{
  "grade_9_10": [
    {
      "key": "digitalis_eszkozhasznalat_es_fajlkezeles",
      "name": "Digitális eszközhasználat és fájlkezelés",
      "short_description": "A tanulók biztonságosan és hatékonyan használják a digitális eszközöket, kezelik a fájlokat, a mappastruktúrát, a mentéseket és a felhőszolgáltatásokat, valamint alap szinten hibaelhárítást végeznek.",
      "sub_topics": [
        {
          "key": "munkaallomas_es_operacios_rendszer_alapok",
          "name": "Munkaállomás és operációs rendszer alapok",
          "short_description": "Az operációs rendszer felületének, beállításainak és alapfunkcióinak tudatos használata különböző eszközökön.",
          "sub_topics": [
            {
              "key": "felulet_es_beallitasok",
              "name": "Felület, beállítások és akadálymentesítés",
              "short_description": "A felhasználói felület személyre szabása, alap beállítások módosítása, egyszerű akadálymentesítési opciók használata.",
              "example_tasks": [
                "Állítsd be a számítógépen a kijelző nagyítását 125%-ra, majd készíts képernyőképet a beállításról és mentsd el a megfelelő mappába!",
                "Hozz létre két külön felhasználói profilt (pl. „diák” és „vendég”), állíts be eltérő háttérképet és ikonméretet, majd írd le röviden a különbségeket!",
                "Keresd meg az akadálymentesítési beállításoknál a kontraszt módot vagy a képernyőolvasót, próbáld ki 3 percig, és fogalmazz meg 3 tanulságot a használhatóságról!"
              ]
            },
            {
              "key": "periferiak_es_csatalakozas",
              "name": "Perifériák és csatlakoztatás",
              "short_description": "Külső eszközök (nyomtató, pendrive, headset) csatlakoztatása, alap hibák felismerése és elhárítása.",
              "example_tasks": [
                "Csatlakoztass egy pendrive-ot, másolj rá egy mappát, majd biztonságosan távolítsd el; dokumentáld a lépéseket 5 sorban!",
                "Egy nyomtatás nem indul el: sorolj fel legalább 5 lehetséges okot, és készíts ellenőrzési sorrendet (prioritási lista) a hiba megtalálására!",
                "Állítsd be a mikrofont és a hangszórót egy videóhíváshoz: készíts egy rövid (30 mp) hangfelvételt, nevezd el szabályosan, majd oszd meg a tanárral!"
              ]
            },
            {
              "key": "alap_hibaelharitas",
              "name": "Alap hibaelhárítás és karbantartás",
              "short_description": "Tipikus problémák (lassulás, tárhelyhiány, frissítések) felismerése, egyszerű megoldások alkalmazása, felelős eszközhasználat.",
              "example_tasks": [
                "Ellenőrizd a tárhelyet: keress 3 nagy fájlt, csoportosítsd őket (pl. videó, kép, dokumentum), majd javasolj megoldást a tárhely felszabadítására!",
                "Készíts egy „gyors ellenőrzőlistát” (10 pont) arról, mit teszel, ha egy program lefagy vagy a gép belassul!",
                "Nézd meg, mely frissítések érhetők el az operációs rendszerhez, és magyarázd el 6-8 mondatban, miért fontos a frissítés biztonsági szempontból!"
              ]
            }
          ]
        },
        {
          "key": "fajlrendszer_es_fajlmuveletek",
          "name": "Fájlrendszer és fájlműveletek",
          "short_description": "Mappastruktúra tervezése, fájlok rendezése, keresése, tömörítése, verziókezelés-szemlélet bevezetése.",
          "sub_topics": [
            {
              "key": "mappastruktura_es_nevadasi_szabalyok",
              "name": "Mappastruktúra és névadási szabályok",
              "short_description": "Átlátható mappaszerkezet kialakítása és egységes fájlnév-konvenció alkalmazása tanulási projektekhez.",
              "example_tasks": [
                "Hozz létre egy „Informatika_9” gyűjtőmappát, benne 4 almappával (dokumentumok, képek, források, leadás), és készíts képernyőképet a struktúráról!",
                "Adj 10 rossz fájlnevet (pl. „uj”, „asd”), majd alakítsd át őket egységes szabály szerint (dátum_téma_verzió) és indokold a választást!",
                "Egy csoportprojektben 5 fő dolgozik: tervezz névadási szabályt a fájlokra és mappákra, hogy ne írjátok felül egymás munkáját!"
              ]
            },
            {
              "key": "kereses_metaadatok",
              "name": "Keresés és metaadatok",
              "short_description": "Fájlkiterjesztések, metaadatok, címkék használata; hatékony keresési stratégiák alkalmazása.",
              "example_tasks": [
                "Keresd meg a gépeden az összes „.pdf” fájlt, amelyek neve tartalmazza a „tananyag” szót, és írd le, milyen szűrőket használtál!",
                "Magyarázd el példákkal a különbséget a fájlnév és a fájlkiterjesztés között, majd sorolj fel 8 gyakori kiterjesztést és a típusukat!",
                "Válassz 3 képfájlt, nézd meg a metaadataikat (pl. készítés ideje), majd írj 5 mondatot arról, miért lehet ez adatvédelmi kockázat!"
              ]
            },
            {
              "key": "tomoerites_es_megosztas",
              "name": "Tömörítés és megosztás",
              "short_description": "Tömörített állományok kezelése, megosztás cél szerint (link, jogosultság), fájlméret optimalizálása.",
              "example_tasks": [
                "Tömöríts egy mappát .zip formátumba, majd bontsd ki egy másik helyre; ellenőrizd, hogy minden fájl megvan-e!",
                "Egy 20 MB-os képet kell e-mailben elküldeni: adj 3 megoldást a méret csökkentésére, és válaszd ki a legjobb kompromisszumot minőség szerint!",
                "Oszd meg egy dokumentumot felhőben úgy, hogy csak megtekinthető legyen; írd le, miben más a „szerkesztheti” jogosultság!"
              ]
            }
          ]
        },
        {
          "key": "felho_es_mentesi_strategiak",
          "name": "Felhő és mentési stratégiák",
          "short_description": "Felhőszolgáltatások tudatos használata, biztonsági mentés, verziózás és helyreállítás alapelvei.",
          "sub_topics": [
            {
              "key": "szinkronizalas_es_verziok",
              "name": "Szinkronizálás és verziók",
              "short_description": "Szinkron működés megértése, verziótörténet használata, visszaállítás alap lépései.",
              "example_tasks": [
                "Készíts egy dokumentumot, mentsd el, majd végezz 3 módosítást és nevezd el a verziókat (v1, v2, v3); írd le, mikor melyiket használnád!",
                "Egy fájl „eltűnt” a felhőből: állíts össze egy 6 lépéses tervet, hogyan keresed meg (kuka, verziótörténet, eszköz szinkron, keresés).",
                "Mutasd be egy példán, mi történik, ha ugyanazt a fájlt két eszközön egyszerre szerkeszted; milyen konfliktusok keletkezhetnek?"
              ]
            },
            {
              "key": "biztonsagi_mentes_3_2_1",
              "name": "Biztonsági mentés (3-2-1 szemlélet)",
              "short_description": "Alap mentési elv (több példány, több médium, egy off-site), és a mindennapi tanulási anyagokra alkalmazása.",
              "example_tasks": [
                "Tervezd meg a saját iskolai fájljaid 3-2-1 mentési rendjét (melyik 3 példány, milyen 2 eszköz, hol az 1 külső hely) és indokold!",
                "Készíts egy ellenőrző listát arról, milyen gyakran mentesz (napi/heti), és milyen fájltípusokat tartasz kritikusnak!",
                "Egy pendrive meghibásodott, rajta a beadandó: írd le, milyen lépések előzhették volna meg a problémát, és mit teszel most (prioritási sorrendben)!"
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "szovegszerkesztes_es_tipografia",
      "name": "Szövegszerkesztés és tipográfia",
      "short_description": "A tanulók igényes, strukturált dokumentumokat készítenek, alkalmazzák a tipográfiai és szerkesztési elveket, és tudatosan kezelik a forrásokat, hivatkozásokat és a dokumentumstruktúrát.",
      "sub_topics": [
        {
          "key": "alap_szerkesztes_es_formazas",
          "name": "Alap szerkesztés és formázás",
          "short_description": "Szabályos szövegbevitel, bekezdés- és karakterformázás, stílusok szemlélete, konzisztens dokumentumkép kialakítása.",
          "sub_topics": [
            {
              "key": "karakter_bekezdes_formazas",
              "name": "Karakter- és bekezdésformázás",
              "short_description": "Betűtípus, méret, kiemelés, térköz, igazítás, behúzás és felsorolások tudatos használata.",
              "example_tasks": [
                "Formázz meg egy 1 oldalas szöveget a következő szabályokkal: cím 16 pt félkövér, törzsszöveg 12 pt sorkizárt, bekezdések között 6 pt térköz; add le PDF-ben!",
                "Készíts kétféle felsorolást (számozott és pontozott) ugyanarra a tartalomra, majd írd le, melyik mikor jobb választás!",
                "Javíts ki egy hibásan formázott dokumentumot: szüntesd meg a „space-szel igazítást”, és állíts be helyes behúzásokat és tabulátorokat!"
              ]
            },
            {
              "key": "stilusok_hasznalata",
              "name": "Stílusok használata és egységes arculat",
              "short_description": "Stíluskészletek alkalmazása, címsorok szintjei, egységes formátum fenntartása hosszabb dokumentumokban.",
              "example_tasks": [
                "Készíts egy 2–3 oldalas beszámolót úgy, hogy a címsorokhoz stílusokat használsz (Címsor 1–2–3), majd generálj automatikus tartalomjegyzéket!",
                "Változtasd meg egy stílus (pl. Címsor 2) tulajdonságait, és figyeld meg, hogyan frissül a dokumentum; írd le 4 mondatban a lényeget!",
                "Készíts egy „dokumentumsablont” (template): adj szabályokat a címekhez, törzsszöveghez és idézetekhez, majd mentsd el és alkalmazd egy új dokumentumra!"
              ]
            },
            {
              "key": "helyesiras_es_szerkesztoi_eszkozok",
              "name": "Helyesírás és szerkesztői eszközök",
              "short_description": "Helyesírás-ellenőrzés, keresés-csere, megjegyzések, változáskövetés alapjai.",
              "example_tasks": [
                "Írj be szándékosan 15 helyesírási hibát egy rövid szövegbe, majd javítsd ki helyesírás-ellenőrzővel és kézi ellenőrzéssel; jelöld, melyiket nem találta meg!",
                "Használd a keresés-csere funkciót: cseréld le az összes „internet” szót „világháló”-ra, de az „internetes” alakokat hagyd érintetlenül; dokumentáld a beállításokat!",
                "Adj visszajelzést egy társad dokumentumára megjegyzésekkel: írj legalább 5 érdemi kommentet (tartalom + forma), majd foglald össze szóban 1 percben!"
              ]
            }
          ]
        },
        {
          "key": "dokumentum_szerkezet_es_hosszabb_anyagok",
          "name": "Dokumentumszerkezet és hosszabb anyagok",
          "short_description": "Oldalbeállítások, szakaszok, fej- és lábléc, oldalszámozás, tartalomjegyzék és hivatkozások készítése.",
          "sub_topics": [
            {
              "key": "oldalbeallitas_szakaszok",
              "name": "Oldalbeállítás és szakaszkezelés",
              "short_description": "Margók, tájolás, hasábok, szakasztörések használata eltérő formázásokhoz ugyanabban a dokumentumban.",
              "example_tasks": [
                "Készíts egy dokumentumot, amelynek 2. oldala fekvő tájolású, a többi álló; használd a megfelelő szakasztörést!",
                "Helyezz el egy képet hasábos elrendezésben (2 hasáb), és állíts be körbefuttatást; magyarázd el, miért kell szakasztörés!",
                "Állíts be egységes margókat és fejlécet, majd exportáld PDF-be úgy, hogy a tördelés nem csúszik el!"
              ]
            },
            {
              "key": "fejlec_lablec_oldalszam_hivatkozas",
              "name": "Fejléc, lábléc, oldalszám, hivatkozások",
              "short_description": "Oldalszámozás, dátum, szerző, automatikus hivatkozások (kereszthivatkozás) és lábjegyzetek használata.",
              "example_tasks": [
                "Adj a dokumentumhoz fejlécet (név, osztály, téma) és oldalszámot, majd készíts címlapot, ahol nem jelenik meg az oldalszám!",
                "Készíts 3 lábjegyzetet forrásmegjelöléssel egy rövid esszében; ügyelj a hivatkozási formára (szerző, cím, év, URL ha kell)!",
                "Hozz létre egy ábrahivatkozást: szúrj be egy képet felirattal, majd a szövegben készíts automatikus kereszthivatkozást rá!"
              ]
            },
            {
              "key": "tartalomjegyzek_es_lista_jegyzekek",
              "name": "Tartalomjegyzék és jegyzékek",
              "short_description": "Automatikus tartalomjegyzék és ábra-/táblázatjegyzék létrehozása stílusok alapján.",
              "example_tasks": [
                "Készíts egy 3 oldalas dokumentumot legalább 6 címsorral, majd generálj automatikus tartalomjegyzéket és frissítsd a végén!",
                "Szúrj be 2 táblázatot és 2 ábrát felirattal, majd hozz létre ábrajegyzéket és táblázatjegyzéket!",
                "Átalakítasz egy címet kézi formázással: javítsd stílussal, és mutasd meg, hogy ettől hogyan javul a tartalomjegyzék!"
              ]
            }
          ]
        },
        {
          "key": "adatok_beillesztese_es_multimedia",
          "name": "Adatok beillesztése és multimédia",
          "short_description": "Képek, alakzatok, táblázatok, diagramok és külső objektumok beillesztése, elhelyezése és forráskezelése.",
          "sub_topics": [
            {
              "key": "kepek_elhelyezes_korbefuttatas",
              "name": "Képek elhelyezése és körbefuttatása",
              "short_description": "Képek méretezése, igazítása, körbefuttatása és a dokumentum esztétikájának javítása.",
              "example_tasks": [
                "Illessz be 3 képet egy cikkbe: az első legyen a szövegben, a második körbefuttatással, a harmadik rögzített pozícióval; írd le a különbségeket!",
                "Készíts egy plakátot A4-ben képekkel és szövegdobozokkal; ügyelj a vizuális hierarchiára és a margókra!",
                "Keress egy szabadon felhasználható képet, tüntesd fel a forrást a dokumentum végén, és írd le 3 mondatban a licenc lényegét!"
              ]
            },
            {
              "key": "tablazatok_egyszeru_adatmegjelenites",
              "name": "Táblázatok és egyszerű adatmegjelenítés",
              "short_description": "Táblázatok beszúrása, formázása, cellaegyesítés, igazítás, egyszerű összehasonlítások megjelenítése.",
              "example_tasks": [
                "Készíts egy 6×5-ös táblázatot egy heti tanulási tervhez, alkalmazz cellaegyesítést és színkiemelést a fő blokkokhoz!",
                "Formázz meg egy táblázatot úgy, hogy nyomtatható legyen: fejlécek ismétlése, sorkizárás, cellamargók; exportáld PDF-be!",
                "Egy táblázatban keveredik a szám és szöveg: javítsd a bevitelt, és magyarázd el 4 mondatban, miért fontos a következetes formátum!"
              ]
            }
          ]
        },
        {
          "key": "forraskezeles_es_szerzoi_jog",
          "name": "Forráskezelés és szerzői jog",
          "short_description": "Források megbízhatóságának értékelése, hivatkozás, idézés szabályai, szerzői jog és szabad felhasználás alapjai.",
          "sub_topics": [
            {
              "key": "forras_ertekeles",
              "name": "Forrásértékelés és hitelesség",
              "short_description": "Online források ellenőrzése (szerző, dátum, domain, hivatkozások), álhírek felismerése.",
              "example_tasks": [
                "Keress 2 forrást ugyanarról a témáról (pl. egészség/technológia), és készíts összehasonlítást 6 szempont alapján (szerző, dátum, hivatkozások, cél, nyelvezet, bizonyíték)!",
                "Találj egy gyanús hírt, és írd le lépésről lépésre, hogyan ellenőrzöd (fordított képkeresés, több forrás, hivatalos oldal, stb.).",
                "Készíts egy rövid (8–10 mondatos) összefoglalót egy cikkből úgy, hogy minden állításhoz jelölöd, melyik mondat melyik forrásból származik!"
              ]
            },
            {
              "key": "idezes_hivatkozas_szerzoi_jog",
              "name": "Idézés, hivatkozás, szerzői jog",
              "short_description": "Idézetek szabályos jelölése, forrásjegyzék készítése, Creative Commons és fair use szemlélet.",
              "example_tasks": [
                "Írj egy 1 oldalas ismertetőt, amelyben legalább 2 közvetlen idézet és 2 parafrázis szerepel; mindegyiket jelöld helyesen forrással!",
                "Válassz egy CC-licences képet, és készíts helyes képaláírást (szerző, cím, licenc, link), majd magyarázd el a licenc feltételeit!",
                "Adj példát 5 olyan esetre, amikor engedélyköteles lehet egy kép vagy szöveg felhasználása iskolai anyagban, és javasolj biztonságos alternatívát!"
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "tablazatkezeles_es_adatelemzes_alapok",
      "name": "Táblázatkezelés és adatelemzés alapok",
      "short_description": "A tanulók táblázatkezelőben adatokat rögzítenek és tisztítanak, képleteket és függvényeket alkalmaznak, diagramokat készítenek, és egyszerű elemzésekkel következtetéseket vonnak le.",
      "sub_topics": [
        {
          "key": "adatbevitel_formatum_tisztitas",
          "name": "Adatbevitel, formátumok és tisztítás",
          "short_description": "Adattípusok (szám, dátum, szöveg), hibás adatok felismerése, rendezés, szűrés és alap tisztítási lépések.",
          "sub_topics": [
            {
              "key": "adattipusok_es_cellformatum",
              "name": "Adattípusok és cellaformátum",
              "short_description": "Számformátumok, dátum/idő, pénznem, százalék; a helyes formátum szerepe a számításokban.",
              "example_tasks": [
                "Adj meg egy 20 soros kiadáslistát (dátum, összeg, kategória), majd állítsd be a megfelelő formátumokat (dátum, pénznem) és jelöld a hibás sorokat!",
                "Egy oszlopban a számok szövegként vannak: javítsd meg (pl. konvertálás), majd ellenőrizd egy összegzés függvénnyel, hogy működik-e!",
                "Készíts kétféle megjelenítést ugyanarra az adatra (pénznem és százalék), és írd le, mikor melyik értelmezhetőbb!"
              ]
            },
            {
              "key": "rendezes_szures_egyedi_feltetelek",
              "name": "Rendezés, szűrés és egyedi feltételek",
              "short_description": "Többszintű rendezés, szűrés feltételekkel, duplikátumok kezelése, egyszerű minőségellenőrzés.",
              "example_tasks": [
                "Rendezd egy osztály jegyeit tartalmazó táblát először tantárgy, majd érdemjegy szerint; írd le, milyen sorrendet kaptál!",
                "Szűrd ki egy bolt nyugtáiból csak a „élelmiszer” kategóriát és a 3000 Ft feletti tételeket; add meg, hány sor maradt!",
                "Keress duplikált e-mail címeket egy listában, jelöld ki őket, majd készíts egy tisztított listát duplikátumok nélkül!"
              ]
            },
            {
              "key": "adatvalidalas_es_hibak",
              "name": "Adatvalidálás és tipikus hibák",
              "short_description": "Adatbevitel korlátozása (legördülő lista), hibák megelőzése és javítása (pl. #DIV/0!, #NÉV?).",
              "example_tasks": [
                "Hozz létre legördülő listát a „kategória” oszlophoz (pl. étel, közlekedés, szórakozás), és állíts be hibajelzést érvénytelen bevitelre!",
                "Készíts példát 3 tipikus hibára (#DIV/0!, #NÉV?, #HIV!), majd írd le mindegyik okát és a javítás módját!",
                "Egy táblázatban a dátumok vegyes formátumúak: alakítsd egységesre, és írd le, miért számít ez rendezésnél!"
              ]
            }
          ]
        },
        {
          "key": "kepletek_es_fuggvenyek_alapok",
          "name": "Képletek és függvények alapok",
          "short_description": "Relatív és abszolút hivatkozások, alap függvények, összesítés és egyszerű döntési logika táblázatkezelőben.",
          "sub_topics": [
            {
              "key": "hivatkozasok_relativ_abszolut",
              "name": "Relatív és abszolút cellahivatkozások",
              "short_description": "Másolható képletek készítése, $ jelek használata, hibák elkerülése ismétlődő számításoknál.",
              "example_tasks": [
                "Készíts árlistát 10 termékkel és 27% ÁFA-val: számold a bruttó árat úgy, hogy az ÁFA kulcs egy fix cellában legyen (abszolút hivatkozás)!",
                "Másolj le egy képletet 20 sorra; jelöld be, hol romlana el, ha nem használnál abszolút hivatkozást, és magyarázd el miért!",
                "Készíts devizaátváltó táblát (HUF→EUR) egy rögzített árfolyammal; legyen könnyen frissíthető egyetlen cella átírásával!"
              ]
            },
            {
              "key": "alap_fuggvenyek",
              "name": "Alap függvények (SZUM, ÁTLAG, MIN, MAX, DARAB)",
              "short_description": "Összegzés, átlagolás és alap statisztikai mutatók használata oszlopokon és tartományokon.",
              "example_tasks": [
                "Egy osztály 15 matek dolgozatának pontszámai alapján számold ki az átlagot, minimumot és maximumot, majd írd le 3 mondatban a következtetést!",
                "Készíts heti lépésszám naplót 7 nappal: számold ki a heti összes lépést és a napi átlagot; készíts rövid értékelést a trendről!",
                "Adott egy 30 soros eladási lista: számold meg, hány tétel nagyobb 5000 Ft-nál (DARABTELI/COUNTIF jelleg), és írd le, miért hasznos ez!"
              ]
            },
            {
              "key": "felteteles_fuggvenyek",
              "name": "Feltételes függvények (HA, ÉS, VAGY)",
              "short_description": "Egyszerű döntési szabályok megvalósítása, kategorizálás és jelölések automatikus létrehozása.",
              "example_tasks": [
                "Osztályozás pontszám alapján: készíts képletet, ami 0–100 pontból jegyet ad (1–5) a megadott határok szerint!",
                "Állíts be egy feltételt: ha a hiányzás > 10 óra ÉS az átlag < 3,0, akkor „figyelmeztetés” jelenjen meg; teszteld 5 példán!",
                "Kategorizálj egy költséglistát: ha a tétel „bérlet” VAGY „busz”, akkor „közlekedés”, különben „egyéb”; ellenőrizd az eredményt!"
              ]
            }
          ]
        },
        {
          "key": "diagramok_es_alap_vizualizacio",
          "name": "Diagramok és alap vizualizáció",
          "short_description": "Megfelelő diagramtípus kiválasztása, tengelyek és címkék beállítása, félrevezető ábrázolás elkerülése.",
          "sub_topics": [
            {
              "key": "diagramtipus_valasztas",
              "name": "Diagramtípus választása",
              "short_description": "Oszlop-, vonal-, kördiagram és kombinált diagram használata a megfelelő adatszerkezethez.",
              "example_tasks": [
                "Egy 12 hónapos költségadatot ábrázolj vonaldiagramon, majd indokold, miért nem kördiagramot választottál!",
                "Ugyanazt az adatot készítsd el oszlop- és vonaldiagramon is; írj 4 mondatot arról, melyik milyen üzenetet emel ki!",
                "Készíts kördiagramot a havi kiadások kategóriánkénti megoszlásáról, és jelöld a 2 legnagyobb kategóriát!"
              ]
            },
            {
              "key": "diagram_formazas_es_ertelemzes",
              "name": "Diagram formázása és értelmezése",
              "short_description": "Cím, jelmagyarázat, tengely, adatfelirat; egyszerű következtetések levonása a grafikon alapján.",
              "example_tasks": [
                "Adj címet, tengelyfeliratokat és adatfeliratokat egy diagramhoz; készíts képernyőképet „előtte–utána” összehasonlítással!",
                "Készíts egy olyan diagramot, amely félrevezető (pl. vágott tengely), majd javítsd ki, és írd le, miért volt félrevezető!",
                "Egy grafikon alapján válaszolj 5 kérdésre (pl. mikor a legmagasabb érték, mekkora a növekedés, van-e kiugrás)!"
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "prezentacio_es_vizualis_kommunikacio",
      "name": "Prezentáció és vizuális kommunikáció",
      "short_description": "A tanulók célközönséghez igazodó, vizuálisan rendezett prezentációkat és egyszerű infografikákat készítenek, tudatosan használják a képeket, diagramokat, hivatkozásokat és az előadói eszközöket.",
      "sub_topics": [
        {
          "key": "prezentacio_tervezes_es_szerkezet",
          "name": "Prezentáció tervezés és szerkezet",
          "short_description": "Üzenet, cél és logikai ív kialakítása; diák szerepe, tartalmi vázlat és időkeret megtervezése.",
          "sub_topics": [
            {
              "key": "celkozonseg_es_uzenet",
              "name": "Célközönség és üzenet megfogalmazása",
              "short_description": "A prezentáció céljának és a közönség igényeinek tisztázása, kulcsüzenetek kiválasztása.",
              "example_tasks": [
                "Válassz egy iskolai témát (pl. iskolai büfé egészségesebbé tétele) és írd le: célközönség, cél, 3 kulcsüzenet; ezek alapján készíts 6 diás vázlatot!",
                "Készíts két külön vázlatot ugyanarra a témára: egyet 9. osztályosoknak, egyet szülői értekezletre; írd le 5-6 mondatban, miben térnek el!",
                "Adott egy 3 perces időkeret: tervezz 7 diát úgy, hogy diánként legfeljebb 1 fő állítás legyen; jelöld, hol kérdeznél a közönségtől!"
              ]
            },
            {
              "key": "tortenetmeseles_es_logikai_iv",
              "name": "Történetmesélés és logikai ív",
              "short_description": "Bevezetés–tárgyalás–lezárás felépítés, probléma–megoldás szerkezet és átvezető mondatok használata.",
              "example_tasks": [
                "Készíts 8 diás prezentációt „Miért fontos a jelszókezelés?” témában probléma–megoldás szerkezettel, és minden dián jelöld az átvezető mondatot!",
                "Írj 1-1 mondatos narrációt minden diához, majd olvasd fel időre; módosítsd a diák számát/tartalmát, hogy 2 perc 30 mp-be beleférj!",
                "Egy rosszul szerkesztett prezentációban a diák sorrendje keveredik: rendezd át, adj 3 új átvezető diát, és indokold a sorrendet!"
              ]
            }
          ]
        },
        {
          "key": "vizualis_alapelvek_es_tipografia_prezi",
          "name": "Vizuális alapelvek és tipográfia prezentációban",
          "short_description": "Olvashatóság, vizuális hierarchia, színek és kontraszt, egységes betűhasználat; zsúfoltság elkerülése.",
          "sub_topics": [
            {
              "key": "vizualis_hierarchia_es_racs",
              "name": "Vizuális hierarchia és rácselrendezés",
              "short_description": "Cím–törzs–kiemelés arányai, igazítás és rács használata, következetes elrendezés kialakítása.",
              "example_tasks": [
                "Vegyél át egy zsúfolt szöveges diát, és alakítsd át 3 változatban (rácsos, kártyás, egykulcsüzenetes); írd le, melyik miért jobb!",
                "Készíts 5 diát egységes rácselrendezéssel: minden dián ugyanott legyen a cím, a kép és a kulcsszó; ellenőrizd, hogy nincs-e „ugráló” elem!",
                "Készíts egy „stíluslapot” a prezentációdhoz (címbetű méret, törzsbetű méret, térközök), és alkalmazd végig 10 dián!"
              ]
            },
            {
              "key": "szinek_kontraszt_olvashatosag",
              "name": "Színek, kontraszt és olvashatóság",
              "short_description": "Kontrasztos színpárok, színvakság-szempontok, háttér–szöveg párosítások és képolvashatóság.",
              "example_tasks": [
                "Készíts 3 diát ugyanazzal a tartalommal: világos, sötét és „rossz kontrasztú” verzióban; jelöld, melyiket miért ne használd!",
                "Válassz 5 színt egy palettába (pl. iskolai projekt arculat), és írd le, melyik mire szolgál (kiemelés, háttér, figyelmeztetés)!",
                "Egy diagramon rosszul látszanak a kategóriák: javítsd a kontrasztot és a jelmagyarázatot, majd készíts rövid értelmezést (3-4 mondat)."
              ]
            }
          ]
        },
        {
          "key": "multimedia_es_hivatkozasok_prezi",
          "name": "Multimédia és hivatkozások a prezentációban",
          "short_description": "Képek, ikonok, videók és diagramok felelős beillesztése; forrásmegjelölés és licenc alapok alkalmazása.",
          "sub_topics": [
            {
              "key": "kep_ikon_es_szerzoi_jog_prezi",
              "name": "Kép/ikon használat és szerzői jog",
              "short_description": "Szabadon felhasználható források keresése, kötelező attribúció, forráslista dián vagy végén.",
              "example_tasks": [
                "Keress 3 jogtiszta képet a témádhoz, és készíts forrásdiát: szerző, cím, licenc, link; ellenőrizd, hogy minden képhez van-e attribúció!",
                "Cseréld le egy prezentáció összes „random Google-képes” elemét jogtiszta képekre/ikonokra; írd le 5 mondatban a keresési stratégiádat!",
                "Készíts egy 1 diás infografikát ikonokkal: jelöld a forrásokat úgy, hogy a dián is olvasható legyen, de ne zavarja a dizájnt!"
              ]
            },
            {
              "key": "diagram_es_beagyazott_objektumok",
              "name": "Diagramok és beágyazott objektumok",
              "short_description": "Táblázatból generált diagram beillesztése, adatok frissíthetősége, beágyazás vs. képként beszúrás.",
              "example_tasks": [
                "Készíts egy táblázatot 12 hónap adataival, generálj diagramot, majd illeszd be a prezentációba: írd le, hogyan frissül, ha az adat változik!",
                "Ugyanazt a diagramot szúrd be képként és beágyazott objektumként is; hasonlítsd össze 4 szempont szerint (méret, minőség, szerkeszthetőség, kompatibilitás).",
                "Készíts egy „adatforrás” diát: tüntesd fel, honnan származik az adat (pl. KSH, iskola felmérés), és írj 3 mondatot a megbízhatóságról!"
              ]
            }
          ]
        },
        {
          "key": "eloadoi_technikak_es_interakcio",
          "name": "Előadói technikák és interakció",
          "short_description": "Előadói nézet, időzítés, kérdések, rövid interakciók, prezentációs etikett és visszajelzés kezelése.",
          "sub_topics": [
            {
              "key": "idokezeles_es_proba",
              "name": "Időkezelés és próba",
              "short_description": "Időmérés, diák ritmusának beállítása, gyakorlás és rövidítés technikái.",
              "example_tasks": [
                "Tarts próbaelőadást 2 percben 6 diához; jegyezd fel, hol csúszol el időben, majd módosítsd a diák tartalmát, hogy pontos legyen!",
                "Készíts „B-tervet”: jelöld meg, mely 2 diát hagynád ki, ha 30 másodperccel rövidebb időkeretet kapsz!",
                "Rögzítsd az előadásod hangját (telefon), hallgasd vissza, és írj 5 konkrét fejlesztési pontot (tempó, hangsúly, töltelékszavak)."
              ]
            },
            {
              "key": "kerdesek_visszajelzes",
              "name": "Kérdések és visszajelzés kezelése",
              "short_description": "Kérdésfeltevés, vita irányítása, konstruktív visszajelzés adása és fogadása.",
              "example_tasks": [
                "Készíts 3 közönségkérdést a prezentációdhoz (1 könnyű, 1 gondolkodtató, 1 vitaindító), és jelöld, melyik dián hangzana el!",
                "Egy társad előadásáról írj visszajelzést 2-2-1 módszerrel: 2 erősség, 2 fejlesztendő, 1 konkrét javaslat!",
                "Szimuláció: kapsz egy kritikus kérdést („Miért bízzunk ebben az adatban?”). Írj egy 6-8 mondatos válaszvázlatot forrásokra hivatkozva!"
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "algoritmikus_gondolkodas_es_blokk_programozas_atmenet",
      "name": "Algoritmikus gondolkodás és blokkprogramozásból szöveges kódba átmenet",
      "short_description": "A tanulók egyszerű problémákat algoritmusokra bontanak, folyamatábrát és pszeudokódot használnak, majd ugyanazokat a megoldásokat fokozatosan szöveges programozási környezetben is megvalósítják.",
      "sub_topics": [
        {
          "key": "problemabontas_es_algoritmusleiras",
          "name": "Problémabontás és algoritmusleírás",
          "short_description": "Feladat értelmezése, input–output meghatározás, lépésekre bontás, tesztesetek kialakítása.",
          "sub_topics": [
            {
              "key": "input_output_es_tesztesetek",
              "name": "Input–output és tesztesetek",
              "short_description": "Bemenetek, kimenetek, szélsőértékek és egyszerű tesztkészlet megtervezése a helyes működés ellenőrzésére.",
              "example_tasks": [
                "Egy program feladata: két szám közül a nagyobbat írja ki. Add meg 6 tesztesettel az inputot és az elvárt outputot, köztük negatív és egyenlő esetet is!",
                "Tervezd meg egy „átlag számoló” feladat inputját: hány számot kér be, mikor áll le, és mi legyen a kimenet; írj hozzá 5 tesztesetet!",
                "Készíts teszteseteket egy „szöveg hosszának” meghatározására: üres szöveg, ékezetes karakterek, szóközök és hosszú szöveg esetén."
              ]
            },
            {
              "key": "pszeudokod_es_folyamatabra",
              "name": "Pszeudokód és folyamatábra",
              "short_description": "Algoritmusok ábrázolása folyamatábrával és pszeudokóddal; döntések és ciklusok jelölése.",
              "example_tasks": [
                "Készíts folyamatábrát egy feladathoz: kérj be egy számot, döntsd el páros-e, és írd ki az eredményt; majd írd le ugyanazt pszeudokóddal!",
                "Írj pszeudokódot „minimum keresés” feladatra egy 10 elemű listában, és jelöld be, hol történik az összehasonlítás!",
                "Egy hibás folyamatábrában a ciklus feltétele rossz helyen van: javítsd ki és magyarázd el 3 mondatban a hibát!"
              ]
            }
          ]
        },
        {
          "key": "alap_vezerlesi_szerkezetek",
          "name": "Alap vezérlési szerkezetek",
          "short_description": "Szekvencia, elágazás, ismétlés; egyszerű számlálós és feltételes ciklusok megértése és alkalmazása.",
          "sub_topics": [
            {
              "key": "elagazas_logikai_feltetelek",
              "name": "Elágazás és logikai feltételek",
              "short_description": "Összehasonlítások, logikai operátorok (ÉS, VAGY, NEM) és összetett döntések felépítése.",
              "example_tasks": [
                "Készíts algoritmust (pszeudokód): ha a hőmérséklet < 0 → „fagy”, 0–25 → „normál”, >25 → „meleg”; adj 6 tesztpéldát!",
                "Írj döntési szabályt: ha a jelszó legalább 8 karakter ÉS van benne szám, akkor „elfogadható”; különben „gyenge”; sorolj fel 5 ellenpéldát!",
                "Egy feltétel hibás: (x > 10 ÉS x < 5). Magyarázd el, miért sosem igaz, és javítsd a kívánt működéshez!"
              ]
            },
            {
              "key": "ciklusok_szamlalo_felteteles",
              "name": "Ciklusok: számlálós és feltételes",
              "short_description": "Ismétlődő feladatok automatizálása, számlálás, összegzés, addig ismétlés amíg feltétel teljesül.",
              "example_tasks": [
                "Írj pszeudokódot: számold ki 1-től 100-ig a számok összegét; jelöld, mely változók változnak a ciklusban!",
                "Készíts algoritmust: addig kér be számokat, amíg a felhasználó 0-t nem ad meg, majd kiírja az átlagot; tervezz 4 tesztesetet!",
                "Egy ciklus végtelenre fut: találd meg a hibát egy példában (a számláló nem változik), és írd le a javítás elvét!"
              ]
            }
          ]
        },
        {
          "key": "blokkbol_szoveges_kodba",
          "name": "Blokkprogramozásból szöveges kódba",
          "short_description": "Azonos logika megvalósítása blokkos és szöveges formában; szintaxis és hibák felismerése.",
          "sub_topics": [
            {
              "key": "azonos_megoldas_ket_formaban",
              "name": "Azonos megoldás két formában",
              "short_description": "Egy egyszerű feladat megoldása blokkos környezetben, majd ugyanaz pszeudokóddal és szöveges kóddal.",
              "example_tasks": [
                "Készíts blokkos programot, amely 10-szer kiírja: „Szia!”; majd írd át pszeudokódra és szöveges kódra (pl. Python) ugyanazzal a logikával!",
                "Egy blokkos „ha–különben” szerkezetet fordíts le szöveges kóddá; jelöld, hol nyílik és záródik a blokk (behúzás/kapcsos zárójel)!",
                "Készíts összehasonlítást 6 pontban: mi könnyebb blokkban, mi szöveges kódban, és milyen hibák jelennek meg eltérően?"
              ]
            },
            {
              "key": "szintaxis_alap_hibak",
              "name": "Szintaxis és alap hibák",
              "short_description": "Gyakori hibák (elütés, zárójelek, behúzás), hibajelzés értelmezése és javítási stratégia.",
              "example_tasks": [
                "Kapsz 5 hibás kódrészletet (hiányzó zárójel, elgépelés, rossz behúzás). Javítsd mindet és írd mellé, milyen típusú hiba volt!",
                "Írj egy „hibakeresési lépéslistát” (8 pont): mit nézel meg először, mit másodszor, és hogyan ellenőrzöd a javítást tesztesettel!",
                "Szándékosan okozz futási hibát (pl. nullával osztás), majd kezeld le: írd le, mi a különbség a szintaktikai és futási hiba között!"
              ]
            }
          ]
        },
        {
          "key": "modell_es_szimulacio_alapok",
          "name": "Modellezés és egyszerű szimulációk",
          "short_description": "Valós helyzetek egyszerűsített modellezése, szabályok megadása, ismétléses szimuláció és eredmények értelmezése.",
          "sub_topics": [
            {
              "key": "szabalyok_es_allapotok",
              "name": "Szabályok és állapotok",
              "short_description": "Állapotváltozók meghatározása, szabályrendszer leírása és szimulációs lépések megtervezése.",
              "example_tasks": [
                "Modellezz egy egyszerű lámpát két állapottal (be/ki): írd le az állapotokat és az átmeneteket (gombnyomás), majd készíts folyamatábrát!",
                "Készíts szabályrendszert egy „pontgyűjtő” játékhoz: hogyan nő a pont, mikor veszít a játékos; adj 5 lépéses példafutást!",
                "Egy automata ajtó modellje: szenzor érzékel → nyit, időzítő → zár. Írd le pszeudokódban a működést és a kivételeket (pl. akadály)."
              ]
            },
            {
              "key": "szimulacio_eredmenyek_ertekelese",
              "name": "Szimuláció eredményeinek értékelése",
              "short_description": "Eredmények rögzítése, egyszerű statisztika, grafikon és következtetés a modell korlátainak megjelölésével.",
              "example_tasks": [
                "Szimuláld 20 lépésen egy „pénzfeldobás” folyamatot (fej/írás), rögzítsd az eredményeket táblázatban, és készíts oszlopdiagramot!",
                "Egy szimuláció eredménye „furcsa”: sorolj fel 4 okot, ami miatt a modell torzíthat (kezdeti állapot, szabály, véletlen, kevés futás)!",
                "Készíts 2 különböző modellt ugyanarra a jelenségre (pl. busz érkezési késés): írd le, melyik mikor hasznosabb és mi a korlátja."
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "programozas_alapok_szoveges_nyelven",
      "name": "Programozás alapok szöveges nyelven (pl. Python)",
      "short_description": "A tanulók egyszerű programokat írnak szöveges nyelven: változókat, elágazást, ciklusokat és függvényeket használnak, alap adatszerkezeteket kezelnek, valamint tudatosan tesztelnek és hibát keresnek.",
      "sub_topics": [
        {
          "key": "alap_szintaxis_es_adattipusok",
          "name": "Alap szintaxis és adattípusok",
          "short_description": "Változók, be- és kimenet, adattípusok, típuskonverzió és egyszerű kifejezések.",
          "sub_topics": [
            {
              "key": "valtozok_be_kimenet",
              "name": "Változók, be- és kimenet",
              "short_description": "Adat bekérése, változók tárolása, formázott kiírás és alap hibák elkerülése.",
              "example_tasks": [
                "Írj programot, ami bekéri a neved és az életkorod, majd kiírja: „Szia NÉV, jövőre ÉLETKOR+1 éves leszel!” (helyes típuskezeléssel)!",
                "Kérj be két számot, írd ki az összegüket, különbségüket, szorzatukat és hányadosukat; kezeld azt az esetet, ha a második szám 0!",
                "Készíts programot, ami bekér egy hőmérsékletet Celsiusban és átváltja Fahrenheitre; adj 3 tesztesetet (0, 20, -10)."
              ]
            },
            {
              "key": "adattipusok_es_tipuskonverzio",
              "name": "Adattípusok és típuskonverzió",
              "short_description": "Szám, szöveg, logikai érték; konverziók és a konverziós hibák felismerése.",
              "example_tasks": [
                "Kapsz egy szövegként beolvasott számot: alakítsd át egész számmá, majd számolj vele; mutasd meg, mi történik, ha nem konvertálsz!",
                "Kérj be egy százalékos értéket (pl. „12.5”), alakítsd lebegőpontos számmá, és számold ki egy 40 000 Ft-os ár kedvezményét!",
                "Írj programot, ami megmondja, hogy egy bekért szöveg „szám-e” (csak számjegyekből áll-e); teszteld „123”, „12a”, „”."
              ]
            }
          ]
        },
        {
          "key": "elagazasok_es_ismetlesek_kodban",
          "name": "Elágazások és ismétlések kódban",
          "short_description": "Feltételek, ciklusok és alap programlogika kialakítása valós feladatokhoz.",
          "sub_topics": [
            {
              "key": "if_elif_else_dontesi_fa",
              "name": "if-elif-else és döntési logika",
              "short_description": "Többágú elágazások, összetett feltételek és döntési fa jellegű programok.",
              "example_tasks": [
                "Írj programot, ami egy pontszám (0–100) alapján érdemjegyet ad; kezeld a hibás bemenetet (pl. -5, 120) is!",
                "Készíts „belépési ellenőrzést”: csak akkor enged be, ha a felhasználónév nem üres ÉS a jelszó legalább 8 karakter; különben írjon ki konkrét hibát!",
                "Egy mozijegy ára korfüggő: 0–5 ingyen, 6–17 kedvezményes, 18–64 normál, 65+ kedvezményes. Írd meg és teszteld 6 példán!"
              ]
            },
            {
              "key": "for_es_while_ciklusok",
              "name": "for és while ciklusok",
              "short_description": "Ismétlődő feladatok: számlálás, összegzés, keresés, input-ellenőrzés és kilépési feltétel.",
              "example_tasks": [
                "Írj programot, ami 1-től N-ig kiírja a páros számokat; N-t a felhasználó adja meg; teszteld N=10 és N=1 esetén!",
                "Kérj be számokat addig, amíg a felhasználó „stop”-ot nem ír; közben számold az összeget és a darabszámot, majd írd ki az átlagot!",
                "Írj programot, ami megkeresi egy listában az első 0 értéket, és kiírja a pozícióját; ha nincs, írja ki, hogy „nincs nulla”!"
              ]
            }
          ]
        },
        {
          "key": "fuggvenyek_es_modularitas_alapok",
          "name": "Függvények és modularitás alapok",
          "short_description": "Függvények definiálása, paraméterek, visszatérési érték, kód újrahasznosítása és olvashatóság.",
          "sub_topics": [
            {
              "key": "fuggveny_definicio_parameterek",
              "name": "Függvény definíció és paraméterek",
              "short_description": "Paraméteres függvények készítése, alap ellenőrzések, és több helyen való felhasználás.",
              "example_tasks": [
                "Írj függvényt `terulet_kor(r)`, ami visszaadja a kör területét; a főprogram kérjen be r-t és írja ki az eredményt 2 tizedesre!",
                "Írj függvényt, ami eldönti egy számról, hogy prímszám-e; teszteld 2, 9, 17, 1 értékekkel!",
                "Bonts szét egy programot 3 függvényre: adatbekérés, számítás, kiírás; mutasd meg, hogy így átláthatóbb lett (rövid indoklás)."
              ]
            },
            {
              "key": "visszateresi_ertek_es_hibakezeles",
              "name": "Visszatérési érték és alap hibakezelés",
              "short_description": "Visszatérési érték használata, egyszerű hibajelzés és input-ellenőrzés függvényekben.",
              "example_tasks": [
                "Írj függvényt, ami két szám osztását végzi: ha a nevező 0, térjen vissza `None`-nal és a főprogram kezelje le!",
                "Készíts függvényt, ami szövegből egész számot próbál készíteni; ha nem sikerül, adjon vissza hibát jelző értéket és kérjen új bemenetet!",
                "Írj függvényt, ami egy listából visszaadja a maximumot; ha üres a lista, adjon vissza megfelelő jelzést és magyarázd el, miért kell kezelni!"
              ]
            }
          ]
        },
        {
          "key": "alap_adatszerkezetek",
          "name": "Alap adatszerkezetek (lista, szótár) és szövegkezelés",
          "short_description": "Listák és szótárak létrehozása, bejárása, egyszerű keresés és összesítés; szövegek alap műveletei.",
          "sub_topics": [
            {
              "key": "listak_bejaras_osszegzes",
              "name": "Listák: bejárás, összegzés, keresés",
              "short_description": "Lista elemeinek feldolgozása ciklussal, minimum/maximum/átlag számítása, elem keresése feltétellel.",
              "example_tasks": [
                "Adott egy lista a napi hőmérsékletekkel: számold ki az átlagot, és írd ki, hány nap volt 30 fok felett!",
                "Írj programot, ami egy névlistából megkeresi, szerepel-e benne a „Péter”; írja ki a pozíciót vagy hogy nincs benne!",
                "Készíts programot, ami a bekért 10 számot listába teszi, majd kiírja a legnagyobb és legkisebb értéket, valamint a különbséget!"
              ]
            },
            {
              "key": "szotar_alapok_kulcs_ertek",
              "name": "Szótár alapok (kulcs–érték párok)",
              "short_description": "Adatok tárolása kulcs alapján (pl. név → pontszám), frissítés, lekérdezés és hiányzó kulcs kezelése.",
              "example_tasks": [
                "Hozz létre szótárat 5 tanuló pontszámával, majd kérj be egy nevet és írd ki a pontszámát; ha nincs, írj ki értelmes üzenetet!",
                "Készíts egyszerű „szótár bővítést”: a felhasználó új nevet és pontszámot ad meg, frissítsd a szótárat és írd ki a teljes listát!",
                "Számold meg egy szövegben a betűk gyakoriságát szótárral (pl. 'alma'): írd ki a gyakoriságokat rendezett formában!"
              ]
            },
            {
              "key": "szovegmuveletek_alapok",
              "name": "Szövegműveletek alapok",
              "short_description": "Hossz, szeletelés, keresés, csere, split/join; egyszerű szövegfeldolgozás gyakorlati feladatokkal.",
              "example_tasks": [
                "Kérj be egy mondatot, számold meg a szavakat, és írd ki, melyik a leghosszabb szó!",
                "Írj programot, ami e-mail címből kinyeri a domain részt (a @ utáni), és kiírja; teszteld 3 példán!",
                "Készíts egyszerű „jelszó-erősség” ellenőrzőt: hossz, számjegy, nagybetű; adjon visszajelzést, melyik feltétel hiányzik!"
              ]
            }
          ]
        },
        {
          "key": "debug_es_teszteles_alapok",
          "name": "Debug és tesztelés alapok",
          "short_description": "Hibák szisztematikus keresése, tesztesetek, nyomkövetés (print), és alap minőségbiztosítási szemlélet.",
          "sub_topics": [
            {
              "key": "hibatipusok_es_uzenetek",
              "name": "Hibatípusok és hibaüzenetek értelmezése",
              "short_description": "Szintaktikai, futási és logikai hibák megkülönböztetése; hibaüzenetek alapján javítás.",
              "example_tasks": [
                "Kapsz 6 hibaüzenetet (pl. NameError, TypeError). Párosítsd őket a tipikus okkal és javíts egy példakódot mindegyikhez!",
                "Írj példát logikai hibára (a program lefut, de rossz eredményt ad), majd mutasd be, hogyan deríted ki nyomkövetéssel!",
                "Készíts táblázatot: hibatípus → jelenség → tipikus ok → javítási lépés (legalább 5 sor)."
              ]
            },
            {
              "key": "tesztesetek_es_refaktor",
              "name": "Tesztesetek és egyszerű refaktorálás",
              "short_description": "Tesztek tervezése, ismétlődő kód kiváltása függvénnyel, olvashatóság javítása.",
              "example_tasks": [
                "Egy program több helyen ugyanazt számolja: alakítsd át függvénnyé, és igazold 3 tesztesettel, hogy ugyanazt az eredményt adja!",
                "Készíts 8 tesztesetet egy „palindrom-e?” függvényhez (kis/nagybetű, szóköz, ékezet), és írd le, melyiket miért választottad!",
                "Olvashatatlan változónevek vannak a kódban: nevezd át őket értelmesre, és írj 5 soros kommentet, mitől lett jobb a kód!"
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "adat_reprezentacio_es_kodolas",
      "name": "Adatreprezentáció és kódolás",
      "short_description": "A tanulók megértik, hogyan reprezentálja a számítógép a számokat, szövegeket, képeket és hangot, és képesek egyszerű átalakításokra, valamint a tömörítés és minőség összefüggéseinek értelmezésére.",
      "sub_topics": [
        {
          "key": "szamrendszerek_es_muveletek_alapok",
          "name": "Számrendszerek alapjai",
          "short_description": "A kettes, tizes és tizenhatos számrendszer közötti átváltás, valamint a bitek és bájtok szerepének megértése.",
          "sub_topics": [
            {
              "key": "bit_bajt_mertekegysegek",
              "name": "Bit, bájt és tárolási mértékegységek",
              "short_description": "A bit és bájt fogalma, valamint a KB–MB–GB nagyságrendek értelmezése gyakorlati példákon.",
              "example_tasks": [
                "Számold ki, hány bájt 2,5 MB (feltételezve 1 MB = 1024 KB és 1 KB = 1024 bájt), majd magyarázd el 2 mondatban, miért használ kétféle (1000/1024) váltószámot a gyakorlat!",
                "Egy telefonon 8 GB szabad hely van. Becsüld meg, hány darab 4 MB-os fotó fér el, és írd le a kerekítés szabályát!",
                "Adj 5 példát (videó, kép, dokumentum, zene, alkalmazás), és becsüld meg a tipikus fájlméretet; indokold, miért ilyen nagyságrendű!"
              ]
            },
            {
              "key": "kettes_tizes_atvaltas",
              "name": "Kettes–tizes átváltás",
              "short_description": "Egyszerű számok átváltása kettes és tizes számrendszer között, helyiértékek használatával.",
              "example_tasks": [
                "Váltsd át 25-öt kettes számrendszerbe, majd ellenőrizd vissza tizesben a helyiértékek összeadásával!",
                "Váltsd át a 101101₂ számot tizesbe lépésről lépésre, majd írd le, melyik bit milyen helyiértéket képvisel!",
                "Írj rövid leírást (6-8 mondat), hogyan lehet fejben átváltani egy 8 bites bináris számot tizesre!"
              ]
            },
            {
              "key": "tizenhatos_es_szinkodok",
              "name": "Tizenhatos számrendszer és színkódok",
              "short_description": "A tizenhatos számrendszer szerepe (pl. színkódok), valamint egyszerű átváltások tizes és tizenhatos között.",
              "example_tasks": [
                "Váltsd át a 255-öt tizenhatosba, majd magyarázd el, miért gyakori a FF jelölés informatikában!",
                "Egy webes színkód: #3A7F2C. Írd le, melyik két karakter melyik színcsatorna (R,G,B), és váltsd át a 3A értéket tizesbe!",
                "Készíts 3 saját színkódot tizenhatosban úgy, hogy az egyik legyen „hideg”, a másik „meleg”, a harmadik „szürke”; indokold a választást!"
              ]
            },
            {
              "key": "bin_osszeadas_szemlelet",
              "name": "Bináris összeadás szemléleti szinten",
              "short_description": "A bináris összeadás alapelve, átvitel (carry) és egyszerű példák hibamentes levezetése.",
              "example_tasks": [
                "Számold ki binárisan: 0110₂ + 0101₂, majd váltsd vissza tizesbe ellenőrzésként!",
                "Mutasd be lépésről lépésre, hogyan működik az átvitel bináris összeadásnál egy példán (pl. 1111₂ + 0001₂)!",
                "Írj 5 mondatot arról, miért fontos az átvitel fogalma a számítógép működése (összeadás, túlcsordulás) szempontjából!"
              ]
            }
          ]
        },
        {
          "key": "szoveg_es_karakterkodolas",
          "name": "Szöveg és karakterkódolás",
          "short_description": "Karakterkészletek és kódolások (ASCII, Unicode/UTF-8) szemlélete, ékezetek és kompatibilitási problémák felismerése.",
          "sub_topics": [
            {
              "key": "ascii_es_unicode_alapok",
              "name": "ASCII és Unicode alapok",
              "short_description": "A karakterkódolás célja, az ASCII korlátai és a Unicode szerepe a többnyelvű szövegekben.",
              "example_tasks": [
                "Magyarázd el 8-10 mondatban, miért nem elég az ASCII a magyar nyelvhez, és mit old meg a Unicode!",
                "Keress egy példát (saját tapasztalat vagy online példa) „elromlott ékezetes” szövegre, és írd le, mi lehetett az ok (kódolás, betűtípus, rendszer)!",
                "Írj egy rövid szöveget ékezetes betűkkel, majd mentsd el kétféle formátumban (pl. TXT és DOCX). Hasonlítsd össze, hol és miért sérülhet a kódolás!"
              ]
            },
            {
              "key": "utf8_es_bajt_meret",
              "name": "UTF-8 és a bájtigény",
              "short_description": "Változó hosszúságú kódolás szemlélete: miért lehet ugyanannyi karakter eltérő bájtméretű.",
              "example_tasks": [
                "Hasonlítsd össze a következő szavak tárolási igényét UTF-8-ban: „alma”, „árvíztűrő”. Indokold, miért lehet nagyobb a bájtszám az ékezetek miatt!",
                "Készíts 10 karakteres jelszót csak angol betűkkel, majd 10 karaktereset ékezetesekkel/emojival. Írd le, melyik lehet több bájt és miért!",
                "Egy 1 MB-os SMS-archívumban becsüld meg, hány darab 160 karakteres üzenet fér el, ha átlagosan 1 bájt/karakterrel számolsz; majd írd le, mikor romlik ez a becslés!"
              ]
            },
            {
              "key": "szoveg_normalizalas_es_kereses",
              "name": "Szöveg-normalizálás és keresés",
              "short_description": "Kis/nagybetű, ékezetek és szóközök kezelése; miért lehet két „ugyanolyan” szöveg mégis különböző tárolásban.",
              "example_tasks": [
                "Készíts példát 5 különböző, de „emberileg azonosnak tűnő” szövegre (pl. extra szóköz, eltérő nagybetű), és írd le, miért számít ez keresésnél!",
                "Adj 3 stratégiát arra, hogyan készítesz megbízható keresést egy névlistában (kisbetűsítés, szóközök levágása, ékezetkezelés)!",
                "Szimuláció: két diák neve ugyanaz, de az egyikben rejtett karakter van (pl. nem törhető szóköz). Írd le, hogyan derítenéd ki és javítanád!"
              ]
            }
          ]
        },
        {
          "key": "kep_es_grafika_digitalisan",
          "name": "Kép és grafika digitálisan",
          "short_description": "Raszter és vektor grafika különbsége, felbontás, színmélység és fájlformátumok alapjai.",
          "sub_topics": [
            {
              "key": "raszter_vektor_kulonbseg",
              "name": "Raszter vs. vektor",
              "short_description": "A két ábrázolási mód jellemzői, tipikus felhasználások (fotó vs. logó) és méretezési hatások.",
              "example_tasks": [
                "Sorolj fel 3 példát, amikor raszter képet érdemes használni, és 3 példát, amikor vektort; mindegyikhez írj 1-1 indokot!",
                "Magyarázd el 6-8 mondatban, miért pixelesedik a raszter kép nagyításkor, míg a vektor nem!",
                "Kapsz egy iskolai logót PNG-ben: készíts tervet, hogyan tennéd alkalmassá óriásplakátra (milyen formátum, milyen lépések)."
              ]
            },
            {
              "key": "felbontas_szinszelesseg",
              "name": "Felbontás és színmélység",
              "short_description": "Képméret (px), DPI szemlélet nyomtatásnál, valamint a színmélység hatása a minőségre és méretre.",
              "example_tasks": [
                "Egy kép 1920×1080 pixeles. Számold ki a pixelek számát, majd becsüld a nyers méretet 24 bites színmélységgel (bájtban/MB-ban)!",
                "Egy A4-es plakátot kell nyomtatni 300 DPI-vel. Írd le, miért fontos a megfelelő felbontás, és adj egy becslést, hogy kb. hány pixel széles legyen a kép!",
                "Hasonlíts össze két képet: 8 bites és 24 bites színmélység. Írd le, milyen jelenséget látsz (sávosodás), és mikor elfogadható a kisebb színmélység!"
              ]
            },
            {
              "key": "formatumok_es_atlatszosag",
              "name": "Fájlformátumok és átlátszóság",
              "short_description": "JPG/PNG/SVG/GIF alap különbségek, tömörítés, átlátszó háttér és animációs használat.",
              "example_tasks": [
                "Válaszd ki, hogy egy fotót és egy logót milyen formátumban mentesz (JPG/PNG/SVG) és indokold 3-3 érvvel!",
                "Készíts egy képet átlátszó háttérrel (PNG), majd helyezd rá két különböző háttérszínre; ellenőrizd, hogy valóban átlátszó-e!",
                "Egy weboldal lassú a sok kép miatt: adj 5 konkrét javaslatot (méretcsökkentés, tömörítés, megfelelő formátum), és válassz közülük 2-t részletesen!"
              ]
            },
            {
              "key": "alap_kep_tomorites",
              "name": "Képtömörítés és minőség",
              "short_description": "Veszteséges (JPG) és veszteségmentes (PNG) tömörítés hatása, artefaktok felismerése és cél szerinti beállítás.",
              "example_tasks": [
                "Ments el ugyanazt a fotót több JPG minőséggel (pl. 90%, 70%, 50%), és írd le, hol jelennek meg artefaktok és mekkora a méretkülönbség!",
                "Készíts döntést: melyik formátumot és beállítást választod (JPG/PNG) egy iskolai weboldal fejlécéhez, és indokold 5 szemponttal!",
                "Írj 6-8 mondatos útmutatót: hogyan optimalizálnád a képeket egy prezentációhoz úgy, hogy jó minőségű maradjon, de ne legyen túl nagy a fájl!"
              ]
            }
          ]
        },
        {
          "key": "hang_es_video_reprezentacio",
          "name": "Hang és videó digitális reprezentációja",
          "short_description": "Mintavételezés, bitráta és tömörítés szemlélete; minőség–méret kompromisszum megértése.",
          "sub_topics": [
            {
              "key": "mintavetelezes_es_bitratak",
              "name": "Mintavételezés és bitráta",
              "short_description": "A mintavételi frekvencia és bitmélység szerepe, valamint a bitráta hatása a fájlméretre.",
              "example_tasks": [
                "Magyarázd el 6-8 mondatban, mi a mintavételezés, és miért fontos a Nyquist-elv szemléleti szinten!",
                "Becsüld meg egy 3 perces, 128 kbps bitrátájú MP3 fájl méretét MB-ban, majd ellenőrizd a számítást!",
                "Készíts döntést: podcastet rögzítesz. Válassz 2 különböző bitrátát (pl. 64 és 128 kbps), és írd le, mikor melyik éri meg!"
              ]
            },
            {
              "key": "veszteseges_vesztesegmentes",
              "name": "Veszteséges és veszteségmentes tömörítés",
              "short_description": "A tömörítés típusai (pl. MP3 vs. WAV/FLAC) és a minőségromlás felismerése.",
              "example_tasks": [
                "Sorolj fel 3 veszteséges és 3 veszteségmentes formátumot (kép/hang), és írd le, melyik mikor előnyös!",
                "Készíts összehasonlítást: miért jó archiváláshoz a veszteségmentes, és miért elég sokszor a veszteséges? Írj 8-10 mondatot!",
                "Egy tanári videót kell feltölteni lassú interneten: válassz tömörítési stratégiát (felbontás/bitráta), és indokold a kompromisszumokat!"
              ]
            },
            {
              "key": "video_felbontas_es_fps",
              "name": "Videó felbontás és képkockasebesség (FPS)",
              "short_description": "A felbontás (720p/1080p), képkockasebesség (24/30/60 FPS) hatása a minőségre és adatforgalomra.",
              "example_tasks": [
                "Készíts döntési táblázatot 3 célra (telefonos megosztás, YouTube, archiválás): milyen felbontást és FPS-t választanál és miért!",
                "Becsüld meg, melyik lesz nagyobb: 1 perces 1080p 60 FPS videó vagy 1 perces 1080p 30 FPS videó azonos bitrátán; magyarázd el a lényegi összefüggést!",
                "Írj 5 mondatot arról, miért lehet elég 30 FPS egy tanórai bemutatóhoz, és mikor indokolt a 60 FPS (pl. sport)."
              ]
            }
          ]
        },
        {
          "key": "adatformatumok_es_egyszeru_allomanyok",
          "name": "Adatformátumok és egyszerű állományok",
          "short_description": "Gyakori adatállományok (CSV, JSON) szemléleti megértése, mezők és rekordok, valamint adatok cseréje programok között.",
          "sub_topics": [
            {
              "key": "csv_szerkezet_es_hibak",
              "name": "CSV szerkezete és tipikus hibák",
              "short_description": "Elválasztójelek, idézőjelezés, fejlécek; miért csúszhat szét a táblázat importáláskor.",
              "example_tasks": [
                "Készíts 10 soros CSV-t egy könyvlistáról (cím, szerző, év). Nyisd meg táblázatkezelőben, és ellenőrizd, hogy a mezők helyesen kerültek oszlopokba!",
                "Mutass be egy hibás CSV-t, ahol vessző van a címben, és javítsd idézőjelezéssel; magyarázd el 4 mondatban a problémát!",
                "Importálj egy CSV-t úgy, hogy a dátumformátum magyar legyen (ÉÉÉÉ-HH-NN vagy HH/NN/ÉÉÉÉ). Írd le, miért fontos az import beállítás."
              ]
            },
            {
              "key": "json_alap_szerkezet",
              "name": "JSON alap szerkezet",
              "short_description": "Kulcs–érték párok, lista és objektum szemlélete; hol találkozunk JSON-nal a mindennapokban (web, API-k).",
              "example_tasks": [
                "Írj egy egyszerű JSON-t a saját „profilodról” (név, osztály, kedvenc tantárgyak listája). Ellenőrizd, hogy helyes-e a zárójelezés!",
                "Kapsz egy JSON-t hibákkal (hiányzó idézőjel, extra vessző). Javítsd ki, és jelöld, melyik hiba milyen típusú!",
                "Magyarázd el 6-8 mondatban, miért hasznos a JSON adatok cseréjére webes alkalmazások között!"
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "halozati_alapismeretek_es_internet",
      "name": "Hálózati alapismeretek és internet",
      "short_description": "A tanulók megértik az internet alapfogalmait (hálózatok, címzés, szolgáltatások), biztonságosan használják a hálózati erőforrásokat, és alap szinten képesek tipikus kapcsolatproblémák okait feltárni.",
      "sub_topics": [
        {
          "key": "halozati_alapfogalmak",
          "name": "Hálózati alapfogalmak",
          "short_description": "Hálózat típusok, eszközök és topológiák szemlélete; router, switch, hozzáférési pont szerepe.",
          "sub_topics": [
            {
              "key": "lan_wan_wifi_alapok",
              "name": "LAN, WAN, Wi-Fi alapok",
              "short_description": "Helyi és távoli hálózatok közti különbség, vezetékes/vezeték nélküli kapcsolat előnyei és korlátai.",
              "example_tasks": [
                "Rajzolj egyszerű hálózati vázlatot az otthoni internetedről (modem/router, Wi-Fi, eszközök). Jelöld, mi LAN és mi WAN!",
                "Sorolj fel 5 okot, ami miatt a Wi-Fi lassú lehet (távolság, falak, csatorna, sok eszköz, szolgáltatói gond), és írd mellé a lehetséges megoldást!",
                "Készíts rövid összehasonlítást: mikor jobb a kábel és mikor elég a Wi-Fi? Adj 3-3 konkrét helyzetet!"
              ]
            },
            {
              "key": "halozati_eszkozok_szerepe",
              "name": "Hálózati eszközök szerepe",
              "short_description": "Router, switch, access point, modem funkciók elkülönítése és tipikus tévhitek tisztázása.",
              "example_tasks": [
                "Párosítsd a fogalmakat a szerepükkel: modem, router, switch, access point. Írj mindegyikhez 1 mondatos példát!",
                "Egy iskolában 3 tantermet kell bekötni: javasolj egyszerű hálózati megoldást (milyen eszközök, hol), és indokold!",
                "Írj 6 állítást a hálózatról (pl. „a router ad internetet”), és jelöld, melyik igaz/hamis, majd javítsd a hibásakat!"
              ]
            },
            {
              "key": "topologiak_es_megosztott_eroforrasok",
              "name": "Topológiák és megosztott erőforrások",
              "short_description": "Csillag topológia szemlélete, megosztott nyomtató és hálózati meghajtó fogalma.",
              "example_tasks": [
                "Készíts rajzot egy csillag topológiáról 6 eszközzel és egy központi switch-csel; jelöld, mi történik, ha a központi eszköz kiesik!",
                "Írd le 5 pontban, milyen előnyei és kockázatai vannak az iskolai közös nyomtatónak (hozzáférés, adatvédelem, sorban állás).",
                "Tervezd meg egy osztály közös „hálózati mappájának” struktúráját (leadás, források, kész), és adj névadási szabályt!"
              ]
            }
          ]
        },
        {
          "key": "cimzes_es_nevfeloldas",
          "name": "Címzés és névfeloldás",
          "short_description": "IP-cím, alhálózat szemlélet, DNS működési képe és a név–cím leképezés megértése.",
          "sub_topics": [
            {
              "key": "ip_cim_alapok_priv_nyilv",
              "name": "IP-cím alapok, privát és nyilvános cím",
              "short_description": "Privát címzés otthoni hálózatban, nyilvános IP fogalma, NAT szemléleti megértése.",
              "example_tasks": [
                "Írd le 6-8 mondatban, mi a különbség a privát és nyilvános IP között, és miért nem kap minden eszköz külön nyilvános IP-t!",
                "Keress példát három tipikus privát IP-tartományra, és magyarázd el, hol találkozol velük a gyakorlatban!",
                "Készíts egyszerű „hibakeresési” forgatókönyvet: van Wi-Fi jel, de nincs internet. Milyen címzés/proxy/DNS okok jöhetnek szóba?"
              ]
            },
            {
              "key": "dns_es_url_felbontas",
              "name": "DNS és URL felbontás",
              "short_description": "Domainnév feloldása IP-re, URL részei (protokoll, domain, útvonal, paraméterek) és jelentésük.",
              "example_tasks": [
                "Bonts fel egy URL-t részekre (protokoll, domain, útvonal, paraméter). Adj 3 példát különböző URL-ekkel!",
                "Magyarázd el egyszerűen, mi a DNS, és mi történik, amikor beírsz egy webcímet a böngészőbe (6-10 lépésben)!",
                "Egy weboldal nem tölt be név alapján, de IP-címmel igen. Írd le, mi lehet az ok, és adj 3 lehetséges megoldást!"
              ]
            },
            {
              "key": "mac_cim_es_dhcp_szemlelet",
              "name": "MAC-cím és DHCP szemlélet",
              "short_description": "Helyi azonosítás (MAC) és automatikus IP-kiosztás (DHCP) működési képe, tipikus otthoni helyzetekkel.",
              "example_tasks": [
                "Írj 6 mondatot arról, mi a DHCP, és miért kényelmes otthon; mikor kell mégis fix IP (példa: nyomtató)!",
                "Szimuláció: új eszközt csatlakoztatsz a Wi-Fi-re. Írd le lépésenként, mi történik a csatlakozás során (jelszó, DHCP, DNS).",
                "Készíts egy listát 5 olyan problémáról, ami DHCP-vel kapcsolatos lehet (pl. IP-ütközés), és adj mindegyikhez 1 egyszerű megoldást!"
              ]
            }
          ]
        },
        {
          "key": "internet_szolgaltatasok_es_protokollok_szemlelet",
          "name": "Internetszolgáltatások és protokollok szemlélete",
          "short_description": "Alap szolgáltatások (web, e-mail, felhő) működési képe; HTTP/HTTPS alap különbségek, adatvédelemhez kapcsolva.",
          "sub_topics": [
            {
              "key": "web_http_https_alapok",
              "name": "Web: HTTP és HTTPS alapok",
              "short_description": "Kliens–szerver modell, kérések és válaszok, HTTPS szerepe a titkosításban.",
              "example_tasks": [
                "Írj 8-10 mondatban arról, mi a különbség HTTP és HTTPS között, és miért fontos ez belépésnél vagy online vásárlásnál!",
                "Készíts példákat 5 tipikus HTTP-státuszkódra (200, 301, 404, 500, 403): mit jelentenek és mikor találkozol velük?",
                "Szimuláció: te vagy a böngésző és a szerver. Írj le egy egyszerű „kérés–válasz” párt (URL, válaszkód, tartalom típusa)."
              ]
            },
            {
              "key": "bongeszo_cache_cookie",
              "name": "Böngésző: cache, cookie és munkamenet",
              "short_description": "Gyorsítótár és cookie szerepe, bejelentkezés, munkamenet, valamint alap adatvédelmi kockázatok.",
              "example_tasks": [
                "Magyarázd el 6-8 mondatban, mi a cookie, és miért működik nélküle másképp egy bejelentkezés!",
                "Készíts listát 5 helyzetről, amikor érdemes törölni a böngésző gyorsítótárát vagy cookie-jait, és írd mellé a várható hatást!",
                "Szimuláció: egy weboldal „nem enged be” hiába jó a jelszó. Sorolj fel 4 lehetséges okot (cookie, cache, 2FA, idő), és adj tesztet mindegyikre!"
              ]
            },
            {
              "key": "felho_szolgaltatasok_szemlelet",
              "name": "Felhőszolgáltatások szemlélete",
              "short_description": "Felhő tárhely, megosztás, szinkron, együttszerkesztés és a jogosultságok szerepe hálózati nézőpontból.",
              "example_tasks": [
                "Egy dokumentumot 3 ember szerkeszt egyszerre. Írd le, milyen előnyei vannak az együttszerkesztésnek, és milyen konfliktusok fordulhatnak elő!",
                "Állíts be egy megosztást „csak megtekintésre” és egyet „szerkesztésre”. Írd le 4 mondatban, melyik mikor biztonságosabb!",
                "Készíts 8 pontos ellenőrző listát, mit nézel meg megosztás előtt (link, jogosultság, lejárat, személyek, érzékeny adatok)!"
              ]
            }
          ]
        },
        {
          "key": "halozati_hibaelharitas_alapok",
          "name": "Hálózati hibaelhárítás alapok",
          "short_description": "Egyszerű diagnosztikai lépések: csatlakozás, jelerősség, beállítások ellenőrzése, eszköz újraindítás és dokumentálás.",
          "sub_topics": [
            {
              "key": "diagnosztikai_lepesek",
              "name": "Diagnosztikai lépések és dokumentálás",
              "short_description": "Hibajelenség pontos leírása, lépéslista készítése, tesztelés és eredmények rögzítése.",
              "example_tasks": [
                "Készíts 10 lépéses hibaelhárítási folyamatot „nincs internet” esetre (wifi jel van/nincs), és jelöld, melyik lépés mit bizonyít!",
                "Írj hibajegyet (ticket) egy iskolai hálózati problémáról: tünetek, időpont, eszköz, próbált lépések, várható hatás!",
                "Szimuláció: a probléma csak bizonyos weboldalakon jelentkezik. Sorolj fel 4 okot (DNS, szűrés, böngésző, HTTPS), és adj tesztet mindegyikhez!"
              ]
            },
            {
              "key": "wifi_csatorna_es_jelerosseg",
              "name": "Wi-Fi csatornák és jelerősség szemlélete",
              "short_description": "Interferencia, csatorna, távolság; gyakorlati tippek a stabilabb kapcsolathoz.",
              "example_tasks": [
                "Egy lakásban a hálószobában gyenge a Wi-Fi: javasolj 4 megoldást (router helye, repeater, 5 GHz, csatorna), és rangsorold költség szerint!",
                "Magyarázd el 6 mondatban, miért lehet stabilabb az 5 GHz rövid távon, és miért jobb a 2,4 GHz falakon át!",
                "Készíts mini-kísérletet: 3 helyen mérd fel a jel erősségét (pl. telefon Wi-Fi ikon/alkalmazás), és írj 5 mondatos következtetést!"
              ]
            },
            {
              "key": "ipconfig_ping_szemlelet",
              "name": "Alap parancsok szemlélete (ipconfig/ping)",
              "short_description": "Egyszerű hálózati ellenőrzések parancssorban (cím lekérdezés, elérés teszt), eredmények értelmezése kezdő szinten.",
              "example_tasks": [
                "Írd le, mit tudsz meg a `ipconfig` (vagy megfelelő) parancsból: sorolj fel 4 információt, amit kiolvasol belőle!",
                "Magyarázd el 5-6 mondatban, mire jó a `ping`, és mit jelent, ha időtúllépés van!",
                "Szimuláció: ping megy a routerre, de nem megy egy webcímre. Írj 3 hipotézist (DNS, szolgáltató, tűzfal) és tesztet mindegyikhez!"
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "kiberbiztonsag_es_digitalis_allampolgarsag",
      "name": "Kiberbiztonság és digitális állampolgárság",
      "short_description": "A tanulók felismerik a leggyakoribb online kockázatokat, biztonságos szokásokat alakítanak ki (jelszavak, 2FA, frissítések), értik a digitális lábnyom és adatvédelem jelentőségét, és felelősen kommunikálnak a digitális térben.",
      "sub_topics": [
        {
          "key": "azonositas_jelszokezeles_es_2fa",
          "name": "Azonosítás, jelszókezelés és kétlépcsős védelem",
          "short_description": "Erős jelszavak, jelszókezelő szemlélet, többfaktoros azonosítás és fiókvédelem alapelvei.",
          "sub_topics": [
            {
              "key": "eros_jelszo_elvek",
              "name": "Erős jelszó elvek és hibás szokások",
              "short_description": "Hossz, egyediség, jelszó-újrahasznosítás kockázata, egyszerű jelszóteszt-szemlélet.",
              "example_tasks": [
                "Készíts 3 jelszó példát: gyenge, közepes, erős. Írd le mindegyikről, miért olyan (hossz, minta, kiszámíthatóság)!",
                "Szimuláció: ugyanazt a jelszót használod 5 oldalon. Írj 6-8 mondatot arról, mi történhet egy adatszivárgás után!",
                "Készíts 10 pontos „jelszó-higiénia” ellenőrző listát, amit egy osztálytársad is követni tud!"
              ]
            },
            {
              "key": "jelszokezelo_es_2fa",
              "name": "Jelszókezelő és 2FA használat",
              "short_description": "Jelszókezelők szerepe, 2FA típusok (app, SMS, hardverkulcs) és alap beállítási elvek.",
              "example_tasks": [
                "Magyarázd el 6-8 mondatban, mi a jelszókezelő előnye, és miért biztonságosabb, mint a „jegyzet a telefonban” megoldás!",
                "Hasonlítsd össze 2FA módszerek kockázatait: SMS vs. authenticator app. Adj 3 érvet mindkét oldalra!",
                "Készíts lépéslistát (8-10 lépés) egy fiók „vészhelyzeti helyreállításához” (backup kódok, másodlagos e-mail, eszközcsere)."
              ]
            },
            {
              "key": "fokozott_fiokbiztonsag",
              "name": "Fokozott fiókbiztonság és jogosultságok",
              "short_description": "Fiókbeállítások áttekintése, bejelentkezési értesítések, alkalmazásengedélyek és harmadik fél hozzáférések kezelése.",
              "example_tasks": [
                "Válassz egy gyakran használt online fiókot (pl. e-mail), és készíts listát 8 olyan beállításról, amit biztonsági okból ellenőriznél!",
                "Szimuláció: „Új bejelentkezés észlelve” értesítést kapsz. Írj lépésről lépésre tervet, mit teszel az első 10 percben!",
                "Nézd át egy fiókban a csatlakoztatott alkalmazásokat/engedélyeket (elméletben). Írd le 5 mondatban, miért veszélyes a felesleges engedély!"
              ]
            }
          ]
        },
        {
          "key": "fenyegetesek_es_tamadasok_alapok",
          "name": "Fenyegetések és támadások alapjai",
          "short_description": "Adathalászat, rosszindulatú szoftverek, social engineering, csalások és tipikus támadási minták felismerése.",
          "sub_topics": [
            {
              "key": "adathalaszat_es_csalas",
              "name": "Adathalászat (phishing) és online csalások",
              "short_description": "Gyanús jelek (URL, nyelvezet, sürgetés), hamis űrlapok, pénzügyi csalások és ellenőrzési technikák.",
              "example_tasks": [
                "Kapsz 3 e-mail részletet (valósághű, de kitalált). Jelöld meg mindegyikben a gyanús jeleket (legalább 5-öt), és írd le, mit tennél!",
                "Készíts 10 pontos ellenőrző listát online vásárlás előtt (értékelések, domain, https, fizetési mód, elérhetőség).",
                "Szimuláció: egy „csomagküldő” SMS linket küld. Írd le 6-8 lépésben, hogyan ellenőrzöd (hivatalos app/oldal, szám, rendelés, link)."
              ]
            },
            {
              "key": "malware_es_vedo_megoldasok",
              "name": "Kártevők (malware) és védekezés",
              "short_description": "Vírus, trójai, zsarolóvírus szemlélete; frissítések, antivírus, biztonsági mentés és óvatos letöltés.",
              "example_tasks": [
                "Magyarázd el 8-10 mondatban, mi a különbség a vírus, trójai és zsarolóvírus között, és adj mindegyikre 1 valós életből vett példát (általános).",
                "Készíts „zsarolóvírus vészforgatókönyvet”: 10 lépés, mit teszel (leválasztás, értesítés, mentés, helyreállítás).",
                "Sorolj fel 6 szokást, ami csökkenti a kártevő kockázatát (frissítés, forrás, jogosultság), és válassz ki 2-t, amit részletesen kifejtesz!"
              ]
            },
            {
              "key": "social_engineering",
              "name": "Social engineering (emberi tényező)",
              "short_description": "Manipulációs technikák (sürgetés, tekintély, ajándék), biztonságos viselkedés és információmegosztás szabályai.",
              "example_tasks": [
                "Készíts 5 példát social engineering helyzetre iskolai környezetben (pl. „admin vagyok, add meg a jelszót”), és írd le a helyes reakciót!",
                "Szimuláció: telefonon hívnak „szolgáltatótól”. Írj 8 mondatos párbeszédvázlatot, hogyan ellenőrzöd a hívót és hogyan utasítod el biztonságosan!",
                "Írj 6-8 mondatot arról, miért a „leggyengébb láncszem” az ember, és hogyan lehet ezt csökkenteni szokásokkal!"
              ]
            }
          ]
        },
        {
          "key": "adatvedelem_es_digitalis_labnyom",
          "name": "Adatvédelem és digitális lábnyom",
          "short_description": "Személyes adatok, érzékeny adatok, digitális nyomok, profilalkotás és felelős adatkezelés a mindennapokban.",
          "sub_topics": [
            {
              "key": "szemelyes_adatok_es_kockazat",
              "name": "Személyes adatok és kockázatok",
              "short_description": "Mi számít személyes adatnak, hogyan lehet visszaélni vele, és hogyan minimalizáljuk az adatmegosztást.",
              "example_tasks": [
                "Sorolj fel 12 személyes adatot, és jelöld, melyik a legérzékenyebb szerinted; indokold a top 3-at 2-2 mondatban!",
                "Egy közösségi profilodon látszik a suli, osztály, hobbi, napi útvonal. Írj 8 mondatot arról, milyen kockázatokat hoz ez és mit változtatnál!",
                "Készíts „adatminimalizálási” tervet: 6 szabály, amit követnél regisztrációkor egy új appnál!"
              ]
            },
            {
              "key": "hozzajarulas_es_beallitasok",
              "name": "Hozzájárulás, beállítások és sütik",
              "short_description": "Adatkezelési tájékoztatók értelmezése alap szinten, hozzájárulások, sütibeállítások és nyomkövetés.",
              "example_tasks": [
                "Nézz meg egy weboldali sütikezelő panelt, és írd le 5 kategóriát (szükséges, statisztikai, marketing stb.) és mit jelentenek!",
                "Készíts döntési helyzetet: elfogadod-e a marketing sütiket? Írj 6-8 mondatot pro/kontra érvekkel és a saját döntéseddel!",
                "Állíts össze 10 kérdést, amit feltennél egy adatkezelési tájékoztatóról (ki kezeli, meddig, mire, kinek adja tovább)!"
              ]
            },
            {
              "key": "digit_lenyomat_es_reputacio",
              "name": "Digitális lenyomat és online reputáció",
              "short_description": "Tartalmak tartóssága, képek és posztok következményei, kereshetőség, felelős megosztás.",
              "example_tasks": [
                "Készíts 6 példát olyan posztra/képre, amit később megbánhatsz, és írd le, milyen következménye lehet (iskola, munka, kapcsolatok).",
                "Szimuláció: egy ismerősödről kínos képet osztanak meg. Írj lépéslistát (8 lépés), mit teszel etikusan és biztonságosan!",
                "Írj 10 pontos „posztolás előtti” ellenőrző listát (szereplők beleegyezése, helyszín, személyes adatok, hangulat)."
              ]
            }
          ]
        },
        {
          "key": "etika_netikett_es_online_kommunikacio",
          "name": "Etika, netikett és online kommunikáció",
          "short_description": "Kulturált digitális kommunikáció, konfliktuskezelés, zaklatás felismerése, és felelős viselkedés közösségi terekben.",
          "sub_topics": [
            {
              "key": "netikett_alapok",
              "name": "Netikett alapok és együttműködés",
              "short_description": "Udvarias, célra törő üzenetek, e-mail szabályok, csoportos munka kommunikációs normái.",
              "example_tasks": [
                "Írj két e-mailt ugyanarra a célra: egy rosszat (tipikus hibákkal) és egy jót (tárgy, megszólítás, kérés, elköszönés). Jelöld a különbségeket!",
                "Készíts 12 pontos netikett-szabályzatot egy osztálycsoport számára (chat), külön kitérve a konfliktusok kezelésére!",
                "Szimuláció: félreértés alakult ki egy chatben. Írj 6-8 mondatot, hogyan tisztáznád úgy, hogy ne eszkalálódjon!"
              ]
            },
            {
              "key": "online_zaklatas_es_bantalmazas",
              "name": "Online zaklatás és bántalmazás",
              "short_description": "Cyberbullying formák, bizonyítékgyűjtés, segítségkérés, blokkolás/jelentés, áldozatvédelem.",
              "example_tasks": [
                "Sorolj fel 6 cyberbullying formát (gúny, kizárás, kamu profil), és mindegyikhez írj 1 megelőző lépést!",
                "Szimuláció: zaklató üzenetek érkeznek. Készíts 10 lépéses tervet (bizonyíték, jelentés, felnőtt, biztonság).",
                "Készíts 1 oldalas tájékoztatót 9. osztályosoknak: mit tegyenek zaklatás esetén, és mit NE tegyenek."
              ]
            }
          ]
        },
        {
          "key": "biztonsagos_eszközhasznalat_es_frissites",
          "name": "Biztonságos eszközhasználat és frissítések",
          "short_description": "Frissítések, jogosultságok, biztonsági beállítások, nyilvános Wi-Fi kockázatok és alap „digitális higiénia”.",
          "sub_topics": [
            {
              "key": "frissitesek_es_patch_menedzsment",
              "name": "Frissítések és javítások szerepe",
              "short_description": "Miért fontosak a frissítések, automatikus frissítés beállítása, és a halogatás kockázatai.",
              "example_tasks": [
                "Írj 8-10 mondatot arról, miért fontos a rendszer és alkalmazások frissítése (biztonsági rés, javítás, kompatibilitás)!",
                "Készíts heti „digitális karbantartás” tervet: 6 teendő (frissítés, mentés, jelszó, jogosultság), és jelöld a gyakoriságot!",
                "Szimuláció: egy app frissítése után valami nem működik. Írj hibakeresési lépéseket (cache, restart, verzió, visszaállítás) és mikor kérsz segítséget!"
              ]
            },
            {
              "key": "nyilvanos_wifi_es_vpn_szemlelet",
              "name": "Nyilvános Wi-Fi és VPN szemlélete",
              "short_description": "Nyilvános hálózatok kockázatai, https, hotspot, és a VPN szerepének alap megértése.",
              "example_tasks": [
                "Készíts 10 szabályt nyilvános Wi-Fi használathoz (mit ne csinálj: bank, jelszó). Indokold a top 3-at!",
                "Szimuláció: kávézóban csatlakozol. Írd le 6-8 lépésben, hogyan ellenőrzöd, hogy nem kamu hálózatra csatlakoztál!",
                "Magyarázd el 6-8 mondatban, mi a VPN, és milyen esetekben lehet hasznos, illetve mikor nem „varázspajzs”."
              ]
            },
            {
              "key": "jogosultsagok_es_app_engedelyek",
              "name": "Jogosultságok és alkalmazásengedélyek",
              "short_description": "Telefonos és számítógépes engedélyek (kamera, hely, mikrofon) és a túlzott engedélykérés felismerése.",
              "example_tasks": [
                "Válassz 3 alkalmazást, és írd le, milyen engedélyeket kérnek. Jelöld, melyik indokolt és melyik gyanús, rövid magyarázattal!",
                "Készíts 6 példát „túl sok engedély” esetre, és írj 1-1 biztonságos megoldást (tiltás, alternatíva, törlés).",
                "Írj rövid útmutatót (10 pont) arról, hogyan döntesz engedélykérésnél: kérdéslista a felhasználónak."
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "projektmunka_es_egyuttmukodesi_eszkozok",
      "name": "Projektmunka és együttműködési eszközök",
      "short_description": "A tanulók digitális projektekben együtt dolgoznak: szerepeket osztanak, közösen szerkesztenek dokumentumokat, követik a feladatokat, alap dokumentációt készítenek és prezentálják az eredményt.",
      "sub_topics": [
        {
          "key": "projekttervezes_es_szerepek",
          "name": "Projekttervezés és szerepek",
          "short_description": "Célok, határidők, felelősségek; egyszerű projektterv, feladatbontás és kockázatkezelés.",
          "sub_topics": [
            {
              "key": "cel_scope_es_idovonal",
              "name": "Cél, scope és idővonal",
              "short_description": "Projektcél meghatározása, terjedelem (mi fér bele), ütemezés és mérföldkövek.",
              "example_tasks": [
                "Tervezd meg egy 2 hetes osztályprojekt célját és scope-ját (mit vállaltok, mit nem). Készíts 5 mérföldkövet dátummal!",
                "Készíts feladatbontást (WBS) egy „iskolai esemény plakát + weboldal” projektre legalább 12 feladattal és felelőssel!",
                "Írj 8-10 mondatot arról, miért csúsznak el projektek, és adj 4 megelőző módszert (tartalék idő, priorizálás)."
              ]
            },
            {
              "key": "szerepek_es_felelossegek",
              "name": "Szerepek és felelősségek",
              "short_description": "Csapatszerepek (koordinátor, szerkesztő, kutató, dizájner), feladatok kiosztása és együttműködési szabályok.",
              "example_tasks": [
                "Ossz szét 5 szerepet egy 4 fős csapatban úgy, hogy mindenki felelőssége egyértelmű legyen. Írd le, hogyan kezelitek az átfedéseket!",
                "Készíts „csapat-szabályzatot” 10 pontban (kommunikáció, fájlnevek, határidő, feedback), és jelöld, mi a következmény, ha megszegik!",
                "Szimuláció: valaki nem teljesíti a feladatát. Írj 6-8 lépéses megoldási tervet (megbeszélés, újratervezés, dokumentálás)."
              ]
            }
          ]
        },
        {
          "key": "kozos_szerkesztes_es_megosztas",
          "name": "Közös szerkesztés és megosztás",
          "short_description": "Közös dokumentumok, jogosultságok, verziók és kommentelés hatékony használata csapatmunkában.",
          "sub_topics": [
            {
              "key": "jogosultsagok_es_link_megosztas",
              "name": "Jogosultságok és linkmegosztás",
              "short_description": "Megtekintés/szerkesztés/komment; meghívás vs. publikus link; biztonságos megosztási gyakorlat.",
              "example_tasks": [
                "Állíts be 3 megosztási módot ugyanarra a fájlra (megtekintés, komment, szerkesztés). Írd le, melyik mikor a megfelelő!",
                "Készíts ellenőrző listát (8 pont) megosztás előtt: ki fér hozzá, meddig, milyen adatok vannak benne, és hogyan vonod vissza a hozzáférést!",
                "Szimuláció: véletlenül publikus linkkel osztottál meg egy fájlt. Írd le azonnali lépéseidet és a megelőzést a jövőre!"
              ]
            },
            {
              "key": "komment_es_valtozaskovetes",
              "name": "Kommentelés és változáskövetés",
              "short_description": "Megjegyzések, javaslat mód, változáskövetés és konfliktuskezelés közös szerkesztésnél.",
              "example_tasks": [
                "Adj 8 érdemi kommentet egy társad szövegére: legalább 3 legyen tartalmi, 3 szerkezeti és 2 nyelvi; jelöld, miért hasznos!",
                "Dolgozzatok 2-en ugyanazon dokumentumon: egyikőtök javítson, másik fogadja el/utasítsa el a módosításokat; készítsetek rövid összefoglalót a folyamatról!",
                "Szimuláció: két ember ugyanazt a bekezdést átírja. Írd le, hogyan oldjátok fel a konfliktust (megbeszélés, verzió, döntés)."
              ]
            }
          ]
        },
        {
          "key": "dokumentacio_es_prezi_zaras",
          "name": "Dokumentáció és bemutatás",
          "short_description": "A projekt eredményének dokumentálása (leírás, források, döntések), majd rövid, célzott bemutatás.",
          "sub_topics": [
            {
              "key": "forraslista_es_hivatkozas_projektben",
              "name": "Forráslista és hivatkozás projektben",
              "short_description": "Felhasznált források rögzítése, licencek, képek attribúciója és átláthatóság.",
              "example_tasks": [
                "Készíts forráslistát a projektedhez legalább 8 tétellel (web, kép, adat). Jelöld, melyik milyen licencű, ha ismert!",
                "Egy képet találtál, de nem ismert a licenc. Írj 5 mondatot, mit teszel (alternatíva, engedély, saját készítés) és miért!",
                "Készíts egy „döntésnaplót”: 5 döntés (miért így), dátummal és felelőssel; írd le, mire jó ez a projekt végén!"
              ]
            },
            {
              "key": "rovid_beszamolo_es_reflexio",
              "name": "Rövid beszámoló és reflexió",
              "short_description": "Eredmények bemutatása, tanulságok, mi ment jól/rosszul, és fejlesztési javaslatok megfogalmazása.",
              "example_tasks": [
                "Készíts 1 oldalas beszámolót: cél, eredmény, 3 tanulság, 3 fejlesztendő pont, 1 javaslat a következő projektre!",
                "Tarts 2 perces bemutatót a projektedről 6 diával, majd kérj visszajelzést 3 szempont mentén (érthetőség, dizájn, tartalom).",
                "Írj rövid reflexiót (10-12 mondat): milyen szerepben dolgoztál, mi volt nehéz, miben fejlődtél, és mit csinálnál másképp."
              ]
            }
          ]
        }
      ]
    }
  ],
  "grade_11_12": [
    {
      "key": "halado_programozas_es_adatszerkezetek",
      "name": "Haladó programozás és adatszerkezetek",
      "short_description": "A tanulók összetettebb programokat készítenek moduláris felépítéssel, fájlkezeléssel és alap algoritmusmintákkal, valamint listák és szótárak mellett egyszerűbb összetett adatszerkezeteket is tudatosan használnak.",
      "sub_topics": [
        {
          "key": "modularis_programozas_es_kod_szervezes",
          "name": "Moduláris programozás és kódszervezés",
          "short_description": "A program felbontása modulokra és függvényekre, újrahasznosítható kódrészek, olvashatóság és karbantarthatóság.",
          "sub_topics": [
            {
              "key": "fuggvenyek_felelossegi_korok",
              "name": "Függvények felelősségi körökkel",
              "short_description": "Egy feladat megoldása több, jól elhatárolt függvényre bontva; tiszta bemenet–kimenet szemlélet.",
              "example_tasks": [
                "Refaktorálj egy 80 soros „egyben megírt” programot 5–7 függvényre (adatbekérés, validálás, számítás, kiírás, mentés). Írd le, melyik függvény mit csinál!",
                "Készíts függvényt `parse_int_safe(szoveg)` néven, ami vagy egész számot ad vissza, vagy hibát jelző értéket. Használd fel 3 különböző bemenetbekérésnél!",
                "Írj 8-10 mondatos értékelést: mitől lesz egy függvény „jó”, és milyen jelek utalnak arra, hogy túl sok mindent csinál (god function)!"
              ]
            },
            {
              "key": "modulok_import_es_sajat_modul",
              "name": "Modulok, import és saját modul készítése",
              "short_description": "Külső modulok használata és egyszerű saját modul kialakítása, importálás és névterek.",
              "example_tasks": [
                "Készíts egy `utils.py` modult 3 hasznos függvénnyel (pl. átlag, maxkülönbség, szöveg-normalizálás), majd importáld és használd egy főprogramban!",
                "Használj egy standard modult (pl. `random` vagy `math`) egy feladat megoldásához, és magyarázd el 5-6 mondatban, miért jobb modulból használni, mint kézzel megírni!",
                "Mutasd be egy példán a névütközést (pl. `from x import *`), majd javítsd a kódot biztonságosabb importtal és indokold!"
              ]
            },
            {
              "key": "kodstilus_es_dokumentalas",
              "name": "Kódstílus és dokumentálás (komment, docstring)",
              "short_description": "Egységes kódstílus, beszédes változónevek, rövid kommentek és docstringek a megértés támogatására.",
              "example_tasks": [
                "Egy kódban minden változó neve `a`, `b`, `c`: nevezd át őket beszédesre, és írj 5 soros magyarázatot, mitől lett olvashatóbb!",
                "Adj docstringet 4 függvényhez úgy, hogy tartalmazza: cél, paraméterek, visszatérés, példa. Ellenőrizd, hogy a leírás alapján más is meg tudná használni!",
                "Készíts „kódreview” checklistet 12 ponttal (stílus, duplikáció, hibakezelés, teszt), és alkalmazd egy rövid kódon."
              ]
            }
          ]
        },
        {
          "key": "fajlkezeles_es_adat_beolvasas",
          "name": "Fájlkezelés és adat beolvasás",
          "short_description": "Szövegfájlok és egyszerű strukturált fájlok (CSV/JSON) olvasása, feldolgozása és mentése; adatminőség alap ellenőrzése.",
          "sub_topics": [
            {
              "key": "txt_fajl_olvasas_iras",
              "name": "TXT fájl olvasás/írás",
              "short_description": "Fájl megnyitás, bejárás soronként, kódolás (UTF-8), és eredmény fájlba mentése.",
              "example_tasks": [
                "Olvass be egy `naplo.txt` fájlt, számold meg, hány sor üres, és írd ki egy `jelentes.txt` fájlba az összefoglalót!",
                "Készíts programot, ami egy szövegfájlból kiszedi az e-mail címeket (egyszerű szabály alapján), és külön fájlba menti őket soronként!",
                "Szimuláció: az ékezetek „elromlanak” beolvasáskor. Írd le, hogyan ellenőrzöd a kódolást, és hogyan oldod meg UTF-8 beállítással!"
              ]
            },
            {
              "key": "csv_beolvasas_es_tisztitas",
              "name": "CSV beolvasás és tisztítás",
              "short_description": "Oszlopok kezelése, típuskonverzió, hiányzó értékek és hibás adatok kiszűrése egyszerű szabályokkal.",
              "example_tasks": [
                "Olvass be egy `eladasok.csv` fájlt (dátum, termék, ár, db). Szűrd ki a hibás sorokat (negatív ár, hiányzó db), és mentsd a tisztított fájlt!",
                "Készíts összesítést CSV-ből: termékenként mennyi volt a bevétel (ár*db), és írd ki egy új CSV-be rendezve bevétel szerint!",
                "A CSV-ben a dátumok vegyes formátumúak. Írj tervet és kódot (vagy pszeudokódot), hogyan konvertálod egységes formára, és teszteld 5 mintával!"
              ]
            },
            {
              "key": "json_adatok_beolvasas_mentes",
              "name": "JSON adatok beolvasása és mentése",
              "short_description": "JSON struktúrák feldolgozása (lista/objektum), mezők ellenőrzése és egyszerű átalakítások.",
              "example_tasks": [
                "Olvass be egy `diakok.json` fájlt (név, osztály, pontszám). Számold ki az osztályátlagot, és mentsd egy `eredmeny.json` fájlba!",
                "Készíts programot, ami a JSON-ból csak a szükséges mezőket tartja meg (adatminimalizálás), és készít egy „publikus” verziót!",
                "Kapsz hibás JSON-t (hiányzó mező, rossz típus). Írj 8-10 soros validálási szabálylistát, majd kezeld le a hibás rekordokat!"
              ]
            }
          ]
        },
        {
          "key": "algoritmusmintak_es_hatékony_megoldasok",
          "name": "Algoritmusminták és hatékony megoldások",
          "short_description": "Gyakori algoritmusminták (keresés, rendezés, számlálás, összegzés) tudatos használata, egyszerű hatékonysági szempontokkal.",
          "sub_topics": [
            {
              "key": "kereses_es_szures_mintak",
              "name": "Keresés és szűrés minták",
              "short_description": "Lineáris keresés, feltételes szűrés és első/összes találat kezelése strukturált adatokon.",
              "sub_topics": [
                {
                  "key": "elso_talalat_es_osszes_talalat",
                  "name": "Első találat vs. összes találat",
                  "short_description": "Mikor állunk meg az első találatnál, és mikor gyűjtünk össze minden megfelelőt; eredmények tárolása listában.",
                  "example_tasks": [
                    "Egy listában keresd meg az első 18 év feletti tanulót, majd külön feladatként gyűjtsd ki az összes 18 év felettit! Írd le, mi a különbség a két megoldásban!",
                    "Egy szövegben keresd meg az első előfordulását a „NAT” szónak, majd készíts listát az összes előfordulás indexével!",
                    "Készíts programot, ami 100 elemű listából kiszűri a páros számokat, és visszaadja az új listát; ellenőrizd 3 tesztesettel!"
                  ]
                },
                {
                  "key": "tobbfelteteles_szures",
                  "name": "Többfeltételes szűrés",
                  "short_description": "Szűrés több feltétel alapján (ÉS/VAGY), összetett rekordoknál (szótár/lista kombináció).",
                  "example_tasks": [
                    "Adott 30 termék (név, ár, kategória). Szűrd ki azokat, amelyek „elektronika” kategóriájúak ÉS 50 000 Ft alatt vannak!",
                    "Egy tanulói listában szűrd ki azokat, akiknek a matek jegye ≥4 VAGY a hiányzásuk ≤5 óra; írd le, miért nem ugyanaz a két feltétel!",
                    "Készíts programot, ami a rekordokat „hibás” listába teszi, ha hiányzik bármely kötelező mező (név, dátum, összeg)."
                  ]
                }
              ]
            },
            {
              "key": "rendezes_alapok_es_kulcs",
              "name": "Rendezés alapok és kulcsfüggvény",
              "short_description": "Beépített rendezés használata, kulcs szerinti rendezés, növekvő/csökkenő sorrend és stabilitás szemlélete.",
              "sub_topics": [
                {
                  "key": "rendezes_szamok_es_szovegek",
                  "name": "Rendezés számokon és szövegeken",
                  "short_description": "Számok rendezése, szöveges rendezés (kis/nagybetű, ékezet) és normalizálás alap gondolata.",
                  "example_tasks": [
                    "Rendezd növekvőbe és csökkenőbe ugyanazt a 15 elemű számlistát, majd írd le, mikor melyik sorrend hasznos (3 példa)!",
                    "Rendezz egy névlistát ABC szerint úgy, hogy ne számítson a kis/nagybetű. Teszteld: „Ádám”, „adam”, „Béla”.",
                    "Készíts egy rövid leírást (6-8 mondat), miért problémás az ékezetes rendezés, és mit jelent a „normalizálás” itt."
                  ]
                },
                {
                  "key": "rendezes_rekordokon_kulccsal",
                  "name": "Rendezés rekordokon kulccsal",
                  "short_description": "Összetett adatok rendezése mező alapján (pl. ár, dátum), többkulcsos rendezés szemlélete.",
                  "example_tasks": [
                    "Rendezz termék rekordokat ár szerint, majd azonos ár esetén név szerint; írd le, miért hasznos a többkulcsos rendezés!",
                    "Rendezz tanulói rekordokat először osztály, majd átlag szerint csökkenőben; készíts rövid összefoglalót a top 3 tanulóról!",
                    "Készíts programot, ami egy eseménylistát dátum szerint rendez, és kiírja a következő 5 eseményt a mai naphoz képest (egyszerűsített)."
                  ]
                }
              ]
            },
            {
              "key": "osszegzes_es_gyakorisag",
              "name": "Összegzés és gyakoriságszámítás",
              "short_description": "Összeg, átlag, kategória szerinti összesítés; gyakoriság szótárral és eredmények értelmezése.",
              "sub_topics": [
                {
                  "key": "kategoriankenti_osszegzes",
                  "name": "Kategóriánkénti összegzés",
                  "short_description": "Adatok csoportosítása kategória szerint, összegzés és top kategóriák meghatározása.",
                  "example_tasks": [
                    "Egy költséglistából (kategória, összeg) számold ki kategóriánként a havi összes költést, és írd ki a 3 legnagyobb kategóriát!",
                    "Készíts programot, ami egy iskolai büfé eladásait összegzi terméktípus szerint, és kiszámolja a bevételi arányokat százalékban!",
                    "Adj 8-10 mondatos értelmezést: miért félrevezető csak az összeggel foglalkozni (darabszám, átlag, kiugrások)!"
                  ]
                },
                {
                  "key": "gyakorisag_szotar",
                  "name": "Gyakoriság számítása szótárral",
                  "short_description": "Elemek előfordulásának számolása, leggyakoribb elem és eloszlás vizsgálata.",
                  "example_tasks": [
                    "Számold meg egy szövegben a szavak gyakoriságát (kisbetűsítéssel), és írd ki a top 5 szót darabszámmal!",
                    "Egy osztály jegyei alapján számold ki, hány darab 1-es, 2-es, 3-as, 4-es, 5-ös van, és készíts egyszerű szöveges „hisztogramot”!",
                    "Írj programot, ami a beolvasott 50 adatból kiszámolja a móduszt (leggyakoribb érték), és kezeli, ha több módusz van!"
                  ]
                }
              ]
            },
            {
              "key": "hatekonysag_szemlelet",
              "name": "Hatékonyság szemlélet (nagyságrend)",
              "short_description": "Egyszerű összehasonlítások: lineáris vs. beépített megoldások, felesleges ismétlés elkerülése, nagyságrendi gondolkodás.",
              "sub_topics": [
                {
                  "key": "felesleges_ciklusok_elkerulese",
                  "name": "Felesleges ciklusok elkerülése",
                  "short_description": "Dupla bejárás kiváltása, köztes eredmények tárolása, egyszerű optimalizálás.",
                  "example_tasks": [
                    "Kapsz egy megoldást, ami egy listát minden elemhez újra bejár (O(n²)). Írd át úgy, hogy csak egyszer járja be (O(n)), és magyarázd el 6 mondatban a különbséget!",
                    "Egy program többször számolja ki ugyanazt a maximumot. Alakítsd át úgy, hogy egyszer számolja és elmentse; mérd idővel 10000 elemre (ha lehet).",
                    "Írj 8 pontos „hatékonysági ellenőrzőlistát” kezdőknek: milyen jelekből látod, hogy lassú lehet a kód?"
                  ]
                },
                {
                  "key": "adatstruktura_valasztas",
                  "name": "Adatszerkezet választás szemlélete",
                  "short_description": "Mikor jó a lista, mikor jó a szótár (gyors keresés), és milyen kompromisszumok vannak.",
                  "example_tasks": [
                    "Ugyanazt a feladatot oldd meg listával és szótárral: név → pontszám keresés. Hasonlítsd össze 5 szempont szerint!",
                    "Készíts példát, ahol szótárral sokkal egyszerűbb a megoldás (gyakoriság), és írd le lépésről lépésre a gondolatmenetet!",
                    "Írj 6-8 mondatot arról, miért nem mindig jobb a „bonyolultabb” adatszerkezet, és mikor felesleges."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "szoftverfejlesztesi_folyamatok_es_verziokezeles",
      "name": "Szoftverfejlesztési folyamatok és verziókezelés",
      "short_description": "A tanulók megismerik a szoftverfejlesztés alap lépéseit (követelmények, tervezés, fejlesztés, teszt), gyakorolják a hibakeresést, és alap szinten használják a verziókezelést (Git) együttműködéshez.",
      "sub_topics": [
        {
          "key": "kovetelmenyek_es_tervezes",
          "name": "Követelmények és tervezés",
          "short_description": "Felhasználói igények, funkcionalitás, egyszerű specifikáció, wireframe/folyamat és adatmodell előkészítés.",
          "sub_topics": [
            {
              "key": "user_story_es_kriteriumok",
              "name": "User story és elfogadási kritériumok",
              "short_description": "Egyszerű felhasználói történetek és mérhető elfogadási feltételek megfogalmazása.",
              "example_tasks": [
                "Írj 5 user story-t egy „házi feladat nyilvántartó” miniapphoz, és mindegyikhez 2 elfogadási kritériumot!",
                "Egy user story túl általános: „Legyen jó a program.” Írd át konkrétan, mérhetően, és indokold, miért lett jobb!",
                "Készíts prioritás listát (MoSCoW) 10 funkcióra: Must/Should/Could/Won’t, és írd le, miért így soroltad be!"
              ]
            },
            {
              "key": "tervezesi_vazlat_es_architektur",
              "name": "Tervezési vázlat és egyszerű architektúra",
              "short_description": "Komponensek felbontása, adatfolyam, képernyővázlat és modulhatárok kijelölése.",
              "example_tasks": [
                "Készíts képernyővázlatot (wireframe) egy 3 oldalas webapphoz (lista, részletek, hozzáadás). Jelöld a mezőket és a navigációt!",
                "Rajzolj adatfolyam ábrát: honnan jön az adat, hol tárolod, hol jelenik meg; írj 5 mondatos magyarázatot!",
                "Bonts fel egy projektet 4 modulra (UI, adatkezelés, validálás, mentés). Írd le a modulok felelősségét és a köztük lévő kapcsolatot!"
              ]
            }
          ]
        },
        {
          "key": "teszteles_hibakereses_es_minoseg",
          "name": "Tesztelés, hibakeresés és minőség",
          "short_description": "Tesztesetek, alap egységteszt-szemlélet, hibajegyek, reprodukció, és minőségi követelmények (olvashatóság, stabilitás).",
          "sub_topics": [
            {
              "key": "teszteset_tervezes_es_edge_case",
              "name": "Teszteset tervezés és szélsőértékek",
              "short_description": "Normál, szélső és hibás bemenetek; tesztleírás és elvárt kimenet rögzítése.",
              "example_tasks": [
                "Készíts 12 tesztesetet egy „regisztráció” űrlap validálásához (üres mező, rövid jelszó, ékezet, szóköz, túl hosszú név) elvárt üzenetekkel!",
                "Írj 8 mondatot arról, mi az „edge case”, és adj 5 példát iskolai alkalmazás kontextusban!",
                "Egy függvény hibázik üres listán. Írj tesztet rá, majd módosítsd a függvényt úgy, hogy kezelje (visszatérés vagy hiba)."
              ]
            },
            {
              "key": "hibajegy_es_reprodukcio",
              "name": "Hibajegy (bug report) és reprodukció",
              "short_description": "Hibajegy tartalma: környezet, lépések, várt/tapasztalt eredmény, logok és képernyőképek.",
              "example_tasks": [
                "Írj hibajegyet egy képzeletbeli apphibára: legyen benne 8 mező (verzió, eszköz, lépések, expected/actual, screenshot link, súlyosság).",
                "Szimuláció: a hiba „néha” jön elő. Írd le, hogyan szűkíted a körülményeket (adat, idő, eszköz, böngésző) 6-8 lépésben!",
                "Készíts 5 példát különböző súlyosságú hibára (kritikus–kozmetikai), és indokold a besorolást!"
              ]
            },
            {
              "key": "code_review_es_standards",
              "name": "Kódreview és alap kódstandardok",
              "short_description": "Kódáttekintés szempontjai: olvashatóság, ismétlés, komplexitás, naming, hibakezelés.",
              "example_tasks": [
                "Készíts 15 pontos kódreview checklistet, és alkalmazd egy rövid kódrészleten: jelöld, hol sérül és hogyan javítanád!",
                "Írj két verziót ugyanarra a megoldásra: egy „spagetti” és egy tiszta. Hasonlítsd össze 6 szempont szerint!",
                "Szimuláció: valaki változóneveket rövidít túl. Írj konstruktív visszajelzést (8-10 mondat) és javasolj konkrét átnevezéseket!"
              ]
            }
          ]
        },
        {
          "key": "verziokezeles_git_alapok",
          "name": "Verziókezelés (Git) alapok",
          "short_description": "Repository, commit, branch, merge, konfliktusok és alap együttműködés (pull request) gyakorlása.",
          "sub_topics": [
            {
              "key": "repo_commit_uzenetek",
              "name": "Repo és commit szemlélet, jó commit üzenetek",
              "short_description": "Mikor commitolunk, mit írunk a commit üzenetbe, és hogyan segíti ez a visszakereshetőséget.",
              "example_tasks": [
                "Adj 10 példát jó commit üzenetre egy iskolai projektből (pl. „Fix: jelszó validáció üres mezőre”), és 5 rossz példát; indokold a különbséget!",
                "Készíts commit stratégiát: milyen gyakran commitolsz és milyen szabály szerint (funkciónként, logikai egységenként). Írd le 8 pontban!",
                "Szimuláció: vissza kell térni egy korábbi működő verzióra. Írd le lépésben, hogyan keresed meg a megfelelő commitot és miért fontos a történet."
              ]
            },
            {
              "key": "branch_merge_konfliktus",
              "name": "Branch, merge és konfliktuskezelés",
              "short_description": "Külön fejlesztési ágak, összeolvasztás és tipikus merge konfliktus feloldása.",
              "example_tasks": [
                "Tervezd meg a branch-struktúrát egy 4 fős csapatnak: legyen feature branch, main, és szabály a merge-re!",
                "Szimuláció: két ember ugyanazt a fájlt módosítja. Írd le, mi a merge konfliktus, és 6-8 lépésben hogyan oldod fel!",
                "Készíts rövid útmutatót (10 pont) „hogyan előzd meg a konfliktusokat” (kisebb commitok, gyakori pull, modulok)."
              ]
            },
            {
              "key": "pull_request_es_egyuttmukodes",
              "name": "Pull request és együttműködés",
              "short_description": "Változások áttekintése, review, visszajelzés, és egyszerű szabályok a csapatmunka minőségéért.",
              "example_tasks": [
                "Írj egy pull request leírást: mi változott, miért, hogyan tesztelted, milyen képernyőképet csatolnál. Készíts sablont!",
                "Készíts 8 mondatos kódreview visszajelzést egy PR-hez: legyen benne dicséret, konkrét észrevétel, kérdés és javaslat.",
                "Állíts össze csapatszabályokat (10 pont) a PR folyamatra: ki review-z, mikor merge-elhető, milyen teszt kell."
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "webfejlesztes_halado_alapok",
      "name": "Webfejlesztés haladó alapok",
      "short_description": "A tanulók webes alkalmazásokat készítenek kliensoldali JavaScript-tel, megértik a HTTP és API-k szerepét, alap szinten kezelik a felhasználói űrlapokat, az állapotot és a böngészőoldali tárolást, valamint figyelnek a biztonságos és akadálymentes megoldásokra.",
      "sub_topics": [
        {
          "key": "html_css_szemlelet_es_reszletek",
          "name": "HTML/CSS szemlélet és részletek",
          "short_description": "Szemantikus HTML, reszponzív elrendezés, alap hozzáférhetőség (a11y) és karbantartható CSS.",
          "sub_topics": [
            {
              "key": "szemantikus_html_es_a11y",
              "name": "Szemantikus HTML és hozzáférhetőség",
              "short_description": "Szemantikus elemek (header, nav, main), címhierarchia, alt szöveg, fókusz és billentyűzet-navigáció alapjai.",
              "example_tasks": [
                "Készíts egy egyszerű oldalt (cím, menü, tartalom, lábléc) kizárólag szemantikus HTML tagekkel, és ellenőrizd: van-e pontos címhierarchia (H1-H2-H3)!",
                "Adj alt szöveget 6 különböző képhez (fotó, ikon, diagram). Írd le, mikor kell üres alt és mikor részletes leírás!",
                "Szimuláció: az oldalt csak billentyűzettel használod. Sorolj fel 5 hibát, ami gyakran előfordul (fókusz eltűnik, nem látszik), és javasolj javítást!"
              ]
            },
            {
              "key": "reszponziv_layout_flex_grid",
              "name": "Reszponzív layout (Flex/Grid)",
              "short_description": "Alap rugalmas elrendezések, töréspontok, mobil-first szemlélet és egyszerű komponensek kialakítása.",
              "example_tasks": [
                "Készíts 3 kártyából álló elrendezést: mobilon egymás alatt, tableten 2+1, desktopon 3 egymás mellett. Írd le, milyen CSS-szabályokkal oldottad meg!",
                "Alakíts át egy fix szélességű oldalt reszponzívra: max-width, százalékos szélességek, és képek rugalmasítása. Készíts előtte/utána képernyőképet!",
                "Készíts egy navigációs menüt, ami mobilon „hamburger” jellegű (egyszerű megoldás), desktopon pedig vízszintes. Írd le a működési logikát!"
              ]
            }
          ]
        },
        {
          "key": "javascript_dom_es_esemenyek",
          "name": "JavaScript: DOM és eseménykezelés",
          "short_description": "DOM-manipuláció, események, űrlapkezelés, validálás, és egyszerű állapotkezelés a kliensoldalon.",
          "sub_topics": [
            {
              "key": "dom_kereses_es_modositas",
              "name": "DOM keresés és módosítás",
              "short_description": "Elemek kiválasztása, tartalom és attribútumok módosítása, osztályok kezelése.",
              "example_tasks": [
                "Készíts oldalt, ahol gombnyomásra megváltozik egy bekezdés szövege, és egy CSS-osztályt is kapcsolsz hozzá (toggle). Írd le, mi történik lépésenként!",
                "Hozz létre dinamikusan 10 listaelemet JavaScript-tel, majd kattintásra töröld az adott elemet. Ügyelj arra, hogy a többi működjön tovább!",
                "Szimuláció: a script fut, de nem talál elemet (null). Magyarázd el 6-8 mondatban, miért történik ez (betöltés), és adj 2 megoldást!"
              ]
            },
            {
              "key": "esemenykezeles_es_delegacio",
              "name": "Eseménykezelés és delegáció alapok",
              "short_description": "Kattintás, input, submit események; több elem kezelése és alap eseménydelegáció szemlélete.",
              "example_tasks": [
                "Készíts egyszerű „teendőlista” oldalt: új feladat hozzáadása, készre jelölés kattintással. Írj rövid magyarázatot az eseményekről!",
                "Oldd meg, hogy a dinamikusan létrehozott elemek kattintása is működjön eseménydelegációval; írd le, miért hasznos ez!",
                "Készíts űrlapot, ahol a submit előtt validálod a mezőket (üres mező, e-mail formátum), és hibaüzenetet jelenítesz meg."
              ]
            },
            {
              "key": "state_es_bongeszo_tarolas",
              "name": "Állapot és böngészőoldali tárolás",
              "short_description": "Egyszerű állapotkezelés JavaScript-ben, localStorage/sessionStorage használat alap szinten.",
              "example_tasks": [
                "Bővítsd a teendőlistát úgy, hogy a feladatok elmentődjenek localStorage-ba és újratöltés után is megmaradjanak!",
                "Magyarázd el 6-8 mondatban a localStorage és sessionStorage különbségét, és adj mindkettőre 1-1 gyakorlati példát!",
                "Szimuláció: a tárolt adatok „szemét” lesznek. Készíts 6 pontos tervet, hogyan kezelsz verziót/ütközést (kulcsnév, törlés, migráció)."
              ]
            }
          ]
        },
        {
          "key": "http_api_es_aszinkron_keresek",
          "name": "HTTP, API-k és aszinkron kérések",
          "short_description": "Kérések/válaszok, JSON, fetch, hibakezelés, alap REST szemlélet, és egyszerű kliensoldali integráció.",
          "sub_topics": [
            {
              "key": "fetch_json_es_hibakezeles",
              "name": "Fetch, JSON és hibakezelés",
              "short_description": "GET kérés, válasz feldolgozása, státuszkódok kezelése és hibaüzenetek megjelenítése a felhasználónak.",
              "example_tasks": [
                "Készíts oldalt, ami egy nyilvános teszt API-ból lekér egy listát (pl. posztok), és megjeleníti. Kezeld a betöltés és hiba állapotokat!",
                "Szimuláció: a szerver 404-et ad. Írd le, hogyan különbözteted meg a hálózati hibát és a HTTP hibát, és mit írsz ki a felhasználónak!",
                "Bővítsd a megoldást: legyen keresőmező, ami szűri a lekért adatokat kliensoldalon. Írd le, miért jó külön a lekérés és külön a szűrés!"
              ]
            },
            {
              "key": "rest_alap_muveletek",
              "name": "REST alapműveletek szemlélete (GET/POST/PUT/DELETE)",
              "short_description": "Erőforrások és műveletek; egyszerű CRUD szemlélet, kérés törzse és fejlécek alap fogalma.",
              "example_tasks": [
                "Írj 8-10 mondatot arról, mit jelent a CRUD, és adj egy példát egy „jegyzet app” erőforrásaira (notes) és műveleteire!",
                "Készíts pszeudokódot vagy kódrészletet POST kéréshez (új elem felvitele). Írd le, milyen adatot küldesz és mit vársz vissza!",
                "Szimuláció: egy API 401-et ad. Magyarázd el, mit jelent, és sorolj fel 3 megoldást (token, bejelentkezés, jogosultság)."
              ]
            }
          ]
        },
        {
          "key": "webbiztonsag_alap_szemlelet",
          "name": "Webbiztonság alap szemlélet",
          "short_description": "Alap kockázatok: XSS, rossz input, biztonságos űrlapkezelés, jelszavak és kliensoldali tárolás korlátai.",
          "sub_topics": [
            {
              "key": "input_validalas_es_xss",
              "name": "Input validálás és XSS alapok",
              "short_description": "Felhasználói input tisztítása/ellenőrzése, veszélyes HTML beillesztés elkerülése, „ne bízz az inputban” elv.",
              "example_tasks": [
                "Készíts űrlapot, ami kommentet fogad. Oldd meg, hogy a komment megjelenítésénél ne lehessen HTML-t futtatni (szövegként jelenjen meg).",
                "Magyarázd el 8 mondatban, mi az XSS, és adj 2 példát, hogyan tud egy rossz megjelenítés gondot okozni!",
                "Készíts 10 pontos validálási listát egy regisztrációs űrlaphoz (név, e-mail, jelszó), és jelöld, mi kliensoldali és mi szerveroldali feladat."
              ]
            },
            {
              "key": "cookies_session_es_token",
              "name": "Cookie, session és token szemlélet",
              "short_description": "Bejelentkezés működési képe, session vs. token, és miért veszélyes érzékeny adatot localStorage-ban tárolni.",
              "example_tasks": [
                "Írj 8-10 mondatot arról, mi a különbség session és token alapú azonosítás között (szemléleti szinten)!",
                "Szimuláció: valaki a localStorage-ba ment jelszót. Írd le, miért rossz ötlet, és milyen alternatívák vannak!",
                "Készíts „biztonságos tárolás” szabálylistát 10 pontban webes projekthez (mit tárolhatsz kliensen és mit nem)."
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "adatbazisok_es_sql_alapok_halado",
      "name": "Adatbázisok és SQL alapok (haladó)",
      "short_description": "A tanulók relációs adatbázisokat terveznek alap szinten (táblák, kulcsok, kapcsolatok), írnak SQL lekérdezéseket, és megértik az adatintegritás és normalizálás alapelveit.",
      "sub_topics": [
        {
          "key": "relacios_modell_es_tervezes",
          "name": "Relációs modell és tervezés",
          "short_description": "Entitások, attribútumok, elsődleges/idegen kulcs, kapcsolatok (1–N, N–N) és egyszerű ER szemlélet.",
          "sub_topics": [
            {
              "key": "kulcsok_es_kapcsolatok",
              "name": "Kulcsok és kapcsolatok",
              "short_description": "Elsődleges kulcs és idegen kulcs szerepe, kapcsolatok megvalósítása táblákkal.",
              "example_tasks": [
                "Tervezd meg egy „iskolai könyvtár” adatbázisát 4 táblával (könyv, diák, kölcsönzés, szerző). Jelöld a kulcsokat és a kapcsolatokat!",
                "Adj példát N–N kapcsolatra (pl. diák–szakkör), és tervezd meg a kapcsolótáblát (mezők, kulcsok).",
                "Írj 8-10 mondatos magyarázatot: miért fontos az idegen kulcs, és milyen hibát akadályoz meg!"
              ]
            },
            {
              "key": "normalizalas_alapok",
              "name": "Normalizálás alapok",
              "short_description": "Adatismétlés csökkentése, 1NF/2NF szemlélet, és egyszerű példák hibás táblaszerkezetre.",
              "example_tasks": [
                "Kapsz egy „hibás” táblát (könyv_cím, szerző1, szerző2, szerző3). Alakítsd át normalizált szerkezetre és indokold!",
                "Írj 6-8 mondatot arról, miért problémás, ha egy cellában több érték van (pl. több telefonszám). Adj javított megoldást!",
                "Tervezd át egy „rendelés” táblát úgy, hogy a termékek ne ismétlődjenek feleslegesen; készíts táblalistát kulcsokkal!"
              ]
            }
          ]
        },
        {
          "key": "sql_lekerdezesek",
          "name": "SQL lekérdezések",
          "short_description": "SELECT, WHERE, ORDER BY, GROUP BY, JOIN; egyszerű aggregációk és gyakorlati lekérdezések.",
          "sub_topics": [
            {
              "key": "select_where_orderby",
              "name": "SELECT/WHERE/ORDER BY",
              "short_description": "Alap szűrés, rendezés, mintakeresés (LIKE) és több feltétel kombinálása.",
              "example_tasks": [
                "Írj SQL lekérdezést, ami kilistázza azokat a könyveket, amelyek 2015 után jelentek meg, és rendezze őket év szerint csökkenőben!",
                "Írj lekérdezést, ami visszaadja azokat a diákokat, akiknek a neve „A”-val kezdődik (LIKE), és az osztályuk 11-es!",
                "Készíts 6 tesztlekérdezést ugyanarra a táblára: 2 egyszerű, 2 többfeltételes, 2 rendezéssel; írd le, mit vársz eredményként!"
              ]
            },
            {
              "key": "groupby_aggregate",
              "name": "GROUP BY és aggregációk",
              "short_description": "COUNT/SUM/AVG, csoportosítás kategóriák szerint, HAVING feltétel szemlélete.",
              "example_tasks": [
                "Írj lekérdezést, ami osztályonként megszámolja a diákokat (COUNT) és átlagpontszámot számol (AVG).",
                "Készíts lekérdezést, ami megadja, mely szerzőknek van legalább 3 könyvük a rendszerben (GROUP BY + HAVING).",
                "Egy eladás táblában számold ki kategóriánként a bevételt (SUM), és rendezd a top 5 kategóriát csökkenőben!"
              ]
            },
            {
              "key": "join_alapok",
              "name": "JOIN alapok",
              "short_description": "Két (vagy több) tábla összekapcsolása kulcsok alapján; inner join és left join szemlélet.",
              "example_tasks": [
                "Írj INNER JOIN lekérdezést: listázd a kölcsönzéseket a diák nevével és a könyv címével együtt!",
                "Írj LEFT JOIN lekérdezést: listázd az összes diákot, és mellé, hogy kölcsönzött-e valaha (ha nincs, akkor NULL). Magyarázd el 4 mondatban, miért left join!",
                "Készíts 3 lekérdezést: 1 join, 1 join + where, 1 join + group by. Írd le mindegyik célját!"
              ]
            }
          ]
        },
        {
          "key": "integritas_es_biztonsag_db",
          "name": "Adatintegritás és adatbázis-biztonság alapok",
          "short_description": "Korlátozások (NOT NULL, UNIQUE), referenciális integritás, alap jogosultság és biztonságos lekérdezés szemlélete.",
          "sub_topics": [
            {
              "key": "constraint_ek",
              "name": "Korlátozások és érvényesség",
              "short_description": "Alap constraint-ek szerepe, hibák megelőzése adatbázis szinten.",
              "example_tasks": [
                "Tervezd meg, mely mezők legyenek NOT NULL és UNIQUE egy „felhasználó” táblában (email, felhasználónév). Indokold!",
                "Adj 5 példát olyan hibára, amit constraint-ekkel meg lehet előzni (üres email, duplikált azonosító), és írd le a megfelelő constraint-et!",
                "Készíts rövid leírást (8 mondat): miért jobb egyes szabályokat adatbázisban is ellenőrizni, nem csak az alkalmazásban?"
              ]
            },
            {
              "key": "sql_injection_szemlelet",
              "name": "SQL injection szemlélet",
              "short_description": "Miért veszélyes a bemenet összefűzése SQL-lel, és hogyan védekezünk (paraméterezés szemlélete).",
              "example_tasks": [
                "Írj 6-8 mondatot arról, mi az SQL injection, és miért veszélyes egy bejelentkezési űrlapnál!",
                "Mutass be egy „rossz” lekérdezésépítést (string összefűzés) és egy „jobb” megoldást paraméterezéssel (pszeudokód elég).",
                "Készíts 10 pontos biztonsági checklistet adatbázis használathoz (jogosultságok, logolás, mentés, paraméterezés)."
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "rendszerismeret_es_uzemeltetes_alapok",
      "name": "Rendszerismeret és üzemeltetés alapok",
      "short_description": "A tanulók alap szinten értik az operációs rendszerek feladatait, képesek tipikus rendszerbeállításokra és hibaelhárításra, ismerik a parancssor alap eszközeit, valamint átlátják a mentés és hozzáférés-kezelés szerepét.",
      "sub_topics": [
        {
          "key": "operacios_rendszerek_funkcioi",
          "name": "Operációs rendszerek funkciói",
          "short_description": "Folyamatok, erőforrás-kezelés, fájlrendszer, felhasználók és jogosultságok alap szemlélete.",
          "sub_topics": [
            {
              "key": "folyamatok_es_eroforrasok",
              "name": "Folyamatok és erőforrások",
              "short_description": "Folyamatok fogalma, CPU/memória használat, és a „miért lassú a gép?” alap ok-okozati összefüggései.",
              "example_tasks": [
                "Írj 8-10 mondatot arról, mi a folyamat, és hogyan függ össze a sok háttérben futó program a gép lassulásával!",
                "Készíts hibaelhárítási lépéslistát: „a gép belassult”. Legyen benne legalább 10 lépés (feladatkezelő, indítás, tárhely, frissítés).",
                "Szimuláció: egy program lefagy. Írd le, hogyan döntesz: vársz, bezárod, újraindítod a gépet, és mikor kell adatmentés."
              ]
            },
            {
              "key": "fajlrendszer_es_utvonalak",
              "name": "Fájlrendszer és útvonalak",
              "short_description": "Mappaszerkezet, abszolút/relatív útvonal, fájlkiterjesztések és rendszerezett tárolás.",
              "example_tasks": [
                "Készíts egy mappastruktúrát egy tanévre (tantárgyak, projektek, beadandók). Adj névadási szabályt és példákat 10 fájlnévre!",
                "Magyarázd el 6-8 mondatban az abszolút és relatív útvonal különbségét, és adj 3-3 példát!",
                "Szimuláció: a program „nem találja a fájlt”. Írd le 6 lépésben, hogyan deríted ki, hogy útvonalhiba vagy jogosultsági hiba."
              ]
            },
            {
              "key": "felhasznalok_es_jogosultsagok_os",
              "name": "Felhasználók és jogosultságok",
              "short_description": "Felhasználói fiókok, admin jogok, fájlhozzáférések és a legkisebb jogosultság elve.",
              "example_tasks": [
                "Írj 8 mondatot arról, miért veszélyes mindig admin fiókkal dolgozni, és mikor indokolt mégis!",
                "Készíts példát 3 szerepkörre (diák, tanár, rendszergazda) és sorolj fel 5-5 jogosultságot, ami náluk reális egy iskolai rendszerben!",
                "Szimuláció: nem tudsz telepíteni egy programot. Írd le, milyen lehetőségeid vannak biztonságosan (engedély kérés, alternatíva)."
              ]
            }
          ]
        },
        {
          "key": "parancssor_es_automatizalas_alapok",
          "name": "Parancssor és automatizálás alapok",
          "short_description": "Alap parancsok, könyvtárkezelés, fájlműveletek, egyszerű szkriptek szemlélete és a parancssor előnyei.",
          "sub_topics": [
            {
              "key": "alap_parancsok_navigacio",
              "name": "Alap parancsok és navigáció",
              "short_description": "Könyvtárváltás, listázás, fájlok létrehozása/törlése parancssorból; alap biztonsági óvatosság.",
              "example_tasks": [
                "Írj parancssori „gyakorlatlapot”: legalább 12 parancs (cd, ls/dir, mkdir, rm/del). Minden parancshoz írd oda, mire jó és egy példát!",
                "Szimuláció: véletlenül rossz mappában törölsz fájlt. Írj 6-8 mondatot, milyen megelőzés kell (ellenőrzés, dry-run, biztonsági mentés).",
                "Készíts egy feladatot: hozz létre 5 mappát és bennük 3-3 fájlt parancssorral (név szerint). Írd le lépésenként a parancsokat!"
              ]
            },
            {
              "key": "kereses_es_szuro_parancsok",
              "name": "Keresés és szűrés parancssorban",
              "short_description": "Fájlok keresése név alapján, egyszerű szövegkeresés és kimenet szűrése (szemléleti szinten).",
              "example_tasks": [
                "Készíts feladatot: találj meg minden `.txt` fájlt egy mappában és almappákban. Írd le a parancs logikáját (OS-től függően)!",
                "Egy naplófájlban keresd meg a „ERROR” sorokat (szövegkeresés). Írd le 5 mondatban, miért hasznos a logok szűrése!",
                "Szimuláció: túl sok találat jön. Írd le, hogyan szűkíted a keresést (mappa, kiterjesztés, dátum, kulcsszó)."
              ]
            },
            {
              "key": "egyszeru_szkriptek_batch",
              "name": "Egyszerű szkriptek (batch/shell) szemlélete",
              "short_description": "Ismétlődő feladatok automatizálása egyszerű parancssori szkriptekkel (fájlmásolás, átnevezés).",
              "example_tasks": [
                "Írj egy szkript-tervet (pszeudokód): 20 fájl átnevezése egységes mintára (pl. `foto_001.jpg`). Írd le a lépéseket!",
                "Készíts automatizálási forgatókönyvet: minden nap mentsd el a „projekt” mappát egy dátumos mappába. Írd le a logikát és a kockázatokat!",
                "Írj 8-10 mondatot arról, mikor éri meg automatizálni és mikor nem (idő, hibakockázat, egyszeriség)."
              ]
            }
          ]
        },
        {
          "key": "mentes_visszaallitas_es_adatbiztonsag",
          "name": "Mentés, visszaállítás és adatbiztonság",
          "short_description": "Mentési stratégiák (3-2-1), verziók, felhő és offline mentés, valamint helyreállítási terv alap szinten.",
          "sub_topics": [
            {
              "key": "mentesi_strategiak_321",
              "name": "Mentési stratégiák (3-2-1)",
              "short_description": "Több példány, több médium, egy példány külön helyen; automatikus mentés és ellenőrzés.",
              "example_tasks": [
                "Készíts 3-2-1 mentési tervet a saját tanulmányaidhoz: mit mentesz, hova, milyen gyakran, és hogyan ellenőrzöd, hogy visszaállítható!",
                "Szimuláció: tönkremegy a laptop. Írd le 8 lépésben, hogyan állítod vissza az adataidat a mentésekből!",
                "Írj 6-8 mondatot arról, miért nem mentés önmagában a „fájl a felhőben”, ha nincs verzió és nincs ellenőrzött visszaállítás."
              ]
            },
            {
              "key": "verziok_es_dokumentum_helyreallitas",
              "name": "Verziók és dokumentum-helyreállítás",
              "short_description": "Korábbi verziók visszaállítása, mentési pontok és a változtatások nyomon követése.",
              "example_tasks": [
                "Egy dokumentumban 3 nappal korábbi verziót kell visszahozni. Írd le a lépéseket (általános felhő/Office logika), és mire figyelsz!",
                "Készíts „mentési pont” szabályt egy projekthez: mikor hozol létre verziót, hogyan nevezed el, és hol tárolod!",
                "Szimuláció: valaki véletlenül töröl egy közös fájlt. Írd le, hogyan deríted ki ki törölte, és hogyan állítod vissza biztonságosan!"
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "felho_es_virtualizacio_alapok",
      "name": "Felhő és virtualizáció alapok",
      "short_description": "A tanulók átlátják a felhőszolgáltatások alapmodelljeit (IaaS/PaaS/SaaS), megértik a virtualizáció lényegét, és képesek egyszerű felhős munkafolyamatok és megosztások biztonságos használatára.",
      "sub_topics": [
        {
          "key": "felho_modellek_es_szolgaltatasok",
          "name": "Felhőmodellek és szolgáltatások",
          "short_description": "SaaS/PaaS/IaaS szemléleti különbség, előnyök, kockázatok és tipikus példák.",
          "sub_topics": [
            {
              "key": "saas_paas_iaas_peldak",
              "name": "SaaS/PaaS/IaaS példák és összehasonlítás",
              "short_description": "A három modell közti felelősség-megosztás és tipikus használati esetek megértése.",
              "example_tasks": [
                "Sorolj fel 3-3 példát SaaS, PaaS és IaaS szolgáltatásra (általános). Írd le, ki felel az üzemeltetésért és ki az adatokért!",
                "Készíts 10 mondatos magyarázatot: miért jó a SaaS iskolai projektekhez, és mikor kell inkább saját szerver/megoldás!",
                "Szimuláció: egy iskolai webappot szeretnél futtatni. Írd le, melyik modellt választanád (SaaS/PaaS/IaaS) és miért (5 szempont)."
              ]
            },
            {
              "key": "felho_koltseg_es_hozzaferes",
              "name": "Felhő költségek és hozzáférés-kezelés",
              "short_description": "Alap költségtényezők (tárhely, forgalom), jogosultságok, megosztás és audit szemlélet.",
              "example_tasks": [
                "Készíts listát 6 tényezőről, ami növelheti egy felhős megoldás költségét (tárhely, forgalom, mentés). Írd mellé a csökkentési ötletet!",
                "Tervezd meg egy osztály felhős mappastruktúráját jogosultságokkal (tanár: szerkeszt, diák: feltölt, publik: olvas). Indokold!",
                "Szimuláció: „túl sokan férnek hozzá” egy fájlhoz. Írd le, hogyan auditálod a hozzáféréseket és hogyan szigorítod (8 lépés)."
              ]
            }
          ]
        },
        {
          "key": "virtualizacio_kontenerek_szemlelet",
          "name": "Virtualizáció és konténerek szemlélete",
          "short_description": "Virtuális gép vs. konténer alap különbségek, izoláció, erőforrások és tipikus fejlesztői/üzemeltetési használat.",
          "sub_topics": [
            {
              "key": "vm_vs_container",
              "name": "Virtuális gép vs. konténer",
              "short_description": "Izoláció, méret, indítási idő és „mindenkinek ugyanúgy fut” problémakör megértése.",
              "example_tasks": [
                "Írj 10 mondatos összehasonlítást VM és konténer között (erőforrás, izoláció, gyorsaság, használat).",
                "Szimuláció: a projekted csak nálad fut, másnál nem. Írd le, hogyan segíthet a konténeresítés (függőségek, verziók) szemléleti szinten!",
                "Készíts példát 3 helyzetre, amikor VM-et választanál, és 3-ra, amikor konténert; mindegyikhez 1 indok."
              ]
            },
            {
              "key": "deploy_szemlelet_es_env",
              "name": "Telepítés (deploy) szemlélet és környezetek",
              "short_description": "Fejlesztői vs. teszt vs. éles környezet, konfigurációk és titkok (secrets) kezelése alap szinten.",
              "example_tasks": [
                "Készíts 3 környezetet (dev/test/prod) leíró táblázatot szövegesen: mi más bennük (adat, debug, log), és miért kell különválasztani!",
                "Írj 8-10 mondatot arról, miért nem szabad jelszavakat API kulcsokat kódba írni, és milyen megoldások vannak (környezeti változók).",
                "Szimuláció: élesben hibázik egy új verzió. Írd le 8 lépésben, hogyan állítasz vissza (rollback), és hogyan előzöd meg a jövőben (teszt, staging)."
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "ai_es_gepi_tanulas_alapok",
      "name": "Mesterséges intelligencia és gépi tanulás alapok",
      "short_description": "A tanulók alap fogalmakat ismernek az MI-ről (adat, modell, tanítás), értik a torzítás és etikai kockázatok lényegét, és egyszerű, hétköznapi példákon keresztül képesek elemezni, mire használható és mire nem.",
      "sub_topics": [
        {
          "key": "mi_alapfogalmak",
          "name": "MI alapfogalmak",
          "short_description": "Adat, jellemzők, tanítóadat, modell, pontosság és túlilleszkedés szemlélete.",
          "sub_topics": [
            {
              "key": "tanito_adat_es_modell",
              "name": "Tanítóadat és modell",
              "short_description": "Miért kell adat a tanításhoz, mi a modell feladata, és hogyan mérjük a teljesítményt.",
              "example_tasks": [
                "Írj 8-10 mondatot arról, mit jelent „tanítani” egy modellt, és miért kell külön tanító és teszt adat!",
                "Készíts egyszerű példát: e-mail spam szűrés. Sorolj fel 8 lehetséges jellemzőt (szavak, feladó), és írd le, miért lehetnek hasznosak!",
                "Szimuláció: a modell a tesztadatokon jól teljesít, de valóságban rosszul. Írd le 4 okát (túlilleszkedés, eltolódás) és 2 megoldást!"
              ]
            },
            {
              "key": "felugyelt_es_nem_felugyelt",
              "name": "Felügyelt és nem felügyelt tanulás",
              "short_description": "Címkézett adatok vs. csoportosítás; tipikus feladatok (osztályozás, klaszterezés).",
              "example_tasks": [
                "Adj 3 példát felügyelt tanulásra és 3 példát nem felügyeltre iskolai/életbeli kontextusban, mindegyikhez 1 mondatos indokkal!",
                "Képzeld el, hogy tanulókat akarsz „tanulási stílus” alapján csoportosítani. Milyen adatok kellenek és miért nem triviális a címkézés? Írj 8 mondatot!",
                "Magyarázd el 6-8 mondatban, mi a különbség osztályozás és klaszterezés között, és miért fontos a cél meghatározása."
              ]
            }
          ]
        },
        {
          "key": "torzitas_etika_es_adatvedelem_mi",
          "name": "Torzítás, etika és adatvédelem az MI-ben",
          "short_description": "Bias, méltányosság, átláthatóság, szerzői jog és személyes adatok kezelése MI rendszerekben.",
          "sub_topics": [
            {
              "key": "bias_es_igazsagossag",
              "name": "Torzítás (bias) és igazságosság",
              "short_description": "Hogyan kerül be a torzítás az adatokba és a modellbe, és milyen következménye lehet döntésekre.",
              "example_tasks": [
                "Készíts példát (szituáció) arra, hogyan lehet torz egy adatgyűjtés (nem reprezentatív minta). Írd le a következményt és 2 javítási módot!",
                "Írj 10 mondatos elemzést: miért veszélyes automatikusan dönteni (felvételi, hitel) torz adatok alapján, és milyen emberi kontroll kell!",
                "Tervezd meg egy iskolai felmérés adatgyűjtését úgy, hogy minél kevesebb bias legyen. Adj 6 konkrét szabályt!"
              ]
            },
            {
              "key": "adatvedelem_es_szerzoi_jog_mi",
              "name": "Adatvédelem és szerzői jog MI használatnál",
              "short_description": "Személyes adatok megosztásának kockázata, promptokban szereplő információk, és a tartalom felhasználásának etikai kérdései.",
              "example_tasks": [
                "Írj 10 pontos szabálylistát: milyen adatot nem írsz be MI eszközbe (név, cím, jelszó), és miért!",
                "Készíts szituációt: egy diák beadandójához MI-t használ, de nem jelöli. Írd le az etikai problémát és javasolj „helyes” megoldást!",
                "Gyűjts össze 6 példát arra, hogyan lehet egy MI által generált tartalmat felelősen felhasználni (ellenőrzés, forrás, saját munka aránya)."
              ]
            }
          ]
        },
        {
          "key": "mi_alkalmazasok_es_korlatai",
          "name": "MI alkalmazások és korlátai",
          "short_description": "Képfelismerés, ajánlórendszerek, nyelvi modellek; pontatlanság, „hallucináció”, és kritikus gondolkodás gyakorlása.",
          "sub_topics": [
            {
              "key": "ajanlorendszerek_es_buborek",
              "name": "Ajánlórendszerek és információs buborék",
              "short_description": "Hogyan befolyásolja a fogyasztást és véleményeket az ajánlás; szűrőbuborék és tudatos tartalomfogyasztás.",
              "example_tasks": [
                "Írj 10 mondatos leírást arról, hogyan működhet egy ajánlórendszer (nézési idő, kattintás), és miért alakít ki buborékot!",
                "Készíts 7 napos „tudatos tartalom” kísérletet: hogyan változtatnád meg az ajánlásokat (keresések, leiratkozás). Írd le a várható hatást!",
                "Szimuláció: két ember teljesen más híreket lát. Írd le 6-8 mondatban, hogyan vezethet ez félreértéshez és polarizációhoz."
              ]
            },
            {
              "key": "nyelvi_modellek_hallucinacio",
              "name": "Nyelvi modellek és pontatlanság",
              "short_description": "Miért adhat magabiztos, de hibás választ egy modell; ellenőrzési stratégiák és forráskritika.",
              "example_tasks": [
                "Írj 8-10 mondatot arról, miért kell ellenőrizni egy MI válaszát, és sorolj fel 5 ellenőrzési módszert (forrás, számolás).",
                "Készíts feladatot: kérj MI-től 5 állítást egy témáról, majd jelöld, melyiket tudod ellenőrizni és hogyan. Írd le a folyamatot!",
                "Szimuláció: az MI kitalál egy forrást. Írj lépéslistát, hogyan deríted ki és hogyan javítod a beadandóban (valós forrás)."
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "mobil_es_cross_platform_fejlesztes_alapok",
      "name": "Mobil és cross-platform fejlesztés alapok",
      "short_description": "A tanulók megértik a mobilalkalmazások alap sajátosságait (UI, állapot, erőforrások), készítenek egyszerű prototípust vagy minimál appot, és átlátják a natív és cross-platform megközelítések előnyeit-hátrányait.",
      "sub_topics": [
        {
          "key": "mobil_ui_es_ux_alapok",
          "name": "Mobil UI/UX alapok",
          "short_description": "Képernyőméretek, érintéses interakció, navigáció, űrlapok és alap hozzáférhetőség mobilon.",
          "sub_topics": [
            {
              "key": "mobil_navigacio_mintak",
              "name": "Mobil navigációs minták",
              "short_description": "Tab, stack, drawer szemlélet; mikor melyik jó és hogyan befolyásolja a használhatóságot.",
              "example_tasks": [
                "Tervezd meg egy „iskolai menza” app navigációját (Főoldal, Menü, Rendelések, Profil). Indokold, miért tab vagy drawer mintát választasz!",
                "Készíts 6-8 mondatos elemzést: miért fontos a „1 kézzel használhatóság”, és hogyan hat ez a gombok elhelyezésére!",
                "Készíts drótvázat (wireframe) 3 képernyőre (lista, részletek, űrlap), és jelöld a navigációs elemeket."
              ]
            },
            {
              "key": "urlapok_es_bevitel_mobilon",
              "name": "Űrlapok és adatbevitel mobilon",
              "short_description": "Billentyűzet típusok, mezők validálása, hibaüzenetek és kitöltési élmény javítása.",
              "example_tasks": [
                "Tervezd meg egy regisztrációs űrlapot mobilra: mezők sorrendje, billentyűzet típusok (email/number), és 5 validálási szabály!",
                "Szimuláció: a felhasználó hibázik 3 mezőben. Írd le, hogyan jelzed ezt úgy, hogy ne legyen frusztráló (inline hiba, fókusz, összefoglaló).",
                "Írj 8-10 mondatot arról, miért rossz ötlet túl sok mezőt kérni mobilon, és hogyan csökkented az adatbevitelt."
              ]
            }
          ]
        },
        {
          "key": "cross_platform_szemlelet",
          "name": "Cross-platform szemlélet",
          "short_description": "Natív vs. cross-platform keretrendszerek (általános), újrahasznosítható komponensek és platform-specifikus különbségek.",
          "sub_topics": [
            {
              "key": "nativ_vs_cross_platform",
              "name": "Natív vs. cross-platform összehasonlítás",
              "short_description": "Teljesítmény, fejlesztési idő, platform funkciók elérése és karbantarthatóság szempontjai.",
              "example_tasks": [
                "Készíts 10 pontos összehasonlítást natív és cross-platform fejlesztés között (költség, teljesítmény, hozzáférés hardverhez).",
                "Adj 3 példát, amikor natív fejlesztést választanál (pl. kamera/AR), és 3 példát, amikor cross-platform elég; indokold mindet!",
                "Szimuláció: egy app iOS-en jól fut, Androidon akad. Írd le 6 lépésben, hogyan keresnéd az okát (UI, eszköz, kép méret, logok)."
              ]
            },
            {
              "key": "komponensek_es_allapot_mobilon",
              "name": "Komponensek és állapot mobilon",
              "short_description": "Komponens-alapú gondolkodás, állapotkezelés alapelvek és egyszerű adatáramlás.",
              "example_tasks": [
                "Bonts fel egy „bevásárlólista” appot 6 komponensre (lista, elem, űrlap, gomb). Írd le mindegyik felelősségét!",
                "Készíts egy egyszerű állapotmodellt: milyen adatok vannak a memóriában (listaelemek), és mikor frissülnek (hozzáadás, törlés).",
                "Írj 8 mondatos magyarázatot: miért hasznos az „egyetlen igazságforrás” (single source of truth) állapotkezelésnél."
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "adat_elemzes_es_vizualizacio_alapok",
      "name": "Adatelemzés és vizualizáció alapok",
      "short_description": "A tanulók egyszerű adatfeldolgozást végeznek (tisztítás, összesítés), alap statisztikai mutatókat értelmeznek, és a megfelelő diagramtípust választják a kommunikációhoz.",
      "sub_topics": [
        {
          "key": "adat_tisztitas_es_elokeszites",
          "name": "Adattisztítás és előkészítés",
          "short_description": "Hiányzó értékek, duplikációk, típusok és egységesítés; egyszerű szabályalapú javítás.",
          "sub_topics": [
            {
              "key": "hianyzo_es_hibas_adatok",
              "name": "Hiányzó és hibás adatok kezelése",
              "short_description": "Hiányzó értékek jelölése, kizárás vs. pótlás, és a döntések hatása az eredményekre.",
              "example_tasks": [
                "Kapsz 50 soros adatlistát hiányzó értékekkel. Döntsd el, mikor törölsz sort és mikor pótolsz. Írd le 6 konkrét szabályban!",
                "Szimuláció: az átlag erősen változik, ha 3 kiugró értéket benne hagysz. Írd le, hogyan ismered fel a kiugrókat és hogyan döntesz róluk!",
                "Készíts rövid jegyzetet (10 mondat): miért veszélyes „vakon” kitölteni a hiányzó adatokat, és hogyan dokumentálod a döntéseket."
              ]
            },
            {
              "key": "normalizalas_es_formatum_egysegesites",
              "name": "Normalizálás és formátum-egységesítés",
              "short_description": "Szöveg normalizálás (kisbetű, ékezet), dátum/valuta egységesítés és kategóriák tisztítása.",
              "example_tasks": [
                "Egy városnév oszlopban 5 féle írásmód van („Bp”, „Budapest”, „budapest”). Írj szabályt, hogyan egységesíted, és készíts előtte/utána példát!",
                "Egy dátumoszlop vegyes: „2025-12-16”, „16/12/2025”. Írd le a konverziós tervet és adj 5 mintaátalakítást!",
                "Készíts 8 pontos „adat-egységesítés” checklistet, amit minden projekt elején lefuttatsz."
              ]
            }
          ]
        },
        {
          "key": "alap_statisztika_es_mutatok",
          "name": "Alap statisztika és mutatók",
          "short_description": "Átlag, medián, módusz, szóródás szemlélete; milyen mutató mikor hasznos és mikor félrevezető.",
          "sub_topics": [
            {
              "key": "atlag_median_modusz",
              "name": "Átlag, medián, módusz",
              "short_description": "Középértékek jelentése, kiugrók hatása és megfelelő mutató választása.",
              "example_tasks": [
                "Egy 12 elemű fizetéslistából számold ki az átlagot és mediánt, majd írd le, melyik tükrözi jobban a „tipikus” értéket és miért!",
                "Készíts saját példát, ahol az átlag félrevezető (1 extrém nagy érték). Írd le 6 mondatban a tanulságot!",
                "Egy osztály dolgozatjegyein számold ki a móduszt, és magyarázd el, mit jelent pedagógiai szempontból."
              ]
            },
            {
              "key": "szorodas_es_kiugrok_szemlelet",
              "name": "Szóródás és kiugrók szemlélete",
              "short_description": "Tartomány, egyszerű szóródás-értelmezés, kiugró értékek szerepe és óvatos következtetés.",
              "example_tasks": [
                "Két osztály átlaga ugyanaz, de az egyiknél nagy a szóródás. Írj 8 mondatos értelmezést, melyik osztály teljesít „egységesebben”!",
                "Készíts 15 adatból álló listát és jelöld meg a kiugrókat egyszerű szabállyal (pl. nagyon eltér). Írd le, miért lehetnek hibák vagy valós jelenségek!",
                "Szimuláció: egy grafikonon furcsa csúcs látszik. Írd le, hogyan ellenőrzöd, hogy adatbeviteli hiba vagy valós trend (6 lépés)."
              ]
            }
          ]
        },
        {
          "key": "adatvizualizacio_es_kommunikacio",
          "name": "Adatelemzés vizualizációval és kommunikáció",
          "short_description": "Megfelelő diagramválasztás, tengelyek, skálák, félrevezető ábrák felismerése és érthető adat-sztori készítése.",
          "sub_topics": [
            {
              "key": "diagram_tipus_valasztas",
              "name": "Diagramtípus választás",
              "short_description": "Oszlop, vonal, kör, hisztogram; mikor melyiket és hogyan ne legyen félrevezető.",
              "example_tasks": [
                "Válassz diagramtípust 5 különböző adathoz (idősor, kategóriák, arányok). Indokold mindegyiket 1-2 mondatban!",
                "Készíts két diagramot ugyanarról az adatról: egy jó és egy félrevezető (pl. nem nulláról induló tengely). Írd le, miért félrevezető!",
                "Írj 10 pontos ellenőrző listát diagramokhoz: cím, tengely, mértékegység, forrás, skála, olvashatóság."
              ]
            },
            {
              "key": "adat_sztori_es_kovetkeztetes",
              "name": "Adat-sztori és következtetés",
              "short_description": "Mit állíthatunk az adatok alapján és mit nem; korreláció vs. okság szemlélete és óvatos megfogalmazás.",
              "example_tasks": [
                "Írj 10 mondatos összefoglalót egy egyszerű adathalmazról: 3 tény (biztos), 2 feltételezés (bizonytalan), 1 további adat igény.",
                "Készíts példát korrelációra, ami nem okság (pl. két együtt mozgó jelenség). Írd le, hogyan vizsgálnád tovább!",
                "Szimuláció: egy grafikonból rossz következtetést vonnak le. Írd le 6-8 mondatban, hogyan javítod a megfogalmazást és mit kérdezel vissza."
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "iot_es_beagyazott_rendszerek_szemlelet",
      "name": "IoT és beágyazott rendszerek szemlélete",
      "short_description": "A tanulók megértik a szenzorok, mikrokontrollerek és okoseszközök működési alapjait, képesek egyszerű IoT-szituációkat elemezni, és figyelnek a biztonsági kockázatokra.",
      "sub_topics": [
        {
          "key": "szenzorok_es_adatgyujtes",
          "name": "Szenzorok és adatgyűjtés",
          "short_description": "Szenzor típusok, mérési zaj, mintavétel és adatküldés szemlélete egyszerű példákon.",
          "sub_topics": [
            {
              "key": "szenzor_tipusok_es_alkalmazasok",
              "name": "Szenzortípusok és alkalmazások",
              "short_description": "Hőmérséklet, fény, mozgás, páratartalom; melyik mire jó és milyen hibák fordulhatnak elő.",
              "example_tasks": [
                "Sorolj fel 6 szenzortípust és mindegyikhez írj 1 valós felhasználást (otthon, iskola, város).",
                "Szimuláció: a mozgásérzékelő túl sok „hamis riasztást” ad. Írj 6 lehetséges okot és 3 javítási ötletet!",
                "Írj 8 mondatos magyarázatot arról, miért fontos a kalibrálás és milyen jelenség a mérési zaj."
              ]
            },
            {
              "key": "mintavetelezes_es_adat_agg",
              "name": "Mintavételezés és adat-aggregáció",
              "short_description": "Milyen gyakran mérünk, hogyan simítunk (átlagolás) és miért küldünk összesített adatot.",
              "example_tasks": [
                "Egy hőmérő 1 másodpercenként mér, de csak 1 percenként küld adatot. Írd le, milyen összesítést használnál (átlag, min/max) és miért!",
                "Készíts 10 perces mintasorozatot (kitalált számokkal), majd számolj belőle perces átlagot és jelöld a kiugrókat!",
                "Szimuláció: ritkább mintavétellel lemaradsz egy gyors eseményről. Írd le, mikor kell sűrűbben mérni és milyen ára van (energia, adat)."
              ]
            }
          ]
        },
        {
          "key": "iot_arch_es_halozat",
          "name": "IoT architektúra és hálózat",
          "short_description": "Eszköz–gateway–felhő modell, protokollok szemlélete (általános), és alap távfelügyelet.",
          "sub_topics": [
            {
              "key": "eszkoz_gateway_felho",
              "name": "Eszköz–gateway–felhő modell",
              "short_description": "Adat útja a szenzortól a felhasználói felületig; miért kell gateway és mit csinál a felhő.",
              "example_tasks": [
                "Rajzolj egyszerű IoT rendszert: szenzor → gateway → felhő → mobil app. Írj 6 mondatot, mit csinál mindegyik elem!",
                "Tervezd meg egy „okos tanterem” rendszert (hőmérséklet, CO₂, világítás). Milyen adatokat gyűjtesz és milyen döntést hozol belőle?",
                "Szimuláció: kiesik az internet. Írd le, mi működjön tovább helyben és mit tároljon a rendszer későbbi feltöltésre!"
              ]
            },
            {
              "key": "iot_biztonsagi_kockazatok",
              "name": "IoT biztonsági kockázatok",
              "short_description": "Alap kockázatok: gyári jelszó, frissítés hiánya, nyitott portok, adatvédelem; biztonságos beállítások.",
              "example_tasks": [
                "Készíts 12 pontos biztonsági checklistet IoT eszköz telepítéséhez (jelszócsere, frissítés, külön Wi-Fi háló).",
                "Szimuláció: egy okos kamera gyári jelszóval fut. Írd le 8 lépésben, hogyan teszed biztonságossá és milyen hibákat kerülsz!",
                "Írj 8 mondatos elemzést: miért különösen veszélyes a sok olcsó IoT eszköz, és milyen felelősségük van a gyártóknak/felhasználóknak."
              ]
            }
          ]
        }
      ]
    }
  ]
}
