{
  "grade_9_10": [
    {
      "key": "introduccion_quimica_estructura_materia",
      "name": "Introducción a la Química y Estructura de la Materia",
      "short_description": "Fundamentos de la química como ciencia, método científico aplicado a fenómenos químicos, y estudio de la estructura atómica y molecular de la materia.",
      "sub_topics": [
        {
          "key": "que_es_quimica_metodo_cientifico",
          "name": "¿Qué es la Química? y Método Científico",
          "short_description": "Definición de química, ramas de la química, importancia en la vida cotidiana y aplicación del método científico en investigaciones químicas.",
          "sub_topics": [
            {
              "key": "definicion_ramas_quimica",
              "name": "Definición y Ramas de la Química",
              "short_description": "Comprender qué estudia la química y sus principales ramas (orgánica, inorgánica, analítica, fisicoquímica, bioquímica).",
              "example_tasks": [
                "Identifica a qué rama de la química pertenecen los siguientes estudios: análisis de sangre en laboratorio clínico, síntesis de plásticos, estudio de reacciones en células vivas.",
                "Explica con tus propias palabras por qué la química se considera una ciencia central que conecta con biología, física y ciencias de la tierra.",
                "Investiga y describe tres aplicaciones de la química en la industria mexicana (por ejemplo: petroquímica, farmacéutica, alimentos)."
              ]
            },
            {
              "key": "metodo_cientifico_quimica",
              "name": "Aplicación del Método Científico en Química",
              "short_description": "Etapas del método científico: observación, planteamiento del problema, hipótesis, experimentación, análisis de resultados y conclusiones.",
              "example_tasks": [
                "Diseña un experimento para investigar qué factores afectan la velocidad de disolución del azúcar en agua (temperatura, agitación, tamaño de partícula).",
                "Observa la oxidación de una manzana cortada y plantea una hipótesis sobre qué la causa. Propón un experimento para comprobar tu hipótesis.",
                "Analiza los resultados de un experimento sobre la densidad de diferentes líquidos y elabora conclusiones basadas en los datos obtenidos."
              ]
            },
            {
              "key": "importancia_quimica_vida",
              "name": "Importancia de la Química en la Vida Cotidiana",
              "short_description": "Reconocer el papel de la química en alimentos, medicamentos, tecnología, medio ambiente y desarrollo sustentable.",
              "example_tasks": [
                "Elabora una lista de 10 productos químicos que utilizas diariamente en casa (jabón, cloro, medicamentos) y explica su función.",
                "Investiga cómo la química contribuye a la conservación de alimentos en México (pasteurización, refrigeración, conservadores).",
                "Debate sobre los beneficios y riesgos del uso de productos químicos en la agricultura mexicana (fertilizantes, pesticidas)."
              ]
            }
          ]
        },
        {
          "key": "magnitudes_unidades_medicion",
          "name": "Magnitudes, Unidades y Medición en Química",
          "short_description": "Sistema Internacional de Unidades, conversión de unidades, instrumentos de medición en el laboratorio y manejo de cifras significativas.",
          "sub_topics": [
            {
              "key": "sistema_internacional_unidades",
              "name": "Sistema Internacional de Unidades (SI)",
              "short_description": "Unidades fundamentales (metro, kilogramo, segundo, mol, kelvin) y unidades derivadas utilizadas en química.",
              "example_tasks": [
                "Convierte las siguientes medidas: 2.5 kg a gramos, 750 mL a litros, 25°C a Kelvin, 1500 mm a metros.",
                "Identifica las unidades del SI apropiadas para medir: masa de sal, volumen de agua, temperatura de ebullición, cantidad de sustancia.",
                "Calcula la densidad de una muestra que tiene 50 g de masa y ocupa 25 cm³ de volumen. Expresa el resultado en g/mL y kg/m³."
              ]
            },
            {
              "key": "instrumentos_laboratorio",
              "name": "Instrumentos de Medición en el Laboratorio",
              "short_description": "Uso correcto de balanza, probeta, pipeta, bureta, termómetro y matraz volumétrico para mediciones precisas.",
              "example_tasks": [
                "Describe el procedimiento correcto para medir 50 mL de agua usando una probeta graduada y explica cómo leer el menisco.",
                "Compara la precisión de diferentes instrumentos: ¿qué es más preciso para medir 10 mL de solución, una probeta de 100 mL o una pipeta volumétrica de 10 mL?",
                "Diseña un experimento para determinar la masa y volumen de diferentes objetos sólidos irregulares utilizando balanza y probeta."
              ]
            },
            {
              "key": "cifras_significativas_notacion",
              "name": "Cifras Significativas y Notación Científica",
              "short_description": "Reglas para identificar cifras significativas, redondeo de resultados y uso de notación científica para números muy grandes o muy pequeños.",
              "example_tasks": [
                "Determina el número de cifras significativas en: 0.00456 g, 1200 m, 3.40 × 10⁵, 0.08020 L.",
                "Realiza las siguientes operaciones respetando cifras significativas: 12.5 g + 3.47 g, 25.0 mL × 1.2 g/mL.",
                "Expresa en notación científica: la masa de un átomo de carbono (0.00000000000000000000002 g), la velocidad de la luz (300,000,000 m/s)."
              ]
            },
            {
              "key": "conversion_factores_unidades",
              "name": "Conversión de Unidades y Factores de Conversión",
              "short_description": "Método del factor unitario para convertir entre diferentes sistemas de unidades (SI, CGS, inglés).",
              "example_tasks": [
                "Convierte 5.5 libras a kilogramos, sabiendo que 1 lb = 453.6 g.",
                "Una receta requiere 2 tazas de harina. Si 1 taza = 240 mL, ¿cuántos litros de harina necesitas?",
                "Calcula cuántos segundos hay en un año utilizando factores de conversión (365 días, 24 horas, 60 minutos, 60 segundos)."
              ]
            }
          ]
        },
        {
          "key": "estructura_atomica",
          "name": "Estructura Atómica de la Materia",
          "short_description": "Modelos atómicos históricos, partículas subatómicas, número atómico, masa atómica, isótopos y configuración electrónica.",
          "sub_topics": [
            {
              "key": "modelos_atomicos_historicos",
              "name": "Evolución de los Modelos Atómicos",
              "short_description": "Modelos de Dalton, Thomson, Rutherford, Bohr y modelo cuántico actual; aportes de cada científico.",
              "example_tasks": [
                "Elabora una línea del tiempo que muestre la evolución de los modelos atómicos desde Dalton hasta el modelo actual.",
                "Compara los modelos de Thomson (budín de pasas) y Rutherford (nuclear): ¿qué experimento llevó al cambio de modelo?",
                "Explica las limitaciones del modelo de Bohr y por qué fue necesario desarrollar el modelo mecánico-cuántico."
              ]
            },
            {
              "key": "particulas_subatomicas",
              "name": "Partículas Subatómicas: Protones, Neutrones y Electrones",
              "short_description": "Propiedades de protones, neutrones y electrones: carga, masa, ubicación en el átomo.",
              "example_tasks": [
                "Completa la tabla para un átomo de sodio (Na, Z=11, A=23): número de protones, neutrones y electrones.",
                "Explica por qué un átomo neutro tiene el mismo número de protones que de electrones.",
                "Calcula el número de neutrones en los siguientes átomos: cloro-35, cloro-37, uranio-238."
              ]
            },
            {
              "key": "numero_atomico_masico_isotopos",
              "name": "Número Atómico, Número de Masa e Isótopos",
              "short_description": "Definición de número atómico (Z) y número de masa (A); concepto y ejemplos de isótopos.",
              "example_tasks": [
                "Determina qué elementos tienen los siguientes números atómicos: Z=6, Z=8, Z=26, Z=79.",
                "Identifica cuáles de los siguientes son isótopos: ¹²C, ¹³C, ¹⁴N, ¹⁴C.",
                "El carbono tiene dos isótopos estables: ¹²C (98.9%) y ¹³C (1.1%). Calcula la masa atómica promedio del carbono."
              ]
            },
            {
              "key": "configuracion_electronica",
              "name": "Configuración Electrónica y Niveles de Energía",
              "short_description": "Distribución de electrones en niveles, subniveles y orbitales; principio de Aufbau, regla de Hund y principio de exclusión de Pauli.",
              "example_tasks": [
                "Escribe la configuración electrónica de los siguientes elementos: carbono (Z=6), oxígeno (Z=8), sodio (Z=11), hierro (Z=26).",
                "Dibuja el diagrama de orbitales para el nitrógeno (Z=7) siguiendo la regla de Hund.",
                "Identifica el elemento cuya configuración electrónica termina en 3s² 3p⁴."
              ]
            },
            {
              "key": "electrones_valencia_kernel",
              "name": "Electrones de Valencia y Configuración Kernel",
              "short_description": "Identificar electrones de valencia y su importancia en la reactividad química; notación kernel.",
              "example_tasks": [
                "Determina cuántos electrones de valencia tienen: Na, Mg, Al, Si, P, S, Cl.",
                "Escribe la configuración electrónica kernel para: calcio [Ar]4s², bromo [Ar]3d¹⁰4s²4p⁵.",
                "Explica por qué los elementos del mismo grupo tienen propiedades químicas similares usando el concepto de electrones de valencia."
              ]
            }
          ]
        },
        {
          "key": "clasificacion_materia_propiedades",
          "name": "Clasificación de la Materia y sus Propiedades",
          "short_description": "Estados de agregación, cambios de estado, clasificación en sustancias puras y mezclas, propiedades físicas y químicas.",
          "sub_topics": [
            {
              "key": "estados_agregacion",
              "name": "Estados de Agregación de la Materia",
              "short_description": "Características de sólidos, líquidos, gases y plasma; teoría cinético-molecular.",
              "example_tasks": [
                "Explica las diferencias entre sólidos, líquidos y gases en términos de la teoría cinético-molecular (movimiento de partículas, fuerzas intermoleculares).",
                "Da tres ejemplos de cada estado de la materia que encuentres en tu cocina.",
                "Describe qué le sucede a las partículas de agua cuando se calienta desde 0°C hasta 120°C."
              ]
            },
            {
              "key": "cambios_estado",
              "name": "Cambios de Estado de la Materia",
              "short_description": "Fusión, solidificación, evaporación, condensación, sublimación y deposición; energía involucrada.",
              "example_tasks": [
                "Identifica los cambios de estado: el hielo seco (CO₂ sólido) se convierte directamente en gas, el agua hierve a 100°C, el vapor se condensa en un espejo.",
                "Dibuja una gráfica de calentamiento del agua desde -20°C hasta 120°C e identifica los cambios de estado.",
                "Explica por qué al sudar te sientes más fresco (utiliza el concepto de calor latente de evaporación)."
              ]
            },
            {
              "key": "sustancias_puras_mezclas",
              "name": "Sustancias Puras y Mezclas",
              "short_description": "Elementos, compuestos, mezclas homogéneas y heterogéneas; criterios de clasificación.",
              "example_tasks": [
                "Clasifica las siguientes sustancias como elemento, compuesto, mezcla homogénea o mezcla heterogénea: aire, agua destilada, ensalada, sal de mesa (NaCl), oro.",
                "Explica la diferencia entre una mezcla homogénea (como el agua de mar) y un compuesto (como el agua pura H₂O).",
                "Diseña un método para separar una mezcla de arena, sal y limaduras de hierro."
              ]
            },
            {
              "key": "propiedades_fisicas_quimicas",
              "name": "Propiedades Físicas y Químicas de la Materia",
              "short_description": "Diferencia entre propiedades físicas (color, densidad, punto de fusión) y químicas (reactividad, combustibilidad).",
              "example_tasks": [
                "Clasifica las siguientes propiedades como físicas o químicas: el agua hierve a 100°C, el hierro se oxida, el azúcar es dulce, el magnesio reacciona con ácidos.",
                "Determina la densidad de diferentes líquidos (aceite, agua, miel) y ordénalos de menor a mayor densidad.",
                "Investiga tres propiedades físicas y tres químicas del aluminio y explica cómo se utilizan en la fabricación de latas de refresco."
              ]
            },
            {
              "key": "metodos_separacion_mezclas",
              "name": "Métodos de Separación de Mezclas",
              "short_description": "Técnicas de separación: filtración, decantación, destilación, evaporación, cromatografía, magnetismo.",
              "example_tasks": [
                "Selecciona el método más adecuado para separar: agua y aceite (decantación), agua y sal (evaporación), arena y agua (filtración).",
                "Describe paso a paso cómo purificar agua de mar para obtener agua destilada.",
                "Diseña un experimento de cromatografía en papel para separar los pigmentos de marcadores de colores."
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "tabla_periodica_enlaces_quimicos",
      "name": "Tabla Periódica y Enlaces Químicos",
      "short_description": "Organización de la tabla periódica, propiedades periódicas de los elementos, y estudio de los diferentes tipos de enlaces químicos que forman las sustancias.",
      "sub_topics": [
        {
          "key": "organizacion_tabla_periodica",
          "name": "Organización y Estructura de la Tabla Periódica",
          "short_description": "Grupos, periodos, bloques (s, p, d, f), clasificación en metales, no metales y metaloides.",
          "sub_topics": [
            {
              "key": "grupos_periodos_bloques",
              "name": "Grupos, Periodos y Bloques de la Tabla Periódica",
              "short_description": "Identificar la ubicación de elementos en grupos (familias) y periodos; significado de los bloques s, p, d, f.",
              "example_tasks": [
                "Localiza en la tabla periódica: sodio, cloro, hierro, carbono. Indica su grupo, periodo y bloque.",
                "Identifica qué elementos pertenecen al grupo 1 (alcalinos), grupo 17 (halógenos) y grupo 18 (gases nobles).",
                "Explica por qué los elementos del grupo 1 tienen propiedades químicas similares utilizando su configuración electrónica."
              ]
            },
            {
              "key": "metales_no_metales_metaloides",
              "name": "Clasificación: Metales, No Metales y Metaloides",
              "short_description": "Propiedades características de metales (conductividad, brillo, maleabilidad), no metales y metaloides.",
              "example_tasks": [
                "Clasifica los siguientes elementos como metal, no metal o metaloide: Cu, S, Si, Au, O₂, Ge.",
                "Compara las propiedades físicas de un metal típico (como el cobre) con un no metal (como el azufre).",
                "Investiga tres usos de metales en la industria mexicana (cobre en cables, aluminio en construcción, hierro en estructuras)."
              ]
            },
            {
              "key": "familias_especiales_elementos",
              "name": "Familias Especiales de Elementos",
              "short_description": "Metales alcalinos, alcalinotérreos, halógenos, gases nobles, metales de transición; propiedades y reactividad.",
              "example_tasks": [
                "Explica por qué los gases nobles son tan poco reactivos (configuración electrónica de capa completa).",
                "Compara la reactividad de los metales alcalinos: Li, Na, K. ¿Cuál es más reactivo y por qué?",
                "Identifica los halógenos (F, Cl, Br, I) y describe sus estados físicos a temperatura ambiente."
              ]
            }
          ]
        },
        {
          "key": "propiedades_periodicas",
          "name": "Propiedades Periódicas de los Elementos",
          "short_description": "Tendencias en la tabla periódica: radio atómico, energía de ionización, afinidad electrónica, electronegatividad.",
          "sub_topics": [
            {
              "key": "radio_atomico_ionico",
              "name": "Radio Atómico y Radio Iónico",
              "short_description": "Variación del tamaño atómico en grupos y periodos; comparación entre átomos neutros y iones.",
              "example_tasks": [
                "Ordena de menor a mayor radio atómico: Li, Na, K (mismo grupo) y explica la tendencia.",
                "Ordena de menor a mayor radio atómico: Na, Mg, Al, Si (mismo periodo) y explica la tendencia.",
                "Compara el tamaño de: Na vs Na⁺, Cl vs Cl⁻. Explica por qué los cationes son más pequeños y los aniones más grandes que sus átomos neutros."
              ]
            },
            {
              "key": "energia_ionizacion",
              "name": "Energía de Ionización",
              "short_description": "Energía necesaria para remover un electrón; tendencias en la tabla periódica.",
              "example_tasks": [
                "Explica por qué la energía de ionización aumenta de izquierda a derecha en un periodo.",
                "Ordena de menor a mayor energía de ionización: Na, Mg, Al y justifica tu respuesta.",
                "Predice qué elemento requiere más energía para perder un electrón: sodio (Na) o neón (Ne). Explica tu razonamiento."
              ]
            },
            {
              "key": "electronegatividad",
              "name": "Electronegatividad y Afinidad Electrónica",
              "short_description": "Capacidad de atraer electrones en un enlace; escala de Pauling; tendencias periódicas.",
              "example_tasks": [
                "Identifica el elemento más electronegativo de la tabla periódica y explica por qué (F, flúor).",
                "Ordena de menor a mayor electronegatividad: C, N, O, F y relaciona con su posición en la tabla periódica.",
                "Predice qué tipo de enlace se formará entre: Na y Cl (diferencia de electronegatividad grande), C y H (diferencia pequeña)."
              ]
            }
          ]
        },
        {
          "key": "enlaces_ionicos",
          "name": "Enlaces Iónicos",
          "short_description": "Formación de iones, transferencia de electrones, formación de redes cristalinas y propiedades de compuestos iónicos.",
          "sub_topics": [
            {
              "key": "formacion_iones",
              "name": "Formación de Cationes y Aniones",
              "short_description": "Pérdida de electrones (cationes) y ganancia de electrones (aniones); regla del octeto.",
              "example_tasks": [
                "Escribe la configuración electrónica del Na y del Na⁺. Explica por qué el sodio forma un catión 1+.",
                "Explica por qué el cloro (Cl) tiende a formar el anión Cl⁻ usando la regla del octeto.",
                "Predice la carga iónica más probable para: Mg, Al, O, S basándote en su posición en la tabla periódica."
              ]
            },
            {
              "key": "enlace_ionico_formacion",
              "name": "Formación del Enlace Iónico",
              "short_description": "Transferencia completa de electrones entre metal y no metal; atracción electrostática.",
              "example_tasks": [
                "Dibuja el diagrama de formación del enlace iónico entre Na y Cl (NaCl), mostrando la transferencia de electrones.",
                "Explica por qué el MgO tiene un enlace iónico más fuerte que el NaCl (cargas +2 y -2 vs +1 y -1).",
                "Escribe la fórmula del compuesto iónico formado entre: Ca y Cl, Al y O, Na y S."
              ]
            },
            {
              "key": "propiedades_compuestos_ionicos",
              "name": "Propiedades de los Compuestos Iónicos",
              "short_description": "Puntos de fusión altos, dureza, fragilidad, conductividad eléctrica en solución o fundidos, solubilidad en agua.",
              "example_tasks": [
                "Explica por qué la sal de mesa (NaCl) tiene un punto de fusión alto (801°C) en términos de fuerzas electrostáticas.",
                "Diseña un experimento para demostrar que el NaCl sólido no conduce electricidad, pero su solución acuosa sí.",
                "Predice si el compuesto KBr (enlace iónico) será soluble en agua o en gasolina. Justifica tu respuesta."
              ]
            }
          ]
        },
        {
          "key": "enlaces_covalentes",
          "name": "Enlaces Covalentes",
          "short_description": "Compartición de electrones, enlaces simples, dobles y triples, polaridad de enlaces y moléculas.",
          "sub_topics": [
            {
              "key": "enlace_covalente_formacion",
              "name": "Formación del Enlace Covalente",
              "short_description": "Compartición de pares de electrones entre no metales; enlaces simples, dobles y triples.",
              "example_tasks": [
                "Dibuja las estructuras de Lewis para: H₂, O₂, N₂, indicando enlaces simples, dobles o triples.",
                "Explica por qué el nitrógeno (N₂) tiene un enlace triple y es muy estable.",
                "Representa la formación del enlace covalente en el agua (H₂O) mostrando los pares de electrones compartidos."
              ]
            },
            {
              "key": "estructuras_lewis",
              "name": "Estructuras de Lewis y Regla del Octeto",
              "short_description": "Representación de enlaces y pares de electrones no compartidos; cumplimiento de la regla del octeto.",
              "example_tasks": [
                "Dibuja las estructuras de Lewis para: CH₄, NH₃, CO₂, HCl.",
                "Identifica cuántos pares de electrones compartidos y no compartidos tiene el amoníaco (NH₃).",
                "Determina si las siguientes moléculas cumplen la regla del octeto: H₂O, BF₃, PCl₅."
              ]
            },
            {
              "key": "polaridad_enlaces",
              "name": "Polaridad de Enlaces Covalentes",
              "short_description": "Enlaces covalentes polares y no polares según diferencia de electronegatividad; dipolo molecular.",
              "example_tasks": [
                "Clasifica los siguientes enlaces como polares o no polares: H-H, H-Cl, C-O, C-H.",
                "Determina cuál molécula es más polar: HF o HCl. Justifica usando valores de electronegatividad.",
                "Dibuja la distribución de cargas parciales (δ+ y δ-) en la molécula de HCl."
              ]
            },
            {
              "key": "geometria_molecular",
              "name": "Geometría Molecular y Polaridad de Moléculas",
              "short_description": "Teoría RPECV, formas moleculares (lineal, angular, tetraédrica, trigonal plana) y polaridad molecular.",
              "example_tasks": [
                "Determina la geometría molecular de: CO₂ (lineal), H₂O (angular), CH₄ (tetraédrica), NH₃ (piramidal trigonal).",
                "Explica por qué el CO₂ es no polar a pesar de tener enlaces polares (geometría lineal simétrica).",
                "Predice si las siguientes moléculas son polares o no polares: H₂O, CCl₄, NH₃, justificando con su geometría."
              ]
            },
            {
              "key": "propiedades_compuestos_covalentes",
              "name": "Propiedades de los Compuestos Covalentes",
              "short_description": "Puntos de fusión bajos, no conducen electricidad, solubilidad variable según polaridad.",
              "example_tasks": [
                "Compara las propiedades del NaCl (iónico) con las del azúcar C₁₂H₂₂O₁₁ (covalente): punto de fusión, conductividad eléctrica.",
                "Explica por qué el agua (polar) disuelve azúcar (polar) pero no disuelve aceite (no polar).",
                "Predice si el metano (CH₄) tendrá un punto de ebullición alto o bajo. Justifica tu respuesta."
              ]
            }
          ]
        },
        {
          "key": "enlaces_metalicos",
          "name": "Enlaces Metálicos y Fuerzas Intermoleculares",
          "short_description": "Modelo del mar de electrones, propiedades de metales, y fuerzas intermoleculares (dipolo-dipolo, puentes de hidrógeno, Van der Waals).",
          "sub_topics": [
            {
              "key": "enlace_metalico",
              "name": "Enlace Metálico y Propiedades de los Metales",
              "short_description": "Mar de electrones deslocalizados; conductividad eléctrica y térmica, maleabilidad, ductilidad, brillo metálico.",
              "example_tasks": [
                "Explica el modelo del mar de electrones y cómo explica la conductividad eléctrica de los metales.",
                "Describe por qué los metales son maleables y dúctiles en términos de su estructura de enlace.",
                "Compara las propiedades del cobre (metálico), sal (iónico) y azúcar (covalente)."
              ]
            },
            {
              "key": "fuerzas_intermoleculares",
              "name": "Fuerzas Intermoleculares: Tipos y Características",
              "short_description": "Fuerzas de dispersión de London, dipolo-dipolo, puentes de hidrógeno; comparación de intensidades.",
              "example_tasks": [
                "Identifica el tipo de fuerza intermolecular predominante en: HCl (dipolo-dipolo), H₂O (puentes de hidrógeno), CH₄ (London).",
                "Ordena de menor a mayor punto de ebullición: CH₄, H₂O, HCl y explica tu ordenamiento usando fuerzas intermoleculares.",
                "Explica por qué el agua tiene un punto de ebullición anormalmente alto (100°C) comparado con moléculas de masa similar."
              ]
            },
            {
              "key": "puentes_hidrogeno",
              "name": "Puentes de Hidrógeno y sus Efectos",
              "short_description": "Formación de puentes de hidrógeno en H₂O, NH₃, HF; importancia biológica y propiedades anómalas del agua.",
              "example_tasks": [
                "Dibuja los puentes de hidrógeno entre moléculas de agua, indicando el átomo parcialmente positivo y el negativo.",
                "Explica por qué el hielo flota en agua líquida usando el concepto de puentes de hidrógeno.",
                "Investiga la importancia de los puentes de hidrógeno en la estructura del ADN y las proteínas."
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "nomenclatura_formulacion_quimica",
      "name": "Nomenclatura y Formulación Química",
      "short_description": "Reglas de nomenclatura IUPAC y tradicional para compuestos inorgánicos y orgánicos básicos; escritura de fórmulas químicas.",
      "sub_topics": [
        {
          "key": "valencia_numero_oxidacion",
          "name": "Valencia y Número de Oxidación",
          "short_description": "Concepto de valencia, determinación de números de oxidación, reglas para asignar estados de oxidación.",
          "sub_topics": [
            {
              "key": "numeros_oxidacion_reglas",
              "name": "Reglas para Asignar Números de Oxidación",
              "short_description": "Reglas sistemáticas para determinar el estado de oxidación de elementos en compuestos y iones.",
              "example_tasks": [
                "Determina el número de oxidación de cada elemento en: H₂O, NaCl, CO₂, H₂SO₄, KMnO₄.",
                "Calcula el número de oxidación del azufre en: H₂S, SO₂, SO₃, H₂SO₄.",
                "Asigna números de oxidación a todos los átomos en el ion nitrato (NO₃⁻) y verifica que la suma dé -1."
              ]
            },
            {
              "key": "valencia_elementos",
              "name": "Valencia de los Elementos Principales",
              "short_description": "Identificar las valencias más comunes de metales y no metales; relación con la posición en la tabla periódica.",
              "example_tasks": [
                "Identifica las valencias comunes de: Na (+1), Mg (+2), Al (+3), Cl (-1), O (-2), N (-3, +3, +5).",
                "Explica por qué los metales alcalinos tienen valencia +1 y los alcalinotérreos +2.",
                "Determina las posibles valencias del hierro: +2 (ferroso) y +3 (férrico) y da un ejemplo de cada compuesto."
              ]
            }
          ]
        },
        {
          "key": "nomenclatura_compuestos_binarios",
          "name": "Nomenclatura de Compuestos Binarios",
          "short_description": "Óxidos metálicos y no metálicos, hidruros, sales binarias; nomenclatura Stock, tradicional y sistemática.",
          "sub_topics": [
            {
              "key": "oxidos_metalicos",
              "name": "Óxidos Metálicos (Óxidos Básicos)",
              "short_description": "Combinación de metal con oxígeno; nomenclatura Stock (número romano) y tradicional (sufijos -oso, -ico).",
              "example_tasks": [
                "Nombra los siguientes óxidos metálicos: Na₂O, CaO, Fe₂O₃, CuO usando nomenclatura Stock y tradicional.",
                "Escribe la fórmula de: óxido de aluminio, óxido de hierro(II), óxido férrico, óxido de cobre(I).",
                "Predice la fórmula del óxido formado por el magnesio y nombra el compuesto."
              ]
            },
            {
              "key": "oxidos_no_metalicos",
              "name": "Óxidos No Metálicos (Óxidos Ácidos o Anhídridos)",
              "short_description": "Combinación de no metal con oxígeno; nomenclatura sistemática con prefijos (mono-, di-, tri-).",
              "example_tasks": [
                "Nombra usando nomenclatura sistemática: CO, CO₂, SO₂, SO₃, N₂O₅.",
                "Escribe la fórmula de: monóxido de carbono, dióxido de azufre, trióxido de dinitró geno, pentóxido de difósforo.",
                "Explica la diferencia entre un óxido metálico y un óxido no metálico en términos de sus propiedades (básicas vs ácidas)."
              ]
            },
            {
              "key": "hidruros",
              "name": "Hidruros Metálicos y No Metálicos (Hidrácidos)",
              "short_description": "Compuestos de hidrógeno con metales (hidruros) y con no metales (hidrácidos).",
              "example_tasks": [
                "Nombra los siguientes hidruros: NaH, CaH₂, AlH₃ (hidruro de sodio, hidruro de calcio, hidruro de aluminio).",
                "Nombra los hidrácidos: HCl (ácido clorhídrico), H₂S (ácido sulfhídrico), HF (ácido fluorhídrico).",
                "Escribe la fórmula de: hidruro de litio, ácido bromhídrico, hidruro de magnesio."
              ]
            },
            {
              "key": "sales_binarias",
              "name": "Sales Binarias (Sales Haloideas)",
              "short_description": "Combinación de metal con no metal (excepto oxígeno); nomenclatura Stock y tradicional.",
              "example_tasks": [
                "Nombra las siguientes sales: NaCl, CaCl₂, FeS, CuBr₂ usando nomenclatura Stock.",
                "Escribe la fórmula de: cloruro de potasio, sulfuro de hierro(III), bromuro de plata, yoduro de sodio.",
                "Predice la fórmula de la sal formada entre aluminio y cloro y nómbrala."
              ]
            }
          ]
        },
        {
          "key": "nomenclatura_compuestos_ternarios",
          "name": "Nomenclatura de Compuestos Ternarios",
          "short_description": "Hidróxidos, oxácidos y oxisales; formación y nomenclatura según reglas IUPAC y tradicionales.",
          "sub_topics": [
            {
              "key": "hidroxidos_bases",
              "name": "Hidróxidos (Bases)",
              "short_description": "Compuestos formados por metal + OH⁻; propiedades básicas y nomenclatura.",
              "example_tasks": [
                "Nombra los siguientes hidróxidos: NaOH, Ca(OH)₂, Al(OH)₃, Fe(OH)₂, Fe(OH)₃.",
                "Escribe la fórmula de: hidróxido de potasio, hidróxido de magnesio, hidróxido de hierro(III).",
                "Predice el producto de la reacción: Na₂O + H₂O → ? y nómbralo (hidróxido de sodio)."
              ]
            },
            {
              "key": "oxacidos",
              "name": "Oxácidos",
              "short_description": "Ácidos que contienen hidrógeno, oxígeno y un no metal; nomenclatura tradicional (-oso, -ico) y Stock.",
              "example_tasks": [
                "Nombra los siguientes oxácidos: HNO₃ (ácido nítrico), H₂SO₄ (ácido sulfúrico), H₃PO₄ (ácido fosfórico), HClO (ácido hipocloroso).",
                "Escribe la fórmula de: ácido carbónico, ácido sulfuroso, ácido perclórico, ácido nitroso.",
                "Identifica el patrón de nomenclatura para los oxácidos del cloro: HClO, HClO₂, HClO₃, HClO₄ (hipo...oso, ...oso, ...ico, per...ico)."
              ]
            },
            {
              "key": "oxisales",
              "name": "Oxisales (Sales Oxigenadas)",
              "short_description": "Sales formadas por la neutralización de oxácidos; terminaciones -ito, -ato según el ácido.",
              "example_tasks": [
                "Nombra las siguientes oxisales: NaNO₃, CaSO₄, K₂CO₃, NaClO, Fe₂(SO₄)₃.",
                "Escribe la fórmula de: nitrato de potasio, sulfato de calcio, carbonato de sodio, fosfato de aluminio.",
                "Completa la tabla de oxisales derivadas del ácido sulfúrico (H₂SO₄ → sulfatos) y del ácido sulfuroso (H₂SO₃ → sulfitos)."
              ]
            }
          ]
        },
        {
          "key": "nomenclatura_organica_basica",
          "name": "Nomenclatura de Compuestos Orgánicos Básicos",
          "short_description": "Introducción a hidrocarburos (alcanos, alquenos, alquinos) y grupos funcionales simples.",
          "sub_topics": [
            {
              "key": "alcanos",
              "name": "Alcanos: Nomenclatura y Estructura",
              "short_description": "Hidrocarburos saturados con enlaces simples C-C; nomenclatura IUPAC (met-, et-, prop-, but-).",
              "example_tasks": [
                "Nombra los primeros diez alcanos: CH₄ (metano), C₂H₆ (etano), C₃H₈ (propano), ..., C₁₀H₂₂ (decano).",
                "Escribe la fórmula molecular y estructural del: pentano, hexano, octano.",
                "Dibuja la estructura del butano (C₄H₁₀) e identifica todos los enlaces carbono-carbono."
              ]
            },
            {
              "key": "alquenos_alquinos",
              "name": "Alquenos y Alquinos: Nomenclatura",
              "short_description": "Hidrocarburos insaturados con dobles (alquenos, -eno) y triples enlaces (alquinos, -ino).",
              "example_tasks": [
                "Nombra los siguientes compuestos: C₂H₄ (eteno/etileno), C₂H₂ (etino/acetileno), C₃H₆ (propeno).",
                "Escribe la fórmula molecular de: buteno, pentino, hexeno.",
                "Compara la fórmula general de alcanos (CₙH₂ₙ₊₂), alquenos (CₙH₂ₙ) y alquinos (CₙH₂ₙ₋₂)."
              ]
            },
            {
              "key": "grupos_funcionales_basicos",
              "name": "Introducción a Grupos Funcionales",
              "short_description": "Alcoholes (-OH), aldehídos (-CHO), cetonas (C=O), ácidos carboxílicos (-COOH); reconocimiento básico.",
              "example_tasks": [
                "Identifica el grupo funcional en: CH₃OH (alcohol), CH₃CHO (aldehído), CH₃COOH (ácido carboxílico).",
                "Nombra los siguientes compuestos: CH₃OH (metanol), C₂H₅OH (etanol), CH₃COOH (ácido acético).",
                "Investiga tres usos del etanol en México (combustible, bebidas, desinfectante)."
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "reacciones_quimicas",
      "name": "Reacciones Químicas",
      "short_description": "Tipos de reacciones químicas, balanceo de ecuaciones, estequiometría y cálculos de reactivos y productos.",
      "sub_topics": [
        {
          "key": "tipos_reacciones_quimicas",
          "name": "Tipos de Reacciones Químicas",
          "short_description": "Clasificación de reacciones: síntesis, descomposición, sustitución simple, doble sustitución y combustión.",
          "sub_topics": [
            {
              "key": "reacciones_sintesis",
              "name": "Reacciones de Síntesis o Combinación",
              "short_description": "Dos o más sustancias se combinan para formar un solo producto (A + B → AB).",
              "example_tasks": [
                "Identifica las siguientes reacciones de síntesis: 2H₂ + O₂ → 2H₂O, C + O₂ → CO₂, CaO + H₂O → Ca(OH)₂.",
                "Predice el producto de las siguientes reacciones de síntesis: Na + Cl₂ → ?, Mg + O₂ → ?",
                "Escribe una ecuación balanceada para la síntesis de amoníaco a partir de nitrógeno e hidrógeno (N₂ + H₂ → NH₃)."
              ]
            },
            {
              "key": "reacciones_descomposicion",
              "name": "Reacciones de Descomposición o Análisis",
              "short_description": "Una sustancia se descompone en dos o más sustancias más simples (AB → A + B).",
              "example_tasks": [
                "Identifica las siguientes reacciones de descomposición: 2H₂O → 2H₂ + O₂, CaCO₃ → CaO + CO₂.",
                "Predice los productos de la descomposición térmica del: carbonato de sodio, hidróxido de cobre(II).",
                "Diseña un experimento para descomponer agua mediante electrólisis y recolectar hidrógeno y oxígeno gaseosos."
              ]
            },
            {
              "key": "reacciones_sustitucion_simple",
              "name": "Reacciones de Sustitución Simple o Desplazamiento",
              "short_description": "Un elemento reemplaza a otro en un compuesto (A + BC → AC + B); serie de actividad de metales.",
              "example_tasks": [
                "Completa las siguientes reacciones: Zn + HCl → ?, Mg + CuSO₄ → ?, Cu + AgNO₃ → ?",
                "Usa la serie de actividad para predecir si ocurrirá reacción: Fe + CuSO₄ → ? (sí), Cu + ZnSO₄ → ? (no).",
                "Explica por qué el sodio puede desplazar al hidrógeno del agua pero el cobre no puede."
              ]
            },
            {
              "key": "reacciones_doble_sustitucion",
              "name": "Reacciones de Doble Sustitución o Intercambio",
              "short_description": "Intercambio de iones entre dos compuestos (AB + CD → AD + CB); reacciones de precipitación y neutralización.",
              "example_tasks": [
                "Completa las reacciones de doble sustitución: NaCl + AgNO₃ → ?, HCl + NaOH → ?",
                "Predice si se formará un precipitado en: BaCl₂ + Na₂SO₄ → ? (BaSO₄ precipita).",
                "Escribe la ecuación de neutralización entre ácido sulfúrico e hidróxido de potasio."
              ]
            },
            {
              "key": "reacciones_combustion",
              "name": "Reacciones de Combustión",
              "short_description": "Reacción con oxígeno que libera energía en forma de calor y luz; combustión completa e incompleta.",
              "example_tasks": [
                "Escribe la ecuación de combustión completa del metano: CH₄ + O₂ → CO₂ + H₂O.",
                "Balancea la combustión completa del etanol: C₂H₅OH + O₂ → CO₂ + H₂O.",
                "Explica la diferencia entre combustión completa (produce CO₂) e incompleta (produce CO o C) y sus peligros."
              ]
            }
          ]
        },
        {
          "key": "balanceo_ecuaciones",
          "name": "Balanceo de Ecuaciones Químicas",
          "short_description": "Ley de conservación de la masa, métodos de balanceo por tanteo y algebraico.",
          "sub_topics": [
            {
              "key": "ley_conservacion_masa",
              "name": "Ley de Conservación de la Masa",
              "short_description": "La masa total de los reactivos es igual a la masa total de los productos; balanceo de átomos.",
              "example_tasks": [
                "Verifica que la ecuación H₂ + O₂ → H₂O esté balanceada contando átomos de cada elemento (no está balanceada).",
                "Explica por qué es necesario balancear ecuaciones químicas usando la ley de conservación de la masa.",
                "Demuestra experimentalmente la conservación de masa en una reacción química (vinagre + bicarbonato en sistema cerrado)."
              ]
            },
            {
              "key": "metodo_tanteo",
              "name": "Balanceo por Tanteo (Inspección)",
              "short_description": "Ajuste de coeficientes estequiométricos mediante ensayo y error sistemático.",
              "example_tasks": [
                "Balancea por tanteo: H₂ + O₂ → H₂O, N₂ + H₂ → NH₃, Fe + O₂ → Fe₂O₃.",
                "Balancea la ecuación: C₃H₈ + O₂ → CO₂ + H₂O (combustión del propano).",
                "Balancea: Al + HCl → AlCl₃ + H₂, verificando que haya igual número de átomos de cada elemento en ambos lados."
              ]
            },
            {
              "key": "balanceo_redox_simple",
              "name": "Introducción al Balanceo de Reacciones Redox",
              "short_description": "Identificación de cambios en números de oxidación; balanceo de ecuaciones de óxido-reducción simples.",
              "example_tasks": [
                "Identifica qué elemento se oxida y cuál se reduce en: Zn + CuSO₄ → ZnSO₄ + Cu.",
                "Balancea la reacción redox: Fe + O₂ → Fe₂O₃ identificando el agente oxidante y reductor.",
                "Determina los cambios en el número de oxidación del carbono en: C + O₂ → CO₂."
              ]
            }
          ]
        },
        {
          "key": "estequiometria",
          "name": "Estequiometría",
          "short_description": "Cálculos cuantitativos en reacciones químicas: relaciones mol-mol, masa-masa, volumen de gases.",
          "sub_topics": [
            {
              "key": "concepto_mol",
              "name": "El Concepto de Mol y Número de Avogadro",
              "short_description": "Mol como unidad de cantidad de sustancia; número de Avogadro (6.022 × 10²³); masa molar.",
              "example_tasks": [
                "Calcula cuántos átomos hay en 2 moles de carbono (usa el número de Avogadro).",
                "Determina la masa molar de: H₂O, CO₂, NaCl, H₂SO₄ usando la tabla periódica.",
                "Convierte 88 g de CO₂ a moles (masa molar CO₂ = 44 g/mol)."
              ]
            },
            {
              "key": "calculos_mol_mol",
              "name": "Cálculos Estequiométricos Mol-Mol",
              "short_description": "Relaciones molares entre reactivos y productos usando coeficientes de la ecuación balanceada.",
              "example_tasks": [
                "En la reacción 2H₂ + O₂ → 2H₂O, ¿cuántos moles de agua se producen a partir de 3 moles de H₂?",
                "Para la síntesis de amoníaco N₂ + 3H₂ → 2NH₃, calcula cuántos moles de H₂ se necesitan para producir 4 moles de NH₃.",
                "Si reaccionan 5 moles de oxígeno en la combustión C₃H₈ + 5O₂ → 3CO₂ + 4H₂O, ¿cuántos moles de CO₂ se forman?"
              ]
            },
            {
              "key": "calculos_masa_masa",
              "name": "Cálculos Estequiométricos Masa-Masa",
              "short_description": "Conversión de masa de reactivo a masa de producto usando relaciones molares y masas molares.",
              "example_tasks": [
                "En la reacción 2H₂ + O₂ → 2H₂O, calcula cuántos gramos de agua se producen a partir de 4 g de H₂.",
                "¿Cuántos gramos de CO₂ se producen en la combustión completa de 16 g de metano (CH₄ + 2O₂ → CO₂ + 2H₂O)?",
                "Calcula la masa de hierro necesaria para producir 100 g de Fe₂O₃ en la reacción 4Fe + 3O₂ → 2Fe₂O₃."
              ]
            },
            {
              "key": "reactivo_limitante_exceso",
              "name": "Reactivo Limitante y Reactivo en Exceso",
              "short_description": "Identificación del reactivo que se consume completamente y determina la cantidad de producto formado.",
              "example_tasks": [
                "En la reacción N₂ + 3H₂ → 2NH₃, si tienes 2 moles de N₂ y 4 moles de H₂, identifica el reactivo limitante.",
                "Se mezclan 10 g de Na con 10 g de Cl₂ para formar NaCl. Determina cuál es el reactivo limitante y cuántos gramos de NaCl se forman.",
                "Calcula la masa de producto formado cuando 50 g de Fe reaccionan con 30 g de O₂ en: 4Fe + 3O₂ → 2Fe₂O₃."
              ]
            },
            {
              "key": "rendimiento_reaccion",
              "name": "Rendimiento Teórico y Porcentaje de Rendimiento",
              "short_description": "Cálculo del rendimiento teórico, real y porcentaje de rendimiento en reacciones químicas.",
              "example_tasks": [
                "Si el rendimiento teórico de una reacción es 50 g pero solo se obtienen 40 g, calcula el porcentaje de rendimiento.",
                "En la síntesis de NH₃, se esperan 100 g teóricamente pero se obtienen 85 g. ¿Cuál es el rendimiento porcentual?",
                "Explica tres factores que pueden causar que el rendimiento real sea menor que el teórico (pérdidas, reacciones secundarias, equilibrio)."
              ]
            }
          ]
        },
        {
          "key": "evidencias_reacciones",
          "name": "Evidencias y Energía en Reacciones Químicas",
          "short_description": "Indicadores de que ocurrió una reacción química; reacciones exotérmicas y endotérmicas; velocidad de reacción.",
          "sub_topics": [
            {
              "key": "evidencias_reaccion_quimica",
              "name": "Evidencias de una Reacción Química",
              "short_description": "Cambios observables: color, temperatura, formación de gas o precipitado, emisión de luz.",
              "example_tasks": [
                "Identifica la evidencia de reacción química en: oxidación del hierro (cambio de color), bicarbonato + vinagre (gas), azúcar quemándose (luz y calor).",
                "Diseña un experimento para observar la formación de un precipitado mezclando soluciones de nitrato de plata y cloruro de sodio.",
                "Explica por qué la efervescencia de una tableta antiácida en agua es evidencia de una reacción química."
              ]
            },
            {
              "key": "reacciones_exotermicas_endotermicas",
              "name": "Reacciones Exotérmicas y Endotérmicas",
              "short_description": "Reacciones que liberan energía (exotérmicas) o absorben energía (endotérmicas); diagramas de energía.",
              "example_tasks": [
                "Clasifica como exotérmica o endotérmica: combustión de madera, fotosíntesis, respiración celular, bolsa de frío instantáneo.",
                "Dibuja un diagrama de energía para una reacción exotérmica mostrando reactivos, productos y energía liberada.",
                "Explica por qué la mano se calienta al mezclar ácido sulfúrico con agua (reacción exotérmica)."
              ]
            },
            {
              "key": "velocidad_reaccion_factores",
              "name": "Velocidad de Reacción y Factores que la Afectan",
              "short_description": "Rapidez con que ocurren las reacciones; efecto de temperatura, concentración, superficie de contacto y catalizadores.",
              "example_tasks": [
                "Diseña experimentos para investigar cómo afecta la temperatura a la velocidad de disolución de una tableta efervescente.",
                "Explica por qué la madera en astillas se quema más rápido que un tronco entero (mayor superficie de contacto).",
                "Investiga el papel de los catalizadores en: motores de automóviles (convertidor catalítico), industria química, procesos biológicos (enzimas)."
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "soluciones_concentraciones",
      "name": "Soluciones y Concentraciones",
      "short_description": "Tipos de soluciones, proceso de disolución, unidades de concentración y preparación de disoluciones.",
      "sub_topics": [
        {
          "key": "soluciones_componentes",
          "name": "Soluciones: Definición y Componentes",
          "short_description": "Concepto de solución como mezcla homogénea; soluto, solvente y tipos de soluciones según su estado físico.",
          "sub_topics": [
            {
              "key": "definicion_soluciones",
              "name": "Definición y Características de las Soluciones",
              "short_description": "Solución como mezcla homogénea; componentes visualmente indistinguibles; ejemplos cotidianos.",
              "example_tasks": [
                "Identifica el soluto y solvente en: agua salada, aire, vinagre, bronce (aleación de cobre y estaño).",
                "Clasifica las siguientes mezclas como soluciones o no: agua azucarada, agua con aceite, alcohol en agua, leche.",
                "Da cinco ejemplos de soluciones que utilices diariamente en casa (refresco, cloro diluido, alcohol, etc.)."
              ]
            },
            {
              "key": "tipos_soluciones_estado",
              "name": "Tipos de Soluciones según el Estado Físico",
              "short_description": "Soluciones sólidas (aleaciones), líquidas (acuosas) y gaseosas (aire); ejemplos de cada tipo.",
              "example_tasks": [
                "Clasifica las siguientes soluciones por su estado: agua salada (líquida), aire (gaseosa), acero (sólida).",
                "Investiga tres ejemplos de aleaciones metálicas usadas en México: acero inoxidable, bronce, latón.",
                "Explica por qué el aire es considerado una solución gaseosa (mezcla homogénea de N₂, O₂, CO₂, etc.)."
              ]
            },
            {
              "key": "proceso_disolucion",
              "name": "Proceso de Disolución",
              "short_description": "Interacción entre partículas de soluto y solvente; factores que afectan la disolución (temperatura, agitación, tamaño de partícula).",
              "example_tasks": [
                "Explica a nivel molecular por qué el agua (polar) disuelve sal (iónica) pero no aceite (no polar).",
                "Diseña un experimento para investigar cómo afecta el tamaño de partícula a la velocidad de disolución del azúcar.",
                "Describe qué sucede cuando se disuelve NaCl en agua en términos de hidratación de iones Na⁺ y Cl⁻."
              ]
            }
          ]
        },
        {
          "key": "solubilidad",
          "name": "Solubilidad y Factores que la Afectan",
          "short_description": "Concepto de solubilidad, curvas de solubilidad, soluciones saturadas, insaturadas y sobresaturadas.",
          "sub_topics": [
            {
              "key": "concepto_solubilidad",
              "name": "Concepto de Solubilidad",
              "short_description": "Cantidad máxima de soluto que se disuelve en una cantidad determinada de solvente a cierta temperatura.",
              "example_tasks": [
                "Define solubilidad y explica sus unidades comunes (g de soluto/100 g de solvente).",
                "Consulta una tabla de solubilidad y determina cuántos gramos de NaCl se disuelven en 100 g de agua a 20°C.",
                "Compara la solubilidad de diferentes sales (NaCl, KNO₃, CaSO₄) en agua a 25°C."
              ]
            },
            {
              "key": "soluciones_saturadas",
              "name": "Soluciones Saturadas, Insaturadas y Sobresaturadas",
              "short_description": "Clasificación de soluciones según la cantidad de soluto disuelto respecto a la solubilidad.",
              "example_tasks": [
                "Clasifica las siguientes soluciones: 30 g NaCl/100 g H₂O (insaturada), 36 g NaCl/100 g H₂O a 20°C (saturada).",
                "Describe cómo preparar una solución sobresaturada de acetato de sodio y qué sucede al agregar un cristal semilla.",
                "Explica qué sucede cuando enfrías una solución saturada de KNO₃ (puede precipitar el soluto)."
              ]
            },
            {
              "key": "factores_afectan_solubilidad",
              "name": "Factores que Afectan la Solubilidad",
              "short_description": "Efecto de temperatura y presión en la solubilidad de sólidos, líquidos y gases.",
              "example_tasks": [
                "Explica por qué la mayoría de las sales sólidas son más solubles en agua caliente que en agua fría (usa curvas de solubilidad).",
                "Describe por qué los gases son menos solubles en agua caliente (las bebidas gaseosas se descarbonan más rápido al calentarse).",
                "Investiga cómo afecta la presión a la solubilidad de gases (Ley de Henry) y su aplicación en bebidas carbonatadas."
              ]
            }
          ]
        },
        {
          "key": "unidades_concentracion",
          "name": "Unidades de Concentración",
          "short_description": "Expresión cuantitativa de concentración: porcentaje en masa, porcentaje en volumen, molaridad, molalidad, ppm.",
          "sub_topics": [
            {
              "key": "porcentaje_masa_volumen",
              "name": "Porcentaje en Masa y Porcentaje en Volumen",
              "short_description": "Concentración expresada como (masa soluto/masa solución) × 100 o (volumen soluto/volumen solución) × 100.",
              "example_tasks": [
                "Calcula el porcentaje en masa de una solución que contiene 20 g de NaCl en 200 g de solución.",
                "Prepara 500 g de una solución de azúcar al 15% en masa. ¿Cuántos gramos de azúcar y agua necesitas?",
                "Una solución de alcohol tiene 70% v/v. ¿Cuántos mL de alcohol puro hay en 250 mL de esta solución?"
              ]
            },
            {
              "key": "molaridad",
              "name": "Molaridad (M)",
              "short_description": "Concentración expresada como moles de soluto por litro de solución (mol/L).",
              "example_tasks": [
                "Calcula la molaridad de una solución que contiene 0.5 moles de NaCl en 2 L de solución.",
                "¿Cuántos gramos de NaOH se necesitan para preparar 500 mL de una solución 0.5 M? (MM NaOH = 40 g/mol)",
                "Determina cuántos moles de H₂SO₄ hay en 250 mL de una solución 2 M."
              ]
            },
            {
              "key": "molalidad_ppm",
              "name": "Molalidad y Partes por Millón (ppm)",
              "short_description": "Molalidad: moles de soluto/kg de solvente; ppm: (masa soluto/masa solución) × 10⁶.",
              "example_tasks": [
                "Calcula la molalidad de una solución que contiene 0.2 moles de glucosa en 500 g de agua.",
                "El límite permitido de plomo en agua potable es 0.01 ppm. ¿Cuántos mg de plomo puede haber en 1 L de agua?",
                "Explica cuándo es más conveniente usar molalidad que molaridad (cuando la temperatura varía)."
              ]
            },
            {
              "key": "conversion_unidades_concentracion",
              "name": "Conversión entre Unidades de Concentración",
              "short_description": "Transformar concentración expresada en una unidad a otra usando densidad y masa molar.",
              "example_tasks": [
                "Convierte una solución 0.5 M de NaCl a porcentaje en masa (usa densidad de la solución).",
                "Una solución de HCl tiene 36% en masa y densidad 1.18 g/mL. Calcula su molaridad.",
                "Transforma una concentración de 1 molal a molaridad para una solución acuosa (considera densidad del agua)."
              ]
            }
          ]
        },
        {
          "key": "preparacion_diluciones",
          "name": "Preparación de Soluciones y Diluciones",
          "short_description": "Procedimientos para preparar soluciones de concentración conocida; cálculos de dilución (M₁V₁ = M₂V₂).",
          "sub_topics": [
            {
              "key": "preparacion_soluciones",
              "name": "Preparación de Soluciones en el Laboratorio",
              "short_description": "Uso de balanza, matraz volumétrico y técnicas correctas para preparar soluciones de concentración exacta.",
              "example_tasks": [
                "Describe el procedimiento completo para preparar 250 mL de una solución 0.1 M de NaCl.",
                "Calcula la masa de KMnO₄ necesaria para preparar 500 mL de una solución 0.02 M (MM KMnO₄ = 158 g/mol).",
                "Explica por qué es importante aforar correctamente un matraz volumétrico al nivel del menisco."
              ]
            },
            {
              "key": "diluciones",
              "name": "Diluciones y Ecuación de Dilución",
              "short_description": "Proceso de agregar solvente a una solución concentrada; fórmula M₁V₁ = M₂V₂.",
              "example_tasks": [
                "Calcula qué volumen de una solución 2 M de HCl necesitas para preparar 500 mL de solución 0.5 M.",
                "Se diluyen 50 mL de una solución 3 M hasta un volumen final de 200 mL. ¿Cuál es la molaridad final?",
                "Describe el procedimiento correcto para diluir ácidos concentrados (siempre agregar ácido al agua, nunca al revés)."
              ]
            },
            {
              "key": "propiedades_coligativas_introduccion",
              "name": "Introducción a las Propiedades Coligativas",
              "short_description": "Propiedades que dependen del número de partículas de soluto: descenso crioscópico, aumento ebulloscópico, presión osmótica.",
              "example_tasks": [
                "Explica por qué el agua de mar se congela a menor temperatura que el agua pura (descenso del punto de congelación).",
                "Describe por qué se agrega sal a las carreteras nevadas (baja el punto de congelación del agua).",
                "Investiga por qué agregar anticongelante (etilenglicol) al radiador del auto previene que el agua se congele en invierno."
              ]
            }
          ]
        },
        {
          "key": "soluciones_vida_cotidiana",
          "name": "Soluciones en la Vida Cotidiana y la Industria",
          "short_description": "Aplicaciones prácticas de soluciones en alimentos, medicina, limpieza y procesos industriales.",
          "sub_topics": [
            {
              "key": "soluciones_alimentos",
              "name": "Soluciones en Alimentos y Bebidas",
              "short_description": "Refrescos, jugos, bebidas alcohólicas, salmueras, jarabes; importancia de la concentración.",
              "example_tasks": [
                "Investiga la concentración de azúcar en diferentes refrescos y compara con las recomendaciones de consumo diario de azúcar.",
                "Explica cómo funciona la conservación de alimentos en salmuera (alta concentración de sal).",
                "Calcula el porcentaje de alcohol en volumen de diferentes bebidas: cerveza (~5%), vino (~12%), tequila (~40%)."
              ]
            },
            {
              "key": "soluciones_medicina",
              "name": "Soluciones en Medicina y Farmacia",
              "short_description": "Sueros fisiológicos, medicamentos líquidos, desinfectantes; importancia de la concentración exacta.",
              "example_tasks": [
                "Investiga qué es el suero fisiológico (NaCl 0.9% en masa) y por qué tiene esa concentración específica.",
                "Explica la importancia de preparar correctamente la concentración de medicamentos líquidos (jarabes, gotas).",
                "Calcula la dilución necesaria para preparar 1 L de solución desinfectante de cloro al 0.5% a partir de cloro comercial al 6%."
              ]
            },
            {
              "key": "soluciones_industria",
              "name": "Soluciones en Procesos Industriales",
              "short_description": "Galvanoplastia, síntesis química, tratamiento de aguas, extracción de metales.",
              "example_tasks": [
                "Investiga cómo se utiliza la galvanoplastia (electrólisis de soluciones) para recubrir objetos metálicos con cromo o níquel.",
                "Describe el proceso de flotación en la minería mexicana para separar minerales usando soluciones.",
                "Explica cómo funciona el tratamiento de aguas residuales usando procesos de coagulación con soluciones químicas."
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "termoquimica_energia",
      "name": "Termoquímica y Energía",
      "short_description": "Estudio de los cambios de energía en reacciones químicas, entalpía, leyes de la termodinámica y aplicaciones energéticas.",
      "sub_topics": [
        {
          "key": "energia_reacciones_quimicas",
          "name": "Energía en las Reacciones Químicas",
          "short_description": "Tipos de energía, conservación de energía, energía de activación y diagramas de energía.",
          "sub_topics": [
            {
              "key": "tipos_energia",
              "name": "Tipos de Energía y Transformaciones",
              "short_description": "Energía cinética, potencial, térmica, química, eléctrica; conversión entre diferentes formas.",
              "example_tasks": [
                "Identifica las transformaciones de energía en: pila (química → eléctrica), fotosíntesis (lumínica → química), motor (química → cinética).",
                "Explica qué tipo de energía se almacena en los enlaces químicos de la gasolina.",
                "Da tres ejemplos de conversión de energía química a térmica que observes en tu vida diaria."
              ]
            },
            {
              "key": "energia_activacion",
              "name": "Energía de Activación",
              "short_description": "Energía mínima necesaria para iniciar una reacción química; papel de los catalizadores.",
              "example_tasks": [
                "Explica por qué el papel no se quema espontáneamente aunque la combustión sea exotérmica (requiere energía de activación).",
                "Dibuja un diagrama de energía mostrando la energía de activación para una reacción con y sin catalizador.",
                "Investiga cómo las enzimas en el cuerpo humano reducen la energía de activación de reacciones metabólicas."
              ]
            },
            {
              "key": "diagramas_energia",
              "name": "Diagramas de Energía de Reacciones",
              "short_description": "Representación gráfica de cambios energéticos; identificación de reactivos, productos, energía de activación y variación de entalpía.",
              "example_tasks": [
                "Interpreta un diagrama de energía e identifica: energía de activación, ΔH, si es exotérmica o endotérmica.",
                "Dibuja el diagrama de energía para la combustión del metano (reacción exotérmica).",
                "Compara diagramas de energía de reacciones exotérmicas y endotérmicas señalando sus diferencias."
              ]
            }
          ]
        },
        {
          "key": "entalpia_calor",
          "name": "Entalpía y Calor de Reacción",
          "short_description": "Concepto de entalpía (H), cambio de entalpía (ΔH), entalpía de formación, combustión y neutralización.",
          "sub_topics": [
            {
              "key": "concepto_entalpia",
              "name": "Concepto de Entalpía (H) y Cambio de Entalpía (ΔH)",
              "short_description": "Entalpía como contenido energético; ΔH positivo (endotérmica) y ΔH negativo (exotérmica).",
              "example_tasks": [
                "Explica el significado de ΔH = -890 kJ en la combustión del metano: CH₄ + 2O₂ → CO₂ + 2H₂O.",
                "Clasifica las siguientes reacciones según el signo de ΔH: ΔH = +286 kJ (endotérmica), ΔH = -393 kJ (exotérmica).",
                "Calcula cuánta energía se libera al quemar 2 moles de metano si ΔH = -890 kJ/mol."
              ]
            },
            {
              "key": "entalpia_formacion",
              "name": "Entalpía de Formación",
              "short_description": "Energía liberada o absorbida al formar un mol de compuesto a partir de sus elementos en estado estándar.",
              "example_tasks": [
                "Define entalpía estándar de formación (ΔH°f) y explica por qué es cero para elementos en su estado estándar.",
                "Calcula el ΔH de reacción usando entalpías de formación: CH₄ + 2O₂ → CO₂ + 2H₂O.",
                "Usa una tabla de entalpías de formación para calcular el calor de combustión del etanol."
              ]
            },
            {
              "key": "ley_hess",
              "name": "Ley de Hess",
              "short_description": "El cambio de entalpía de una reacción es independiente del camino seguido; suma de ecuaciones termoquímicas.",
              "example_tasks": [
                "Aplica la Ley de Hess para calcular ΔH de una reacción combinando ecuaciones termoquímicas dadas.",
                "Explica por qué la Ley de Hess es útil para calcular ΔH de reacciones que no pueden medirse directamente.",
                "Calcula el ΔH de formación del metano usando la Ley de Hess y las entalpías de combustión del C, H₂ y CH₄."
              ]
            },
            {
              "key": "calorimetria",
              "name": "Calorimetría y Medición del Calor",
              "short_description": "Calorímetro, capacidad calorífica, calor específico; ecuación q = mcΔT.",
              "example_tasks": [
                "Calcula el calor absorbido cuando 100 g de agua se calientan de 20°C a 80°C (c = 4.18 J/g°C).",
                "Diseña un calorímetro simple usando vasos de unicel para medir el calor de neutralización de HCl y NaOH.",
                "Determina el calor específico de un metal si 50 g del metal a 100°C se enfrían a 25°C liberando 1500 J."
              ]
            }
          ]
        },
        {
          "key": "leyes_termodinamica",
          "name": "Leyes de la Termodinámica",
          "short_description": "Primera y segunda ley de la termodinámica; concepto de entropía y espontaneidad de reacciones.",
          "sub_topics": [
            {
              "key": "primera_ley_termodinamica",
              "name": "Primera Ley de la Termodinámica",
              "short_description": "Conservación de la energía: la energía no se crea ni se destruye, solo se transforma.",
              "example_tasks": [
                "Explica la primera ley de la termodinámica con el ejemplo de un motor de combustión interna.",
                "Calcula el cambio de energía interna (ΔU) de un sistema si absorbe 500 J de calor y realiza 200 J de trabajo.",
                "Describe cómo se aplica la conservación de energía en una reacción exotérmica."
              ]
            },
            {
              "key": "segunda_ley_entr opia",
              "name": "Segunda Ley de la Termodinámica y Entropía",
              "short_description": "La entropía del universo tiende a aumentar; concepto de desorden molecular.",
              "example_tasks": [
                "Explica qué es la entropía usando ejemplos: hielo derritiéndose, gas expandiéndose, mezcla de sustancias.",
                "Predice si la entropía aumenta o disminuye en: 2H₂(g) + O₂(g) → 2H₂O(l), NaCl(s) → Na⁺(ac) + Cl⁻(ac).",
                "Describe por qué los procesos espontáneos tienden a aumentar la entropía total del universo."
              ]
            },
            {
              "key": "espontaneidad_energia_libre",
              "name": "Espontaneidad y Energía Libre de Gibbs",
              "short_description": "Criterio de espontaneidad; relación entre ΔG, ΔH y ΔS; ecuación ΔG = ΔH - TΔS.",
              "example_tasks": [
                "Determina si una reacción es espontánea si ΔG < 0, en equilibrio si ΔG = 0, o no espontánea si ΔG > 0.",
                "Explica por qué el hielo se derrite espontáneamente a 25°C pero no a -10°C (cambio en ΔG con temperatura).",
                "Predice el signo de ΔG para: ΔH = -100 kJ, ΔS = +50 J/K a 298 K usando ΔG = ΔH - TΔS."
              ]
            }
          ]
        },
        {
          "key": "combustibles_energia",
          "name": "Combustibles y Fuentes de Energía",
          "short_description": "Combustibles fósiles, energías renovables, impacto ambiental y eficiencia energética.",
          "sub_topics": [
            {
              "key": "combustibles_fosiles",
              "name": "Combustibles Fósiles: Petróleo, Gas y Carbón",
              "short_description": "Origen, composición, extracción y uso de combustibles fósiles; industria petrolera en México.",
              "example_tasks": [
                "Investiga la importancia del petróleo en la economía mexicana y el papel de PEMEX.",
                "Compara el poder calorífico (energía por gramo) de gasolina, gas natural y carbón.",
                "Calcula cuánta energía se libera en la combustión completa de 1 kg de metano (ΔH = -890 kJ/mol)."
              ]
            },
            {
              "key": "energias_renovables",
              "name": "Fuentes de Energía Renovable",
              "short_description": "Solar, eólica, hidroeléctrica, geotérmica, biomasa; ventajas y limitaciones.",
              "example_tasks": [
                "Investiga tres proyectos de energía renovable en México: parques eólicos en Oaxaca, plantas solares, geotermia.",
                "Compara ventajas y desventajas de energías renovables vs combustibles fósiles (sostenibilidad, costo, disponibilidad).",
                "Calcula cuánta energía solar llega a 1 m² en México al día y su potencial para generar electricidad."
              ]
            },
            {
              "key": "impacto_ambiental_energia",
              "name": "Impacto Ambiental del Uso de Energía",
              "short_description": "Emisiones de CO₂, calentamiento global, lluvia ácida, contaminación; desarrollo sustentable.",
              "example_tasks": [
                "Calcula cuánto CO₂ se produce en la combustión de 1 kg de gasolina (aproximadamente C₈H₁₈).",
                "Investiga cómo las emisiones de gases de efecto invernadero contribuyen al cambio climático.",
                "Propón cinco acciones para reducir tu huella de carbono en relación al consumo de energía."
              ]
            },
            {
              "key": "eficiencia_energetica",
              "name": "Eficiencia Energética y Conservación",
              "short_description": "Concepto de eficiencia, pérdidas de energía, tecnologías eficientes, ahorro energético.",
              "example_tasks": [
                "Calcula la eficiencia de un motor que convierte 40% de la energía química del combustible en trabajo mecánico.",
                "Compara el consumo energético de focos incandescentes vs LED para producir la misma cantidad de luz.",
                "Investiga el programa de sustitución de electrodomésticos en México para mejorar la eficiencia energética."
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "velocidad_reaccion_equilibrio",
      "name": "Velocidad de Reacción y Equilibrio Químico",
      "short_description": "Cinética química, factores que afectan la velocidad de reacción, equilibrio químico y principio de Le Chatelier.",
      "sub_topics": [
        {
          "key": "cinetica_quimica",
          "name": "Cinética Química y Velocidad de Reacción",
          "short_description": "Definición de velocidad de reacción, teoría de colisiones, energía de activación y mecanismos de reacción.",
          "sub_topics": [
            {
              "key": "velocidad_reaccion_definicion",
              "name": "Definición y Medición de Velocidad de Reacción",
              "short_description": "Velocidad como cambio de concentración de reactivos o productos por unidad de tiempo.",
              "example_tasks": [
                "Define velocidad de reacción y explica cómo se mide experimentalmente (cambio en color, volumen de gas, masa).",
                "Interpreta una gráfica de concentración vs tiempo para una reacción y determina en qué periodo la reacción es más rápida.",
                "Diseña un experimento para medir la velocidad de reacción entre magnesio y ácido clorhídrico midiendo el volumen de H₂ producido."
              ]
            },
            {
              "key": "teoria_colisiones",
              "name": "Teoría de Colisiones",
              "short_description": "Las partículas deben colisionar con energía suficiente y orientación adecuada para reaccionar.",
              "example_tasks": [
                "Explica la teoría de colisiones y por qué no todas las colisiones entre moléculas resultan en reacción.",
                "Describe los dos requisitos para una colisión efectiva: energía mínima (energía de activación) y orientación correcta.",
                "Relaciona la teoría de colisiones con el efecto de la temperatura en la velocidad de reacción."
              ]
            },
            {
              "key": "complejo_activado",
              "name": "Complejo Activado y Estado de Transición",
              "short_description": "Estructura temporal de alta energía formada durante la colisión de reactivos.",
              "example_tasks": [
                "Dibuja un diagrama de energía mostrando reactivos, complejo activado y productos para una reacción exotérmica.",
                "Explica qué es el complejo activado y por qué es inestable.",
                "Identifica el complejo activado en la reacción: H₂ + I₂ → 2HI (se forma temporalmente H-H-I-I)."
              ]
            }
          ]
        },
        {
          "key": "factores_velocidad_reaccion",
          "name": "Factores que Afectan la Velocidad de Reacción",
          "short_description": "Efecto de concentración, temperatura, superficie de contacto, catalizadores e inhibidores.",
          "sub_topics": [
            {
              "key": "efecto_concentracion",
              "name": "Efecto de la Concentración",
              "short_description": "Mayor concentración aumenta la frecuencia de colisiones y la velocidad de reacción.",
              "example_tasks": [
                "Diseña un experimento para investigar cómo afecta la concentración de HCl en la velocidad de reacción con Zn.",
                "Explica por qué el oxígeno puro hace que la combustión sea más rápida que el aire (mayor concentración de O₂).",
                "Predice qué sucede con la velocidad de reacción si duplicas la concentración de uno de los reactivos."
              ]
            },
            {
              "key": "efecto_temperatura",
              "name": "Efecto de la Temperatura",
              "short_description": "Mayor temperatura aumenta la energía cinética de las partículas y la velocidad de reacción.",
              "example_tasks": [
                "Explica por qué los alimentos se conservan mejor en el refrigerador (menor temperatura, reacciones más lentas).",
                "Diseña un experimento para comparar la velocidad de disolución de una tableta efervescente en agua fría, tibia y caliente.",
                "Describe la regla general: por cada 10°C de aumento, la velocidad de reacción se duplica aproximadamente."
              ]
            },
            {
              "key": "efecto_superficie_contacto",
              "name": "Efecto del Área de Superficie de Contacto",
              "short_description": "Mayor superficie expuesta aumenta el número de colisiones posibles.",
              "example_tasks": [
                "Explica por qué el carbón en polvo se quema más rápido que un trozo grande de carbón.",
                "Compara la velocidad de reacción entre una tableta efervescente entera y una triturada en polvo.",
                "Diseña un experimento para demostrar el efecto de la superficie usando diferentes tamaños de trozos de magnesio con HCl."
              ]
            },
            {
              "key": "catalizadores_inhibidores",
              "name": "Catalizadores e Inhibidores",
              "short_description": "Catalizadores aceleran reacciones sin consumirse; inhibidores las retardan.",
              "example_tasks": [
                "Explica cómo funciona un catalizador (reduce la energía de activación sin participar en la reacción neta).",
                "Investiga tres ejemplos de catalizadores: enzimas en digestión, convertidor catalítico en autos, catalizador en síntesis de amoníaco.",
                "Describe el papel de los inhibidores en conservadores de alimentos (retardan reacciones de descomposición)."
              ]
            }
          ]
        },
        {
          "key": "equilibrio_quimico",
          "name": "Equilibrio Químico",
          "short_description": "Reacciones reversibles, estado de equilibrio, constante de equilibrio y características del equilibrio dinámico.",
          "sub_topics": [
            {
              "key": "reacciones_reversibles",
              "name": "Reacciones Reversibles y Equilibrio Dinámico",
              "short_description": "Reacciones que pueden proceder en ambas direcciones; equilibrio cuando velocidades directa e inversa son iguales.",
              "example_tasks": [
                "Explica la diferencia entre una reacción irreversible (combustión) y reversible (N₂ + 3H₂ ⇌ 2NH₃).",
                "Describe qué significa equilibrio dinámico (las reacciones continúan pero sin cambio neto en concentraciones).",
                "Da tres ejemplos de sistemas en equilibrio: agua líquida ⇌ vapor, ácido débil ⇌ iones, solución saturada ⇌ precipitado."
              ]
            },
            {
              "key": "constante_equilibrio",
              "name": "Constante de Equilibrio (Keq)",
              "short_description": "Relación entre concentraciones de productos y reactivos en equilibrio; expresión de Keq.",
              "example_tasks": [
                "Escribe la expresión de Keq para: N₂(g) + 3H₂(g) ⇌ 2NH₃(g).",
                "Interpreta el significado de Keq: si Keq >> 1 (favorece productos), si Keq << 1 (favorece reactivos).",
                "Calcula Keq si en equilibrio: [N₂] = 0.5 M, [H₂] = 0.8 M, [NH₃] = 0.3 M para N₂ + 3H₂ ⇌ 2NH₃."
              ]
            },
            {
              "key": "cociente_reaccion",
              "name": "Cociente de Reacción (Q) y Predicción de Equilibrio",
              "short_description": "Comparación de Q con Keq para predecir la dirección de la reacción.",
              "example_tasks": [
                "Calcula Q para una mezcla y compara con Keq para determinar si la reacción procederá hacia productos o reactivos.",
                "Explica qué sucede cuando: Q < Keq (reacción directa), Q = Keq (equilibrio), Q > Keq (reacción inversa).",
                "Predice la dirección de la reacción si Q = 0.5 y Keq = 2.0."
              ]
            }
          ]
        },
        {
          "key": "principio_le_chatelier",
          "name": "Principio de Le Chatelier",
          "short_description": "Respuesta del sistema en equilibrio ante cambios de concentración, presión, temperatura y efecto de catalizadores.",
          "sub_topics": [
            {
              "key": "efecto_concentracion_equilibrio",
              "name": "Efecto de Cambios en Concentración",
              "short_description": "Agregar o remover reactivos/productos desplaza el equilibrio para contrarrestar el cambio.",
              "example_tasks": [
                "Para N₂ + 3H₂ ⇌ 2NH₃, predice hacia dónde se desplaza el equilibrio si: agregas N₂, eliminas NH₃, agregas H₂.",
                "Explica cómo el hígado elimina toxinas usando el principio de Le Chatelier (equilibrio de reacciones metabólicas).",
                "Diseña un experimento para observar cambios de color en un equilibrio al agregar reactivos (por ejemplo, Fe³⁺ + SCN⁻ ⇌ FeSCN²⁺)."
              ]
            },
            {
              "key": "efecto_presion_volumen",
              "name": "Efecto de Cambios en Presión y Volumen",
              "short_description": "Cambios de presión afectan equilibrios con gases; el sistema se desplaza hacia el lado con menos moles gaseosos.",
              "example_tasks": [
                "Para N₂(g) + 3H₂(g) ⇌ 2NH₃(g), predice el efecto de aumentar la presión (se favorece producción de NH₃, menos moles).",
                "Explica por qué cambiar la presión no afecta a: H₂(g) + I₂(g) ⇌ 2HI(g) (igual número de moles en ambos lados).",
                "Predice hacia dónde se desplaza el equilibrio 2SO₂(g) + O₂(g) ⇌ 2SO₃(g) si disminuye el volumen del recipiente."
              ]
            },
            {
              "key": "efecto_temperatura_equilibrio",
              "name": "Efecto de Cambios en Temperatura",
              "short_description": "Aumento de temperatura favorece la reacción endotérmica; disminución favorece la exotérmica.",
              "example_tasks": [
                "Para N₂ + 3H₂ ⇌ 2NH₃ (ΔH = -92 kJ), predice el efecto de aumentar la temperatura (favorece reactivos, reacción endotérmica).",
                "Explica por qué los refrescos liberan más CO₂ cuando están calientes: CO₂(ac) ⇌ CO₂(g) (reacción endotérmica).",
                "Predice cómo afecta enfriar el sistema 2NO₂(g) ⇌ N₂O₄(g) + calor (se favorece N₂O₄)."
              ]
            },
            {
              "key": "catalizadores_equilibrio",
              "name": "Efecto de Catalizadores en el Equilibrio",
              "short_description": "Los catalizadores aceleran el alcance del equilibrio pero no cambian la posición del equilibrio ni Keq.",
              "example_tasks": [
                "Explica por qué agregar un catalizador no cambia las concentraciones en el equilibrio (acelera ambas reacciones por igual).",
                "Describe la importancia industrial de catalizadores en el proceso Haber para producir amoníaco más rápidamente.",
                "Compara el tiempo para alcanzar equilibrio con y sin catalizador en un diagrama de concentración vs tiempo."
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "acidos_bases",
      "name": "Ácidos y Bases",
      "short_description": "Teorías ácido-base, propiedades, pH, indicadores, reacciones de neutralización y titulaciones.",
      "sub_topics": [
        {
          "key": "teorias_acido_base",
          "name": "Teorías Ácido-Base",
          "short_description": "Teorías de Arrhenius, Brønsted-Lowry y Lewis; definiciones y ejemplos de ácidos y bases.",
          "sub_topics": [
            {
              "key": "teoria_arrhenius",
              "name": "Teoría de Arrhenius",
              "short_description": "Ácidos liberan H⁺ en agua; bases liberan OH⁻ en agua; limitada a soluciones acuosas.",
              "example_tasks": [
                "Clasifica como ácido o base según Arrhenius: HCl, NaOH, H₂SO₄, Ca(OH)₂.",
                "Escribe las ecuaciones de disociación en agua: HCl → H⁺ + Cl⁻, NaOH → Na⁺ + OH⁻.",
                "Explica la limitación de la teoría de Arrhenius (solo funciona en agua)."
              ]
            },
            {
              "key": "teoria_bronsted_lowry",
              "name": "Teoría de Brønsted-Lowry",
              "short_description": "Ácidos son donadores de protones (H⁺); bases son aceptoras de protones; pares conjugados.",
              "example_tasks": [
                "Identifica el ácido y la base en: HCl + H₂O → H₃O⁺ + Cl⁻ (HCl es ácido, H₂O es base).",
                "Identifica los pares conjugados ácido-base en: NH₃ + H₂O ⇌ NH₄⁺ + OH⁻.",
                "Explica por qué el agua puede actuar como ácido o base (sustancia anfótera)."
              ]
            },
            {
              "key": "teoria_lewis",
              "name": "Teoría de Lewis",
              "short_description": "Ácidos son aceptores de pares de electrones; bases son donadores de pares de electrones.",
              "example_tasks": [
                "Identifica el ácido y base de Lewis en: BF₃ + NH₃ → BF₃NH₃.",
                "Explica por qué BF₃ es un ácido de Lewis aunque no tiene hidrógeno (acepta par de electrones).",
                "Describe ventajas de la teoría de Lewis (más general, incluye reacciones sin protones)."
              ]
            }
          ]
        },
        {
          "key": "propiedades_acidos_bases",
          "name": "Propiedades de Ácidos y Bases",
          "short_description": "Características físicas y químicas, sabor, tacto, reactividad con metales e indicadores.",
          "sub_topics": [
            {
              "key": "propiedades_acidos",
              "name": "Propiedades Características de los Ácidos",
              "short_description": "Sabor agrio, conducen electricidad, reaccionan con metales liberando H₂, cambian color de indicadores.",
              "example_tasks": [
                "Enumera cinco propiedades de los ácidos: sabor agrio, conducen electricidad, pH < 7, etc.",
                "Explica por qué los ácidos reaccionan con metales activos: Zn + 2HCl → ZnCl₂ + H₂.",
                "Investiga tres ácidos comunes en casa: vinagre (ácido acético), limón (ácido cítrico), estómago (ácido clorhídrico)."
              ]
            },
            {
              "key": "propiedades_bases",
              "name": "Propiedades Características de las Bases",
              "short_description": "Sabor amargo, tacto resbaladizo, conducen electricidad, cambian color de indicadores.",
              "example_tasks": [
                "Enumera cinco propiedades de las bases: sabor amargo, tacto jabonoso, pH > 7, etc.",
                "Explica por qué las bases se sienten resbaladizas (saponifican grasas de la piel).",
                "Investiga tres bases comunes: hidróxido de sodio (soda cáustica), amoníaco (limpiador), antiácidos (hidróxido de magnesio)."
              ]
            },
            {
              "key": "acidos_bases_fuertes_debiles",
              "name": "Ácidos y Bases Fuertes vs Débiles",
              "short_description": "Grado de ionización en agua; ácidos/bases fuertes se ionizan completamente, débiles parcialmente.",
              "example_tasks": [
                "Clasifica como fuerte o débil: HCl (fuerte), H₂SO₄ (fuerte), CH₃COOH (débil), NaOH (fuerte), NH₃ (débil).",
                "Explica por qué HCl es un ácido fuerte (se disocia 100% en agua) y CH₃COOH es débil (se disocia parcialmente).",
                "Compara la conductividad eléctrica de soluciones 0.1 M de HCl y CH₃COOH (HCl conduce mejor)."
              ]
            }
          ]
        },
        {
          "key": "ph_escala",
          "name": "Escala de pH y pOH",
          "short_description": "Definición de pH, cálculo de pH y pOH, relación entre [H⁺], [OH⁻] y constante del agua.",
          "sub_topics": [
            {
              "key": "definicion_ph",
              "name": "Definición y Cálculo de pH",
              "short_description": "pH = -log[H⁺]; escala de 0 a 14; pH < 7 ácido, pH = 7 neutro, pH > 7 básico.",
              "example_tasks": [
                "Calcula el pH de una solución con [H⁺] = 1 × 10⁻³ M (pH = 3).",
                "Determina si las siguientes soluciones son ácidas, neutras o básicas: pH = 4, pH = 7, pH = 11.",
                "Calcula [H⁺] si pH = 5 (usa [H⁺] = 10⁻ᵖᴴ)."
              ]
            },
            {
              "key": "ph_poh_relacion",
              "name": "Relación entre pH y pOH",
              "short_description": "pH + pOH = 14; [H⁺] × [OH⁻] = 1 × 10⁻¹⁴ (Kw); cálculos combinados.",
              "example_tasks": [
                "Calcula pOH si pH = 9 (pOH = 14 - 9 = 5).",
                "Determina [OH⁻] en una solución con pH = 3 (usa Kw = [H⁺][OH⁻]).",
                "Calcula pH de una solución con [OH⁻] = 1 × 10⁻⁴ M."
              ]
            },
            {
              "key": "medicion_ph",
              "name": "Medición del pH: Indicadores y pH-metro",
              "short_description": "Indicadores ácido-base (fenolftaleína, tornasol, naranja de metilo); uso de pH-metro digital.",
              "example_tasks": [
                "Describe el cambio de color de tres indicadores: tornasol (rojo/azul), fenolftaleína (incoloro/rosa), naranja de metilo.",
                "Diseña un experimento para determinar el pH de sustancias caseras usando indicadores naturales (col morada).",
                "Compara ventajas y desventajas de usar indicadores vs pH-metro (precisión, costo, facilidad)."
              ]
            }
          ]
        },
        {
          "key": "neutralizacion_titulacion",
          "name": "Reacciones de Neutralización y Titulaciones",
          "short_description": "Reacción entre ácidos y bases para formar sal y agua; titulación ácido-base y cálculos estequiométricos.",
          "sub_topics": [
            {
              "key": "reacciones_neutralizacion",
              "name": "Reacciones de Neutralización",
              "short_description": "Ácido + Base → Sal + Agua; ecuaciones de neutralización y aplicaciones.",
              "example_tasks": [
                "Escribe la ecuación de neutralización: HCl + NaOH → NaCl + H₂O.",
                "Completa y balancea: H₂SO₄ + Ca(OH)₂ → ?, HNO₃ + KOH → ?",
                "Explica cómo funcionan los antiácidos (neutralizan el exceso de HCl en el estómago)."
              ]
            },
            {
              "key": "sales_hidrolisis",
              "name": "Sales y Hidrólisis",
              "short_description": "Formación de sales; sales neutras, ácidas y básicas según sus iones; concepto de hidrólisis.",
              "example_tasks": [
                "Predice si las siguientes sales forman soluciones ácidas, básicas o neutras: NaCl, NH₄Cl, Na₂CO₃.",
                "Explica por qué NaCl forma solución neutra (ni Na⁺ ni Cl⁻ se hidrolizan).",
                "Describe la hidrólisis de CH₃COO⁻ en agua: CH₃COO⁻ + H₂O ⇌ CH₃COOH + OH⁻ (solución básica)."
              ]
            },
            {
              "key": "titulacion_acido_base",
              "name": "Titulación Ácido-Base",
              "short_description": "Técnica para determinar concentración desconocida; punto de equivalencia, uso de indicadores.",
              "example_tasks": [
                "Describe el procedimiento de una titulación: bureta, matraz Erlenmeyer, indicador, punto de equivalencia.",
                "Calcula la concentración de HCl si 25 mL se neutralizan con 20 mL de NaOH 0.5 M.",
                "Selecciona el indicador apropiado para una titulación de ácido fuerte con base fuerte (fenolftaleína, vira cerca de pH 7-9)."
              ]
            },
            {
              "key": "soluciones_amortiguadoras",
              "name": "Soluciones Amortiguadoras (Buffer)",
              "short_description": "Soluciones que resisten cambios de pH; sistemas ácido débil-sal o base débil-sal; importancia biológica.",
              "example_tasks": [
                "Explica cómo funciona un buffer de ácido acético/acetato de sodio para mantener pH constante.",
                "Describe la importancia de los sistemas buffer en sangre humana (mantiene pH ~7.4).",
                "Calcula el pH de un buffer usando la ecuación de Henderson-Hasselbalch: pH = pKa + log([A⁻]/[HA])."
              ]
            }
          ]
        },
        {
          "key": "acidos_bases_vida_cotidiana",
          "name": "Ácidos y Bases en la Vida Cotidiana",
          "short_description": "Aplicaciones en alimentos, higiene, salud, industria y medio ambiente.",
          "sub_topics": [
            {
              "key": "acidos_bases_alimentos",
              "name": "Ácidos y Bases en Alimentos",
              "short_description": "Ácidos orgánicos en frutas, bebidas; bases en alimentos procesados; conservadores.",
              "example_tasks": [
                "Identifica ácidos en alimentos: cítrico (limón), acético (vinagre), málico (manzana), láctico (yogur).",
                "Investiga el uso de bicarbonato de sodio (base) en la cocina: leudante, neutralizador de acidez.",
                "Mide el pH de diferentes bebidas (refresco, jugo, leche) y clasifícalas según acidez."
              ]
            },
            {
              "key": "acidos_bases_higiene_salud",
              "name": "Ácidos y Bases en Higiene y Salud",
              "short_description": "Jabones, champús, antiácidos, desinfectantes; importancia del pH en piel.",
              "example_tasks": [
                "Explica cómo funcionan los jabones (bases que saponifican grasas) y por qué pH neutro es mejor para la piel.",
                "Investiga cómo los antiácidos neutralizan la acidez estomacal (contienen Al(OH)₃, Mg(OH)₂, CaCO₃).",
                "Compara el pH de diferentes productos de higiene: jabón, champú, cremas y relaciona con su función."
              ]
            },
            {
              "key": "acidos_bases_industria",
              "name": "Ácidos y Bases en la Industria",
              "short_description": "Producción de fertilizantes, plásticos, papel, metalurgia; ácido sulfúrico y bases industriales.",
              "example_tasks": [
                "Investiga la importancia del ácido sulfúrico en la industria (fertilizantes, baterías, refinación de petróleo).",
                "Describe el uso de bases en la fabricación de papel (NaOH digiere lignina de la madera).",
                "Explica el proceso de galvanoplastia que usa soluciones ácidas o básicas para recubrimientos metálicos."
              ]
            },
            {
              "key": "lluvia_acida",
              "name": "Lluvia Ácida y Problemas Ambientales",
              "short_description": "Formación de lluvia ácida por óxidos de azufre y nitrógeno; efectos en ecosistemas y materiales.",
              "example_tasks": [
                "Explica cómo se forma la lluvia ácida: SO₂ + H₂O → H₂SO₃, NO₂ + H₂O → HNO₃.",
                "Describe los efectos de la lluvia ácida en lagos, bosques, monumentos y edificios.",
                "Propón tres soluciones para reducir la lluvia ácida (reducir emisiones de SO₂ y NOₓ, uso de filtros, energías limpias)."
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "quimica_carbono_organica",
      "name": "Química del Carbono (Orgánica Básica)",
      "short_description": "Características del carbono, hidrocarburos, grupos funcionales y compuestos orgánicos en la vida cotidiana.",
      "sub_topics": [
        {
          "key": "carbono_caracteristicas",
          "name": "El Carbono y sus Características Únicas",
          "short_description": "Tetravalencia del carbono, capacidad de formar cadenas, enlaces simples, dobles y triples.",
          "sub_topics": [
            {
              "key": "tetravalencia_carbono",
              "name": "Tetravalencia del Carbono",
              "short_description": "Carbono forma cuatro enlaces covalentes; geometría tetraédrica en saturados.",
              "example_tasks": [
                "Explica por qué el carbono puede formar cuatro enlaces (tiene 4 electrones de valencia).",
                "Dibuja la estructura del metano (CH₄) mostrando los cuatro enlaces C-H en geometría tetraédrica.",
                "Compara el carbono con otros elementos del grupo 14 (Si, Ge) en cuanto a capacidad de formar cadenas."
              ]
            },
            {
              "key": "cadenas_carbonadas",
              "name": "Formación de Cadenas y Estructuras Carbonadas",
              "short_description": "Cadenas lineales, ramificadas, cíclicas; enlaces carbono-carbono simples, dobles y triples.",
              "example_tasks": [
                "Dibuja ejemplos de cadenas carbonadas: lineal (butano), ramificada (isobutano), cíclica (ciclohexano).",
                "Explica por qué el carbono puede formar millones de compuestos diferentes (catenación).",
                "Identifica enlaces simples, dobles y triples en: etano (C-C), eteno (C=C), etino (C≡C)."
              ]
            },
            {
              "key": "isomeria_basica",
              "name": "Introducción a la Isomería",
              "short_description": "Isómeros estructurales: misma fórmula molecular, diferente estructura; ejemplos simples.",
              "example_tasks": [
                "Dibuja los dos isómeros del butano (C₄H₁₀): n-butano y isobutano.",
                "Explica qué son los isómeros y por qué tienen propiedades diferentes.",
                "Determina cuántos isómeros tiene el pentano (C₅H₁₂): tres isómeros."
              ]
            }
          ]
        },
        {
          "key": "hidrocarburos",
          "name": "Hidrocarburos: Alcanos, Alquenos y Alquinos",
          "short_description": "Clasificación, nomenclatura, propiedades y reacciones de hidrocarburos saturados e insaturados.",
          "sub_topics": [
            {
              "key": "alcanos_propiedades",
              "name": "Alcanos: Propiedades y Nomenclatura",
              "short_description": "Hidrocarburos saturados (CₙH₂ₙ₊₂); nomenclatura IUPAC; propiedades físicas.",
              "example_tasks": [
                "Nombra los siguientes alcanos: CH₄, C₂H₆, C₃H₈, C₄H₁₀, C₅H₁₂.",
                "Escribe la fórmula molecular y estructural de: heptano, nonano, decano.",
                "Describe la tendencia de puntos de ebullición en alcanos (aumenta con el tamaño de la cadena)."
              ]
            },
            {
              "key": "alquenos_propiedades",
              "name": "Alquenos: Propiedades y Nomenclatura",
              "short_description": "Hidrocarburos con doble enlace C=C (CₙH₂ₙ); terminación -eno; reacciones de adición.",
              "example_tasks": [
                "Nombra: C₂H₄ (eteno), C₃H₆ (propeno), C₄H₈ (buteno).",
                "Escribe la ecuación de adición de H₂ al eteno: C₂H₄ + H₂ → C₂H₆.",
                "Explica por qué los alquenos son más reactivos que los alcanos (doble enlace puede romperse)."
              ]
            },
            {
              "key": "alquinos_propiedades",
              "name": "Alquinos: Propiedades y Nomenclatura",
              "short_description": "Hidrocarburos con triple enlace C≡C (CₙH₂ₙ₋₂); terminación -ino; alta reactividad.",
              "example_tasks": [
                "Nombra: C₂H₂ (etino/acetileno), C₃H₄ (propino).",
                "Investiga el uso del acetileno en soldadura (produce llama de alta temperatura al quemarse).",
                "Compara la reactividad de alcanos, alquenos y alquinos (aumenta con la insaturación)."
              ]
            },
            {
              "key": "hidrocarburos_aromaticos",
              "name": "Introducción a Hidrocarburos Aromáticos",
              "short_description": "Benceno y derivados; estructura de resonancia; estabilidad del anillo aromático.",
              "example_tasks": [
                "Dibuja la estructura del benceno (C₆H₆) mostrando el anillo hexagonal con enlaces deslocalizados.",
                "Nombra algunos derivados del benceno: tolueno, xileno, fenol.",
                "Investiga usos del benceno y sus derivados (disolventes, plásticos, explosivos, medicamentos)."
              ]
            }
          ]
        },
        {
          "key": "grupos_funcionales",
          "name": "Grupos Funcionales en Compuestos Orgánicos",
          "short_description": "Alcoholes, aldehídos, cetonas, ácidos carboxílicos, ésteres, aminas; nomenclatura y propiedades básicas.",
          "sub_topics": [
            {
              "key": "alcoholes",
              "name": "Alcoholes (R-OH)",
              "short_description": "Grupo hidroxilo (-OH) unido a carbono; nomenclatura terminación -ol; propiedades.",
              "example_tasks": [
                "Nombra: CH₃OH (metanol), C₂H₅OH (etanol), C₃H₇OH (propanol).",
                "Describe tres usos del etanol: bebidas alcohólicas, desinfectante, combustible.",
                "Explica por qué los alcoholes tienen puntos de ebullición más altos que alcanos de masa similar (puentes de hidrógeno)."
              ]
            },
            {
              "key": "aldehydos_cetonas",
              "name": "Aldehídos (R-CHO) y Cetonas (R-CO-R')",
              "short_description": "Grupo carbonilo C=O; aldehídos con H en carbonilo, cetonas con dos carbonos.",
              "example_tasks": [
                "Nombra: CH₃CHO (etanal/acetaldehído), CH₃COCH₃ (propanona/acetona).",
                "Diferencia aldehídos y cetonas por la posición del grupo carbonilo (extremo vs centro de cadena).",
                "Investiga usos de acetona (disolvente en quitaesmalte, industria química)."
              ]
            },
            {
              "key": "acidos_carboxilicos",
              "name": "Ácidos Carboxílicos (R-COOH)",
              "short_description": "Grupo carboxilo (-COOH); propiedades ácidas; nomenclatura terminación -oico.",
              "example_tasks": [
                "Nombra: HCOOH (ácido fórmico), CH₃COOH (ácido acético), C₂H₅COOH (ácido propanoico).",
                "Explica por qué los ácidos carboxílicos son ácidos (liberan H⁺ del grupo COOH).",
                "Investiga ácidos carboxílicos en alimentos: acético (vinagre), cítrico (limón), láctico (yogur)."
              ]
            },
            {
              "key": "esteres_aminas",
              "name": "Ésteres (R-COO-R') y Aminas (R-NH₂)",
              "short_description": "Ésteres de ácidos y alcoholes (aromas); aminas derivadas del amoníaco (bases orgánicas).",
              "example_tasks": [
                "Describe la formación de un éster: ácido carboxílico + alcohol → éster + agua.",
                "Investiga ésteres responsables de aromas de frutas: acetato de etilo (plátano), butanoato de metilo (manzana).",
                "Nombra: CH₃NH₂ (metilamina), C₂H₅NH₂ (etilamina) y describe su carácter básico."
              ]
            }
          ]
        },
        {
          "key": "polimeros_macromoleculas",
          "name": "Polímeros y Macromoléculas",
          "short_description": "Concepto de polímero, monómeros, polímeros naturales y sintéticos, plásticos.",
          "sub_topics": [
            {
              "key": "concepto_polimero",
              "name": "Concepto de Polímero y Polimerización",
              "short_description": "Macromoléculas formadas por unidades repetidas (monómeros); polimerización por adición y condensación.",
              "example_tasks": [
                "Define polímero y monómero con ejemplos: polietileno formado por monómeros de etileno.",
                "Diferencia polimerización por adición (alquenos) y condensación (formación de agua o molécula pequeña).",
                "Escribe la reacción de polimerización del etileno: nCH₂=CH₂ → [-CH₂-CH₂-]ₙ."
              ]
            },
            {
              "key": "polimeros_naturales",
              "name": "Polímeros Naturales",
              "short_description": "Carbohidratos (almidón, celulosa), proteínas, ácidos nucleicos, caucho natural.",
              "example_tasks": [
                "Identifica polímeros naturales: almidón (glucosa), proteínas (aminoácidos), ADN (nucleótidos), celulosa.",
                "Explica la diferencia entre almidón y celulosa (ambos son polímeros de glucosa pero con enlaces diferentes).",
                "Investiga el uso del caucho natural en México antes de la llegada de los españoles (pueblos mesoamericanos)."
              ]
            },
            {
              "key": "polimeros_sinteticos_plasticos",
              "name": "Polímeros Sintéticos y Plásticos",
              "short_description": "Polietileno, PVC, PET, nylon; propiedades, usos y problemática ambiental.",
              "example_tasks": [
                "Identifica plásticos comunes por su código de reciclaje: PET (1), HDPE (2), PVC (3), LDPE (4), PP (5).",
                "Compara propiedades de diferentes plásticos: polietileno (bolsas), PVC (tuberías), PET (botellas).",
                "Investiga el problema de contaminación por plásticos en México y alternativas (biodegradables, reciclaje, reducción de uso)."
              ]
            }
          ]
        },
        {
          "key": "compuestos_organicos_vida",
          "name": "Compuestos Orgánicos en la Vida Cotidiana",
          "short_description": "Combustibles, alimentos, medicamentos, cosméticos y materiales orgánicos.",
          "sub_topics": [
            {
              "key": "combustibles_fosiles_organicos",
              "name": "Combustibles Fósiles como Compuestos Orgánicos",
              "short_description": "Petróleo, gas natural, carbón; origen biológico; hidrocarburos complejos.",
              "example_tasks": [
                "Explica el origen de los combustibles fósiles (descomposición de materia orgánica durante millones de años).",
                "Identifica hidrocarburos en combustibles: metano en gas natural, octano en gasolina.",
                "Investiga el proceso de refinación del petróleo en México y los productos obtenidos."
              ]
            },
            {
              "key": "compuestos_organicos_alimentos",
              "name": "Compuestos Orgánicos en Alimentos",
              "short_description": "Carbohidratos, lípidos, proteínas, vitaminas; estructura y función.",
              "example_tasks": [
                "Clasifica biomoléculas en alimentos: carbohidratos (tortilla, pan), lípidos (aceite, aguacate), proteínas (frijol, carne).",
                "Explica la estructura de carbohidratos: monosacáridos (glucosa), disacáridos (sacarosa), polisacáridos (almidón).",
                "Investiga la importancia de los ácidos grasos omega-3 y omega-6 en la dieta."
              ]
            },
            {
              "key": "medicamentos_drogas",
              "name": "Medicamentos y Drogas",
              "short_description": "Compuestos orgánicos con actividad biológica; aspirina, antibióticos, analgésicos.",
              "example_tasks": [
                "Investiga la estructura química de medicamentos comunes: aspirina (ácido acetilsalicílico), paracetamol.",
                "Explica cómo los antibióticos (compuestos orgánicos) combaten infecciones bacterianas.",
                "Describe el problema del abuso de drogas y adicciones en términos de química cerebral (dopamina, serotonina)."
              ]
            },
            {
              "key": "cosmeticos_productos_cuidado",
              "name": "Cosméticos y Productos de Cuidado Personal",
              "short_description": "Jabones, detergentes, cremas, perfumes; química de su composición.",
              "example_tasks": [
                "Explica cómo funcionan los jabones (moléculas con parte hidrofílica e hidrofóbica) para limpiar grasa.",
                "Investiga la composición de perfumes (mezclas de ésteres, alcoholes y otros compuestos aromáticos).",
                "Compara jabones naturales (sales de ácidos grasos) con detergentes sintéticos."
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "electroquimica",
      "name": "Electroquímica",
      "short_description": "Reacciones de óxido-reducción, celdas electroquímicas, pilas, electrólisis y aplicaciones electroquímicas.",
      "sub_topics": [
        {
          "key": "reacciones_redox",
          "name": "Reacciones de Óxido-Reducción (Redox)",
          "short_description": "Transferencia de electrones, identificación de oxidación y reducción, agentes oxidantes y reductores.",
          "sub_topics": [
            {
              "key": "oxidacion_reduccion_conceptos",
              "name": "Conceptos de Oxidación y Reducción",
              "short_description": "Oxidación como pérdida de electrones; reducción como ganancia de electrones; regla OIL RIG.",
              "example_tasks": [
                "Define oxidación y reducción usando el concepto de transferencia de electrones (OIL: Oxidation Is Loss, RIG: Reduction Is Gain).",
                "Identifica qué elemento se oxida y cuál se reduce en: Zn + Cu²⁺ → Zn²⁺ + Cu.",
                "Explica por qué oxidación y reducción siempre ocurren simultáneamente en una reacción redox."
              ]
            },
            {
              "key": "numero_oxidacion_redox",
              "name": "Número de Oxidación en Reacciones Redox",
              "short_description": "Cambios en números de oxidación indican oxidación o reducción; balanceo de ecuaciones redox.",
              "example_tasks": [
                "Determina los números de oxidación de todos los elementos en: Fe₂O₃, H₂SO₄, KMnO₄.",
                "Identifica cambios de número de oxidación en: 2Mg + O₂ → 2MgO (Mg: 0 → +2 oxidación, O: 0 → -2 reducción).",
                "Determina cuántos electrones se transfieren en: Fe²⁺ → Fe³⁺ + e⁻ (oxidación), Cl₂ + 2e⁻ → 2Cl⁻ (reducción)."
              ]
            },
            {
              "key": "agentes_oxidantes_reductores",
              "name": "Agentes Oxidantes y Agentes Reductores",
              "short_description": "Sustancia que oxida a otra (agente oxidante) y se reduce; sustancia que reduce a otra (agente reductor) y se oxida.",
              "example_tasks": [
                "En la reacción Zn + CuSO₄ → ZnSO₄ + Cu, identifica el agente oxidante (Cu²⁺) y el agente reductor (Zn).",
                "Explica por qué el oxígeno es un buen agente oxidante (alta electronegatividad, acepta electrones fácilmente).",
                "Identifica agentes oxidantes comunes: O₂, Cl₂, H₂O₂, KMnO₄; y reductores: H₂, metales activos, carbón."
              ]
            },
            {
              "key": "balanceo_ecuaciones_redox",
              "name": "Balanceo de Ecuaciones Redox",
              "short_description": "Método del ion-electrón y método del número de oxidación para balancear reacciones redox.",
              "example_tasks": [
                "Balancea por el método del número de oxidación: Fe + O₂ → Fe₂O₃.",
                "Balancea la reacción redox: MnO₄⁻ + Fe²⁺ + H⁺ → Mn²⁺ + Fe³⁺ + H₂O (en medio ácido).",
                "Verifica que los electrones perdidos en la oxidación sean iguales a los ganados en la reducción."
              ]
            }
          ]
        },
        {
          "key": "celdas_galvanicas_pilas",
          "name": "Celdas Galvánicas (Pilas Voltaicas)",
          "short_description": "Conversión de energía química en eléctrica, componentes de una pila, potencial de electrodo, serie electromotriz.",
          "sub_topics": [
            {
              "key": "componentes_celda_galvanica",
              "name": "Componentes y Funcionamiento de una Celda Galvánica",
              "short_description": "Ánodo (oxidación), cátodo (reducción), puente salino, flujo de electrones, notación de celda.",
              "example_tasks": [
                "Dibuja una celda galvánica Zn-Cu e identifica: ánodo (Zn), cátodo (Cu), flujo de electrones, puente salino.",
                "Explica la función del puente salino (mantiene neutralidad eléctrica permitiendo el flujo de iones).",
                "Escribe las semirreacciones: ánodo Zn → Zn²⁺ + 2e⁻ (oxidación), cátodo Cu²⁺ + 2e⁻ → Cu (reducción)."
              ]
            },
            {
              "key": "potencial_electrodo",
              "name": "Potencial de Electrodo y Serie Electromotriz",
              "short_description": "Potencial estándar de reducción (E°), electrodo estándar de hidrógeno, cálculo de voltaje de celda.",
              "example_tasks": [
                "Usa una tabla de potenciales de reducción para calcular E°celda = E°cátodo - E°ánodo.",
                "Determina el voltaje de una celda Zn-Cu usando E°(Zn²⁺/Zn) = -0.76 V y E°(Cu²⁺/Cu) = +0.34 V.",
                "Predice si una reacción redox es espontánea (E°celda > 0) o no espontánea (E°celda < 0)."
              ]
            },
            {
              "key": "tipos_pilas_baterias",
              "name": "Tipos de Pilas y Baterías",
              "short_description": "Pila seca, pila alcalina, batería de plomo-ácido, batería de litio; características y aplicaciones.",
              "example_tasks": [
                "Compara pilas primarias (no recargables, pila seca) con pilas secundarias (recargables, batería de auto).",
                "Describe el funcionamiento de una batería de plomo-ácido usada en automóviles (Pb y PbO₂ en H₂SO₄).",
                "Investiga ventajas y desventajas de baterías de litio (alta densidad energética, costo, reciclaje)."
              ]
            },
            {
              "key": "celdas_combustible",
              "name": "Celdas de Combustible",
              "short_description": "Conversión continua de combustible químico en electricidad; celda de hidrógeno-oxígeno.",
              "example_tasks": [
                "Explica cómo funciona una celda de combustible de H₂-O₂: 2H₂ + O₂ → 2H₂O + energía eléctrica.",
                "Compara celdas de combustible con baterías convencionales (suministro continuo de combustible vs cerradas).",
                "Investiga aplicaciones de celdas de combustible en vehículos de hidrógeno y estaciones espaciales."
              ]
            }
          ]
        },
        {
          "key": "electrolisis",
          "name": "Electrólisis",
          "short_description": "Conversión de energía eléctrica en química, electrólisis de agua y sales fundidas, leyes de Faraday.",
          "sub_topics": [
            {
              "key": "proceso_electrolisis",
              "name": "Proceso de Electrólisis",
              "short_description": "Uso de corriente eléctrica para provocar reacciones no espontáneas; celda electrolítica.",
              "example_tasks": [
                "Dibuja una celda electrolítica para la electrólisis del agua e identifica productos: H₂ en cátodo, O₂ en ánodo.",
                "Explica la diferencia entre celda galvánica (espontánea, produce electricidad) y celda electrolítica (no espontánea, requiere electricidad).",
                "Escribe las semirreacciones en la electrólisis de agua: 2H₂O → O₂ + 4H⁺ + 4e⁻ (ánodo), 4H₂O + 4e⁻ → 2H₂ + 4OH⁻ (cátodo)."
              ]
            },
            {
              "key": "electrolisis_sales_fundidas",
              "name": "Electrólisis de Sales Fundidas",
              "short_description": "Obtención de metales activos mediante electrólisis; ejemplo de NaCl fundido.",
              "example_tasks": [
                "Describe la electrólisis de NaCl fundido: cátodo 2Na⁺ + 2e⁻ → 2Na, ánodo 2Cl⁻ → Cl₂ + 2e⁻.",
                "Explica por qué es necesario fundir el NaCl para electrolizarlo (iones deben ser móviles).",
                "Investiga la producción industrial de aluminio mediante electrólisis de Al₂O₃ fundido (proceso Hall-Héroult)."
              ]
            },
            {
              "key": "leyes_faraday",
              "name": "Leyes de Faraday de la Electrólisis",
              "short_description": "Relación entre cantidad de electricidad y cantidad de sustancia producida; cálculos estequiométricos.",
              "example_tasks": [
                "Enuncia la primera ley de Faraday: la masa depositada es proporcional a la carga eléctrica (Q = I × t).",
                "Calcula cuántos gramos de Cu se depositan al pasar 2 A durante 1 hora en una solución de CuSO₄.",
                "Determina cuánto tiempo se requiere para depositar 10 g de Ag usando una corriente de 5 A."
              ]
            },
            {
              "key": "galvanoplastia_refinacion",
              "name": "Galvanoplastia y Refinación Electrolítica",
              "short_description": "Recubrimiento de metales por electrólisis; purificación de metales; cromado, niquelado, plateado.",
              "example_tasks": [
                "Describe el proceso de cromado de piezas metálicas usando electrólisis de soluciones de Cr³⁺.",
                "Explica cómo se purifica el cobre mediante refinación electrolítica (ánodo de Cu impuro, cátodo de Cu puro).",
                "Investiga aplicaciones de la galvanoplastia en la industria automotriz y de joyería en México."
              ]
            }
          ]
        },
        {
          "key": "corrosion_proteccion",
          "name": "Corrosión y Protección de Metales",
          "short_description": "Corrosión como proceso electroquímico, oxidación de metales, métodos de prevención.",
          "sub_topics": [
            {
              "key": "corrosion_metales",
              "name": "Corrosión de Metales",
              "short_description": "Oxidación de metales en presencia de oxígeno y agua; herrumbre del hierro.",
              "example_tasks": [
                "Explica el proceso de corrosión del hierro: 4Fe + 3O₂ + 6H₂O → 4Fe(OH)₃ (herrumbre).",
                "Describe los factores que aceleran la corrosión: humedad, sales, ácidos, temperatura.",
                "Diseña un experimento para observar la corrosión del hierro en diferentes condiciones (agua salada, agua destilada, aire seco)."
              ]
            },
            {
              "key": "metodos_prevencion_corrosion",
              "name": "Métodos de Prevención de la Corrosión",
              "short_description": "Recubrimientos, galvanización, protección catódica, pinturas anticorrosivas.",
              "example_tasks": [
                "Explica cómo funciona la galvanización (recubrimiento de hierro con zinc) para prevenir corrosión.",
                "Describe la protección catódica usando ánodos de sacrificio (Mg o Zn protegen hierro).",
                "Compara diferentes métodos de protección: pintura, galvanizado, cromado, acero inoxidable."
              ]
            },
            {
              "key": "impacto_economico_corrosion",
              "name": "Impacto Económico y Ambiental de la Corrosión",
              "short_description": "Costos de corrosión en infraestructura, mantenimiento y pérdidas de materiales.",
              "example_tasks": [
                "Investiga el costo económico de la corrosión en México (deterioro de puentes, edificios, tuberías).",
                "Describe problemas de corrosión en la industria petrolera (tuberías, plataformas marinas).",
                "Propón estrategias para minimizar costos de corrosión en construcciones e infraestructura."
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "quimica_ambiental",
      "name": "Química Ambiental",
      "short_description": "Contaminación del aire, agua y suelo; química atmosférica, calentamiento global y desarrollo sustentable.",
      "sub_topics": [
        {
          "key": "contaminacion_aire",
          "name": "Contaminación del Aire",
          "short_description": "Contaminantes atmosféricos, smog, lluvia ácida, efecto invernadero y destrucción de ozono.",
          "sub_topics": [
            {
              "key": "contaminantes_primarios_secundarios",
              "name": "Contaminantes Primarios y Secundarios",
              "short_description": "Contaminantes emitidos directamente (CO, SO₂, NOₓ) vs formados en atmósfera (O₃, H₂SO₄).",
              "example_tasks": [
                "Clasifica como primario o secundario: CO (primario), ozono troposférico (secundario), SO₂ (primario), H₂SO₄ (secundario).",
                "Identifica fuentes de contaminantes primarios: CO de automóviles, SO₂ de termoeléctricas, NOₓ de combustión.",
                "Explica cómo se forma el ozono troposférico (O₃) a partir de NOₓ y COVs bajo luz solar."
              ]
            },
            {
              "key": "smog_fotoquimico",
              "name": "Smog Fotoquímico",
              "short_description": "Formación de smog por reacción de NOₓ y VOCs con luz solar; problemas de salud.",
              "example_tasks": [
                "Explica cómo se forma el smog fotoquímico en ciudades como Ciudad de México (NOₓ + VOCs + luz → O₃ + otros).",
                "Describe efectos del smog en la salud: irritación respiratoria, daño pulmonar, agravamiento de asma.",
                "Investiga medidas para reducir smog: verificación vehicular, restricciones de circulación, combustibles más limpios."
              ]
            },
            {
              "key": "lluvia_acida_atmosfera",
              "name": "Lluvia Ácida",
              "short_description": "Formación por óxidos de azufre y nitrógeno; efectos en ecosistemas, lagos, bosques y edificios.",
              "example_tasks": [
                "Escribe las reacciones de formación de lluvia ácida: SO₂ + H₂O → H₂SO₃, 2SO₂ + O₂ → 2SO₃, SO₃ + H₂O → H₂SO₄.",
                "Describe efectos de lluvia ácida en lagos (acidificación, muerte de peces), bosques (daño a hojas), monumentos (corrosión de mármol).",
                "Propón tres soluciones para reducir lluvia ácida (desulfurización de gases, uso de carbón bajo en azufre, energías renovables)."
              ]
            },
            {
              "key": "capa_ozono",
              "name": "Destrucción de la Capa de Ozono",
              "short_description": "Ozono estratosférico (O₃), CFCs y destrucción de ozono, consecuencias para la vida.",
              "example_tasks": [
                "Explica la importancia del ozono estratosférico (absorbe radiación UV dañina).",
                "Describe cómo los CFCs destruyen ozono: CFCl₃ + UV → CFCl₂ + Cl, Cl + O₃ → ClO + O₂ (reacción en cadena).",
                "Investiga el Protocolo de Montreal y la prohibición de CFCs para proteger la capa de ozono."
              ]
            }
          ]
        },
        {
          "key": "efecto_invernadero_clima",
          "name": "Efecto Invernadero y Cambio Climático",
          "short_description": "Gases de efecto invernadero, calentamiento global, consecuencias y mitigación.",
          "sub_topics": [
            {
              "key": "gases_efecto_invernadero",
              "name": "Gases de Efecto Invernadero (GEI)",
              "short_description": "CO₂, CH₄, N₂O, vapor de agua; mecanismo de retención de calor.",
              "example_tasks": [
                "Explica el efecto invernadero natural (gases retienen radiación infrarroja, calientan la Tierra).",
                "Identifica principales GEI: CO₂ (combustión), CH₄ (ganadería, descomposición), N₂O (fertilizantes), CFCs.",
                "Compara el potencial de calentamiento de diferentes GEI (CH₄ es ~25 veces más potente que CO₂)."
              ]
            },
            {
              "key": "calentamiento_global",
              "name": "Calentamiento Global y sus Consecuencias",
              "short_description": "Aumento de temperatura promedio, derretimiento de glaciares, aumento del nivel del mar, eventos extremos.",
              "example_tasks": [
                "Describe evidencias del calentamiento global: aumento de temperatura, retroceso de glaciares, cambios en precipitación.",
                "Explica consecuencias: aumento del nivel del mar (inundación de costas), eventos climáticos extremos, pérdida de biodiversidad.",
                "Investiga cómo afecta el cambio climático a México: sequías, huracanes más intensos, afectación de agricultura."
              ]
            },
            {
              "key": "mitigacion_adaptacion",
              "name": "Mitigación y Adaptación al Cambio Climático",
              "short_description": "Reducción de emisiones de GEI, energías renovables, eficiencia energética, captura de carbono.",
              "example_tasks": [
                "Propón cinco acciones para reducir emisiones de CO₂: transporte público, energías renovables, eficiencia energética, reforestación.",
                "Explica la diferencia entre mitigación (reducir causas) y adaptación (ajustarse a efectos).",
                "Investiga acuerdos internacionales: Protocolo de Kioto, Acuerdo de París, compromisos de México."
              ]
            }
          ]
        },
        {
          "key": "contaminacion_agua",
          "name": "Contaminación del Agua",
          "short_description": "Fuentes de contaminación, tipos de contaminantes, tratamiento de aguas, calidad del agua.",
          "sub_topics": [
            {
              "key": "fuentes_contaminantes_agua",
              "name": "Fuentes y Tipos de Contaminantes del Agua",
              "short_description": "Contaminación puntual y difusa; contaminantes orgánicos, inorgánicos, biológicos, térmicos.",
              "example_tasks": [
                "Diferencia contaminación puntual (descargas industriales, drenajes) de difusa (escorrentía agrícola, urbana).",
                "Clasifica contaminantes: orgánicos (DBO, aceites), inorgánicos (metales pesados, nitratos), biológicos (patógenos), térmicos.",
                "Investiga problemas de contaminación del agua en México: descargas industriales, aguas residuales no tratadas, minería."
              ]
            },
            {
              "key": "eutrofizacion",
              "name": "Eutrofización de Cuerpos de Agua",
              "short_description": "Exceso de nutrientes (nitratos, fosfatos), crecimiento de algas, agotamiento de oxígeno.",
              "example_tasks": [
                "Explica el proceso de eutrofización: exceso de nutrientes → proliferación de algas → muerte y descomposición → consumo de O₂ → muerte de peces.",
                "Identifica fuentes de nitratos y fosfatos: fertilizantes agrícolas, detergentes, aguas residuales.",
                "Propón medidas para prevenir eutrofización: reducir uso de fertilizantes, tratar aguas residuales, detergentes sin fosfatos."
              ]
            },
            {
              "key": "tratamiento_aguas",
              "name": "Tratamiento de Aguas Residuales y Potabilización",
              "short_description": "Procesos físicos, químicos y biológicos; plantas de tratamiento; desinfección.",
              "example_tasks": [
                "Describe etapas del tratamiento de aguas residuales: primaria (sedimentación), secundaria (biológica), terciaria (química).",
                "Explica procesos de potabilización: coagulación-floculación, filtración, desinfección con Cl₂ u O₃.",
                "Investiga plantas de tratamiento en tu localidad y su eficiencia en remoción de contaminantes."
              ]
            },
            {
              "key": "calidad_agua_parametros",
              "name": "Parámetros de Calidad del Agua",
              "short_description": "pH, oxígeno disuelto, DBO, DQO, turbidez, metales pesados; normas mexicanas.",
              "example_tasks": [
                "Define parámetros de calidad: pH, OD (oxígeno disuelto), DBO (demanda bioquímica de oxígeno), turbidez.",
                "Explica por qué es importante medir DBO (indica contaminación orgánica y consumo de oxígeno por descomposición).",
                "Investiga normas mexicanas (NOMs) para calidad del agua potable y límites máximos de contaminantes."
              ]
            }
          ]
        },
        {
          "key": "contaminacion_suelo_residuos",
          "name": "Contaminación del Suelo y Manejo de Residuos",
          "short_description": "Fuentes de contaminación del suelo, residuos sólidos, tóxicos y peligrosos, reciclaje.",
          "sub_topics": [
            {
              "key": "contaminacion_suelo",
              "name": "Contaminación del Suelo",
              "short_description": "Pesticidas, metales pesados, hidrocarburos, residuos industriales; efectos en agricultura y salud.",
              "example_tasks": [
                "Identifica fuentes de contaminación del suelo: pesticidas, fertilizantes, derrames de petróleo, basureros, industrias.",
                "Explica efectos de metales pesados (Pb, Hg, Cd) en suelo: toxicidad para plantas, bioacumulación en cadena alimentaria.",
                "Investiga problemas de contaminación del suelo en México: pasivos mineros, derrames petroleros, sitios industriales abandonados."
              ]
            },
            {
              "key": "residuos_solidos_clasificacion",
              "name": "Residuos Sólidos: Clasificación y Manejo",
              "short_description": "Residuos urbanos, industriales, peligrosos; las 3 R (reducir, reutilizar, reciclar).",
              "example_tasks": [
                "Clasifica residuos: urbanos (domésticos), industriales (fábricas), peligrosos (baterías, solventes, hospitalarios).",
                "Explica el principio de las 3 R: reducir consumo, reutilizar productos, reciclar materiales.",
                "Calcula cuántos kg de basura genera tu familia por semana y propón estrategias para reducirla."
              ]
            },
            {
              "key": "reciclaje_economia_circular",
              "name": "Reciclaje y Economía Circular",
              "short_description": "Separación de residuos, procesos de reciclaje, economía circular vs lineal.",
              "example_tasks": [
                "Describe el proceso de reciclaje de diferentes materiales: papel, vidrio, plástico, aluminio.",
                "Compara economía lineal (extraer-producir-desechar) con economía circular (reducir-reutilizar-reciclar).",
                "Investiga programas de reciclaje en México y el porcentaje de residuos que se reciclan actualmente."
              ]
            },
            {
              "key": "residuos_peligrosos",
              "name": "Residuos Peligrosos y su Manejo",
              "short_description": "Características CRETIB, manejo especial, disposición final, normatividad.",
              "example_tasks": [
                "Define residuos peligrosos según características CRETIB: Corrosivo, Reactivo, Explosivo, Tóxico, Inflamable, Biológico-infeccioso.",
                "Identifica residuos peligrosos en casa: baterías, medicamentos caducados, solventes, pinturas.",
                "Investiga el manejo adecuado de residuos peligrosos: centros de acopio, tratamiento especial, confinamiento controlado."
              ]
            }
          ]
        },
        {
          "key": "desarrollo_sustentable",
          "name": "Desarrollo Sustentable y Química Verde",
          "short_description": "Principios de sustentabilidad, química verde, tecnologías limpias, huella ecológica.",
          "sub_topics": [
            {
              "key": "desarrollo_sustentable_concepto",
              "name": "Concepto de Desarrollo Sustentable",
              "short_description": "Satisfacer necesidades actuales sin comprometer recursos de futuras generaciones; dimensiones ambiental, social y económica.",
              "example_tasks": [
                "Define desarrollo sustentable e identifica sus tres pilares: ambiental, social, económico.",
                "Explica por qué es necesario el desarrollo sustentable (recursos limitados, crecimiento poblacional, degradación ambiental).",
                "Da tres ejemplos de prácticas sustentables: energías renovables, agricultura orgánica, construcción verde."
              ]
            },
            {
              "key": "quimica_verde",
              "name": "Principios de Química Verde",
              "short_description": "Diseño de procesos y productos químicos menos peligrosos y más eficientes; prevención de residuos.",
              "example_tasks": [
                "Enuncia algunos principios de química verde: prevención de residuos, eficiencia atómica, uso de sustancias menos tóxicas.",
                "Compara un proceso químico tradicional con uno verde (ejemplo: síntesis de ibuprofeno).",
                "Investiga innovaciones en química verde: catálisis, solventes verdes (agua, CO₂ supercrítico), materias primas renovables."
              ]
            },
            {
              "key": "tecnologias_limpias",
              "name": "Tecnologías Limpias y Producción Sustentable",
              "short_description": "Procesos industriales que minimizan impacto ambiental; eficiencia energética, reducción de emisiones.",
              "example_tasks": [
                "Identifica tecnologías limpias en industrias: uso de energía solar, tratamiento de emisiones, reciclaje de agua.",
                "Compara producción tradicional vs sustentable en términos de uso de recursos y generación de residuos.",
                "Investiga empresas mexicanas que implementan tecnologías limpias (cervecerías, cementeras, automotrices)."
              ]
            },
            {
              "key": "huella_ecologica",
              "name": "Huella Ecológica y Huella de Carbono",
              "short_description": "Medición del impacto humano en el planeta; cálculo de huella personal; acciones para reducirla.",
              "example_tasks": [
                "Define huella ecológica (área de tierra y agua necesaria para producir recursos y absorber residuos).",
                "Calcula tu huella de carbono personal usando calculadoras en línea (transporte, alimentación, energía, consumo).",
                "Propón un plan de acción personal para reducir tu huella ecológica en 20% (cambios en transporte, dieta, consumo energético)."
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "quimica_vida_cotidiana",
      "name": "Química en la Vida Cotidiana",
      "short_description": "Aplicaciones prácticas de la química en alimentos, medicamentos, materiales, hogar e industria mexicana.",
      "sub_topics": [
        {
          "key": "quimica_alimentos_cocina",
          "name": "Química en Alimentos y Cocina",
          "short_description": "Reacciones químicas al cocinar, conservadores, aditivos, valor nutricional.",
          "sub_topics": [
            {
              "key": "reacciones_cocina",
              "name": "Reacciones Químicas al Cocinar",
              "short_description": "Caramelización, reacción de Maillard, desnaturalización de proteínas, fermentación.",
              "example_tasks": [
                "Explica la reacción de Maillard (aminoácidos + azúcares → color café y sabor en carne asada, pan tostado).",
                "Describe la caramelización del azúcar y cómo cambia su estructura química al calentarse.",
                "Investiga la desnaturalización de proteínas al cocinar huevos (cambio de estructura, coagulación)."
              ]
            },
            {
              "key": "conservadores_aditivos",
              "name": "Conservadores y Aditivos Alimentarios",
              "short_description": "Sustancias que prolongan vida útil o mejoran propiedades; benzoatos, nitritos, antioxidantes, colorantes.",
              "example_tasks": [
                "Identifica conservadores comunes: benzoato de sodio (refrescos), nitritos (carnes curadas), ácido ascórbico (antioxidante).",
                "Explica cómo funcionan los conservadores (inhiben crecimiento de microorganismos, previenen oxidación).",
                "Investiga controversias sobre aditivos: colorantes artificiales, glutamato monosódico, nitritos (formación de nitrosaminas)."
              ]
            },
            {
              "key": "fermentacion_alimentos",
              "name": "Fermentación en Alimentos",
              "short_description": "Procesos fermentativos en pan, yogur, queso, bebidas alcohólicas; microorganismos involucrados.",
              "example_tasks": [
                "Explica la fermentación alcohólica en la producción de tequila, cerveza y vino (levaduras convierten azúcar en etanol + CO₂).",
                "Describe la fermentación láctica en yogur y queso (bacterias convierten lactosa en ácido láctico).",
                "Diseña un experimento casero de fermentación: hacer pan con levadura observando producción de CO₂."
              ]
            }
          ]
        },
        {
          "key": "quimica_hogar_higiene",
          "name": "Química en el Hogar y Productos de Higiene",
          "short_description": "Productos de limpieza, jabones, detergentes, desinfectantes; uso seguro de químicos domésticos.",
          "sub_topics": [
            {
              "key": "productos_limpieza",
              "name": "Productos de Limpieza y su Química",
              "short_description": "Jabones, detergentes, cloro, amoníaco; mecanismos de limpieza y desinfección.",
              "example_tasks": [
                "Explica cómo funcionan los detergentes (moléculas anfifílicas rodean grasa formando micelas).",
                "Describe el mecanismo de desinfección del cloro (hipoclorito de sodio oxida y destruye microorganismos).",
                "Investiga peligros de mezclar cloro con amoníaco o ácidos (producción de gases tóxicos Cl₂, cloraminas)."
              ]
            },
            {
              "key": "seguridad_quimicos_hogar",
              "name": "Uso Seguro de Químicos en el Hogar",
              "short_description": "Etiquetas, pictogramas de peligro, almacenamiento, primeros auxilios, ventilación.",
              "example_tasks": [
                "Identifica pictogramas de peligro en productos: corrosivo, tóxico, inflamable, irritante.",
                "Describe medidas de seguridad al usar productos químicos: ventilación, guantes, no mezclar productos, leer etiquetas.",
                "Investiga qué hacer en caso de intoxicación por productos de limpieza (contactar centro toxicológico, no inducir vómito en corrosivos)."
              ]
            },
            {
              "key": "alternativas_naturales_limpieza",
              "name": "Alternativas Naturales para Limpieza",
              "short_description": "Bicarbonato, vinagre, limón, aceites esenciales; limpieza ecológica.",
              "example_tasks": [
                "Describe usos del bicarbonato de sodio en limpieza: desodorante, limpiador suave, destapa caños (con vinagre).",
                "Explica cómo el vinagre (ácido acético) elimina depósitos minerales y desinfecta superficies.",
                "Investiga recetas de productos de limpieza caseros y ecológicos usando ingredientes naturales."
              ]
            }
          ]
        },
        {
          "key": "quimica_materiales_tecnologia",
          "name": "Química de Materiales y Tecnología",
          "short_description": "Plásticos, metales, cerámicos, nanomateriales; propiedades y aplicaciones tecnológicas.",
          "sub_topics": [
            {
              "key": "materiales_modernos",
              "name": "Materiales Modernos y sus Aplicaciones",
              "short_description": "Polímeros avanzados, materiales compuestos, fibras sintéticas, cerámicas avanzadas.",
              "example_tasks": [
                "Investiga aplicaciones de polímeros avanzados: teflón (antiadherente), kevlar (chalecos antibalas), polímeros conductores.",
                "Describe materiales compuestos: fibra de carbono (ligero y resistente en autos, aviones), concreto reforzado.",
                "Explica propiedades de cerámicas avanzadas: resistencia a altas temperaturas, dureza (turbinas, naves espaciales)."
              ]
            },
            {
              "key": "nanotecnologia_nanomateriales",
              "name": "Nanotecnología y Nanomateriales",
              "short_description": "Materiales a escala nanométrica, propiedades únicas, aplicaciones en medicina, electrónica, energía.",
              "example_tasks": [
                "Define nanotecnología (manipulación de materia a escala 1-100 nm) y sus aplicaciones.",
                "Investiga nanomateriales: nanotubos de carbono (conductividad, resistencia), nanopartículas de plata (antibacterial).",
                "Describe aplicaciones de nanotecnología: liberación controlada de medicamentos, celdas solares, filtros de agua."
              ]
            },
            {
              "key": "materiales_electronicos",
              "name": "Materiales en Electrónica y Semiconductores",
              "short_description": "Silicio, semiconductores, pantallas LCD/LED, baterías de litio.",
              "example_tasks": [
                "Explica por qué el silicio es el material base de la electrónica (semiconductor, abundante).",
                "Describe el funcionamiento básico de semiconductores: dopaje tipo n y tipo p.",
                "Investiga materiales en baterías: litio-ion (electrónicos portátiles), cátodos de óxidos metálicos."
              ]
            }
          ]
        },
        {
          "key": "quimica_salud_medicina",
          "name": "Química en Salud y Medicina",
          "short_description": "Fármacos, química del cuerpo humano, diagnóstico y terapias químicas.",
          "sub_topics": [
            {
              "key": "farmacos_medicamentos",
              "name": "Fármacos y Medicamentos",
              "short_description": "Desarrollo de fármacos, mecanismos de acción, antibióticos, analgésicos, vacunas.",
              "example_tasks": [
                "Explica cómo funcionan los antibióticos (inhiben procesos vitales de bacterias sin afectar células humanas).",
                "Investiga el desarrollo de vacunas desde la perspectiva química (antígenos, respuesta inmune, conservadores).",
                "Describe mecanismos de analgésicos: aspirina (inhibe síntesis de prostaglandinas), paracetamol."
              ]
            },
            {
              "key": "quimica_cuerpo_humano",
              "name": "Química del Cuerpo Humano",
              "short_description": "Bioquímica básica: proteínas, carbohidratos, lípidos, ácidos nucleicos; metabolismo.",
              "example_tasks": [
                "Explica las funciones de biomoléculas: proteínas (estructura, enzimas), carbohidratos (energía), lípidos (membranas, energía).",
                "Describe el papel del ADN y ARN en la síntesis de proteínas.",
                "Investiga procesos metabólicos: respiración celular (glucosa + O₂ → CO₂ + H₂O + ATP), digestión."
              ]
            },
            {
              "key": "analisis_clinicos",
              "name": "Análisis Clínicos y Diagnóstico",
              "short_description": "Pruebas de laboratorio, análisis de sangre, orina; reactivos y técnicas analíticas.",
              "example_tasks": [
                "Explica pruebas comunes de laboratorio: glucosa en sangre (diabetes), creatinina (función renal), colesterol.",
                "Describe cómo funcionan pruebas rápidas: embarazo (detección de hCG), COVID-19 (antígenos o anticuerpos).",
                "Investiga técnicas analíticas en laboratorio clínico: espectrofotometría, cromatografía, inmunoensayos."
              ]
            }
          ]
        },
        {
          "key": "quimica_industria_mexico",
          "name": "Química en la Industria Mexicana",
          "short_description": "Sectores industriales, petroquímica, minería, agricultura, manufactura en México.",
          "sub_topics": [
            {
              "key": "industria_petroquimica",
              "name": "Industria Petroquímica en México",
              "short_description": "PEMEX, refinación de petróleo, producción de plásticos, fertilizantes, petroquímicos.",
              "example_tasks": [
                "Describe el proceso de refinación del petróleo: destilación fraccionada, craqueo, reformado.",
                "Investiga productos de la petroquímica: polietileno, PVC, fertilizantes nitrogenados, solventes.",
                "Explica la importancia económica de la industria petrolera y petroquímica en México."
              ]
            },
            {
              "key": "mineria_metalurgia",
              "name": "Minería y Metalurgia",
              "short_description": "Extracción y procesamiento de minerales; plata, oro, cobre, zinc en México.",
              "example_tasks": [
                "Describe procesos de extracción metalúrgica: flotación, lixiviación, pirometalurgia, electrorrefinación.",
                "Investiga la importancia de la minería en México (principal productor de plata, importantes yacimientos de oro, cobre).",
                "Explica impactos ambientales de la minería y medidas de mitigación (pasivos ambientales, uso de agua, contaminación)."
              ]
            },
            {
              "key": "industria_alimentaria_bebidas",
              "name": "Industria Alimentaria y de Bebidas",
              "short_description": "Procesamiento de alimentos, bebidas, conservación, fermentación industrial.",
              "example_tasks": [
                "Investiga la industria tequilera: fermentación de agave, destilación, añejamiento.",
                "Describe procesos industriales de conservación: pasteurización, esterilización, liofilización, irradiación.",
                "Explica la química detrás de la producción de tortillas de maíz: nixtamalización (Ca(OH)₂ mejora propiedades nutricionales)."
              ]
            }
          ]
        }
      ]
    }
  ],
  "grade_11_12": [
    {
      "key": "introduccion_fisica_magnitudes",
      "name": "Introducción a la Física y Magnitudes Físicas",
      "short_description": "Método científico en física, sistemas de unidades, conversiones, magnitudes escalares y vectoriales, notación científica y análisis dimensional.",
      "sub_topics": [
        {
          "key": "que_es_fisica",
          "name": "¿Qué es la Física?",
          "short_description": "Definición de física, ramas, importancia en ciencia y tecnología, relación con otras ciencias.",
          "sub_topics": [
            {
              "key": "definicion_fisica_ramas",
              "name": "Definición y Ramas de la Física",
              "short_description": "Física como estudio de materia, energía y sus interacciones; división en mecánica, termodinámica, electromagnetismo, óptica, física moderna.",
              "example_tasks": [
                "Define física y explica su objetivo principal (estudiar leyes fundamentales que rigen el universo).",
                "Identifica a qué rama de la física pertenecen: movimiento de planetas (mecánica), luz (óptica), electricidad (electromagnetismo), calor (termodinámica).",
                "Investiga contribuciones de físicos mexicanos: Arturo Rosenblueth, Manuel Sandoval Vallarta, Deborah Dultzin."
              ]
            },
            {
              "key": "metodo_cientifico_fisica",
              "name": "Método Científico en Física",
              "short_description": "Observación, hipótesis, experimentación, análisis de datos, conclusiones; importancia de la medición.",
              "example_tasks": [
                "Diseña un experimento siguiendo el método científico para determinar cómo afecta la masa a la aceleración bajo fuerza constante.",
                "Explica la diferencia entre ley física (describe qué ocurre) y teoría física (explica por qué ocurre).",
                "Analiza un experimento histórico famoso: péndulo de Galileo, plano inclinado, experimento de Michelson-Morley."
              ]
            },
            {
              "key": "fisica_tecnologia_sociedad",
              "name": "Física, Tecnología y Sociedad",
              "short_description": "Aplicaciones de la física en tecnología moderna, comunicaciones, medicina, energía, transporte.",
              "example_tasks": [
                "Identifica aplicaciones de física en tecnología: GPS (relatividad), rayos X (medicina), semiconductores (electrónica), láser (comunicaciones).",
                "Investiga cómo la física ha transformado la sociedad moderna (electricidad, telecomunicaciones, internet, medicina nuclear).",
                "Describe el papel de la física en retos actuales: energías renovables, cambio climático, exploración espacial."
              ]
            }
          ]
        },
        {
          "key": "sistemas_unidades_medicion",
          "name": "Sistemas de Unidades y Medición",
          "short_description": "Sistema Internacional (SI), unidades fundamentales y derivadas, conversión entre sistemas, precisión y exactitud.",
          "sub_topics": [
            {
              "key": "sistema_internacional_si",
              "name": "Sistema Internacional de Unidades (SI)",
              "short_description": "Siete unidades fundamentales: metro, kilogramo, segundo, ampere, kelvin, mol, candela; prefijos métricos.",
              "example_tasks": [
                "Identifica las unidades del SI para: longitud (m), masa (kg), tiempo (s), temperatura (K), corriente eléctrica (A), cantidad de sustancia (mol).",
                "Convierte usando prefijos métricos: 5 km a m, 250 mg a g, 3.5 μs a s, 2 GW a W.",
                "Expresa en notación científica con unidades SI: velocidad de la luz (3×10⁸ m/s), masa de un electrón (9.1×10⁻³¹ kg)."
              ]
            },
            {
              "key": "unidades_derivadas",
              "name": "Unidades Derivadas",
              "short_description": "Unidades formadas por combinación de fundamentales: m/s, m/s², N, J, W, Pa.",
              "example_tasks": [
                "Expresa las siguientes unidades derivadas en términos de unidades fundamentales: Newton (N = kg·m/s²), Joule (J = kg·m²/s²), Watt (W = J/s).",
                "Identifica las unidades correctas para: velocidad, aceleración, fuerza, energía, potencia, presión.",
                "Calcula la energía cinética (½mv²) de un objeto de 2 kg moviéndose a 5 m/s y expresa el resultado en Joules."
              ]
            },
            {
              "key": "conversion_unidades",
              "name": "Conversión entre Sistemas de Unidades",
              "short_description": "Factores de conversión entre SI, CGS y sistema inglés; análisis dimensional.",
              "example_tasks": [
                "Convierte: 60 mph a m/s, 5 pies a metros, 10 libras a kilogramos, 100°F a °C y K.",
                "Usa análisis dimensional para convertir 100 km/h a m/s mostrando todos los factores de conversión.",
                "Verifica la coherencia dimensional en la ecuación d = v₀t + ½at² (ambos lados deben dar metros)."
              ]
            },
            {
              "key": "precision_exactitud_errores",
              "name": "Precisión, Exactitud y Errores de Medición",
              "short_description": "Diferencia entre precisión y exactitud, error absoluto y relativo, cifras significativas en mediciones.",
              "example_tasks": [
                "Explica la diferencia entre precisión (reproducibilidad de mediciones) y exactitud (cercanía al valor real) con un ejemplo.",
                "Calcula el error absoluto y porcentual si mides 9.8 m pero el valor real es 10.0 m.",
                "Determina el número de cifras significativas en mediciones: 0.00450 m, 1200 kg, 5.60×10³ s, y realiza operaciones respetando cifras significativas."
              ]
            }
          ]
        },
        {
          "key": "magnitudes_escalares_vectoriales",
          "name": "Magnitudes Escalares y Vectoriales",
          "short_description": "Diferencia entre escalares y vectores, representación gráfica de vectores, componentes rectangulares, operaciones vectoriales.",
          "sub_topics": [
            {
              "key": "escalares_vs_vectores",
              "name": "Magnitudes Escalares vs Vectoriales",
              "short_description": "Escalares definidas solo por magnitud; vectores requieren magnitud y dirección.",
              "example_tasks": [
                "Clasifica como escalar o vectorial: temperatura, velocidad, masa, fuerza, energía, aceleración, tiempo, desplazamiento.",
                "Explica por qué la velocidad es vectorial pero la rapidez es escalar.",
                "Da tres ejemplos de situaciones donde es importante considerar la dirección (vectores): viento, fuerza, navegación."
              ]
            },
            {
              "key": "representacion_vectores",
              "name": "Representación Gráfica de Vectores",
              "short_description": "Vectores como flechas: longitud representa magnitud, orientación representa dirección.",
              "example_tasks": [
                "Dibuja un vector de 5 N hacia el noreste (45°) usando una escala apropiada.",
                "Representa gráficamente: velocidad de 30 m/s al este, fuerza de 50 N hacia arriba, desplazamiento de 10 m al suroeste.",
                "Explica los elementos de un vector: magnitud (módulo), dirección, sentido, punto de aplicación."
              ]
            },
            {
              "key": "componentes_rectangulares",
              "name": "Componentes Rectangulares de Vectores",
              "short_description": "Descomposición de vectores en componentes x e y; uso de trigonometría.",
              "example_tasks": [
                "Calcula las componentes x e y de un vector de 100 N que forma 30° con el eje x positivo (Vₓ = V cos θ, Vᵧ = V sen θ).",
                "Determina la magnitud y dirección de un vector con componentes Vₓ = 4 m/s, Vᵧ = 3 m/s (usa Pitágoras y arctan).",
                "Descompón en componentes rectangulares: fuerza de 50 N a 60° sobre la horizontal, velocidad de 25 m/s al noroeste."
              ]
            },
            {
              "key": "suma_resta_vectores",
              "name": "Suma y Resta de Vectores",
              "short_description": "Método gráfico (polígono y paralelogramo) y método analítico (componentes).",
              "example_tasks": [
                "Suma gráficamente dos vectores: 30 m al este + 40 m al norte, usando el método del polígono.",
                "Suma analíticamente vectores A = 5î + 3ĵ y B = 2î - 4ĵ (suma componente por componente).",
                "Calcula la resultante de tres fuerzas: F₁ = 10 N al este, F₂ = 15 N al norte, F₃ = 8 N al oeste."
              ]
            },
            {
              "key": "producto_escalar_vectorial",
              "name": "Producto Escalar y Vectorial",
              "short_description": "Producto punto (A·B = AB cos θ) y producto cruz (A×B); aplicaciones en trabajo y torque.",
              "example_tasks": [
                "Calcula el producto escalar de vectores A = 3î + 4ĵ y B = 2î + 5ĵ (A·B = AₓBₓ + AᵧBᵧ).",
                "Determina el ángulo entre dos vectores usando A·B = |A||B| cos θ.",
                "Explica aplicaciones físicas: producto escalar en trabajo (W = F·d), producto vectorial en torque (τ = r × F)."
              ]
            }
          ]
        },
        {
          "key": "analisis_dimensional_graficas",
          "name": "Análisis Dimensional y Gráficas en Física",
          "short_description": "Verificación de ecuaciones mediante dimensiones, interpretación de gráficas, pendiente y área bajo la curva.",
          "sub_topics": [
            {
              "key": "analisis_dimensional",
              "name": "Análisis Dimensional",
              "short_description": "Verificación de coherencia dimensional en ecuaciones; obtención de relaciones entre variables.",
              "example_tasks": [
                "Verifica que la ecuación v = v₀ + at es dimensionalmente correcta (ambos lados dan [LT⁻¹]).",
                "Determina las dimensiones de la constante G en F = Gm₁m₂/r² (G tiene dimensiones [L³M⁻¹T⁻²]).",
                "Usa análisis dimensional para verificar que E = ½mv² tiene unidades de energía (Joules)."
              ]
            },
            {
              "key": "interpretacion_graficas",
              "name": "Interpretación de Gráficas en Física",
              "short_description": "Lectura de gráficas posición-tiempo, velocidad-tiempo; significado de pendiente, intersección y área.",
              "example_tasks": [
                "Interpreta una gráfica posición vs tiempo: ¿qué significa pendiente (velocidad), línea horizontal (reposo), pendiente negativa (regreso)?",
                "Analiza una gráfica velocidad vs tiempo: calcula la aceleración (pendiente) y el desplazamiento (área bajo la curva).",
                "Dibuja la gráfica v-t correspondiente a un objeto que acelera uniformemente desde el reposo, luego se mueve con velocidad constante."
              ]
            },
            {
              "key": "pendiente_area_graficas",
              "name": "Pendiente y Área Bajo la Curva",
              "short_description": "Cálculo de derivadas (pendiente) e integrales (área) en contextos físicos.",
              "example_tasks": [
                "Calcula la velocidad instantánea (pendiente) en t = 2 s de una gráfica x-t que sigue x = 5t².",
                "Determina el desplazamiento total calculando el área bajo una gráfica v-t rectangular (v = 10 m/s durante 5 s).",
                "Explica por qué el área bajo la curva en una gráfica F-d representa trabajo realizado."
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "cinematica_una_dimension",
      "name": "Cinemática en Una Dimensión",
      "short_description": "Estudio del movimiento rectilíneo: conceptos de posición, desplazamiento, velocidad, aceleración; movimiento uniforme y uniformemente acelerado.",
      "sub_topics": [
        {
          "key": "conceptos_basicos_cinematica",
          "name": "Conceptos Básicos de Cinemática",
          "short_description": "Posición, desplazamiento, distancia recorrida, sistema de referencia, trayectoria.",
          "sub_topics": [
            {
              "key": "posicion_desplazamiento",
              "name": "Posición y Desplazamiento",
              "short_description": "Posición como ubicación en el espacio; desplazamiento como cambio de posición (vector).",
              "example_tasks": [
                "Define sistema de referencia y explica por qué es necesario para describir movimiento.",
                "Calcula el desplazamiento de un automóvil que va de x = 5 m a x = 25 m (Δx = 20 m).",
                "Diferencia entre distancia recorrida (escalar, 30 m) y desplazamiento (vector, puede ser menor si hay regreso)."
              ]
            },
            {
              "key": "velocidad_rapidez",
              "name": "Velocidad y Rapidez",
              "short_description": "Rapidez como razón de cambio de distancia; velocidad como razón de cambio de desplazamiento (vectorial).",
              "example_tasks": [
                "Calcula la velocidad media de un automóvil que se desplaza 100 km al este en 2 horas (v̄ = Δx/Δt = 50 km/h al este).",
                "Explica la diferencia entre rapidez media (total de distancia / tiempo) y velocidad media (desplazamiento / tiempo).",
                "Determina la velocidad instantánea en t = 3 s si x(t) = 2t² + 3t (deriva: v = dx/dt = 4t + 3)."
              ]
            },
            {
              "key": "aceleracion",
              "name": "Aceleración",
              "short_description": "Aceleración como razón de cambio de velocidad; aceleración media e instantánea.",
              "example_tasks": [
                "Calcula la aceleración media de un auto que cambia su velocidad de 10 m/s a 30 m/s en 4 s (a = Δv/Δt = 5 m/s²).",
                "Explica qué significa aceleración negativa (desaceleración o frenado).",
                "Determina la aceleración instantánea en t = 2 s si v(t) = 3t² - 2t (deriva: a = dv/dt = 6t - 2)."
              ]
            }
          ]
        },
        {
          "key": "movimiento_rectilineo_uniforme",
          "name": "Movimiento Rectilíneo Uniforme (MRU)",
          "short_description": "Movimiento con velocidad constante; ecuaciones, gráficas y problemas de MRU.",
          "sub_topics": [
            {
              "key": "caracteristicas_mru",
              "name": "Características del MRU",
              "short_description": "Velocidad constante, aceleración cero, trayectoria recta.",
              "example_tasks": [
                "Identifica las características del MRU: v = constante, a = 0, trayectoria recta.",
                "Dibuja las gráficas x-t (línea recta), v-t (línea horizontal), a-t (línea en cero) para MRU.",
                "Da tres ejemplos de MRU aproximado: auto en autopista con control crucero, luz en el vacío, patinador en hielo."
              ]
            },
            {
              "key": "ecuaciones_mru",
              "name": "Ecuaciones del MRU",
              "short_description": "Ecuación fundamental: x = x₀ + vt; cálculo de posición, velocidad y tiempo.",
              "example_tasks": [
                "Calcula la posición de un auto que viaja a 20 m/s durante 10 s partiendo de x₀ = 0 (x = vt = 200 m).",
                "Determina cuánto tiempo tarda un ciclista en recorrer 500 m a velocidad constante de 10 m/s (t = d/v = 50 s).",
                "Un tren viaja a 30 m/s. Si pasa por x = 100 m en t = 0, ¿dónde estará en t = 5 s? (x = 100 + 30(5) = 250 m)"
              ]
            },
            {
              "key": "problemas_encuentro_alcance",
              "name": "Problemas de Encuentro y Alcance",
              "short_description": "Dos móviles en MRU: cuándo y dónde se encuentran o alcanzan.",
              "example_tasks": [
                "Dos autos parten simultáneamente de posiciones separadas 200 m, uno a 15 m/s y otro a 10 m/s en sentidos opuestos. ¿Cuándo se encuentran?",
                "Un auto A viaja a 20 m/s. Un auto B parte 5 s después desde el mismo punto a 25 m/s. ¿Cuándo alcanza B a A?",
                "Resuelve gráficamente un problema de encuentro trazando x-t para ambos móviles e identificando el punto de intersección."
              ]
            }
          ]
        },
        {
          "key": "movimiento_uniformemente_acelerado",
          "name": "Movimiento Rectilíneo Uniformemente Acelerado (MRUA)",
          "short_description": "Movimiento con aceleración constante; ecuaciones cinemáticas, caída libre y tiro vertical.",
          "sub_topics": [
            {
              "key": "caracteristicas_mrua",
              "name": "Características del MRUA",
              "short_description": "Aceleración constante, velocidad variable, ecuaciones cinemáticas.",
              "example_tasks": [
                "Identifica características del MRUA: a = constante, v cambia uniformemente, x cambia parabólicamente.",
                "Dibuja gráficas para MRUA: x-t (parábola), v-t (línea recta con pendiente = a), a-t (línea horizontal).",
                "Da ejemplos de MRUA: auto acelerando, objeto en caída libre, cohete despegando con aceleración constante."
              ]
            },
            {
              "key": "ecuaciones_mrua",
              "name": "Ecuaciones del MRUA",
              "short_description": "Ecuaciones fundamentales: v = v₀ + at, x = x₀ + v₀t + ½at², v² = v₀² + 2a(x - x₀).",
              "example_tasks": [
                "Calcula la velocidad final de un auto que acelera desde reposo a 2 m/s² durante 10 s (v = v₀ + at = 0 + 2(10) = 20 m/s).",
                "Determina la distancia recorrida por un objeto con v₀ = 5 m/s, a = 3 m/s² durante 4 s (x = v₀t + ½at²).",
                "Un auto frena con a = -5 m/s² desde 25 m/s. ¿Qué distancia recorre hasta detenerse? (usa v² = v₀² + 2ax, con v = 0)"
              ]
            },
            {
              "key": "caida_libre",
              "name": "Caída Libre",
              "short_description": "Movimiento vertical bajo gravedad (g = 9.8 m/s²); todos los objetos caen con la misma aceleración.",
              "example_tasks": [
                "Calcula el tiempo que tarda una piedra en caer desde 45 m de altura (usa y = ½gt², g = 9.8 m/s²).",
                "Determina la velocidad con que un objeto llega al suelo después de caer desde 20 m (v = √(2gh)).",
                "Explica por qué una pluma y una moneda caen a la misma velocidad en el vacío (sin resistencia del aire)."
              ]
            },
            {
              "key": "tiro_vertical",
              "name": "Tiro Vertical",
              "short_description": "Lanzamiento vertical hacia arriba o abajo; altura máxima, tiempo de vuelo.",
              "example_tasks": [
                "Una pelota se lanza hacia arriba con v₀ = 20 m/s. Calcula la altura máxima alcanzada (v = 0 en el punto máximo, usa v² = v₀² - 2gh).",
                "Determina el tiempo total de vuelo de un objeto lanzado verticalmente con v₀ = 30 m/s hasta que regresa al punto de partida.",
                "Calcula la velocidad con que regresa al suelo un objeto lanzado hacia arriba con v₀ = 15 m/s (misma magnitud, dirección opuesta)."
              ]
            }
          ]
        },
        {
          "key": "graficas_cinematica",
          "name": "Análisis Gráfico del Movimiento",
          "short_description": "Interpretación y construcción de gráficas x-t, v-t, a-t; relaciones entre gráficas.",
          "sub_topics": [
            {
              "key": "graficas_posicion_tiempo",
              "name": "Gráficas Posición-Tiempo",
              "short_description": "Interpretación de pendiente como velocidad; movimiento hacia adelante, atrás, en reposo.",
              "example_tasks": [
                "Interpreta una gráfica x-t: identifica periodos de reposo (horizontal), movimiento uniforme (recta inclinada), regreso (pendiente negativa).",
                "Calcula la velocidad en diferentes tramos de una gráfica x-t segmentada.",
                "Dibuja la gráfica x-t para: objeto en reposo 2 s, luego se mueve a 5 m/s durante 3 s, luego regresa a 3 m/s durante 2 s."
              ]
            },
            {
              "key": "graficas_velocidad_tiempo",
              "name": "Gráficas Velocidad-Tiempo",
              "short_description": "Pendiente representa aceleración; área bajo la curva representa desplazamiento.",
              "example_tasks": [
                "Calcula la aceleración a partir de la pendiente de una gráfica v-t.",
                "Determina el desplazamiento total calculando el área bajo una gráfica v-t trapezoidal.",
                "Dibuja la gráfica v-t correspondiente a un auto que acelera uniformemente, luego mantiene velocidad constante, luego frena hasta detenerse."
              ]
            },
            {
              "key": "relacion_entre_graficas",
              "name": "Relación entre Gráficas x-t, v-t, a-t",
              "short_description": "Derivación e integración gráfica; pendiente de x-t da v-t, pendiente de v-t da a-t.",
              "example_tasks": [
                "Dada una gráfica x-t parabólica, dibuja la gráfica v-t correspondiente (línea recta) y a-t (horizontal).",
                "A partir de una gráfica a-t constante, construye las gráficas v-t (recta) y x-t (parábola).",
                "Explica cómo obtener la gráfica v-t a partir de x-t: la velocidad es la pendiente de la posición en cada punto."
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "cinematica_dos_dimensiones",
      "name": "Cinemática en Dos Dimensiones",
      "short_description": "Movimiento en un plano: movimiento parabólico, movimiento circular, velocidad y aceleración como vectores.",
      "sub_topics": [
        {
          "key": "movimiento_parabolico",
          "name": "Movimiento Parabólico (Tiro Parabólico)",
          "short_description": "Composición de movimiento horizontal (MRU) y vertical (MRUA); trayectoria parabólica.",
          "sub_topics": [
            {
              "key": "caracteristicas_tiro_parabolico",
              "name": "Características del Tiro Parabólico",
              "short_description": "Movimiento independiente en x (MRU) y en y (MRUA con g); trayectoria curva.",
              "example_tasks": [
                "Explica el principio de independencia de movimientos: horizontal y vertical son independientes.",
                "Descompón la velocidad inicial v₀ en componentes: v₀ₓ = v₀ cos θ, v₀ᵧ = v₀ sen θ.",
                "Describe la trayectoria de un proyectil: parábola simétrica si lanzado desde el suelo."
              ]
            },
            {
              "key": "ecuaciones_tiro_parabolico",
              "name": "Ecuaciones del Tiro Parabólico",
              "short_description": "Ecuaciones para componentes x e y; alcance horizontal, altura máxima, tiempo de vuelo.",
              "example_tasks": [
                "Calcula el alcance horizontal de un proyectil lanzado con v₀ = 20 m/s a θ = 45° (usa R = v₀² sen(2θ)/g).",
                "Determina la altura máxima alcanzada por un proyectil con v₀ᵧ = 30 m/s (usa H = v₀ᵧ²/(2g)).",
                "Calcula el tiempo de vuelo de un proyectil lanzado con v₀ = 25 m/s a 60° (t = 2v₀ sen θ/g)."
              ]
            },
            {
              "key": "problemas_tiro_parabolico",
              "name": "Problemas de Tiro Parabólico",
              "short_description": "Aplicaciones: tiro desde altura, ángulo para alcance máximo, velocidad en cualquier punto.",
              "example_tasks": [
                "Un balón se patea con v₀ = 15 m/s a 30°. Calcula: alcance, altura máxima, tiempo de vuelo.",
                "Desde un acantilado de 50 m se lanza horizontalmente un objeto a 10 m/s. ¿Dónde cae? (calcula tiempo de caída, luego distancia horizontal).",
                "Determina el ángulo de lanzamiento para alcance máximo en terreno plano (45°) y explica por qué."
              ]
            }
          ]
        },
        {
          "key": "movimiento_circular",
          "name": "Movimiento Circular Uniforme (MCU)",
          "short_description": "Movimiento en trayectoria circular con rapidez constante; velocidad angular, aceleración centrípeta.",
          "sub_topics": [
            {
              "key": "caracteristicas_mcu",
              "name": "Características del MCU",
              "short_description": "Rapidez constante, velocidad cambia de dirección, aceleración dirigida al centro.",
              "example_tasks": [
                "Explica por qué hay aceleración en MCU aunque la rapidez sea constante (la dirección de v cambia).",
                "Identifica ejemplos de MCU: satélite en órbita, rueda de la fortuna, partícula en ciclotrón.",
                "Describe la dirección de velocidad (tangente) y aceleración (hacia el centro) en MCU."
              ]
            },
            {
              "key": "magnitudes_angulares",
              "name": "Magnitudes Angulares",
              "short_description": "Desplazamiento angular (θ), velocidad angular (ω), aceleración angular (α); relación con magnitudes lineales.",
              "example_tasks": [
                "Convierte ángulos: 180° a radianes (π rad), 2π rad a grados (360°), 90° a radianes (π/2 rad).",
                "Calcula la velocidad angular de una rueda que da 60 rpm (ω = 2π rad/s × 60/60 = 2π rad/s).",
                "Relaciona velocidad lineal y angular: v = ωr. Si r = 0.5 m y ω = 4 rad/s, calcula v."
              ]
            },
            {
              "key": "aceleracion_centripeta",
              "name": "Aceleración Centrípeta",
              "short_description": "Aceleración dirigida al centro: aᴄ = v²/r = ω²r; necesaria para cambiar dirección.",
              "example_tasks": [
                "Calcula la aceleración centrípeta de un auto que toma una curva de radio 50 m a 20 m/s (aᴄ = v²/r).",
                "Determina el radio de una centrífuga que gira a 3000 rpm produciendo aceleración de 1000g.",
                "Explica por qué los pasajeros sienten una fuerza hacia afuera en una curva (marco no inercial, fuerza centrífuga aparente)."
              ]
            },
            {
              "key": "periodo_frecuencia",
              "name": "Periodo y Frecuencia",
              "short_description": "Periodo (T): tiempo de una revolución; frecuencia (f): revoluciones por unidad de tiempo; f = 1/T.",
              "example_tasks": [
                "Calcula el periodo de un satélite que completa una órbita en 90 minutos (T = 90 min = 5400 s).",
                "Determina la frecuencia de rotación de la Tierra (f = 1/T = 1/(24 h) ≈ 1.16 × 10⁻⁵ Hz).",
                "Relaciona velocidad angular con periodo: ω = 2π/T. Si T = 2 s, calcula ω."
              ]
            }
          ]
        },
        {
          "key": "movimiento_relativo",
          "name": "Movimiento Relativo",
          "short_description": "Velocidad y posición dependen del sistema de referencia; transformaciones entre sistemas.",
          "sub_topics": [
            {
              "key": "sistemas_referencia",
              "name": "Sistemas de Referencia",
              "short_description": "Observadores en diferentes marcos de referencia miden velocidades diferentes.",
              "example_tasks": [
                "Explica por qué un pasajero en tren ve objetos dentro del tren en reposo, mientras alguien afuera los ve en movimiento.",
                "Da ejemplos de sistemas de referencia: sistema de laboratorio, sistema del centro de masa, sistema rotante.",
                "Describe la importancia de especificar el sistema de referencia al reportar velocidades."
              ]
            },
            {
              "key": "velocidad_relativa",
              "name": "Velocidad Relativa",
              "short_description": "Suma vectorial de velocidades en diferentes sistemas: v_AB = v_AC + v_CB.",
              "example_tasks": [
                "Un bote viaja a 5 m/s en río con corriente de 2 m/s. Calcula velocidad respecto a tierra si va: a favor, en contra, perpendicular.",
                "Dos autos viajan en la misma dirección a 20 m/s y 15 m/s. ¿Cuál es la velocidad relativa entre ellos?",
                "Un avión vuela a 200 km/h al norte con viento de 50 km/h al este. Calcula velocidad resultante respecto a tierra."
              ]
            },
            {
              "key": "problemas_movimiento_relativo",
              "name": "Problemas de Movimiento Relativo",
              "short_description": "Aplicaciones en navegación, aviación, cruce de ríos.",
              "example_tasks": [
                "Un nadador cruza un río de 100 m de ancho nadando a 1.5 m/s perpendicular, con corriente de 1 m/s. ¿Dónde llega a la otra orilla?",
                "¿En qué dirección debe apuntar un avión para volar directo al norte si hay viento del oeste a 40 km/h y el avión vuela a 300 km/h?",
                "Dos trenes viajan en vías paralelas, uno a 30 m/s al este y otro a 20 m/s al oeste. Calcula su velocidad relativa."
              ]
            }
          ]
        }
      ]
    },
    {
      "key": "dinamica_leyes_newton",
      "name": "Dinámica: Leyes de Newton",
      "short_description": "Estudio de las causas del movimiento: fuerza, masa, leyes de Newton, aplicaciones y tipos de fuerzas.",
      "sub_topics": [
        {
          "key": "concepto_fuerza",
          "name": "Concepto de Fuerza",
          "short_description": "Fuerza como interacción que cambia el estado de movimiento; fuerza como vector, unidad Newton.",
          "sub_topics": [
            {
              "key": "definicion_fuerza",
              "name": "Definición y Características de la Fuerza",
              "short_description": "Fuerza produce aceleración, es vectorial, unidad SI: Newton (N = kg·m/s²).",
              "example_tasks": [
                "Define fuerza y explica por qué es una magnitud vectorial (tiene magnitud y dirección).",
                "Identifica fuerzas en situaciones cotidianas: empujar caja, tensión en cuerda, peso de objeto, fricción al deslizar.",
                "Convierte unidades de fuerza: 5 N a dinas (1 N = 10⁵ dinas), 1000 N a kilonewtons."
              ]
            },
            {
              "key": "tipos_fuerzas",
              "name": "Tipos de Fuerzas",
              "short_description": "Fuerzas de contacto (fricción, tensión, normal) y a distancia (gravitacional, eléctrica, magnética).",
              "example_tasks": [
                "Clasifica como fuerza de contacto o a distancia: gravedad, fricción, fuerza normal, fuerza eléctrica, tensión.",
                "Dibuja diagrama de cuerpo libre para una caja en reposo sobre mesa inclinada (peso, normal, fricción).",
                "Explica la diferencia entre peso (fuerza gravitacional) y masa (cantidad de materia)."
              ]
            },
            {
              "key": "diagrama_cuerpo_libre",
              "name": "Diagrama de Cuerpo Libre (DCL)",
              "short_description": "Representación de todas las fuerzas que actúan sobre un objeto; herramienta fundamental en dinámica.",
              "example_tasks": [
                "Dibuja el DCL para: objeto colgando de cuerda (tensión hacia arriba, peso hacia abajo).",
                "Construye DCL para bloque deslizando por plano inclinado (peso, normal, fricción).",
                "Identifica errores comunes en DCL: incluir fuerzas que el objeto ejerce sobre otros, omitir fuerzas reales."
              ]
            }
          ]
        },
        {
          "key": "primera_ley_newton",
          "name": "Primera Ley de Newton (Ley de Inercia)",
          "short_description": "Objeto en reposo o MRU permanece así a menos que actúe fuerza neta; concepto de inercia.",
          "sub_topics": [
            {
              "key": "enunciado_inercia",
              "name": "Enunciado y Significado de la Primera Ley",
              "short_description": "Un cuerpo permanece en reposo o MRU si la fuerza neta es cero; inercia como resistencia al cambio.",
              "example_tasks": [
                "Enuncia la primera ley de Newton y explica qué significa fuerza neta igual a cero.",
                "Da ejemplos de inercia: pasajeros se mueven hacia adelante cuando auto frena, objetos en mesa cuando se jala el mantel.",
                "Explica por qué es necesario usar cinturón de seguridad en términos de la primera ley."
              ]
            },
            {
              "key": "equilibrio_estatico_dinamico",
              "name": "Equilibrio Estático y Dinámico",
              "short_description": "Equilibrio estático (v = 0) y dinámico (v = constante ≠ 0); ambos requieren ΣF = 0.",
              "example_tasks": [
                "Identifica si hay equilibrio: libro en mesa (estático), auto a velocidad constante (dinámico), auto acelerando (no hay equilibrio).",
                "Calcula fuerzas en equilibrio: si dos cuerdas sostienen objeto de 50 N a 30° y 60°, determina tensiones.",
                "Explica por qué paracaidista en descenso a velocidad terminal está en equilibrio dinámico (peso = resistencia del aire)."
              ]
            },
            {
              "key": "marcos_inerciales",
              "name": "Marcos de Referencia Inerciales",
              "short_description": "Sistemas donde se cumple la primera ley; marcos no inerciales (acelerados) requieren fuerzas ficticias.",
              "example_tasks": [
                "Define marco de referencia inercial y da ejemplos (sistema fijo a Tierra aproximadamente, sistema de estrellas fijas).",
                "Explica por qué sientes una fuerza hacia atrás cuando auto acelera (marco del auto es no inercial).",
                "Identifica marcos no inerciales: auto acelerando, elevador acelerando, plataforma rotante."
              ]
            }
          ]
        },
        {
          "key": "segunda_ley_newton",
          "name": "Segunda Ley de Newton (F = ma)",
          "short_description": "Fuerza neta produce aceleración proporcional a la fuerza e inversamente proporcional a la masa.",
          "sub_topics": [
            {
              "key": "enunciado_segunda_ley",
              "name": "Enunciado y Aplicación de F = ma",
              "short_description": "ΣF = ma; la aceleración es directamente proporcional a fuerza neta e inversamente proporcional a masa.",
              "example_tasks": [
                "Calcula la aceleración de un objeto de 10 kg sometido a fuerza neta de 50 N (a = F/m = 5 m/s²).",
                "Determina la fuerza necesaria para acelerar un auto de 1000 kg a 2 m/s².",
                "Explica por qué objetos más masivos son más difíciles de acelerar (mayor inercia, menor a para misma F)."
              ]
            },
            {
              "key": "masa_peso",
              "name": "Masa y Peso",
              "short_description": "Masa es cantidad de materia (kg), peso es fuerza gravitacional (N); W = mg.",
              "example_tasks": [
                "Calcula el peso de una persona de 70 kg en la Tierra (W = mg = 70 × 9.8 = 686 N).",
                "Determina tu peso en la Luna (g_Luna ≈ 1.6 m/s²) si tienes masa de 60 kg.",
                "Explica por qué tu masa es constante pero tu peso varía en diferentes planetas."
              ]
            },
            {
              "key": "problemas_segunda_ley",
              "name": "Problemas de Aplicación de la Segunda Ley",
              "short_description": "Resolución de problemas con múltiples fuerzas; descomposición vectorial, sistemas de ecuaciones.",
              "example_tasks": [
                "Un bloque de 5 kg se empuja con 30 N horizontalmente. Si hay fricción de 10 N, calcula la aceleración.",
                "Dos fuerzas actúan sobre objeto de 8 kg: 20 N al este, 15 N al norte. Calcula magnitud y dirección de aceleración.",
                "Resuelve: bloque de 10 kg en plano inclinado 30° (descompón peso, encuentra aceleración si no hay fricción)."
              ]
            }
          ]
        },
        {
          "key": "tercera_ley_newton",
          "name": "Tercera Ley de Newton (Acción y Reacción)",
          "short_description": "Para toda acción hay reacción igual y opuesta; pares de fuerzas actúan sobre objetos diferentes.",
          "sub_topics": [
            {
              "key": "enunciado_accion_reaccion",
              "name": "Enunciado de la Tercera Ley",
              "short_description": "Si A ejerce fuerza sobre B, entonces B ejerce fuerza igual y opuesta sobre A (F_AB = -F_BA).",
              "example_tasks": [
                "Identifica pares acción-reacción: Tierra atrae manzana / manzana atrae Tierra, mano empuja pared / pared empuja mano.",
                "Explica por qué los pares acción-reacción no se cancelan (actúan sobre objetos diferentes).",
                "Describe cómo funciona un cohete usando la tercera ley (expulsa gases hacia abajo, gases empujan cohete hacia arriba)."
              ]
            },
            {
              "key": "aplicaciones_tercera_ley",
              "name": "Aplicaciones de la Tercera Ley",
              "short_description": "Caminar, nadar, propulsión de cohetes, retroceso de armas.",
              "example_tasks": [
                "Explica cómo caminas: pie empuja suelo hacia atrás, suelo empuja pie hacia adelante.",
                "Describe la propulsión a chorro en términos de acción-reacción (motor expulsa aire hacia atrás, avión es empujado hacia adelante).",
                "Calcula el retroceso de un rifle de 4 kg que dispara bala de 10 g a 400 m/s (conservación de momento)."
              ]
            }
          ]
        },
        {
          "key": "fuerzas_especiales",
          "name": "Fuerzas Especiales",
          "short_description": "Fricción, tensión, fuerza normal, fuerza elástica; características y aplicaciones.",
          "sub_topics": [
            {
              "key": "fuerza_friccion",
              "name": "Fuerza de Fricción",
              "short_description": "Fricción estática (objeto en reposo) y cinética (objeto en movimiento); coeficiente de fricción.",
              "example_tasks": [
                "Calcula la fuerza de fricción estática máxima para bloque de 20 kg sobre superficie con μₛ = 0.4 (fₛ = μₛN = μₛmg).",
                "Determina la fuerza necesaria para mover bloque de 15 kg si μₖ = 0.3.",
                "Explica por qué fricción estática es mayor que cinética (μₛ > μₖ) en términos microscópicos."
              ]
            },
            {
              "key": "tension_cuerdas",
              "name": "Tensión en Cuerdas",
              "short_description": "Fuerza transmitida por cuerdas, cables o cadenas; tensión uniforme en cuerda sin masa.",
              "example_tasks": [
                "Calcula la tensión en cuerda que sostiene masa de 10 kg colgando (T = mg = 98 N).",
                "Determina tensiones en sistema de poleas: masa de 20 kg colgando de polea fija.",
                "Resuelve: dos masas (5 kg y 3 kg) conectadas por cuerda sobre polea sin fricción. Calcula aceleración y tensión."
              ]
            },
            {
              "key": "fuerza_normal",
              "name": "Fuerza Normal",
              "short_description": "Fuerza perpendicular ejercida por superficie; no siempre igual al peso.",
              "example_tasks": [
                "Calcula la fuerza normal sobre bloque de 8 kg en superficie horizontal (N = mg).",
                "Determina N para bloque de 10 kg en plano inclinado 30° (N = mg cos 30°).",
                "Explica por qué te sientes más pesado en elevador acelerando hacia arriba (N > mg)."
              ]
            },
            {
              "key": "fuerza_elastica",
              "name": "Fuerza Elástica (Ley de Hooke)",
              "short_description": "F = -kx; fuerza restauradora en resortes proporcional a elongación.",
              "example_tasks": [
                "Calcula la fuerza ejercida por resorte de k = 200 N/m estirado 0.1 m (F = kx = 20 N).",
                "Determina la constante k de un resorte que se estira 5 cm bajo peso de 10 N.",
                "Explica el signo negativo en F = -kx (fuerza se opone al desplazamiento, es restauradora)."
              ]
            }
          ]
        }
      ]
    }
  ]
}
