[
  {
    "key": "introduccion_quimica",
    "name": "Introducción a la Química",
    "short_description": "Conceptos fundamentales de la química como ciencia, método científico, sistema internacional de unidades y conversiones, así como normas de seguridad en el laboratorio.",
    "sub_topics": [
      {
        "key": "naturaleza_quimica",
        "name": "Naturaleza de la Química",
        "short_description": "Definición de química, su campo de estudio y relación con otras ciencias naturales.",
        "sub_topics": [
          {
            "key": "definicion_quimica",
            "name": "Definición y Campo de Estudio",
            "short_description": "Comprensión de la química como ciencia que estudia la materia, sus propiedades, composición y transformaciones.",
            "example_tasks": [
              "Explica con tus propias palabras qué estudia la química y por qué es importante en la vida cotidiana",
              "Identifica tres situaciones de tu entorno donde se aplican principios químicos y explica cómo",
              "Compara la química con la física y la biología, señalando similitudes y diferencias en sus objetos de estudio"
            ]
          },
          {
            "key": "materia_energia",
            "name": "Materia y Energía",
            "short_description": "Distinción entre materia y energía, sus formas y transformaciones fundamentales.",
            "example_tasks": [
              "Define materia y energía, proporcionando tres ejemplos de cada una",
              "Clasifica las siguientes situaciones según involucren principalmente materia o energía: luz solar, agua, sonido, aire",
              "Explica cómo se relacionan la materia y la energía en el proceso de combustión de la gasolina"
            ]
          },
          {
            "key": "ramas_quimica",
            "name": "Ramas de la Química",
            "short_description": "Identificación de las principales divisiones de la química y sus áreas de aplicación.",
            "example_tasks": [
              "Enumera y describe brevemente las cinco ramas principales de la química",
              "Relaciona cada rama de la química con un producto o aplicación específica en México",
              "Investiga qué rama de la química se involucra en el desarrollo de nuevos medicamentos y explica por qué"
            ]
          }
        ]
      },
      {
        "key": "metodo_cientifico",
        "name": "Método Científico",
        "short_description": "Aplicación del método científico en la investigación química y resolución de problemas.",
        "sub_topics": [
          {
            "key": "pasos_metodo_cientifico",
            "name": "Etapas del Método Científico",
            "short_description": "Identificación y aplicación de las etapas: observación, hipótesis, experimentación, análisis y conclusión.",
            "example_tasks": [
              "Ordena las siguientes etapas del método científico: conclusión, hipótesis, experimentación, observación, análisis",
              "Describe un experimento sencillo siguiendo todas las etapas del método científico para probar la solubilidad del azúcar en agua",
              "Analiza un caso de estudio sobre la corrosión del hierro y identifica qué etapa del método científico se está aplicando en cada sección"
            ]
          },
          {
            "key": "hipotesis_teoria",
            "name": "Hipótesis, Teoría y Ley Científica",
            "short_description": "Diferenciación entre hipótesis, teoría científica y ley científica en el contexto de la química.",
            "example_tasks": [
              "Explica la diferencia entre una hipótesis y una teoría científica con ejemplos químicos",
              "Clasifica las siguientes afirmaciones como hipótesis, teoría o ley: 'La materia no se crea ni se destruye', 'El agua hierve porque sus moléculas se mueven más rápido'",
              "Redacta una hipótesis sobre qué factor afecta más la velocidad de disolución de una tableta efervescente"
            ]
          }
        ]
      },
      {
        "key": "mediciones_unidades",
        "name": "Mediciones y Sistema Internacional",
        "short_description": "Manejo del Sistema Internacional de Unidades, mediciones fundamentales y conversiones.",
        "sub_topics": [
          {
            "key": "unidades_fundamentales",
            "name": "Unidades Fundamentales del SI",
            "short_description": "Identificación y uso de las siete unidades fundamentales del Sistema Internacional.",
            "example_tasks": [
              "Enumera las siete unidades fundamentales del SI y su magnitud correspondiente",
              "Identifica la unidad del SI apropiada para medir: la masa de un libro, la temperatura del agua, el volumen de un refresco",
              "Explica por qué es importante tener un sistema internacional de unidades estandarizado en la ciencia"
            ]
          },
          {
            "key": "conversiones_unidades",
            "name": "Conversiones de Unidades",
            "short_description": "Realización de conversiones entre diferentes unidades usando factores de conversión.",
            "example_tasks": [
              "Convierte 2.5 kg a gramos utilizando factores de conversión",
              "Un estudiante mide 1.65 m de altura. Expresa esta medida en centímetros y en milímetros",
              "Convierte 500 mL a litros y luego a metros cúbicos, mostrando todos los pasos"
            ]
          },
          {
            "key": "notacion_cientifica",
            "name": "Notación Científica",
            "short_description": "Expresión de cantidades muy grandes o muy pequeñas usando notación científica.",
            "example_tasks": [
              "Expresa el número 0.000025 en notación científica",
              "El diámetro de un átomo de hidrógeno es aproximadamente 0.0000000001 m. Escribe esta cantidad en notación científica",
              "Realiza la siguiente operación y expresa el resultado en notación científica: (3.2 × 10⁴) × (2.5 × 10³)"
            ]
          },
          {
            "key": "cifras_significativas",
            "name": "Cifras Significativas",
            "short_description": "Identificación y uso correcto de cifras significativas en mediciones y cálculos.",
            "example_tasks": [
              "Identifica el número de cifras significativas en las siguientes mediciones: 0.0045 g, 120.0 mL, 5.00 × 10³ km",
              "Realiza la suma 12.11 g + 0.345 g + 3.2 g y expresa el resultado con el número correcto de cifras significativas",
              "Un estudiante mide la masa de un objeto tres veces: 15.34 g, 15.32 g, 15.35 g. Calcula el promedio con el número correcto de cifras significativas"
            ]
          }
        ]
      },
      {
        "key": "propiedades_materia",
        "name": "Propiedades de la Materia",
        "short_description": "Clasificación y caracterización de las propiedades físicas y químicas de la materia.",
        "sub_topics": [
          {
            "key": "propiedades_fisicas",
            "name": "Propiedades Físicas",
            "short_description": "Identificación de propiedades que se pueden observar sin cambiar la composición de la sustancia.",
            "example_tasks": [
              "Enumera cinco propiedades físicas del agua y explica por qué son propiedades físicas",
              "Clasifica las siguientes propiedades como intensivas o extensivas: color, volumen, densidad, punto de fusión, masa",
              "Describe cómo podrías usar propiedades físicas para distinguir entre agua y alcohol sin probarlos"
            ]
          },
          {
            "key": "propiedades_quimicas",
            "name": "Propiedades Químicas",
            "short_description": "Reconocimiento de propiedades que describen cómo una sustancia puede transformarse en otra.",
            "example_tasks": [
              "Define qué es una propiedad química y proporciona tres ejemplos",
              "Explica por qué la inflamabilidad de la gasolina es una propiedad química y no física",
              "Compara las propiedades químicas del hierro y del oro, mencionando cuál es más reactivo y por qué"
            ]
          },
          {
            "key": "cambios_fisicos_quimicos",
            "name": "Cambios Físicos y Químicos",
            "short_description": "Diferenciación entre cambios físicos y cambios químicos en la materia.",
            "example_tasks": [
              "Clasifica los siguientes procesos como cambios físicos o químicos: hervir agua, quemar madera, congelar jugo, oxidar hierro",
              "Explica tres evidencias que indican que ha ocurrido un cambio químico",
              "Describe lo que ocurre a nivel molecular cuando el agua se evapora (cambio físico) versus cuando se descompone por electrólisis (cambio químico)"
            ]
          }
        ]
      },
      {
        "key": "clasificacion_materia",
        "name": "Clasificación de la Materia",
        "short_description": "Organización de la materia en sustancias puras y mezclas, elementos y compuestos.",
        "sub_topics": [
          {
            "key": "sustancias_puras",
            "name": "Sustancias Puras: Elementos y Compuestos",
            "short_description": "Distinción entre elementos y compuestos como tipos de sustancias puras.",
            "example_tasks": [
              "Define elemento y compuesto, proporcionando tres ejemplos de cada uno",
              "Clasifica las siguientes sustancias como elementos o compuestos: oxígeno (O₂), agua (H₂O), hierro (Fe), sal (NaCl), carbono (C)",
              "Explica por qué el agua es un compuesto y no un elemento, usando conceptos sobre su composición molecular"
            ]
          },
          {
            "key": "mezclas_homogeneas",
            "name": "Mezclas Homogéneas",
            "short_description": "Caracterización de mezclas con composición uniforme en toda su extensión.",
            "example_tasks": [
              "Define mezcla homogénea y proporciona tres ejemplos de la vida cotidiana",
              "Explica por qué el aire es considerado una mezcla homogénea",
              "Describe cómo preparar una mezcla homogénea de agua con azúcar y qué observarías"
            ]
          },
          {
            "key": "mezclas_heterogeneas",
            "name": "Mezclas Heterogéneas",
            "short_description": "Identificación de mezclas con composición no uniforme y fases distinguibles.",
            "example_tasks": [
              "Define mezcla heterogénea y proporciona tres ejemplos",
              "Clasifica las siguientes mezclas como homogéneas o heterogéneas: agua con aceite, vinagre, ensalada, bronce, granito",
              "Diseña un método para separar una mezcla heterogénea de arena y limaduras de hierro"
            ]
          },
          {
            "key": "metodos_separacion",
            "name": "Métodos de Separación de Mezclas",
            "short_description": "Aplicación de técnicas físicas para separar componentes de mezclas.",
            "example_tasks": [
              "Describe el proceso de filtración y menciona un ejemplo de cuándo se utiliza",
              "Explica cómo separarías una mezcla de agua y sal utilizando un método de separación apropiado",
              "Diseña un procedimiento completo para separar una mezcla de arena, sal y limaduras de hierro, especificando qué método usarías en cada paso"
            ]
          }
        ]
      },
      {
        "key": "seguridad_laboratorio",
        "name": "Seguridad en el Laboratorio",
        "short_description": "Normas de seguridad, manejo de sustancias químicas y uso correcto del equipo de laboratorio.",
        "sub_topics": [
          {
            "key": "normas_seguridad",
            "name": "Normas Básicas de Seguridad",
            "short_description": "Reglas fundamentales para trabajar de manera segura en el laboratorio de química.",
            "example_tasks": [
              "Enumera diez normas básicas de seguridad que deben seguirse en un laboratorio de química",
              "Explica por qué es importante usar bata de laboratorio y lentes de seguridad durante los experimentos",
              "Describe qué acciones tomarías si accidentalmente derramas un ácido en la mesa de trabajo"
            ]
          },
          {
            "key": "pictogramas_seguridad",
            "name": "Pictogramas de Seguridad",
            "short_description": "Interpretación de símbolos de peligro en etiquetas de productos químicos.",
            "example_tasks": [
              "Identifica y explica el significado de cinco pictogramas de seguridad comunes en productos químicos",
              "Un frasco tiene el pictograma de una llama. ¿Qué precauciones debes tomar al manipular esta sustancia?",
              "Diseña una etiqueta de seguridad para un frasco de ácido clorhídrico, incluyendo los pictogramas apropiados"
            ]
          },
          {
            "key": "equipo_laboratorio",
            "name": "Equipo de Laboratorio",
            "short_description": "Identificación y uso correcto del material y equipo común en el laboratorio.",
            "example_tasks": [
              "Dibuja y nombra diez instrumentos comunes del laboratorio de química",
              "Explica la diferencia entre un vaso de precipitados y un matraz volumétrico, y cuándo usarías cada uno",
              "Describe el procedimiento correcto para medir exactamente 25.0 mL de agua usando una bureta"
            ]
          },
          {
            "key": "manejo_residuos",
            "name": "Manejo de Residuos Químicos",
            "short_description": "Disposición adecuada de residuos químicos según su clasificación y peligrosidad.",
            "example_tasks": [
              "Explica por qué no se deben desechar residuos químicos en el drenaje común",
              "Clasifica los siguientes residuos y explica cómo deberían desecharse: vidrios rotos, soluciones ácidas, papel contaminado",
              "Describe el protocolo de tu escuela para el manejo de residuos químicos peligrosos"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "estructura_atomica",
    "name": "Estructura Atómica",
    "short_description": "Modelos atómicos históricos y modernos, partículas subatómicas, configuración electrónica y propiedades periódicas de los elementos.",
    "sub_topics": [
      {
        "key": "modelos_atomicos",
        "name": "Evolución de los Modelos Atómicos",
        "short_description": "Desarrollo histórico de los modelos que explican la estructura del átomo.",
        "sub_topics": [
          {
            "key": "modelo_dalton",
            "name": "Modelo Atómico de Dalton",
            "short_description": "Teoría atómica de Dalton y sus postulados fundamentales sobre la naturaleza de la materia.",
            "example_tasks": [
              "Enumera los cuatro postulados principales de la teoría atómica de Dalton",
              "Explica cómo el modelo de Dalton explicaba la Ley de Conservación de la Masa",
              "Describe una limitación del modelo de Dalton que fue corregida por descubrimientos posteriores"
            ]
          },
          {
            "key": "modelo_thomson",
            "name": "Modelo Atómico de Thomson",
            "short_description": "Descubrimiento del electrón y modelo del 'budín con pasas' de Thomson.",
            "example_tasks": [
              "Describe el modelo atómico de Thomson y explica por qué se le llama 'budín con pasas'",
              "Explica qué experimento condujo a Thomson al descubrimiento del electrón",
              "Compara el modelo de Dalton con el de Thomson, señalando el avance que representó"
            ]
          },
          {
            "key": "modelo_rutherford",
            "name": "Modelo Atómico de Rutherford",
            "short_description": "Experimento de la lámina de oro y descubrimiento del núcleo atómico.",
            "example_tasks": [
              "Describe el experimento de Rutherford con la lámina de oro y sus resultados principales",
              "Explica qué evidencia del experimento llevó a Rutherford a proponer la existencia de un núcleo atómico",
              "Dibuja un diagrama del modelo atómico de Rutherford y compáralo con el modelo de Thomson"
            ]
          },
          {
            "key": "modelo_bohr",
            "name": "Modelo Atómico de Bohr",
            "short_description": "Niveles de energía cuantizados y órbitas electrónicas definidas en el átomo de hidrógeno.",
            "example_tasks": [
              "Explica los tres postulados principales del modelo atómico de Bohr",
              "Describe cómo el modelo de Bohr explica los espectros de emisión del hidrógeno",
              "Calcula la energía de un electrón en el segundo nivel energético del átomo de hidrógeno usando la ecuación de Bohr"
            ]
          },
          {
            "key": "modelo_mecanica_cuantica",
            "name": "Modelo de Mecánica Cuántica",
            "short_description": "Modelo actual del átomo basado en orbitales y probabilidad de encontrar electrones.",
            "example_tasks": [
              "Explica la diferencia entre una órbita (Bohr) y un orbital (mecánica cuántica)",
              "Describe qué representan los números cuánticos en el modelo actual del átomo",
              "Explica el principio de incertidumbre de Heisenberg y su relevancia en la estructura atómica"
            ]
          }
        ]
      },
      {
        "key": "particulas_subatomicas",
        "name": "Partículas Subatómicas",
        "short_description": "Características y propiedades de protones, neutrones y electrones.",
        "sub_topics": [
          {
            "key": "caracteristicas_particulas",
            "name": "Protones, Neutrones y Electrones",
            "short_description": "Masa, carga y ubicación de las partículas fundamentales del átomo.",
            "example_tasks": [
              "Completa una tabla con la masa, carga y ubicación de protones, neutrones y electrones",
              "Explica por qué el átomo es eléctricamente neutro a pesar de contener partículas con carga",
              "Calcula la masa aproximada de un átomo que tiene 12 protones, 12 neutrones y 12 electrones, expresando tu respuesta en uma"
            ]
          },
          {
            "key": "numero_atomico_masico",
            "name": "Número Atómico y Número de Masa",
            "short_description": "Definición y uso del número atómico (Z) y número de masa (A) para caracterizar átomos.",
            "example_tasks": [
              "Define número atómico y número de masa, explicando qué información proporciona cada uno",
              "Un átomo tiene 17 protones y 18 neutrones. Determina su número atómico y número de masa",
              "Identifica el elemento que tiene Z = 26 y A = 56, y calcula cuántos neutrones tiene este átomo"
            ]
          },
          {
            "key": "isotopos",
            "name": "Isótopos",
            "short_description": "Átomos del mismo elemento con diferente número de neutrones y sus aplicaciones.",
            "example_tasks": [
              "Define isótopo y explica por qué los isótopos de un elemento tienen las mismas propiedades químicas",
              "El carbono tiene tres isótopos: C-12, C-13 y C-14. Indica cuántos protones, neutrones y electrones tiene cada uno",
              "Investiga y explica una aplicación práctica de un isótopo radiactivo en medicina o industria"
            ]
          },
          {
            "key": "iones",
            "name": "Iones: Cationes y Aniones",
            "short_description": "Formación de iones por pérdida o ganancia de electrones y su notación.",
            "example_tasks": [
              "Explica la diferencia entre un catión y un anión, proporcionando dos ejemplos de cada uno",
              "Un átomo de sodio (Z = 11) pierde un electrón. Escribe la notación iónica y determina cuántos protones y electrones tiene el ion resultante",
              "Predice qué tipo de ion (catión o anión) formarán los siguientes elementos y justifica tu respuesta: oxígeno, calcio, cloro"
            ]
          }
        ]
      },
      {
        "key": "configuracion_electronica",
        "name": "Configuración Electrónica",
        "short_description": "Distribución de electrones en niveles, subniveles y orbitales atómicos.",
        "sub_topics": [
          {
            "key": "numeros_cuanticos",
            "name": "Números Cuánticos",
            "short_description": "Significado y valores permitidos de los cuatro números cuánticos que describen un electrón.",
            "example_tasks": [
              "Enumera los cuatro números cuánticos y explica qué aspecto del electrón describe cada uno",
              "Indica los valores posibles del número cuántico azimutal (l) cuando n = 3",
              "Escribe el conjunto de números cuánticos para el último electrón de un átomo de carbono (Z = 6)"
            ]
          },
          {
            "key": "orbitales_atomicos",
            "name": "Orbitales Atómicos",
            "short_description": "Tipos de orbitales (s, p, d, f), su forma y capacidad electrónica.",
            "example_tasks": [
              "Describe la forma de los orbitales s, p y d, y dibuja un esquema de cada uno",
              "Indica cuántos orbitales hay en cada subnivel: s, p, d, f, y cuántos electrones puede contener cada subnivel",
              "Explica por qué el segundo nivel energético puede contener un máximo de 8 electrones"
            ]
          },
          {
            "key": "principio_aufbau",
            "name": "Principio de Aufbau",
            "short_description": "Orden de llenado de orbitales según su energía creciente.",
            "example_tasks": [
              "Escribe el orden de llenado de orbitales hasta 4p usando el principio de Aufbau",
              "Explica por qué el orbital 4s se llena antes que el orbital 3d",
              "Usa el diagrama de Moeller para determinar el orden de llenado de los orbitales en un átomo de potasio (Z = 19)"
            ]
          },
          {
            "key": "principio_exclusion_pauli",
            "name": "Principio de Exclusión de Pauli",
            "short_description": "Restricción de que dos electrones no pueden tener los mismos cuatro números cuánticos.",
            "example_tasks": [
              "Enuncia el principio de exclusión de Pauli y explica su importancia en la configuración electrónica",
              "Explica por qué un orbital puede contener un máximo de dos electrones",
              "Indica si el siguiente conjunto de números cuánticos es permitido para dos electrones en el mismo átomo: (2, 0, 0, +½) y (2, 0, 0, -½)"
            ]
          },
          {
            "key": "regla_hund",
            "name": "Regla de Máxima Multiplicidad de Hund",
            "short_description": "Distribución de electrones en orbitales degenerados con spines paralelos.",
            "example_tasks": [
              "Enuncia la regla de Hund y explica por qué los electrones prefieren ocupar orbitales vacíos antes de aparearse",
              "Dibuja el diagrama de orbitales para el nitrógeno (Z = 7) aplicando la regla de Hund",
              "Explica por qué la configuración del oxígeno en los orbitales 2p es más estable cuando tiene dos electrones desapareados"
            ]
          },
          {
            "key": "configuraciones_elementales",
            "name": "Configuraciones Electrónicas de Elementos",
            "short_description": "Escritura de configuraciones electrónicas completas y abreviadas para diferentes elementos.",
            "example_tasks": [
              "Escribe la configuración electrónica completa del cloro (Z = 17)",
              "Escribe la configuración electrónica abreviada del hierro (Z = 26) usando la configuración del gas noble más cercano",
              "Identifica el elemento cuya configuración electrónica termina en 3d⁶ 4s²"
            ]
          },
          {
            "key": "configuraciones_iones",
            "name": "Configuraciones Electrónicas de Iones",
            "short_description": "Determinación de configuraciones electrónicas para cationes y aniones.",
            "example_tasks": [
              "Escribe la configuración electrónica del ion Ca²⁺ (el calcio tiene Z = 20)",
              "Escribe la configuración electrónica del ion O²⁻ (el oxígeno tiene Z = 8)",
              "Explica por qué los metales de transición pierden primero los electrones del orbital ns antes que los del orbital (n-1)d al formar cationes"
            ]
          }
        ]
      },
      {
        "key": "espectroscopia",
        "name": "Espectroscopía Atómica",
        "short_description": "Espectros de emisión y absorción, relación entre energía y frecuencia de la radiación electromagnética.",
        "sub_topics": [
          {
            "key": "espectro_electromagnetico",
            "name": "Espectro Electromagnético",
            "short_description": "Regiones del espectro electromagnético y sus características.",
            "example_tasks": [
              "Enumera las regiones del espectro electromagnético en orden de energía creciente",
              "Explica la relación entre frecuencia, longitud de onda y energía de la radiación electromagnética",
              "Calcula la frecuencia de una onda de luz que tiene una longitud de onda de 500 nm"
            ]
          },
          {
            "key": "espectros_atomicos",
            "name": "Espectros de Emisión y Absorción",
            "short_description": "Interpretación de espectros atómicos discontinuos como evidencia de niveles de energía cuantizados.",
            "example_tasks": [
              "Explica la diferencia entre un espectro de emisión y un espectro de absorción",
              "Describe qué sucede a nivel atómico cuando un electrón emite luz al pasar de un nivel de energía superior a uno inferior",
              "Explica por qué cada elemento produce un espectro de emisión único que sirve como 'huella digital'"
            ]
          },
          {
            "key": "ecuacion_planck",
            "name": "Ecuación de Planck y Energía de Fotones",
            "short_description": "Cálculo de la energía de fotones usando la relación E = hν.",
            "example_tasks": [
              "Calcula la energía de un fotón de luz roja con una frecuencia de 4.5 × 10¹⁴ Hz (h = 6.626 × 10⁻³⁴ J·s)",
              "¿Qué tipo de radiación (UV, visible, IR) tiene fotones con energía de 3.0 × 10⁻¹⁹ J?",
              "Compara la energía de un fotón de luz azul con uno de luz roja y explica cuál tiene mayor energía"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "tabla_periodica",
    "name": "Tabla Periódica de los Elementos",
    "short_description": "Organización de la tabla periódica, clasificación de elementos, propiedades periódicas y tendencias en grupos y periodos.",
    "sub_topics": [
      {
        "key": "organizacion_tabla",
        "name": "Organización de la Tabla Periódica",
        "short_description": "Estructura de la tabla periódica moderna basada en número atómico, periodos y grupos.",
        "sub_topics": [
          {
            "key": "ley_periodica",
            "name": "Ley Periódica Moderna",
            "short_description": "Propiedades de los elementos como función periódica de su número atómico.",
            "example_tasks": [
              "Enuncia la ley periódica moderna y explica cómo difiere de la ley de Mendeleiev",
              "Explica por qué los elementos se ordenan por número atómico y no por masa atómica",
              "Describe qué significa que las propiedades de los elementos sean 'periódicas'"
            ]
          },
          {
            "key": "periodos_grupos",
            "name": "Periodos y Grupos",
            "short_description": "Identificación de periodos (filas) y grupos o familias (columnas) en la tabla periódica.",
            "example_tasks": [
              "Explica qué información proporcionan el periodo y el grupo de un elemento sobre su configuración electrónica",
              "Identifica el periodo y grupo del cloro (Z = 17) y relaciona esto con su configuración electrónica",
              "Determina cuántos electrones de valencia tiene un elemento del grupo 15 (VA)"
            ]
          },
          {
            "key": "bloques_tabla",
            "name": "Bloques s, p, d y f",
            "short_description": "Clasificación de elementos según el orbital que se está llenando.",
            "example_tasks": [
              "Dibuja un diagrama de la tabla periódica mostrando los bloques s, p, d y f",
              "Explica por qué los elementos del bloque d se llaman metales de transición",
              "Identifica a qué bloque pertenecen los siguientes elementos: calcio, bromo, hierro, uranio"
            ]
          }
        ]
      },
      {
        "key": "clasificacion_elementos",
        "name": "Clasificación de los Elementos",
        "short_description": "Categorización de elementos en metales, no metales, metaloides y gases nobles.",
        "sub_topics": [
          {
            "key": "metales",
            "name": "Metales",
            "short_description": "Propiedades características de los elementos metálicos y su ubicación en la tabla.",
            "example_tasks": [
              "Enumera cinco propiedades físicas características de los metales",
              "Explica por qué los metales son buenos conductores de electricidad a nivel atómico",
              "Identifica la ubicación general de los metales en la tabla periódica y nombra tres familias de metales"
            ]
          },
          {
            "key": "no_metales",
            "name": "No Metales",
            "short_description": "Propiedades de los elementos no metálicos y su posición en la tabla periódica.",
            "example_tasks": [
              "Enumera cinco propiedades que distinguen a los no metales de los metales",
              "Explica por qué los no metales tienden a ganar electrones al formar enlaces",
              "Identifica cinco elementos no metálicos y describe sus estados físicos a temperatura ambiente"
            ]
          },
          {
            "key": "metaloides",
            "name": "Metaloides o Semimetales",
            "short_description": "Elementos con propiedades intermedias entre metales y no metales.",
            "example_tasks": [
              "Enumera los elementos considerados metaloides y ubícalos en la tabla periódica",
              "Explica por qué el silicio es importante en la industria electrónica",
              "Compara las propiedades del metaloid boro con las del metal aluminio y el no metal carbono"
            ]
          },
          {
            "key": "gases_nobles",
            "name": "Gases Nobles",
            "short_description": "Características de los elementos del grupo 18 y su baja reactividad.",
            "example_tasks": [
              "Enumera los gases nobles y explica por qué son químicamente inertes",
              "Relaciona la configuración electrónica de los gases nobles con su estabilidad química",
              "Describe dos aplicaciones prácticas de los gases nobles en la vida cotidiana o industria"
            ]
          }
        ]
      },
      {
        "key": "familias_elementos",
        "name": "Familias o Grupos Representativos",
        "short_description": "Características específicas de los grupos principales de la tabla periódica.",
        "sub_topics": [
          {
            "key": "metales_alcalinos",
            "name": "Metales Alcalinos (Grupo 1)",
            "short_description": "Propiedades y reactividad de los elementos del grupo 1.",
            "example_tasks": [
              "Enumera los metales alcalinos y describe tres propiedades que comparten",
              "Explica por qué los metales alcalinos son tan reactivos y deben almacenarse en aceite",
              "Escribe la ecuación de la reacción del sodio con agua y describe qué se observa"
            ]
          },
          {
            "key": "metales_alcalinoterreos",
            "name": "Metales Alcalinotérreos (Grupo 2)",
            "short_description": "Características de los elementos del grupo 2 y su menor reactividad que el grupo 1.",
            "example_tasks": [
              "Enumera los metales alcalinotérreos y compara su reactividad con la de los metales alcalinos",
              "Explica por qué el calcio es importante para la salud ósea y dental",
              "Describe una aplicación industrial del magnesio"
            ]
          },
          {
            "key": "halogenos",
            "name": "Halógenos (Grupo 17)",
            "short_description": "Propiedades de los elementos del grupo 17 y su alta reactividad como no metales.",
            "example_tasks": [
              "Enumera los halógenos y describe su tendencia en estado físico a temperatura ambiente",
              "Explica por qué los halógenos son tan reactivos y tienden a formar iones con carga -1",
              "Describe dos aplicaciones del cloro y del yodo en la vida cotidiana"
            ]
          },
          {
            "key": "familia_carbono",
            "name": "Familia del Carbono (Grupo 14)",
            "short_description": "Diversidad de propiedades en el grupo 14, desde no metales hasta metales.",
            "example_tasks": [
              "Enumera los elementos del grupo 14 y clasifícalos como metales, metaloides o no metales",
              "Explica por qué el carbono es fundamental para la vida y forma millones de compuestos",
              "Compara las propiedades del carbono con las del silicio y menciona una aplicación de cada uno"
            ]
          },
          {
            "key": "familia_nitrogeno",
            "name": "Familia del Nitrógeno (Grupo 15)",
            "short_description": "Características de los elementos del grupo 15 y su importancia biológica.",
            "example_tasks": [
              "Enumera los elementos del grupo 15 y describe la tendencia en su carácter metálico",
              "Explica la importancia del nitrógeno para los seres vivos y su ciclo biogeoquímico",
              "Describe una aplicación del fósforo en agricultura"
            ]
          },
          {
            "key": "familia_oxigeno",
            "name": "Familia del Oxígeno (Grupo 16)",
            "short_description": "Propiedades de los calcógenos y su papel en compuestos importantes.",
            "example_tasks": [
              "Enumera los elementos del grupo 16 y sus estados de oxidación más comunes",
              "Explica por qué el oxígeno es esencial para la respiración celular",
              "Describe las diferencias entre oxígeno (O₂) y ozono (O₃) y la importancia de cada uno"
            ]
          }
        ]
      },
      {
        "key": "propiedades_periodicas",
        "name": "Propiedades Periódicas",
        "short_description": "Tendencias de propiedades atómicas en la tabla periódica.",
        "sub_topics": [
          {
            "key": "radio_atomico",
            "name": "Radio Atómico",
            "short_description": "Tendencia del tamaño atómico en periodos y grupos.",
            "example_tasks": [
              "Explica cómo varía el radio atómico al moverse de izquierda a derecha en un periodo y por qué",
              "Explica cómo varía el radio atómico al bajar en un grupo y por qué",
              "Ordena los siguientes elementos de mayor a menor radio atómico: Li, Na, K, Rb"
            ]
          },
          {
            "key": "energia_ionizacion",
            "name": "Energía de Ionización",
            "short_description": "Energía necesaria para remover un electrón de un átomo gaseoso.",
            "example_tasks": [
              "Define energía de ionización y explica su relación con la atracción nuclear",
              "Explica por qué la energía de ionización generalmente aumenta de izquierda a derecha en un periodo",
              "Ordena los siguientes elementos de menor a mayor energía de ionización: F, Cl, Br, I"
            ]
          },
          {
            "key": "afinidad_electronica",
            "name": "Afinidad Electrónica",
            "short_description": "Energía liberada cuando un átomo gaseoso gana un electrón.",
            "example_tasks": [
              "Define afinidad electrónica y explica qué elementos tienen las afinidades electrónicas más altas",
              "Explica por qué los halógenos tienen afinidades electrónicas muy altas",
              "Compara la afinidad electrónica del cloro con la del azufre y explica la diferencia"
            ]
          },
          {
            "key": "electronegatividad",
            "name": "Electronegatividad",
            "short_description": "Capacidad de un átomo para atraer electrones en un enlace químico.",
            "example_tasks": [
              "Define electronegatividad según la escala de Pauling y menciona qué elemento es el más electronegativo",
              "Explica cómo varía la electronegatividad en la tabla periódica y las razones de estas tendencias",
              "Ordena los siguientes elementos de menor a mayor electronegatividad: C, N, O, F"
            ]
          },
          {
            "key": "caracter_metalico",
            "name": "Carácter Metálico",
            "short_description": "Tendencia de los elementos a exhibir propiedades metálicas.",
            "example_tasks": [
              "Explica qué significa que un elemento tenga carácter metálico",
              "Describe cómo varía el carácter metálico en un periodo de izquierda a derecha",
              "Ordena los siguientes elementos de mayor a menor carácter metálico: Si, P, S, Cl"
            ]
          },
          {
            "key": "radio_ionico",
            "name": "Radio Iónico",
            "short_description": "Tamaño de cationes y aniones en comparación con sus átomos neutros.",
            "example_tasks": [
              "Explica por qué los cationes son más pequeños que sus átomos neutros correspondientes",
              "Explica por qué los aniones son más grandes que sus átomos neutros correspondientes",
              "Compara el tamaño del Na, Na⁺, Cl y Cl⁻, ordenándolos de mayor a menor radio"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "enlace_quimico",
    "name": "Enlace Químico",
    "short_description": "Tipos de enlaces químicos (iónico, covalente, metálico), teorías de enlace, geometría molecular y fuerzas intermoleculares.",
    "sub_topics": [
      {
        "key": "teoria_enlace",
        "name": "Teoría del Enlace Químico",
        "short_description": "Conceptos fundamentales sobre por qué se forman los enlaces entre átomos.",
        "sub_topics": [
          {
            "key": "regla_octeto",
            "name": "Regla del Octeto",
            "short_description": "Tendencia de los átomos a adquirir ocho electrones en su capa de valencia.",
            "example_tasks": [
              "Enuncia la regla del octeto y explica por qué los átomos tienden a cumplirla",
              "Indica cuántos electrones necesita ganar, perder o compartir el oxígeno (Z = 8) para cumplir la regla del octeto",
              "Menciona tres excepciones a la regla del octeto y proporciona un ejemplo de cada una"
            ]
          },
          {
            "key": "electrones_valencia",
            "name": "Electrones de Valencia",
            "short_description": "Identificación y representación de electrones de la capa externa involucrados en enlaces.",
            "example_tasks": [
              "Determina el número de electrones de valencia para los siguientes elementos: C, N, O, Cl",
              "Dibuja los diagramas de Lewis para los átomos de los elementos del segundo periodo",
              "Explica por qué los electrones de valencia son los más importantes en la formación de enlaces"
            ]
          },
          {
            "key": "energia_enlace",
            "name": "Energía de Enlace",
            "short_description": "Energía requerida para romper o liberada al formar enlaces químicos.",
            "example_tasks": [
              "Define energía de enlace y explica su relación con la estabilidad de una molécula",
              "Explica por qué se libera energía cuando se forma un enlace químico",
              "Compara la energía de enlace de un enlace C-C simple con un enlace C=C doble y explica cuál es más fuerte"
            ]
          }
        ]
      },
      {
        "key": "enlace_ionico",
        "name": "Enlace Iónico",
        "short_description": "Formación de enlaces por transferencia de electrones entre metales y no metales.",
        "sub_topics": [
          {
            "key": "formacion_enlace_ionico",
            "name": "Formación de Compuestos Iónicos",
            "short_description": "Proceso de transferencia de electrones y formación de cationes y aniones.",
            "example_tasks": [
              "Explica cómo se forma un enlace iónico entre el sodio y el cloro, incluyendo diagramas de Lewis",
              "Predice qué tipo de iones formarán el magnesio y el oxígeno, y escribe la fórmula del compuesto iónico resultante",
              "Describe la transferencia de electrones en la formación del cloruro de calcio (CaCl₂)"
            ]
          },
          {
            "key": "energia_reticular",
            "name": "Energía Reticular",
            "short_description": "Energía liberada en la formación de un mol de compuesto iónico sólido a partir de iones gaseosos.",
            "example_tasks": [
              "Define energía reticular y explica qué factores la afectan",
              "Explica por qué el MgO tiene mayor energía reticular que el NaCl",
              "Relaciona la energía reticular con el punto de fusión de los compuestos iónicos"
            ]
          },
          {
            "key": "propiedades_compuestos_ionicos",
            "name": "Propiedades de los Compuestos Iónicos",
            "short_description": "Características físicas y químicas típicas de sustancias iónicas.",
            "example_tasks": [
              "Enumera cinco propiedades características de los compuestos iónicos",
              "Explica por qué los compuestos iónicos conducen electricidad cuando están fundidos o en solución, pero no en estado sólido",
              "Describe por qué los compuestos iónicos tienen puntos de fusión elevados"
            ]
          },
          {
            "key": "estructura_cristalina",
            "name": "Estructura Cristalina de Compuestos Iónicos",
            "short_description": "Organización de iones en redes cristalinas tridimensionales.",
            "example_tasks": [
              "Describe la estructura cristalina del cloruro de sodio",
              "Explica por qué los compuestos iónicos forman cristales",
              "Dibuja un diagrama simple de la red cristalina del NaCl mostrando la alternancia de iones"
            ]
          }
        ]
      },
      {
        "key": "enlace_covalente",
        "name": "Enlace Covalente",
        "short_description": "Formación de enlaces por compartición de pares de electrones entre no metales.",
        "sub_topics": [
          {
            "key": "enlaces_covalentes_simples",
            "name": "Enlaces Covalentes Simples",
            "short_description": "Compartición de un par de electrones entre dos átomos.",
            "example_tasks": [
              "Dibuja la estructura de Lewis para la molécula de hidrógeno (H₂) mostrando el enlace covalente simple",
              "Explica cómo se forma un enlace covalente en la molécula de cloro (Cl₂)",
              "Dibuja la estructura de Lewis para el metano (CH₄) mostrando los cuatro enlaces simples"
            ]
          },
          {
            "key": "enlaces_multiples",
            "name": "Enlaces Covalentes Múltiples",
            "short_description": "Enlaces dobles y triples por compartición de dos o tres pares de electrones.",
            "example_tasks": [
              "Dibuja la estructura de Lewis para el dióxido de carbono (CO₂) mostrando los enlaces dobles",
              "Dibuja la estructura de Lewis para el nitrógeno molecular (N₂) mostrando el enlace triple",
              "Compara la longitud y fuerza de los enlaces C-C, C=C y C≡C"
            ]
          },
          {
            "key": "estructuras_lewis",
            "name": "Estructuras de Lewis",
            "short_description": "Representación de enlaces y pares de electrones libres en moléculas.",
            "example_tasks": [
              "Dibuja la estructura de Lewis para el agua (H₂O) mostrando los pares de electrones enlazantes y no enlazantes",
              "Dibuja la estructura de Lewis para el amoníaco (NH₃)",
              "Dibuja la estructura de Lewis para el ion carbonato (CO₃²⁻) mostrando su carga"
            ]
          },
          {
            "key": "resonancia",
            "name": "Estructuras de Resonancia",
            "short_description": "Moléculas que requieren más de una estructura de Lewis para representarse adecuadamente.",
            "example_tasks": [
              "Dibuja las estructuras de resonancia para el ion nitrato (NO₃⁻)",
              "Explica qué es la resonancia y por qué algunas moléculas la presentan",
              "Dibuja las estructuras de resonancia para el benceno (C₆H₆)"
            ]
          },
          {
            "key": "polaridad_enlaces",
            "name": "Polaridad de Enlaces",
            "short_description": "Enlaces covalentes polares y no polares según la diferencia de electronegatividad.",
            "example_tasks": [
              "Explica la diferencia entre un enlace covalente polar y uno no polar",
              "Clasifica los siguientes enlaces como polares o no polares: H-H, H-Cl, C-O, Cl-Cl",
              "Indica la dirección del dipolo en el enlace H-F usando la notación δ+ y δ-"
            ]
          },
          {
            "key": "propiedades_compuestos_covalentes",
            "name": "Propiedades de Compuestos Covalentes",
            "short_description": "Características físicas y químicas de sustancias con enlaces covalentes.",
            "example_tasks": [
              "Enumera cinco propiedades típicas de los compuestos covalentes moleculares",
              "Explica por qué los compuestos covalentes tienen puntos de fusión más bajos que los iónicos",
              "Compara la solubilidad en agua de compuestos covalentes polares y no polares"
            ]
          }
        ]
      },
      {
        "key": "geometria_molecular",
        "name": "Geometría Molecular",
        "short_description": "Forma tridimensional de las moléculas según la teoría RPECV.",
        "sub_topics": [
          {
            "key": "teoria_rpecv",
            "name": "Teoría de Repulsión de Pares Electrónicos (RPECV)",
            "short_description": "Predicción de geometría molecular basada en la repulsión entre pares de electrones.",
            "example_tasks": [
              "Enuncia los principios básicos de la teoría RPECV",
              "Explica por qué los pares de electrones se repelen y cómo esto determina la geometría molecular",
              "Predice el ángulo de enlace en una molécula con geometría tetraédrica"
            ]
          },
          {
            "key": "geometrias_comunes",
            "name": "Geometrías Moleculares Comunes",
            "short_description": "Identificación de geometrías: lineal, angular, trigonal plana, tetraédrica, bipiramidal y octaédrica.",
            "example_tasks": [
              "Predice la geometría molecular del CO₂ y dibuja su estructura tridimensional",
              "Predice la geometría del amoníaco (NH₃) y explica por qué no es plana",
              "Compara la geometría del metano (CH₄) con la del agua (H₂O) y explica las diferencias"
            ]
          },
          {
            "key": "polaridad_molecular",
            "name": "Polaridad Molecular",
            "short_description": "Determinación de si una molécula es polar o no polar según su geometría y polaridad de enlaces.",
            "example_tasks": [
              "Explica por qué el CO₂ es no polar a pesar de tener enlaces polares",
              "Determina si las siguientes moléculas son polares o no polares: H₂O, CH₄, NH₃, CCl₄",
              "Dibuja la estructura del agua y muestra su momento dipolar resultante"
            ]
          }
        ]
      },
      {
        "key": "enlace_metalico",
        "name": "Enlace Metálico",
        "short_description": "Modelo del mar de electrones y propiedades características de los metales.",
        "sub_topics": [
          {
            "key": "teoria_enlace_metalico",
            "name": "Teoría del Mar de Electrones",
            "short_description": "Modelo de electrones deslocalizados en una red de cationes metálicos.",
            "example_tasks": [
              "Describe el modelo del mar de electrones para explicar el enlace metálico",
              "Explica cómo los electrones deslocalizados permiten la conducción eléctrica en metales",
              "Compara el enlace metálico con el enlace iónico y el covalente"
            ]
          },
          {
            "key": "propiedades_metales",
            "name": "Propiedades de los Metales",
            "short_description": "Explicación de conductividad, maleabilidad, ductilidad y brillo metálico.",
            "example_tasks": [
              "Explica a nivel molecular por qué los metales son buenos conductores de electricidad y calor",
              "Describe por qué los metales son maleables y dúctiles usando el modelo del enlace metálico",
              "Explica el origen del brillo metálico característico"
            ]
          },
          {
            "key": "aleaciones",
            "name": "Aleaciones",
            "short_description": "Mezclas de metales con propiedades modificadas para aplicaciones específicas.",
            "example_tasks": [
              "Define aleación y proporciona tres ejemplos comunes",
              "Explica por qué el acero es más duro que el hierro puro",
              "Describe una aleación importante en México (como el bronce en arte prehispánico) y sus propiedades"
            ]
          }
        ]
      },
      {
        "key": "fuerzas_intermoleculares",
        "name": "Fuerzas Intermoleculares",
        "short_description": "Interacciones entre moléculas que afectan propiedades físicas de las sustancias.",
        "sub_topics": [
          {
            "key": "fuerzas_london",
            "name": "Fuerzas de Dispersión de London",
            "short_description": "Fuerzas intermoleculares más débiles presentes en todas las sustancias moleculares.",
            "example_tasks": [
              "Explica cómo se originan las fuerzas de dispersión de London",
              "Describe por qué las fuerzas de London aumentan con el tamaño molecular",
              "Explica por qué el I₂ es sólido a temperatura ambiente mientras que el Cl₂ es gas"
            ]
          },
          {
            "key": "fuerzas_dipolo_dipolo",
            "name": "Fuerzas Dipolo-Dipolo",
            "short_description": "Interacciones electrostáticas entre moléculas polares.",
            "example_tasks": [
              "Explica qué son las fuerzas dipolo-dipolo y en qué tipo de moléculas se presentan",
              "Compara la intensidad de las fuerzas dipolo-dipolo con las fuerzas de London",
              "Explica por qué el punto de ebullición del HCl es mayor que el del Cl₂ a pesar de tener masas molares similares"
            ]
          },
          {
            "key": "puentes_hidrogeno",
            "name": "Puentes de Hidrógeno",
            "short_description": "Interacción especialmente fuerte entre H unido a F, O o N y pares de electrones de estos átomos.",
            "example_tasks": [
              "Explica qué es un puente de hidrógeno y por qué es más fuerte que otras fuerzas intermoleculares",
              "Dibuja los puentes de hidrógeno entre moléculas de agua",
              "Explica por qué el agua tiene un punto de ebullición anormalmente alto comparado con H₂S, H₂Se y H₂Te"
            ]
          },
          {
            "key": "propiedades_fuerzas_intermoleculares",
            "name": "Relación con Propiedades Físicas",
            "short_description": "Influencia de fuerzas intermoleculares en punto de fusión, ebullición, viscosidad y tensión superficial.",
            "example_tasks": [
              "Ordena las siguientes sustancias de menor a mayor punto de ebullición: CH₄, H₂O, NH₃, Ne",
              "Explica por qué el etanol (C₂H₅OH) es soluble en agua pero el hexano (C₆H₁₄) no lo es",
              "Relaciona la alta tensión superficial del agua con los puentes de hidrógeno"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "nomenclatura_quimica",
    "name": "Nomenclatura Química Inorgánica",
    "short_description": "Reglas de nomenclatura tradicional, Stock y sistemática de la IUPAC para compuestos binarios, ternarios y cuaternarios.",
    "sub_topics": [
      {
        "key": "fundamentos_nomenclatura",
        "name": "Fundamentos de Nomenclatura",
        "short_description": "Conceptos básicos, números de oxidación y sistemas de nomenclatura.",
        "sub_topics": [
          {
            "key": "numero_oxidacion",
            "name": "Número de Oxidación",
            "short_description": "Determinación del estado de oxidación de elementos en compuestos.",
            "example_tasks": [
              "Define número de oxidación y enuncia las reglas para asignarlo",
              "Determina el número de oxidación de cada elemento en H₂SO₄",
              "Calcula el número de oxidación del cromo en K₂Cr₂O₇"
            ]
          },
          {
            "key": "sistemas_nomenclatura",
            "name": "Sistemas de Nomenclatura",
            "short_description": "Nomenclatura tradicional, Stock y sistemática (IUPAC).",
            "example_tasks": [
              "Explica las diferencias entre los tres sistemas de nomenclatura química",
              "Nombra el Fe₂O₃ usando los tres sistemas de nomenclatura",
              "Indica cuándo es más apropiado usar cada sistema de nomenclatura"
            ]
          }
        ]
      },
      {
        "key": "compuestos_binarios",
        "name": "Compuestos Binarios",
        "short_description": "Nomenclatura de compuestos formados por dos elementos diferentes.",
        "sub_topics": [
          {
            "key": "oxidos_metalicos",
            "name": "Óxidos Metálicos",
            "short_description": "Compuestos binarios de oxígeno con metales.",
            "example_tasks": [
              "Nombra los siguientes óxidos metálicos usando nomenclatura Stock: CaO, Fe₂O₃, CuO",
              "Escribe la fórmula química del óxido de aluminio",
              "Nombra el Na₂O usando los tres sistemas de nomenclatura"
            ]
          },
          {
            "key": "oxidos_no_metalicos",
            "name": "Óxidos No Metálicos (Anhídridos)",
            "short_description": "Compuestos binarios de oxígeno con no metales.",
            "example_tasks": [
              "Nombra los siguientes óxidos no metálicos: CO₂, SO₃, N₂O₅",
              "Escribe la fórmula del trióxido de azufre",
              "Explica la diferencia en nomenclatura entre óxidos metálicos y no metálicos"
            ]
          },
          {
            "key": "hidruros_metalicos",
            "name": "Hidruros Metálicos",
            "short_description": "Compuestos binarios de hidrógeno con metales.",
            "example_tasks": [
              "Nombra los siguientes hidruros: NaH, CaH₂, AlH₃",
              "Escribe la fórmula del hidruro de litio",
              "Explica el número de oxidación del hidrógeno en los hidruros metálicos"
            ]
          },
          {
            "key": "hidruros_no_metalicos",
            "name": "Hidruros No Metálicos",
            "short_description": "Compuestos binarios de hidrógeno con no metales.",
            "example_tasks": [
              "Nombra los siguientes hidruros no metálicos: HCl, NH₃, H₂S",
              "Escribe la fórmula del metano y del agua como hidruros no metálicos",
              "Explica por qué algunos hidruros no metálicos tienen nombres comunes (como agua, amoníaco)"
            ]
          },
          {
            "key": "sales_binarias",
            "name": "Sales Binarias (Haluros)",
            "short_description": "Compuestos formados por un metal y un no metal (excepto oxígeno).",
            "example_tasks": [
              "Nombra las siguientes sales binarias: NaCl, FeCl₃, CuBr₂",
              "Escribe la fórmula del cloruro de calcio",
              "Nombra el KI usando nomenclatura tradicional y Stock"
            ]
          }
        ]
      },
      {
        "key": "compuestos_ternarios",
        "name": "Compuestos Ternarios",
        "short_description": "Nomenclatura de compuestos formados por tres elementos diferentes.",
        "sub_topics": [
          {
            "key": "hidroxidos",
            "name": "Hidróxidos",
            "short_description": "Compuestos ternarios que contienen el grupo OH⁻.",
            "example_tasks": [
              "Nombra los siguientes hidróxidos: NaOH, Ca(OH)₂, Fe(OH)₃",
              "Escribe la fórmula del hidróxido de aluminio",
              "Explica cómo se forma un hidróxido a partir de un óxido metálico"
            ]
          },
          {
            "key": "oxoacidos",
            "name": "Oxoácidos",
            "short_description": "Ácidos que contienen oxígeno en su estructura.",
            "example_tasks": [
              "Nombra los siguientes oxoácidos: H₂SO₄, HNO₃, H₃PO₄",
              "Escribe la fórmula del ácido carbónico",
              "Explica la diferencia entre ácido sulfúrico (H₂SO₄) y ácido sulfuroso (H₂SO₃)"
            ]
          },
          {
            "key": "oxisales",
            "name": "Oxisales",
            "short_description": "Sales formadas por metal, no metal y oxígeno, derivadas de oxoácidos.",
            "example_tasks": [
              "Nombra las siguientes oxisales: Na₂SO₄, KNO₃, CaCO₃",
              "Escribe la fórmula del sulfato de cobre (II)",
              "Relaciona el ácido sulfúrico con su sal correspondiente, el sulfato"
            ]
          },
          {
            "key": "sales_acidas",
            "name": "Sales Ácidas",
            "short_description": "Sales que contienen hidrógeno sustituible en su estructura.",
            "example_tasks": [
              "Nombra las siguientes sales ácidas: NaHCO₃, Ca(HCO₃)₂",
              "Escribe la fórmula del hidrogenosulfato de sodio",
              "Explica la diferencia entre Na₂CO₃ (carbonato de sodio) y NaHCO₃ (hidrogenocarbonato de sodio)"
            ]
          }
        ]
      },
      {
        "key": "nomenclatura_aplicada",
        "name": "Nomenclatura Aplicada",
        "short_description": "Práctica integral de nomenclatura con compuestos diversos.",
        "sub_topics": [
          {
            "key": "identificacion_compuestos",
            "name": "Identificación de Tipo de Compuesto",
            "short_description": "Clasificación de compuestos según su tipo a partir de fórmula o nombre.",
            "example_tasks": [
              "Clasifica los siguientes compuestos según su tipo: HCl, NaOH, CaCO₃, SO₂, MgCl₂",
              "Identifica qué tipo de compuesto es cada uno: ácido sulfúrico, óxido de calcio, cloruro de sodio",
              "Explica las diferencias estructurales entre un óxido, un hidróxido y un ácido"
            ]
          },
          {
            "key": "formulas_nombres",
            "name": "Conversión entre Fórmulas y Nombres",
            "short_description": "Traducción bidireccional entre nomenclatura y fórmula química.",
            "example_tasks": [
              "Escribe las fórmulas de: óxido de magnesio, ácido nítrico, sulfato de aluminio, hidróxido de potasio",
              "Nombra los siguientes compuestos: H₃PO₄, Cu(NO₃)₂, NH₄Cl, Ca(OH)₂, CO₂",
              "Corrige los errores en las siguientes fórmulas según el nombre: óxido de hierro (III) = FeO, cloruro de calcio = CaCl"
            ]
          },
          {
            "key": "nomenclatura_compuestos_comunes",
            "name": "Compuestos de Uso Cotidiano",
            "short_description": "Nomenclatura de sustancias químicas comunes en la vida diaria.",
            "example_tasks": [
              "Identifica el nombre químico y la fórmula de: sal de mesa, vinagre, soda cáustica, cal viva",
              "Explica qué compuesto químico es el bicarbonato de sodio y escribe su fórmula",
              "Investiga y nombra el compuesto activo en el polvo para hornear, blanqueador y antiácidos"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "reacciones_quimicas",
    "name": "Reacciones Químicas",
    "short_description": "Tipos de reacciones químicas, balanceo de ecuaciones, evidencias de cambio químico y leyes de conservación.",
    "sub_topics": [
      {
        "key": "ecuaciones_quimicas",
        "name": "Ecuaciones Químicas",
        "short_description": "Representación simbólica de reacciones químicas y sus componentes.",
        "sub_topics": [
          {
            "key": "componentes_ecuacion",
            "name": "Componentes de una Ecuación Química",
            "short_description": "Identificación de reactivos, productos, coeficientes y estados de agregación.",
            "example_tasks": [
              "Identifica los reactivos y productos en la ecuación: 2H₂ + O₂ → 2H₂O",
              "Explica qué significan los símbolos (s), (l), (g) y (ac) en una ecuación química",
              "Escribe la ecuación para la combustión del metano incluyendo estados de agregación"
            ]
          },
          {
            "key": "interpretacion_ecuaciones",
            "name": "Interpretación de Ecuaciones",
            "short_description": "Lectura e interpretación cualitativa y cuantitativa de ecuaciones químicas.",
            "example_tasks": [
              "Interpreta la ecuación N₂ + 3H₂ → 2NH₃ en términos de moléculas y moles",
              "Explica qué información proporciona una ecuación química balanceada",
              "Lee la ecuación 2Na + Cl₂ → 2NaCl y explica qué sucede a nivel molecular"
            ]
          },
          {
            "key": "ley_conservacion_masa",
            "name": "Ley de Conservación de la Masa",
            "short_description": "Aplicación de la ley de Lavoisier en reacciones químicas.",
            "example_tasks": [
              "Enuncia la Ley de Conservación de la Masa y explica su importancia en química",
              "Si 10 g de hidrógeno reaccionan con 80 g de oxígeno, ¿cuántos gramos de agua se forman?",
              "Explica por qué es necesario balancear las ecuaciones químicas usando la Ley de Conservación de la Masa"
            ]
          }
        ]
      },
      {
        "key": "balanceo_ecuaciones",
        "name": "Balanceo de Ecuaciones Químicas",
        "short_description": "Métodos para igualar el número de átomos en reactivos y productos.",
        "sub_topics": [
          {
            "key": "metodo_tanteo",
            "name": "Método de Tanteo",
            "short_description": "Balanceo por inspección ajustando coeficientes sistemáticamente.",
            "example_tasks": [
              "Balancea la siguiente ecuación por tanteo: Fe + O₂ → Fe₂O₃",
              "Balancea la ecuación: C₃H₈ + O₂ → CO₂ + H₂O",
              "Balancea la ecuación de combustión del etanol: C₂H₅OH + O₂ → CO₂ + H₂O"
            ]
          },
          {
            "key": "metodo_algebraico",
            "name": "Método Algebraico",
            "short_description": "Balanceo usando sistema de ecuaciones con variables para coeficientes.",
            "example_tasks": [
              "Balancea la ecuación usando el método algebraico: KClO₃ → KCl + O₂",
              "Explica paso a paso cómo aplicar el método algebraico para balancear ecuaciones",
              "Balancea por método algebraico: Fe₂O₃ + C → Fe + CO"
            ]
          },
          {
            "key": "balanceo_redox",
            "name": "Balanceo de Reacciones Redox",
            "short_description": "Balanceo de ecuaciones de oxidación-reducción por método del ion-electrón.",
            "example_tasks": [
              "Identifica qué elemento se oxida y cuál se reduce en: Zn + HCl → ZnCl₂ + H₂",
              "Balancea la ecuación redox en medio ácido: MnO₄⁻ + Fe²⁺ → Mn²⁺ + Fe³⁺",
              "Balancea la ecuación: Cu + HNO₃ → Cu(NO₃)₂ + NO + H₂O"
            ]
          }
        ]
      },
      {
        "key": "clasificacion_reacciones",
        "name": "Clasificación de Reacciones Químicas",
        "short_description": "Tipos de reacciones según el proceso que ocurre.",
        "sub_topics": [
          {
            "key": "sintesis",
            "name": "Reacciones de Síntesis o Combinación",
            "short_description": "Dos o más sustancias se combinan para formar un producto más complejo.",
            "example_tasks": [
              "Define reacción de síntesis y proporciona la forma general de este tipo de reacción",
              "Clasifica y completa la reacción: 2Mg + O₂ → ?",
              "Escribe la ecuación de síntesis del agua a partir de sus elementos"
            ]
          },
          {
            "key": "descomposicion",
            "name": "Reacciones de Descomposición",
            "short_description": "Un compuesto se divide en dos o más sustancias más simples.",
            "example_tasks": [
              "Define reacción de descomposición y proporciona su forma general",
              "Completa la reacción de descomposición: 2H₂O → ?",
              "Escribe la ecuación de descomposición del carbonato de calcio por calor"
            ]
          },
          {
            "key": "desplazamiento_simple",
            "name": "Reacciones de Desplazamiento Simple",
            "short_description": "Un elemento reemplaza a otro en un compuesto.",
            "example_tasks": [
              "Define reacción de desplazamiento simple y proporciona su forma general",
              "Predice si ocurrirá reacción entre zinc y sulfato de cobre (II), y escribe la ecuación",
              "Explica el uso de la serie de actividad de metales para predecir reacciones de desplazamiento"
            ]
          },
          {
            "key": "desplazamiento_doble",
            "name": "Reacciones de Desplazamiento Doble",
            "short_description": "Intercambio de iones entre dos compuestos.",
            "example_tasks": [
              "Define reacción de desplazamiento doble y proporciona su forma general",
              "Completa y balancea: AgNO₃ + NaCl → ?",
              "Predice los productos de la reacción entre HCl y NaOH"
            ]
          },
          {
            "key": "combustion",
            "name": "Reacciones de Combustión",
            "short_description": "Reacción rápida con oxígeno que libera energía en forma de luz y calor.",
            "example_tasks": [
              "Define reacción de combustión y menciona sus productos típicos",
              "Escribe la ecuación de combustión completa del propano (C₃H₈)",
              "Explica la diferencia entre combustión completa e incompleta del carbono"
            ]
          }
        ]
      },
      {
        "key": "evidencias_reacciones",
        "name": "Evidencias de Reacciones Químicas",
        "short_description": "Indicadores observables de que ha ocurrido una reacción química.",
        "sub_topics": [
          {
            "key": "cambios_observables",
            "name": "Cambios Físicos Observables",
            "short_description": "Manifestaciones visibles de reacciones químicas.",
            "example_tasks": [
              "Enumera cinco evidencias que indican que ha ocurrido una reacción química",
              "Describe qué observarías durante la reacción entre vinagre y bicarbonato de sodio",
              "Explica por qué el cambio de color puede ser evidencia de una reacción química"
            ]
          },
          {
            "key": "formacion_precipitados",
            "name": "Formación de Precipitados",
            "short_description": "Aparición de sólidos insolubles en reacciones en solución acuosa.",
            "example_tasks": [
              "Define precipitado y explica cómo se forma",
              "Predice si se formará un precipitado al mezclar soluciones de AgNO₃ y NaCl",
              "Describe un experimento donde se observe la formación de un precipitado"
            ]
          },
          {
            "key": "produccion_gases",
            "name": "Producción de Gases",
            "short_description": "Liberación de gases como evidencia de reacción química.",
            "example_tasks": [
              "Describe qué gas se produce en la reacción entre un metal y un ácido",
              "Explica cómo podrías detectar la producción de dióxido de carbono en una reacción",
              "Escribe una reacción que produzca gas oxígeno y describe cómo comprobar su presencia"
            ]
          },
          {
            "key": "cambios_energia",
            "name": "Cambios de Energía",
            "short_description": "Liberación o absorción de energía como indicador de reacción química.",
            "example_tasks": [
              "Explica la diferencia entre una reacción exotérmica y una endotérmica",
              "Proporciona dos ejemplos de reacciones exotérmicas de la vida cotidiana",
              "Describe qué sentirías al tocar el recipiente donde ocurre una reacción exotérmica"
            ]
          }
        ]
      },
      {
        "key": "velocidad_reaccion",
        "name": "Factores que Afectan la Velocidad de Reacción",
        "short_description": "Variables que modifican la rapidez con que ocurren las reacciones químicas.",
        "sub_topics": [
          {
            "key": "naturaleza_reactivos",
            "name": "Naturaleza de los Reactivos",
            "short_description": "Influencia de las propiedades químicas en la velocidad de reacción.",
            "example_tasks": [
              "Explica por qué algunos metales reaccionan más rápido que otros con ácidos",
              "Compara la velocidad de reacción del sodio y del hierro con agua",
              "Describe cómo la estructura química afecta la velocidad de reacción"
            ]
          },
          {
            "key": "concentracion",
            "name": "Concentración de Reactivos",
            "short_description": "Efecto de la cantidad de reactivos en la velocidad de reacción.",
            "example_tasks": [
              "Explica cómo afecta la concentración de reactivos a la velocidad de reacción",
              "Diseña un experimento para demostrar el efecto de la concentración en la velocidad de reacción",
              "Predice qué sucederá con la velocidad de reacción si duplicas la concentración de uno de los reactivos"
            ]
          },
          {
            "key": "temperatura",
            "name": "Temperatura",
            "short_description": "Influencia de la temperatura en la energía cinética y colisiones moleculares.",
            "example_tasks": [
              "Explica por qué aumentar la temperatura incrementa la velocidad de reacción",
              "Describe un ejemplo cotidiano donde la temperatura afecte la velocidad de una reacción",
              "Relaciona el concepto de energía de activación con el efecto de la temperatura"
            ]
          },
          {
            "key": "superficie_contacto",
            "name": "Superficie de Contacto",
            "short_description": "Efecto del área expuesta de reactivos sólidos en la velocidad.",
            "example_tasks": [
              "Explica por qué un sólido pulverizado reacciona más rápido que un sólido en bloque",
              "Compara la velocidad de reacción de una tableta efervescente entera versus triturada",
              "Diseña un experimento para demostrar el efecto de la superficie de contacto en la velocidad de reacción"
            ]
          },
          {
            "key": "catalizadores",
            "name": "Catalizadores",
            "short_description": "Sustancias que modifican la velocidad de reacción sin consumirse.",
            "example_tasks": [
              "Define catalizador y explica cómo funciona a nivel molecular",
              "Proporciona dos ejemplos de catalizadores en procesos industriales o biológicos",
              "Explica la diferencia entre un catalizador y un reactivo"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "estequiometria",
    "name": "Estequiometría",
    "short_description": "Cálculos cuantitativos en química basados en relaciones molares, concepto de mol, masa molar y relaciones entre masa, volumen y número de partículas.",
    "sub_topics": [
      {
        "key": "concepto_mol",
        "name": "El Concepto de Mol",
        "short_description": "Unidad fundamental para contar partículas en química.",
        "sub_topics": [
          {
            "key": "definicion_mol",
            "name": "Definición de Mol",
            "short_description": "Mol como cantidad de sustancia que contiene el número de Avogadro de partículas.",
            "example_tasks": [
              "Define mol y explica por qué es necesario en química",
              "Enuncia el valor del número de Avogadro y explica qué representa",
              "Calcula cuántos átomos hay en 2 moles de carbono"
            ]
          },
          {
            "key": "masa_molar",
            "name": "Masa Molar",
            "short_description": "Masa de un mol de sustancia expresada en g/mol.",
            "example_tasks": [
              "Calcula la masa molar del agua (H₂O)",
              "Determina la masa molar del sulfato de cobre (II) pentahidratado: CuSO₄·5H₂O",
              "Explica la relación entre masa atómica, masa molecular y masa molar"
            ]
          },
          {
            "key": "conversiones_mol",
            "name": "Conversiones con el Mol",
            "short_description": "Conversiones entre masa, moles y número de partículas.",
            "example_tasks": [
              "Convierte 50 g de NaCl a moles",
              "Calcula cuántas moléculas hay en 3 moles de CO₂",
              "Determina la masa de 1.5 × 10²⁴ moléculas de agua"
            ]
          },
          {
            "key": "composicion_porcentual",
            "name": "Composición Porcentual",
            "short_description": "Porcentaje en masa de cada elemento en un compuesto.",
            "example_tasks": [
              "Calcula el porcentaje de oxígeno en H₂O",
              "Determina la composición porcentual del dióxido de carbono (CO₂)",
              "Un compuesto contiene 40% de carbono, 6.7% de hidrógeno y 53.3% de oxígeno. Calcula su fórmula empírica"
            ]
          }
        ]
      },
      {
        "key": "formulas_quimicas",
        "name": "Fórmulas Químicas",
        "short_description": "Determinación de fórmulas empíricas y moleculares a partir de datos experimentales.",
        "sub_topics": [
          {
            "key": "formula_empirica",
            "name": "Fórmula Empírica",
            "short_description": "Proporción más simple de átomos en un compuesto.",
            "example_tasks": [
              "Define fórmula empírica y explica cómo difiere de la fórmula molecular",
              "Determina la fórmula empírica de un compuesto que contiene 40.0% C, 6.7% H y 53.3% O",
              "Calcula la fórmula empírica de un óxido de hierro que contiene 69.9% de Fe"
            ]
          },
          {
            "key": "formula_molecular",
            "name": "Fórmula Molecular",
            "short_description": "Número real de átomos de cada elemento en una molécula.",
            "example_tasks": [
              "Si la fórmula empírica de un compuesto es CH₂ y su masa molar es 42 g/mol, determina su fórmula molecular",
              "Explica la relación entre fórmula empírica y fórmula molecular",
              "La fórmula empírica de la glucosa es CH₂O y su masa molar es 180 g/mol. Encuentra su fórmula molecular"
            ]
          },
          {
            "key": "analisis_combustion",
            "name": "Análisis por Combustión",
            "short_description": "Determinación de fórmulas a partir de productos de combustión.",
            "example_tasks": [
              "Un compuesto orgánico se quema produciendo 4.4 g de CO₂ y 1.8 g de H₂O. Determina su fórmula empírica",
              "Explica cómo el análisis de combustión ayuda a determinar la composición de compuestos orgánicos",
              "Describe el procedimiento experimental para realizar un análisis por combustión"
            ]
          }
        ]
      },
      {
        "key": "calculos_estequiometricos",
        "name": "Cálculos Estequiométricos",
        "short_description": "Cálculos cuantitativos basados en ecuaciones químicas balanceadas.",
        "sub_topics": [
          {
            "key": "relaciones_molares",
            "name": "Relaciones Molares",
            "short_description": "Uso de coeficientes en ecuaciones para relacionar cantidades de sustancias.",
            "example_tasks": [
              "En la reacción N₂ + 3H₂ → 2NH₃, ¿cuántos moles de NH₃ se producen a partir de 5 moles de H₂?",
              "Explica cómo los coeficientes de una ecuación balanceada representan relaciones molares",
              "Determina la relación molar entre reactivos y productos en: 2C₄H₁₀ + 13O₂ → 8CO₂ + 10H₂O"
            ]
          },
          {
            "key": "masa_masa",
            "name": "Cálculos Masa-Masa",
            "short_description": "Determinación de masa de productos a partir de masa de reactivos.",
            "example_tasks": [
              "¿Cuántos gramos de H₂O se producen al quemar completamente 10 g de H₂?",
              "En la reacción 2Na + Cl₂ → 2NaCl, calcula cuántos gramos de NaCl se forman con 23 g de Na",
              "Si reaccionan 50 g de CaCO₃ según: CaCO₃ → CaO + CO₂, calcula la masa de CaO producido"
            ]
          },
          {
            "key": "reactivo_limitante",
            "name": "Reactivo Limitante",
            "short_description": "Identificación del reactivo que se consume completamente y limita la cantidad de producto.",
            "example_tasks": [
              "Define reactivo limitante y reactivo en exceso",
              "En la reacción N₂ + 3H₂ → 2NH₃, si hay 10 g de N₂ y 10 g de H₂, identifica el reactivo limitante",
              "Calcula cuántos gramos de NH₃ se forman cuando 5 moles de N₂ reaccionan con 10 moles de H₂"
            ]
          },
          {
            "key": "rendimiento_reaccion",
            "name": "Rendimiento de Reacción",
            "short_description": "Rendimiento teórico, real y porcentual en reacciones químicas.",
            "example_tasks": [
              "Define rendimiento teórico, rendimiento real y rendimiento porcentual",
              "Si el rendimiento teórico es 50 g y se obtienen 40 g de producto, calcula el rendimiento porcentual",
              "Explica por qué el rendimiento real es generalmente menor que el teórico"
            ]
          },
          {
            "key": "pureza_reactivos",
            "name": "Pureza de Reactivos",
            "short_description": "Cálculos considerando la pureza de las sustancias químicas.",
            "example_tasks": [
              "Una muestra de NaCl tiene 95% de pureza. ¿Cuántos gramos de muestra se necesitan para obtener 50 g de NaCl puro?",
              "Calcula cuántos gramos de O₂ puro se producen al descomponer 100 g de KClO₃ con 80% de pureza",
              "Explica por qué es importante considerar la pureza en cálculos estequiométricos industriales"
            ]
          }
        ]
      },
      {
        "key": "estequiometria_soluciones",
        "name": "Estequiometría en Soluciones",
        "short_description": "Cálculos en reacciones que ocurren en solución acuosa.",
        "sub_topics": [
          {
            "key": "molaridad_calculos",
            "name": "Cálculos con Molaridad",
            "short_description": "Uso de concentración molar en cálculos estequiométricos.",
            "example_tasks": [
              "¿Cuántos moles de HCl hay en 250 mL de una solución 2.0 M?",
              "Calcula el volumen de H₂SO₄ 0.5 M necesario para neutralizar 50 mL de NaOH 1.0 M",
              "Determina la molaridad de una solución si 25 mL reaccionan completamente con 30 mL de KOH 0.8 M"
            ]
          },
          {
            "key": "diluciones",
            "name": "Diluciones",
            "short_description": "Preparación de soluciones menos concentradas a partir de soluciones concentradas.",
            "example_tasks": [
              "Explica el proceso de dilución y la ecuación M₁V₁ = M₂V₂",
              "¿Qué volumen de HCl 12 M se necesita para preparar 500 mL de HCl 2.0 M?",
              "Describe el procedimiento correcto para diluir un ácido concentrado de forma segura"
            ]
          },
          {
            "key": "titulaciones",
            "name": "Titulaciones Ácido-Base",
            "short_description": "Determinación de concentración mediante reacciones de neutralización.",
            "example_tasks": [
              "Define titulación y describe sus componentes (titulante, analito, punto de equivalencia)",
              "En una titulación, 25 mL de HCl reaccionan con 30 mL de NaOH 0.5 M. Calcula la concentración del HCl",
              "Explica cómo seleccionar el indicador apropiado para una titulación ácido-base"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "estados_agregacion",
    "name": "Estados de Agregación de la Materia",
    "short_description": "Propiedades de sólidos, líquidos y gases, teoría cinética molecular y cambios de estado.",
    "sub_topics": [
      {
        "key": "teoria_cinetica",
        "name": "Teoría Cinético-Molecular",
        "short_description": "Modelo que explica el comportamiento de la materia basado en el movimiento de partículas.",
        "sub_topics": [
          {
            "key": "postulados_teoria",
            "name": "Postulados de la Teoría Cinética",
            "short_description": "Principios fundamentales sobre partículas, movimiento y energía.",
            "example_tasks": [
              "Enumera los cinco postulados principales de la teoría cinético-molecular",
              "Explica cómo la teoría cinética relaciona temperatura con energía cinética promedio",
              "Describe qué sucede a nivel molecular cuando aumenta la temperatura de un gas"
            ]
          },
          {
            "key": "interpretacion_estados",
            "name": "Interpretación de Estados de Agregación",
            "short_description": "Explicación de propiedades macroscópicas usando el modelo cinético.",
            "example_tasks": [
              "Usa la teoría cinética para explicar por qué los gases son compresibles",
              "Explica a nivel molecular por qué los líquidos tienen volumen definido pero no forma definida",
              "Describe las diferencias en movimiento y orden de partículas en sólidos, líquidos y gases"
            ]
          },
          {
            "key": "energia_cinetica_temperatura",
            "name": "Energía Cinética y Temperatura",
            "short_description": "Relación entre temperatura absoluta y energía cinética promedio de partículas.",
            "example_tasks": [
              "Explica por qué la temperatura es una medida de la energía cinética promedio",
              "Describe qué sucede con el movimiento molecular cuando la temperatura se acerca al cero absoluto",
              "Compara la energía cinética de moléculas de agua a 25°C y a 100°C"
            ]
          }
        ]
      },
      {
        "key": "estado_solido",
        "name": "Estado Sólido",
        "short_description": "Características y tipos de sólidos según su estructura.",
        "sub_topics": [
          {
            "key": "propiedades_solidos",
            "name": "Propiedades de los Sólidos",
            "short_description": "Características generales: forma y volumen definidos, incompresibilidad.",
            "example_tasks": [
              "Enumera cinco propiedades características del estado sólido",
              "Explica a nivel molecular por qué los sólidos tienen forma definida",
              "Describe cómo las fuerzas intermoleculares afectan las propiedades de los sólidos"
            ]
          },
          {
            "key": "solidos_cristalinos",
            "name": "Sólidos Cristalinos",
            "short_description": "Sólidos con estructura ordenada y puntos de fusión definidos.",
            "example_tasks": [
              "Define sólido cristalino y describe su estructura interna",
              "Clasifica los siguientes como sólidos cristalinos o amorfos: diamante, vidrio, sal, plástico",
              "Explica por qué los sólidos cristalinos tienen puntos de fusión definidos"
            ]
          },
          {
            "key": "solidos_amorfos",
            "name": "Sólidos Amorfos",
            "short_description": "Sólidos sin estructura ordenada y fusión gradual.",
            "example_tasks": [
              "Define sólido amorfo y proporciona tres ejemplos",
              "Explica por qué el vidrio es considerado un líquido superenfriado",
              "Compara las propiedades de un sólido cristalino con un sólido amorfo"
            ]
          },
          {
            "key": "tipos_cristales",
            "name": "Tipos de Cristales",
            "short_description": "Cristales iónicos, moleculares, covalentes y metálicos.",
            "example_tasks": [
              "Describe las características de los cristales iónicos y proporciona dos ejemplos",
              "Compara las propiedades de los cristales moleculares con los cristales covalentes",
              "Explica por qué el diamante es tan duro usando conceptos de estructura cristalina"
            ]
          }
        ]
      },
      {
        "key": "estado_liquido",
        "name": "Estado Líquido",
        "short_description": "Propiedades de líquidos, tensión superficial, viscosidad y capilaridad.",
        "sub_topics": [
          {
            "key": "propiedades_liquidos",
            "name": "Propiedades Generales de los Líquidos",
            "short_description": "Volumen definido, forma variable, fluidez.",
            "example_tasks": [
              "Enumera cinco propiedades que distinguen a los líquidos de sólidos y gases",
              "Explica a nivel molecular por qué los líquidos fluyen",
              "Describe el balance entre fuerzas intermoleculares y energía cinética en líquidos"
            ]
          },
          {
            "key": "tension_superficial",
            "name": "Tensión Superficial",
            "short_description": "Tendencia de la superficie líquida a contraerse debido a fuerzas intermoleculares.",
            "example_tasks": [
              "Define tensión superficial y explica su origen a nivel molecular",
              "Explica por qué algunos insectos pueden caminar sobre el agua",
              "Describe un experimento para demostrar la tensión superficial del agua"
            ]
          },
          {
            "key": "viscosidad",
            "name": "Viscosidad",
            "short_description": "Resistencia de un líquido a fluir.",
            "example_tasks": [
              "Define viscosidad y menciona qué factores la afectan",
              "Ordena los siguientes líquidos de menor a mayor viscosidad: agua, miel, aceite, alcohol",
              "Explica por qué la viscosidad disminuye al aumentar la temperatura"
            ]
          },
          {
            "key": "capilaridad",
            "name": "Capilaridad",
            "short_description": "Ascenso o descenso de líquidos en tubos capilares.",
            "example_tasks": [
              "Define capilaridad y explica cómo ocurre",
              "Describe cómo la capilaridad permite que las plantas transporten agua",
              "Explica la diferencia entre adhesión y cohesión en el contexto de la capilaridad"
            ]
          },
          {
            "key": "presion_vapor",
            "name": "Presión de Vapor",
            "short_description": "Presión ejercida por el vapor en equilibrio con su líquido.",
            "example_tasks": [
              "Define presión de vapor y explica cómo se relaciona con la volatilidad",
              "Explica por qué la presión de vapor aumenta con la temperatura",
              "Compara la presión de vapor del agua, alcohol y acetona a temperatura ambiente"
            ]
          }
        ]
      },
      {
        "key": "estado_gaseoso",
        "name": "Estado Gaseoso",
        "short_description": "Propiedades de gases, variables de estado y comportamiento molecular.",
        "sub_topics": [
          {
            "key": "propiedades_gases",
            "name": "Propiedades de los Gases",
            "short_description": "Expansión, compresibilidad, difusión y efusión.",
            "example_tasks": [
              "Enumera y explica cinco propiedades características de los gases",
              "Explica por qué los gases son altamente compresibles",
              "Describe el fenómeno de difusión con un ejemplo cotidiano"
            ]
          },
          {
            "key": "variables_estado",
            "name": "Variables de Estado de un Gas",
            "short_description": "Presión, volumen, temperatura y cantidad de sustancia.",
            "example_tasks": [
              "Define las cuatro variables de estado que describen un gas",
              "Explica cómo se mide la presión de un gas y menciona tres unidades comunes",
              "Convierte 1 atm a mmHg, kPa y torr"
            ]
          },
          {
            "key": "condiciones_normales",
            "name": "Condiciones Normales (CN o TPN)",
            "short_description": "Condiciones estándar de temperatura y presión para gases.",
            "example_tasks": [
              "Define condiciones normales (CN) y condiciones estándar (CNPT)",
              "Indica la temperatura y presión en condiciones normales",
              "Calcula el volumen que ocupa 1 mol de cualquier gas en CN"
            ]
          }
        ]
      },
      {
        "key": "cambios_estado",
        "name": "Cambios de Estado",
        "short_description": "Transformaciones entre estados de agregación y energía involucrada.",
        "sub_topics": [
          {
            "key": "tipos_cambios_estado",
            "name": "Tipos de Cambios de Estado",
            "short_description": "Fusión, solidificación, vaporización, condensación, sublimación y deposición.",
            "example_tasks": [
              "Define los seis cambios de estado y dibuja un diagrama que los relacione",
              "Clasifica los siguientes procesos: formación de escarcha, hervir agua, derretir hielo, formar hielo seco",
              "Explica qué cambios de estado son endotérmicos y cuáles exotérmicos"
            ]
          },
          {
            "key": "curvas_calentamiento",
            "name": "Curvas de Calentamiento y Enfriamiento",
            "short_description": "Gráficas de temperatura vs. tiempo durante cambios de estado.",
            "example_tasks": [
              "Dibuja e interpreta una curva de calentamiento del agua desde -20°C hasta 120°C",
              "Explica por qué la temperatura permanece constante durante los cambios de estado",
              "Identifica en una curva de calentamiento las regiones donde hay un solo estado y donde coexisten dos estados"
            ]
          },
          {
            "key": "calor_latente",
            "name": "Calor Latente",
            "short_description": "Energía necesaria para cambios de estado sin cambio de temperatura.",
            "example_tasks": [
              "Define calor latente de fusión y calor latente de vaporización",
              "Explica por qué se necesita más energía para vaporizar agua que para fundirla",
              "Calcula la energía necesaria para convertir 50 g de hielo a 0°C en agua a 0°C (calor de fusión del agua = 334 J/g)"
            ]
          },
          {
            "key": "punto_fusion_ebullicion",
            "name": "Puntos de Fusión y Ebullición",
            "short_description": "Temperaturas características donde ocurren cambios de estado.",
            "example_tasks": [
              "Define punto de fusión y punto de ebullición",
              "Explica cómo las fuerzas intermoleculares afectan los puntos de fusión y ebullición",
              "Ordena las siguientes sustancias de menor a mayor punto de ebullición: H₂O, CH₄, NH₃"
            ]
          },
          {
            "key": "equilibrio_fases",
            "name": "Equilibrio entre Fases",
            "short_description": "Coexistencia dinámica de dos estados de agregación.",
            "example_tasks": [
              "Explica qué es el equilibrio dinámico entre líquido y vapor",
              "Describe qué sucede en un recipiente cerrado con agua a nivel molecular",
              "Define punto triple y punto crítico usando el diagrama de fases del agua"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "leyes_gases",
    "name": "Leyes de los Gases",
    "short_description": "Relaciones cuantitativas entre variables de estado en gases: leyes de Boyle, Charles, Gay-Lussac, Avogadro y ley de gas ideal.",
    "sub_topics": [
      {
        "key": "ley_boyle",
        "name": "Ley de Boyle",
        "short_description": "Relación inversa entre presión y volumen a temperatura constante.",
        "sub_topics": [
          {
            "key": "enunciado_boyle",
            "name": "Enunciado y Expresión Matemática",
            "short_description": "P₁V₁ = P₂V₂ cuando T y n son constantes.",
            "example_tasks": [
              "Enuncia la ley de Boyle y escribe su expresión matemática",
              "Un gas ocupa 5.0 L a 2.0 atm. Calcula su volumen a 1.0 atm si la temperatura permanece constante",
              "Explica por qué la presión aumenta cuando se comprime un gas"
            ]
          },
          {
            "key": "aplicaciones_boyle",
            "name": "Aplicaciones de la Ley de Boyle",
            "short_description": "Ejemplos prácticos de la relación presión-volumen.",
            "example_tasks": [
              "Explica cómo funciona una jeringa usando la ley de Boyle",
              "Describe qué le sucede a un globo cuando se sumerge en agua profunda",
              "Explica el funcionamiento del sistema respiratorio humano usando la ley de Boyle"
            ]
          },
          {
            "key": "grafica_boyle",
            "name": "Representación Gráfica",
            "short_description": "Gráfica de presión vs. volumen (hipérbola).",
            "example_tasks": [
              "Dibuja la gráfica P vs V para la ley de Boyle",
              "Explica qué tipo de relación muestra la gráfica (proporcional, inversamente proporcional)",
              "Interpreta una gráfica P vs 1/V y explica su linealidad"
            ]
          }
        ]
      },
      {
        "key": "ley_charles",
        "name": "Ley de Charles",
        "short_description": "Relación directa entre volumen y temperatura absoluta a presión constante.",
        "sub_topics": [
          {
            "key": "enunciado_charles",
            "name": "Enunciado y Expresión Matemática",
            "short_description": "V₁/T₁ = V₂/T₂ cuando P y n son constantes.",
            "example_tasks": [
              "Enuncia la ley de Charles y escribe su expresión matemática",
              "Un gas ocupa 3.0 L a 300 K. Calcula su volumen a 400 K si la presión permanece constante",
              "Explica por qué la temperatura debe estar en escala absoluta (Kelvin) para usar esta ley"
            ]
          },
          {
            "key": "aplicaciones_charles",
            "name": "Aplicaciones de la Ley de Charles",
            "short_description": "Ejemplos cotidianos de la relación volumen-temperatura.",
            "example_tasks": [
              "Explica por qué un globo se infla cuando se calienta",
              "Describe qué sucede con el volumen de una llanta de coche en un día caluroso versus frío",
              "Explica el funcionamiento de un globo aerostático usando la ley de Charles"
            ]
          },
          {
            "key": "cero_absoluto",
            "name": "Concepto de Cero Absoluto",
            "short_description": "Temperatura mínima teórica donde el volumen de un gas ideal sería cero.",
            "example_tasks": [
              "Explica qué es el cero absoluto y su valor en Kelvin y Celsius",
              "Usa la ley de Charles para explicar por qué existe una temperatura mínima absoluta",
              "Describe qué sucede con el movimiento molecular al acercarse al cero absoluto"
            ]
          }
        ]
      },
      {
        "key": "ley_gay_lussac",
        "name": "Ley de Gay-Lussac",
        "short_description": "Relación directa entre presión y temperatura absoluta a volumen constante.",
        "sub_topics": [
          {
            "key": "enunciado_gay_lussac",
            "name": "Enunciado y Expresión Matemática",
            "short_description": "P₁/T₁ = P₂/T₂ cuando V y n son constantes.",
            "example_tasks": [
              "Enuncia la ley de Gay-Lussac y escribe su expresión matemática",
              "Un gas en un recipiente rígido tiene presión de 1.5 atm a 300 K. Calcula su presión a 450 K",
              "Explica por qué la presión aumenta cuando se calienta un gas en un recipiente cerrado"
            ]
          },
          {
            "key": "aplicaciones_gay_lussac",
            "name": "Aplicaciones de la Ley de Gay-Lussac",
            "short_description": "Ejemplos prácticos de la relación presión-temperatura.",
            "example_tasks": [
              "Explica por qué las latas de aerosol tienen advertencias sobre no exponerlas al calor",
              "Describe qué sucede con la presión de un neumático cuando se calienta por fricción",
              "Explica el riesgo de explosión de recipientes cerrados al calentarlos"
            ]
          }
        ]
      },
      {
        "key": "ley_avogadro",
        "name": "Ley de Avogadro",
        "short_description": "Relación directa entre volumen y número de moles a temperatura y presión constantes.",
        "sub_topics": [
          {
            "key": "enunciado_avogadro",
            "name": "Enunciado y Expresión Matemática",
            "short_description": "V₁/n₁ = V₂/n₂ cuando P y T son constantes.",
            "example_tasks": [
              "Enuncia la ley de Avogadro y escribe su expresión matemática",
              "Si 2 moles de un gas ocupan 44.8 L en CN, ¿qué volumen ocuparán 5 moles?",
              "Explica por qué volúmenes iguales de gases diferentes contienen el mismo número de moléculas a igual T y P"
            ]
          },
          {
            "key": "volumen_molar",
            "name": "Volumen Molar",
            "short_description": "Volumen ocupado por un mol de gas en condiciones normales (22.4 L).",
            "example_tasks": [
              "Define volumen molar y menciona su valor en condiciones normales",
              "Calcula cuántos moles de gas hay en 67.2 L en condiciones normales",
              "Explica por qué todos los gases tienen el mismo volumen molar en CN"
            ]
          }
        ]
      },
      {
        "key": "ley_combinada_gases",
        "name": "Ley Combinada de los Gases",
        "short_description": "Combinación de las leyes de Boyle, Charles y Gay-Lussac.",
        "sub_topics": [
          {
            "key": "ecuacion_combinada",
            "name": "Ecuación de la Ley Combinada",
            "short_description": "P₁V₁/T₁ = P₂V₂/T₂ cuando n es constante.",
            "example_tasks": [
              "Escribe la ecuación de la ley combinada de los gases",
              "Un gas ocupa 5.0 L a 2.0 atm y 300 K. Calcula su volumen a 1.5 atm y 400 K",
              "Explica cómo la ley combinada incluye las tres leyes anteriores como casos especiales"
            ]
          },
          {
            "key": "problemas_ley_combinada",
            "name": "Resolución de Problemas",
            "short_description": "Aplicación de la ley combinada a situaciones con múltiples variables cambiantes.",
            "example_tasks": [
              "Un globo con 3.0 L de helio a 25°C y 1.0 atm sube a una altura donde P = 0.5 atm y T = -10°C. Calcula su nuevo volumen",
              "Determina la presión final de un gas que pasa de 10 L, 2 atm y 300 K a 5 L y 400 K",
              "Identifica qué ley simple aplicarías si solo cambia una variable y cuál permanece constante"
            ]
          }
        ]
      },
      {
        "key": "ley_gas_ideal",
        "name": "Ley del Gas Ideal",
        "short_description": "Ecuación de estado que relaciona todas las variables: PV = nRT.",
        "sub_topics": [
          {
            "key": "ecuacion_gas_ideal",
            "name": "Ecuación del Gas Ideal",
            "short_description": "PV = nRT y significado de la constante universal R.",
            "example_tasks": [
              "Escribe la ecuación del gas ideal e identifica cada variable",
              "Menciona tres valores comunes de R con sus unidades correspondientes",
              "Calcula el volumen de 2 moles de gas a 1 atm y 273 K usando PV = nRT"
            ]
          },
          {
            "key": "calculos_gas_ideal",
            "name": "Cálculos con la Ley del Gas Ideal",
            "short_description": "Determinación de cualquier variable conociendo las otras tres.",
            "example_tasks": [
              "Calcula la presión de 3 moles de gas que ocupan 10 L a 300 K",
              "Determina cuántos moles de gas hay en un recipiente de 5 L a 2 atm y 400 K",
              "Calcula la temperatura de un gas si 0.5 moles ocupan 12 L a 1.5 atm"
            ]
          },
          {
            "key": "densidad_masa_molar",
            "name": "Densidad y Masa Molar de Gases",
            "short_description": "Uso de PV = nRT para calcular densidad y masa molar.",
            "example_tasks": [
              "Deriva la ecuación para calcular densidad de un gas: d = PM/RT",
              "Calcula la densidad del CO₂ a 25°C y 1 atm",
              "Determina la masa molar de un gas si su densidad es 1.96 g/L a CN"
            ]
          },
          {
            "key": "limitaciones_gas_ideal",
            "name": "Limitaciones del Modelo de Gas Ideal",
            "short_description": "Desviaciones a alta presión y baja temperatura.",
            "example_tasks": [
              "Enumera las suposiciones del modelo de gas ideal",
              "Explica por qué los gases reales se desvían del comportamiento ideal a alta presión",
              "Describe en qué condiciones un gas real se comporta más como gas ideal"
            ]
          }
        ]
      },
      {
        "key": "mezclas_gaseosas",
        "name": "Mezclas de Gases",
        "short_description": "Ley de Dalton de las presiones parciales y composición de mezclas gaseosas.",
        "sub_topics": [
          {
            "key": "ley_dalton",
            "name": "Ley de Dalton de las Presiones Parciales",
            "short_description": "La presión total es la suma de las presiones parciales de cada gas.",
            "example_tasks": [
              "Enuncia la ley de Dalton de las presiones parciales",
              "Una mezcla contiene N₂ a 0.5 atm, O₂ a 0.3 atm y CO₂ a 0.2 atm. Calcula la presión total",
              "Explica qué es la presión parcial y cómo se relaciona con la presión total"
            ]
          },
          {
            "key": "fraccion_molar",
            "name": "Fracción Molar",
            "short_description": "Proporción de moles de un gas en una mezcla.",
            "example_tasks": [
              "Define fracción molar y explica cómo se calcula",
              "Una mezcla contiene 2 moles de H₂ y 3 moles de N₂. Calcula la fracción molar de cada gas",
              "Si la presión total es 2 atm y la fracción molar del O₂ es 0.3, calcula su presión parcial"
            ]
          },
          {
            "key": "recoleccion_agua",
            "name": "Recolección de Gases sobre Agua",
            "short_description": "Consideración de la presión de vapor del agua en la recolección de gases.",
            "example_tasks": [
              "Explica el método de recolección de gases sobre agua",
              "Un gas se recolecta sobre agua a 25°C y presión total de 750 mmHg. Si la presión de vapor del agua es 24 mmHg, calcula la presión del gas",
              "Describe por qué es necesario corregir la presión cuando se recolecta un gas sobre agua"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "teoria_cinetica_molecular",
    "name": "Teoría Cinético-Molecular y Comportamiento de Gases",
    "short_description": "Interpretación microscópica del comportamiento de gases, distribución de velocidades moleculares y gases reales.",
    "sub_topics": [
      {
        "key": "distribucion_velocidades",
        "name": "Distribución de Velocidades Moleculares",
        "short_description": "Distribución de Maxwell-Boltzmann y velocidades moleculares.",
        "sub_topics": [
          {
            "key": "velocidades_moleculares",
            "name": "Tipos de Velocidades Moleculares",
            "short_description": "Velocidad promedio, más probable y cuadrática media.",
            "example_tasks": [
              "Explica qué representa la distribución de Maxwell-Boltzmann",
              "Describe cómo cambia la distribución de velocidades al aumentar la temperatura",
              "Explica por qué no todas las moléculas en un gas tienen la misma velocidad"
            ]
          },
          {
            "key": "energia_cinetica_temperatura",
            "name": "Energía Cinética y Temperatura",
            "short_description": "Relación cuantitativa entre temperatura absoluta y energía cinética promedio.",
            "example_tasks": [
              "Escribe la ecuación que relaciona energía cinética promedio con temperatura: KE = (3/2)kT",
              "Explica por qué al duplicar la temperatura no se duplica la velocidad molecular",
              "Compara la energía cinética promedio de moléculas de N₂ y O₂ a la misma temperatura"
            ]
          }
        ]
      },
      {
        "key": "difusion_efusion",
        "name": "Difusión y Efusión de Gases",
        "short_description": "Movimiento de moléculas gaseosas y ley de Graham.",
        "sub_topics": [
          {
            "key": "difusion_gases",
            "name": "Difusión",
            "short_description": "Mezcla espontánea de gases debido al movimiento molecular.",
            "example_tasks": [
              "Define difusión y proporciona un ejemplo cotidiano",
              "Explica por qué la difusión es más rápida a temperaturas altas",
              "Describe qué factores afectan la velocidad de difusión de un gas"
            ]
          },
          {
            "key": "efusion_gases",
            "name": "Efusión",
            "short_description": "Escape de gas a través de un orificio pequeño.",
            "example_tasks": [
              "Define efusión y explica en qué difiere de la difusión",
              "Describe un ejemplo práctico de efusión",
              "Explica por qué un globo de helio se desinfla más rápido que uno de aire"
            ]
          },
          {
            "key": "ley_graham",
            "name": "Ley de Graham",
            "short_description": "Relación entre velocidad de efusión/difusión y masa molar.",
            "example_tasks": [
              "Enuncia la ley de Graham y escribe su expresión matemática",
              "Compara las velocidades de efusión del H₂ y del O₂",
              "Calcula la relación de velocidades de difusión entre CH₄ y CO₂"
            ]
          }
        ]
      },
      {
        "key": "gases_reales",
        "name": "Gases Reales",
        "short_description": "Desviaciones del comportamiento ideal y ecuación de Van der Waals.",
        "sub_topics": [
          {
            "key": "desviaciones_idealidad",
            "name": "Desviaciones del Comportamiento Ideal",
            "short_description": "Condiciones donde los gases reales no siguen PV = nRT.",
            "example_tasks": [
              "Explica en qué condiciones un gas real se desvía más del comportamiento ideal",
              "Describe las dos suposiciones del modelo de gas ideal que fallan en gases reales",
              "Compara el factor de compresibilidad (Z) para gases ideales y reales"
            ]
          },
          {
            "key": "ecuacion_van_der_waals",
            "name": "Ecuación de Van der Waals",
            "short_description": "Correcciones por volumen molecular y fuerzas intermoleculares.",
            "example_tasks": [
              "Escribe la ecuación de Van der Waals e identifica qué representa cada término de corrección",
              "Explica por qué se debe corregir la presión y el volumen en gases reales",
              "Describe qué representan las constantes 'a' y 'b' en la ecuación de Van der Waals"
            ]
          },
          {
            "key": "licuefaccion_gases",
            "name": "Licuefacción de Gases",
            "short_description": "Conversión de gas a líquido mediante enfriamiento y compresión.",
            "example_tasks": [
              "Explica el proceso de licuefacción de gases",
              "Define temperatura crítica y presión crítica",
              "Describe por qué algunos gases son más fáciles de licuar que otros"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "soluciones",
    "name": "Soluciones y Concentración",
    "short_description": "Tipos de soluciones, proceso de disolución, factores que afectan la solubilidad y expresiones cuantitativas de concentración.",
    "sub_topics": [
      {
        "key": "componentes_soluciones",
        "name": "Componentes de las Soluciones",
        "short_description": "Identificación de soluto, solvente y características de soluciones.",
        "sub_topics": [
          {
            "key": "soluto_solvente",
            "name": "Soluto y Solvente",
            "short_description": "Definición y diferenciación entre el componente que se disuelve y el medio dispersante.",
            "example_tasks": [
              "Define soluto y solvente, e identifícalos en una solución de azúcar en agua",
              "Explica cómo identificar cuál componente es el solvente cuando ambos son líquidos",
              "Clasifica los componentes en las siguientes soluciones: agua salada, bronce (Cu-Sn), aire"
            ]
          },
          {
            "key": "tipos_soluciones",
            "name": "Tipos de Soluciones",
            "short_description": "Clasificación según el estado físico del soluto y solvente.",
            "example_tasks": [
              "Clasifica las soluciones según los estados de agregación de soluto y solvente (9 tipos posibles)",
              "Proporciona ejemplos de soluciones sólido-líquido, líquido-líquido y gas-líquido",
              "Describe ejemplos de soluciones sólidas (aleaciones) y gaseosas (aire)"
            ]
          },
          {
            "key": "caracteristicas_soluciones",
            "name": "Características de las Soluciones",
            "short_description": "Propiedades que distinguen a las soluciones verdaderas de coloides y suspensiones.",
            "example_tasks": [
              "Enumera cinco características de las soluciones verdaderas",
              "Compara soluciones, coloides y suspensiones en términos de tamaño de partícula y estabilidad",
              "Explica por qué las soluciones no sedimentan y son transparentes"
            ]
          }
        ]
      },
      {
        "key": "proceso_disolucion",
        "name": "Proceso de Disolución",
        "short_description": "Mecanismo molecular de disolución y factores energéticos involucrados.",
        "sub_topics": [
          {
            "key": "mecanismo_molecular",
            "name": "Mecanismo de Disolución a Nivel Molecular",
            "short_description": "Interacciones soluto-solvente y proceso de solvatación/hidratación.",
            "example_tasks": [
              "Describe el proceso de disolución del NaCl en agua a nivel molecular",
              "Explica qué es la hidratación de iones con un ejemplo",
              "Dibuja un esquema mostrando cómo las moléculas de agua rodean a un ion en solución"
            ]
          },
          {
            "key": "polaridad_solubilidad",
            "name": "Polaridad y Regla 'Lo Similar Disuelve lo Similar'",
            "short_description": "Relación entre polaridad del soluto y solvente para predecir solubilidad.",
            "example_tasks": [
              "Explica la regla 'lo similar disuelve lo similar' usando conceptos de polaridad",
              "Predice si el yodo (I₂) será más soluble en agua o en hexano, y justifica tu respuesta",
              "Explica por qué el etanol es soluble en agua pero el hexano no lo es"
            ]
          },
          {
            "key": "energia_disolucion",
            "name": "Energía de Disolución",
            "short_description": "Cambios energéticos: energía reticular, de solvatación y de disolución.",
            "example_tasks": [
              "Describe los tres pasos energéticos en el proceso de disolución",
              "Explica por qué algunas disoluciones son exotérmicas y otras endotérmicas",
              "Relaciona el signo de ΔH de disolución con la estabilidad de la solución"
            ]
          }
        ]
      },
      {
        "key": "solubilidad",
        "name": "Solubilidad",
        "short_description": "Factores que afectan la solubilidad y clasificación de soluciones según saturación.",
        "sub_topics": [
          {
            "key": "definicion_solubilidad",
            "name": "Definición de Solubilidad",
            "short_description": "Cantidad máxima de soluto que se disuelve en una cantidad determinada de solvente.",
            "example_tasks": [
              "Define solubilidad e indica sus unidades comunes",
              "Explica la diferencia entre solubilidad y velocidad de disolución",
              "Si la solubilidad del NaCl es 36 g/100 mL a 25°C, ¿cuánto se disolverá en 250 mL de agua?"
            ]
          },
          {
            "key": "curvas_solubilidad",
            "name": "Curvas de Solubilidad",
            "short_description": "Gráficas de solubilidad vs. temperatura para diferentes sustancias.",
            "example_tasks": [
              "Interpreta una curva de solubilidad y determina la solubilidad de KNO₃ a 40°C",
              "Compara las curvas de solubilidad de sólidos (que aumentan con T) y gases (que disminuyen con T)",
              "Usa una curva de solubilidad para determinar si una solución está saturada, insaturada o sobresaturada"
            ]
          },
          {
            "key": "soluciones_saturadas",
            "name": "Soluciones Saturadas, Insaturadas y Sobresaturadas",
            "short_description": "Clasificación según la cantidad de soluto disuelto respecto al máximo posible.",
            "example_tasks": [
              "Define solución saturada, insaturada y sobresaturada",
              "Explica cómo preparar una solución sobresaturada y por qué es inestable",
              "Clasifica una solución de 30 g de NaCl en 100 mL de agua a 25°C (solubilidad = 36 g/100 mL)"
            ]
          },
          {
            "key": "factores_temperatura",
            "name": "Efecto de la Temperatura en la Solubilidad",
            "short_description": "Influencia de la temperatura en la solubilidad de sólidos y gases.",
            "example_tasks": [
              "Explica por qué la mayoría de los sólidos son más solubles a temperaturas altas",
              "Explica por qué los gases son menos solubles a temperaturas altas",
              "Describe un ejemplo cotidiano del efecto de la temperatura en la solubilidad de gases"
            ]
          },
          {
            "key": "efecto_presion",
            "name": "Efecto de la Presión en la Solubilidad",
            "short_description": "Ley de Henry para gases disueltos en líquidos.",
            "example_tasks": [
              "Enuncia la ley de Henry y explica qué predice",
              "Explica por qué al abrir una bebida carbonatada se liberan burbujas",
              "Describe cómo la presión afecta la solubilidad de O₂ en la sangre durante el buceo"
            ]
          }
        ]
      },
      {
        "key": "unidades_concentracion",
        "name": "Unidades de Concentración",
        "short_description": "Expresiones cuantitativas de la cantidad de soluto en una solución.",
        "sub_topics": [
          {
            "key": "porcentaje_masa",
            "name": "Porcentaje en Masa (% m/m)",
            "short_description": "Gramos de soluto por cada 100 gramos de solución.",
            "example_tasks": [
              "Calcula el % m/m de una solución que contiene 20 g de NaCl en 80 g de agua",
              "¿Cuántos gramos de azúcar hay en 500 g de una solución al 15% m/m?",
              "Describe cómo preparar 200 g de una solución de sal al 10% m/m"
            ]
          },
          {
            "key": "porcentaje_volumen",
            "name": "Porcentaje en Volumen (% V/V)",
            "short_description": "Mililitros de soluto por cada 100 mL de solución.",
            "example_tasks": [
              "Calcula el % V/V de una solución que contiene 25 mL de etanol en 100 mL de solución total",
              "¿Cuántos mL de alcohol hay en 500 mL de una solución al 70% V/V?",
              "Explica por qué el % V/V es más común para soluciones líquido-líquido"
            ]
          },
          {
            "key": "porcentaje_masa_volumen",
            "name": "Porcentaje Masa-Volumen (% m/V)",
            "short_description": "Gramos de soluto por cada 100 mL de solución.",
            "example_tasks": [
              "Calcula el % m/V de una solución que contiene 15 g de glucosa en 200 mL de solución",
              "¿Cuántos gramos de NaOH se necesitan para preparar 500 mL de solución al 5% m/V?",
              "Explica cuándo es conveniente usar % m/V en lugar de % m/m"
            ]
          },
          {
            "key": "molaridad",
            "name": "Molaridad (M)",
            "short_description": "Moles de soluto por litro de solución.",
            "example_tasks": [
              "Calcula la molaridad de una solución que contiene 40 g de NaOH en 500 mL de solución",
              "¿Cuántos gramos de H₂SO₄ se necesitan para preparar 2 L de solución 0.5 M?",
              "Explica cómo se afecta la molaridad cuando una solución se calienta y su volumen cambia"
            ]
          },
          {
            "key": "molalidad",
            "name": "Molalidad (m)",
            "short_description": "Moles de soluto por kilogramo de solvente.",
            "example_tasks": [
              "Calcula la molalidad de una solución que contiene 20 g de NaCl en 500 g de agua",
              "Explica por qué la molalidad no cambia con la temperatura",
              "Compara molaridad y molalidad, indicando cuándo es preferible usar cada una"
            ]
          },
          {
            "key": "fraccion_molar",
            "name": "Fracción Molar (X)",
            "short_description": "Proporción de moles de un componente respecto al total de moles.",
            "example_tasks": [
              "Calcula la fracción molar de etanol en una solución que contiene 2 moles de etanol y 8 moles de agua",
              "Demuestra que la suma de todas las fracciones molares en una solución es igual a 1",
              "Convierte una fracción molar de 0.25 a porcentaje molar"
            ]
          },
          {
            "key": "normalidad",
            "name": "Normalidad (N)",
            "short_description": "Equivalentes de soluto por litro de solución.",
            "example_tasks": [
              "Define equivalente químico y normalidad",
              "Calcula la normalidad de una solución de H₂SO₄ 0.5 M en una reacción ácido-base",
              "Explica la relación entre normalidad y molaridad según el número de equivalentes"
            ]
          },
          {
            "key": "ppm_ppb",
            "name": "Partes por Millón (ppm) y Partes por Billón (ppb)",
            "short_description": "Unidades para concentraciones muy diluidas.",
            "example_tasks": [
              "Define ppm y explica cuándo se usa esta unidad",
              "Convierte 50 mg de contaminante en 1 L de agua a ppm",
              "Explica por qué los límites de contaminantes en agua potable se expresan en ppm"
            ]
          },
          {
            "key": "conversiones_concentracion",
            "name": "Conversiones entre Unidades de Concentración",
            "short_description": "Transformación de una expresión de concentración a otra.",
            "example_tasks": [
              "Convierte una solución 2.0 M de NaOH a % m/V (densidad de la solución = 1.08 g/mL)",
              "Transforma una solución 3.0 m de glucosa a molaridad (densidad de la solución = 1.12 g/mL)",
              "Explica qué información adicional necesitas para convertir molaridad a molalidad"
            ]
          }
        ]
      },
      {
        "key": "preparacion_soluciones",
        "name": "Preparación de Soluciones",
        "short_description": "Procedimientos para preparar soluciones con concentraciones específicas.",
        "sub_topics": [
          {
            "key": "disolucion_solido",
            "name": "Preparación por Disolución de Sólidos",
            "short_description": "Procedimiento para disolver una masa calculada de soluto sólido.",
            "example_tasks": [
              "Describe paso a paso cómo preparar 500 mL de solución de NaCl 0.5 M",
              "Explica por qué se debe agregar el soluto primero y luego completar al volumen deseado",
              "Calcula qué masa de CuSO₄·5H₂O se necesita para preparar 250 mL de solución 0.2 M"
            ]
          },
          {
            "key": "diluciones_preparacion",
            "name": "Preparación por Dilución",
            "short_description": "Obtención de soluciones diluidas a partir de soluciones concentradas.",
            "example_tasks": [
              "Calcula cuántos mL de HCl 12 M se necesitan para preparar 1 L de HCl 0.5 M",
              "Describe el procedimiento seguro para diluir un ácido concentrado",
              "Explica por qué se debe añadir ácido al agua y nunca agua al ácido"
            ]
          },
          {
            "key": "uso_matraz_aforado",
            "name": "Uso del Matraz Aforado",
            "short_description": "Técnica correcta para preparar soluciones de concentración exacta.",
            "example_tasks": [
              "Describe el procedimiento completo para usar un matraz aforado de 250 mL",
              "Explica por qué el menisco debe estar al nivel del aforo",
              "Indica qué errores comunes pueden afectar la concentración final de la solución"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "propiedades_coligativas",
    "name": "Propiedades Coligativas",
    "short_description": "Propiedades que dependen del número de partículas de soluto y no de su naturaleza: disminución de presión de vapor, elevación ebulloscópica, descenso crioscópico y presión osmótica.",
    "sub_topics": [
      {
        "key": "concepto_propiedades_coligativas",
        "name": "Concepto de Propiedades Coligativas",
        "short_description": "Definición y características generales de las propiedades coligativas.",
        "sub_topics": [
          {
            "key": "definicion_coligativas",
            "name": "Definición y Características",
            "short_description": "Propiedades que dependen solo del número de partículas de soluto.",
            "example_tasks": [
              "Define propiedades coligativas y explica por qué se llaman así",
              "Enumera las cuatro propiedades coligativas principales",
              "Explica por qué las propiedades coligativas no dependen de la naturaleza química del soluto"
            ]
          },
          {
            "key": "electrolitos_no_electrolitos",
            "name": "Electrolitos y No Electrolitos",
            "short_description": "Distinción entre solutos que se disocian y los que permanecen como moléculas.",
            "example_tasks": [
              "Define electrolito y no electrolito, proporcionando ejemplos de cada uno",
              "Explica por qué una solución de NaCl produce un efecto coligativo mayor que una de glucosa a igual molaridad",
              "Clasifica las siguientes sustancias como electrolitos o no electrolitos: HCl, C₆H₁₂O₆, KOH, CH₃OH"
            ]
          },
          {
            "key": "factor_van_hoff",
            "name": "Factor de Van't Hoff (i)",
            "short_description": "Número de partículas producidas por cada unidad de soluto.",
            "example_tasks": [
              "Define el factor de Van't Hoff e indica su valor para no electrolitos",
              "Calcula el factor de Van't Hoff teórico para NaCl, CaCl₂ y Al₂(SO₄)₃",
              "Explica por qué el factor de Van't Hoff real es generalmente menor que el teórico"
            ]
          }
        ]
      },
      {
        "key": "disminucion_presion_vapor",
        "name": "Disminución de la Presión de Vapor",
        "short_description": "Reducción de la presión de vapor del solvente por presencia de soluto.",
        "sub_topics": [
          {
            "key": "ley_raoult",
            "name": "Ley de Raoult",
            "short_description": "Relación entre presión de vapor de la solución y fracción molar del solvente.",
            "example_tasks": [
              "Enuncia la ley de Raoult y escribe su expresión matemática",
              "Calcula la presión de vapor de una solución que contiene 1 mol de glucosa en 9 moles de agua (P°agua = 23.8 mmHg a 25°C)",
              "Explica por qué la presión de vapor disminuye al agregar un soluto no volátil"
            ]
          },
          {
            "key": "disminucion_relativa",
            "name": "Disminución Relativa de Presión de Vapor",
            "short_description": "Relación entre el cambio de presión y la fracción molar del soluto.",
            "example_tasks": [
              "Deriva la ecuación ΔP/P° = Xsoluto a partir de la ley de Raoult",
              "Calcula la disminución de presión de vapor al disolver 40 g de sacarosa en 500 g de agua",
              "Explica cómo se puede usar la disminución de presión de vapor para determinar masa molar"
            ]
          }
        ]
      },
      {
        "key": "elevacion_ebulloscopica",
        "name": "Elevación del Punto de Ebullición",
        "short_description": "Aumento de la temperatura de ebullición por presencia de soluto.",
        "sub_topics": [
          {
            "key": "concepto_elevacion",
            "name": "Concepto y Explicación",
            "short_description": "Por qué las soluciones hierven a temperatura más alta que el solvente puro.",
            "example_tasks": [
              "Explica a nivel molecular por qué una solución hierve a mayor temperatura que el solvente puro",
              "Define punto de ebullición y explica cómo se relaciona con la presión de vapor",
              "Describe un ejemplo cotidiano de elevación del punto de ebullición"
            ]
          },
          {
            "key": "ecuacion_ebulloscopica",
            "name": "Ecuación Ebulloscópica",
            "short_description": "ΔTeb = Keb · m · i para calcular la elevación del punto de ebullición.",
            "example_tasks": [
              "Escribe la ecuación ebulloscópica e identifica cada término",
              "Calcula la elevación del punto de ebullición de una solución 0.5 m de glucosa en agua (Keb = 0.52 °C/m)",
              "Determina el punto de ebullición de una solución de 58.5 g de NaCl en 1 kg de agua"
            ]
          },
          {
            "key": "aplicaciones_elevacion",
            "name": "Aplicaciones Prácticas",
            "short_description": "Usos de la elevación del punto de ebullición en la vida diaria.",
            "example_tasks": [
              "Explica por qué se agrega sal al agua para cocinar pasta",
              "Describe el uso de esta propiedad en la determinación de masas molares",
              "Explica el principio de los anticongelantes en radiadores de automóviles"
            ]
          }
        ]
      },
      {
        "key": "descenso_crioscopico",
        "name": "Descenso del Punto de Congelación",
        "short_description": "Disminución de la temperatura de congelación por presencia de soluto.",
        "sub_topics": [
          {
            "key": "concepto_descenso",
            "name": "Concepto y Explicación",
            "short_description": "Por qué las soluciones congelan a temperatura más baja que el solvente puro.",
            "example_tasks": [
              "Explica a nivel molecular por qué una solución congela a menor temperatura que el solvente puro",
              "Describe cómo las partículas de soluto interfieren con la formación de cristales de hielo",
              "Proporciona dos ejemplos cotidianos del descenso del punto de congelación"
            ]
          },
          {
            "key": "ecuacion_crioscopica",
            "name": "Ecuación Crioscópica",
            "short_description": "ΔTcong = Kcong · m · i para calcular el descenso del punto de congelación.",
            "example_tasks": [
              "Escribe la ecuación crioscópica e identifica cada término",
              "Calcula el descenso del punto de congelación de una solución 1.5 m de etilenglicol en agua (Kcong = 1.86 °C/m)",
              "Determina el punto de congelación de una solución de 117 g de NaCl en 2 kg de agua"
            ]
          },
          {
            "key": "aplicaciones_descenso",
            "name": "Aplicaciones Prácticas",
            "short_description": "Usos del descenso crioscópico en tecnología y vida diaria.",
            "example_tasks": [
              "Explica cómo funcionan los anticongelantes para motores de automóviles",
              "Describe por qué se pone sal en las carreteras durante el invierno",
              "Explica el principio de las máquinas para hacer helado con sal y hielo"
            ]
          }
        ]
      },
      {
        "key": "presion_osmotica",
        "name": "Presión Osmótica",
        "short_description": "Presión necesaria para detener el flujo de solvente a través de una membrana semipermeable.",
        "sub_topics": [
          {
            "key": "osmosis_concepto",
            "name": "Concepto de Ósmosis",
            "short_description": "Flujo de solvente a través de una membrana semipermeable.",
            "example_tasks": [
              "Define ósmosis y membrana semipermeable",
              "Explica la dirección del flujo de agua en un proceso osmótico",
              "Describe qué sucede cuando se sumergen células vegetales en soluciones hipo e hipertónicas"
            ]
          },
          {
            "key": "ecuacion_presion_osmotica",
            "name": "Ecuación de Presión Osmótica",
            "short_description": "π = MRT o π = iMRT para soluciones de electrolitos.",
            "example_tasks": [
              "Escribe la ecuación de Van't Hoff para presión osmótica",
              "Calcula la presión osmótica de una solución 0.1 M de glucosa a 25°C (R = 0.0821 L·atm/mol·K)",
              "Determina la molaridad de una solución que tiene presión osmótica de 5 atm a 20°C"
            ]
          },
          {
            "key": "soluciones_isotonicas",
            "name": "Soluciones Isotónicas, Hipertónicas e Hipotónicas",
            "short_description": "Clasificación según presión osmótica relativa.",
            "example_tasks": [
              "Define solución isotónica, hipertónica e hipotónica",
              "Explica por qué es importante usar solución salina isotónica en aplicaciones médicas",
              "Describe qué le sucede a un glóbulo rojo en agua pura versus en solución salina hipertónica"
            ]
          },
          {
            "key": "aplicaciones_osmosis",
            "name": "Aplicaciones de la Ósmosis",
            "short_description": "Importancia biológica y tecnológica de la ósmosis.",
            "example_tasks": [
              "Explica el papel de la ósmosis en la absorción de agua por las raíces de las plantas",
              "Describe el proceso de ósmosis inversa para purificación de agua",
              "Explica por qué las células necesitan mantener un equilibrio osmótico con su entorno"
            ]
          }
        ]
      },
      {
        "key": "determinacion_masa_molar",
        "name": "Determinación de Masa Molar por Propiedades Coligativas",
        "short_description": "Uso de propiedades coligativas para calcular masa molar de solutos.",
        "sub_topics": [
          {
            "key": "calculo_masa_molar",
            "name": "Procedimiento de Cálculo",
            "short_description": "Uso de datos experimentales para determinar masa molar.",
            "example_tasks": [
              "Una solución de 10 g de un compuesto desconocido en 100 g de agua congela a -1.86°C. Calcula su masa molar",
              "Determina la masa molar de un compuesto si una solución 0.5 m eleva el punto de ebullición del agua en 0.26°C",
              "Explica por qué el método crioscópico es más preciso que el ebulloscópico"
            ]
          },
          {
            "key": "consideraciones_experimentales",
            "name": "Consideraciones Experimentales",
            "short_description": "Factores que afectan la precisión de las determinaciones.",
            "example_tasks": [
              "Explica por qué se debe usar un soluto no volátil y no electrolito",
              "Describe qué errores experimentales pueden afectar la determinación de masa molar",
              "Indica cuál propiedad coligativa es más sensible para determinar masas molares grandes"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "acidos_bases",
    "name": "Ácidos y Bases",
    "short_description": "Teorías ácido-base (Arrhenius, Brønsted-Lowry, Lewis), escala de pH, fuerza de ácidos y bases, reacciones de neutralización.",
    "sub_topics": [
      {
        "key": "teorias_acido_base",
        "name": "Teorías Ácido-Base",
        "short_description": "Diferentes definiciones de ácidos y bases según su desarrollo histórico.",
        "sub_topics": [
          {
            "key": "teoria_arrhenius",
            "name": "Teoría de Arrhenius",
            "short_description": "Ácidos producen H⁺ y bases producen OH⁻ en solución acuosa.",
            "example_tasks": [
              "Define ácido y base según Arrhenius",
              "Clasifica las siguientes sustancias según Arrhenius: HCl, NaOH, NH₃, H₂SO₄",
              "Explica las limitaciones de la teoría de Arrhenius"
            ]
          },
          {
            "key": "teoria_bronsted_lowry",
            "name": "Teoría de Brønsted-Lowry",
            "short_description": "Ácidos donan protones (H⁺) y bases aceptan protones.",
            "example_tasks": [
              "Define ácido y base según Brønsted-Lowry",
              "Identifica los pares ácido-base conjugados en: HCl + H₂O → H₃O⁺ + Cl⁻",
              "Explica por qué NH₃ puede actuar como base según Brønsted-Lowry pero no según Arrhenius"
            ]
          },
          {
            "key": "pares_conjugados",
            "name": "Pares Ácido-Base Conjugados",
            "short_description": "Relación entre un ácido y su base conjugada, y viceversa.",
            "example_tasks": [
              "Define par ácido-base conjugado",
              "Identifica la base conjugada del H₂SO₄ y el ácido conjugado del NH₃",
              "Explica la relación entre la fuerza de un ácido y la fuerza de su base conjugada"
            ]
          },
          {
            "key": "teoria_lewis",
            "name": "Teoría de Lewis",
            "short_description": "Ácidos aceptan pares de electrones y bases donan pares de electrones.",
            "example_tasks": [
              "Define ácido y base según Lewis",
              "Identifica el ácido y la base de Lewis en: BF₃ + NH₃ → F₃B-NH₃",
              "Explica por qué la teoría de Lewis es la más general de las tres teorías"
            ]
          }
        ]
      },
      {
        "key": "propiedades_acidos_bases",
        "name": "Propiedades de Ácidos y Bases",
        "short_description": "Características químicas y físicas que permiten identificar ácidos y bases.",
        "sub_topics": [
          {
            "key": "propiedades_acidos",
            "name": "Propiedades de los Ácidos",
            "short_description": "Sabor agrio, conducen electricidad, cambian indicadores, reaccionan con metales.",
            "example_tasks": [
              "Enumera cinco propiedades características de los ácidos",
              "Explica por qué los ácidos reaccionan con metales activos produciendo hidrógeno",
              "Describe qué sucede cuando un ácido entra en contacto con papel tornasol azul"
            ]
          },
          {
            "key": "propiedades_bases",
            "name": "Propiedades de las Bases",
            "short_description": "Sabor amargo, resbaladizas, conducen electricidad, cambian indicadores.",
            "example_tasks": [
              "Enumera cinco propiedades características de las bases",
              "Explica por qué las bases tienen textura resbaladiza (jabonosa)",
              "Describe qué sucede cuando una base entra en contacto con papel tornasol rojo"
            ]
          },
          {
            "key": "indicadores",
            "name": "Indicadores Ácido-Base",
            "short_description": "Sustancias que cambian de color según el pH del medio.",
            "example_tasks": [
              "Define indicador ácido-base y explica cómo funciona",
              "Describe los cambios de color de la fenolftaleína y el papel tornasol en medio ácido y básico",
              "Explica por qué el extracto de col morada puede usarse como indicador natural"
            ]
          }
        ]
      },
      {
        "key": "autoionizacion_agua",
        "name": "Autoionización del Agua y pH",
        "short_description": "Equilibrio del agua pura y escala de pH.",
        "sub_topics": [
          {
            "key": "equilibrio_agua",
            "name": "Equilibrio de Autoionización",
            "short_description": "H₂O ⇌ H⁺ + OH⁻ y producto iónico del agua (Kw).",
            "example_tasks": [
              "Escribe la ecuación de autoionización del agua",
              "Define el producto iónico del agua (Kw) e indica su valor a 25°C",
              "Calcula [OH⁻] en una solución donde [H⁺] = 1.0 × 10⁻⁵ M"
            ]
          },
          {
            "key": "escala_ph",
            "name": "Escala de pH",
            "short_description": "pH = -log[H⁺] como medida de acidez.",
            "example_tasks": [
              "Define pH y escribe su expresión matemática",
              "Calcula el pH de una solución donde [H⁺] = 1.0 × 10⁻³ M",
              "Explica por qué la escala de pH va de 0 a 14 en soluciones acuosas"
            ]
          },
          {
            "key": "escala_poh",
            "name": "Escala de pOH",
            "short_description": "pOH = -log[OH⁻] como medida de basicidad.",
            "example_tasks": [
              "Define pOH y explica su relación con pH",
              "Calcula el pOH de una solución con pH = 3",
              "Demuestra que pH + pOH = 14 a 25°C"
            ]
          },
          {
            "key": "calculos_ph",
            "name": "Cálculos de pH y pOH",
            "short_description": "Conversiones entre [H⁺], [OH⁻], pH y pOH.",
            "example_tasks": [
              "Calcula el pH de una solución 0.01 M de HCl (ácido fuerte)",
              "Determina [H⁺] en una solución con pH = 5.5",
              "Calcula el pH de una solución 0.05 M de NaOH (base fuerte)"
            ]
          },
          {
            "key": "interpretacion_ph",
            "name": "Interpretación de Valores de pH",
            "short_description": "Clasificación de soluciones como ácidas, neutras o básicas.",
            "example_tasks": [
              "Clasifica las siguientes soluciones según su pH: pH = 2, pH = 7, pH = 11",
              "Ordena de más ácido a más básico: vinagre (pH = 3), sangre (pH = 7.4), limpiador amoníaco (pH = 11)",
              "Explica qué significa que una solución tenga pH = 7"
            ]
          }
        ]
      },
      {
        "key": "fuerza_acidos_bases",
        "name": "Fuerza de Ácidos y Bases",
        "short_description": "Clasificación según su grado de ionización en solución acuosa.",
        "sub_topics": [
          {
            "key": "acidos_fuertes_debiles",
            "name": "Ácidos Fuertes y Débiles",
            "short_description": "Grado de ionización en solución acuosa.",
            "example_tasks": [
              "Explica la diferencia entre ácido fuerte y ácido débil",
              "Enumera los seis ácidos fuertes comunes",
              "Escribe las ecuaciones de ionización del HCl (fuerte) y del CH₃COOH (débil)"
            ]
          },
          {
            "key": "bases_fuertes_debiles",
            "name": "Bases Fuertes y Débiles",
            "short_description": "Grado de disociación en solución acuosa.",
            "example_tasks": [
              "Explica la diferencia entre base fuerte y base débil",
              "Enumera las bases fuertes comunes (hidróxidos de metales alcalinos y alcalinotérreos)",
              "Escribe las ecuaciones de disociación del NaOH (fuerte) y del NH₃ (débil)"
            ]
          },
          {
            "key": "constante_ionizacion",
            "name": "Constantes de Ionización (Ka y Kb)",
            "short_description": "Medida cuantitativa de la fuerza de ácidos y bases débiles.",
            "example_tasks": [
              "Define la constante de ionización ácida (Ka) y escribe su expresión para un ácido genérico HA",
              "Explica cómo se relaciona el valor de Ka con la fuerza de un ácido",
              "Compara dos ácidos: uno con Ka = 1.8 × 10⁻⁵ y otro con Ka = 6.3 × 10⁻⁴. ¿Cuál es más fuerte?"
            ]
          },
          {
            "key": "calculo_ph_debiles",
            "name": "Cálculo de pH de Ácidos y Bases Débiles",
            "short_description": "Uso de Ka o Kb para determinar pH de soluciones.",
            "example_tasks": [
              "Calcula el pH de una solución 0.1 M de ácido acético (Ka = 1.8 × 10⁻⁵)",
              "Determina el porcentaje de ionización de un ácido débil 0.1 M con Ka = 1.0 × 10⁻⁵",
              "Explica por qué se puede usar la aproximación [H⁺] ≈ √(Ka·C) para ácidos débiles diluidos"
            ]
          }
        ]
      },
      {
        "key": "neutralizacion",
        "name": "Reacciones de Neutralización",
        "short_description": "Reacción entre ácido y base para formar sal y agua.",
        "sub_topics": [
          {
            "key": "ecuaciones_neutralizacion",
            "name": "Ecuaciones de Neutralización",
            "short_description": "Representación de reacciones ácido + base → sal + agua.",
            "example_tasks": [
              "Escribe la ecuación general de neutralización",
              "Completa y balancea: HCl + NaOH → ?",
              "Escribe la ecuación de neutralización entre H₂SO₄ y Ca(OH)₂"
            ]
          },
          {
            "key": "titulacion_acido_base",
            "name": "Titulación Ácido-Base",
            "short_description": "Método analítico para determinar concentración mediante neutralización.",
            "example_tasks": [
              "Describe el procedimiento de una titulación ácido-base",
              "Calcula la concentración de HCl si 25 mL se neutralizan con 30 mL de NaOH 0.5 M",
              "Explica qué es el punto de equivalencia y cómo se detecta"
            ]
          },
          {
            "key": "curvas_titulacion",
            "name": "Curvas de Titulación",
            "short_description": "Gráficas de pH vs. volumen de titulante agregado.",
            "example_tasks": [
              "Describe la forma de la curva de titulación de un ácido fuerte con una base fuerte",
              "Identifica el punto de equivalencia en una curva de titulación",
              "Explica por qué el pH en el punto de equivalencia de HCl + NaOH es 7"
            ]
          },
          {
            "key": "sales_hidrolisis",
            "name": "Hidrólisis de Sales",
            "short_description": "Reacción de iones de sales con agua que afecta el pH.",
            "example_tasks": [
              "Explica qué es la hidrólisis de sales",
              "Predice si una solución de NaCl, NH₄Cl y CH₃COONa será ácida, básica o neutra",
              "Escribe la ecuación de hidrólisis del ion acetato (CH₃COO⁻)"
            ]
          }
        ]
      },
      {
        "key": "soluciones_amortiguadoras",
        "name": "Soluciones Amortiguadoras (Buffer)",
        "short_description": "Soluciones que resisten cambios de pH al agregar pequeñas cantidades de ácido o base.",
        "sub_topics": [
          {
            "key": "concepto_buffer",
            "name": "Concepto de Buffer",
            "short_description": "Mezcla de ácido débil con su base conjugada (o base débil con su ácido conjugado).",
            "example_tasks": [
              "Define solución amortiguadora y explica cómo funciona",
              "Describe la composición de un buffer de ácido acético/acetato de sodio",
              "Explica por qué una mezcla de HCl y NaCl no puede formar un buffer"
            ]
          },
          {
            "key": "ecuacion_henderson_hasselbalch",
            "name": "Ecuación de Henderson-Hasselbalch",
            "short_description": "pH = pKa + log([A⁻]/[HA]) para calcular pH de buffers.",
            "example_tasks": [
              "Escribe la ecuación de Henderson-Hasselbalch y define cada término",
              "Calcula el pH de un buffer que contiene 0.1 M de CH₃COOH y 0.1 M de CH₃COONa (pKa = 4.74)",
              "Determina la relación [A⁻]/[HA] necesaria para preparar un buffer de pH = 5.0 con ácido acético"
            ]
          },
          {
            "key": "capacidad_amortiguadora",
            "name": "Capacidad Amortiguadora",
            "short_description": "Cantidad de ácido o base que puede neutralizar un buffer sin cambio significativo de pH.",
            "example_tasks": [
              "Define capacidad amortiguadora",
              "Explica por qué la capacidad amortiguadora es máxima cuando pH = pKa",
              "Describe qué factores determinan la capacidad de un buffer"
            ]
          },
          {
            "key": "aplicaciones_buffers",
            "name": "Aplicaciones de Soluciones Buffer",
            "short_description": "Importancia en sistemas biológicos y procesos industriales.",
            "example_tasks": [
              "Explica la importancia del sistema buffer bicarbonato en la sangre humana",
              "Describe el papel de buffers en mantener el pH del citoplasma celular",
              "Menciona aplicaciones industriales de soluciones amortiguadoras"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "oxidacion_reduccion",
    "name": "Reacciones de Oxidación-Reducción (Redox)",
    "short_description": "Transferencia de electrones, números de oxidación, balanceo de ecuaciones redox, serie de actividad y tipos de reacciones redox.",
    "sub_topics": [
      {
        "key": "conceptos_redox",
        "name": "Conceptos Fundamentales de Redox",
        "short_description": "Definiciones de oxidación, reducción, agente oxidante y agente reductor.",
        "sub_topics": [
          {
            "key": "definiciones_redox",
            "name": "Oxidación y Reducción",
            "short_description": "Pérdida y ganancia de electrones en reacciones químicas.",
            "example_tasks": [
              "Define oxidación y reducción en términos de transferencia de electrones",
              "Explica por qué las reacciones redox siempre ocurren simultáneamente",
              "Identifica qué especie se oxida y cuál se reduce en: Zn + Cu²⁺ → Zn²⁺ + Cu"
            ]
          },
          {
            "key": "agentes_oxidantes_reductores",
            "name": "Agentes Oxidantes y Reductores",
            "short_description": "Especies que causan la oxidación o reducción de otras sustancias.",
            "example_tasks": [
              "Define agente oxidante y agente reductor",
              "Identifica el agente oxidante y reductor en: 2Na + Cl₂ → 2NaCl",
              "Explica por qué el agente oxidante se reduce y el agente reductor se oxida"
            ]
          },
          {
            "key": "numero_oxidacion_redox",
            "name": "Números de Oxidación en Redox",
            "short_description": "Uso de números de oxidación para identificar reacciones redox.",
            "example_tasks": [
              "Determina el cambio en número de oxidación de cada elemento en: Fe₂O₃ + 3CO → 2Fe + 3CO₂",
              "Explica cómo usar números de oxidación para identificar si una reacción es redox",
              "Identifica cuál de las siguientes es una reacción redox: HCl + NaOH → NaCl + H₂O o 2Mg + O₂ → 2MgO"
            ]
          }
        ]
      },
      {
        "key": "balanceo_redox",
        "name": "Balanceo de Ecuaciones Redox",
        "short_description": "Métodos para balancear reacciones de oxidación-reducción.",
        "sub_topics": [
          {
            "key": "metodo_numeros_oxidacion",
            "name": "Método de Números de Oxidación",
            "short_description": "Balanceo basado en igualar cambios en números de oxidación.",
            "example_tasks": [
              "Balancea la siguiente ecuación por el método de números de oxidación: Cu + HNO₃ → Cu(NO₃)₂ + NO + H₂O",
              "Describe paso a paso el método de números de oxidación",
              "Balancea: Fe₂O₃ + C → Fe + CO₂ usando números de oxidación"
            ]
          },
          {
            "key": "metodo_ion_electron",
            "name": "Método del Ion-Electrón (Semirreacciones)",
            "short_description": "Balanceo separando la reacción en semirreacciones de oxidación y reducción.",
            "example_tasks": [
              "Explica los pasos del método del ion-electrón",
              "Escribe las semirreacciones de oxidación y reducción para: Zn + Cu²⁺ → Zn²⁺ + Cu",
              "Balancea la reacción: MnO₄⁻ + Fe²⁺ → Mn²⁺ + Fe³⁺ en medio ácido"
            ]
          },
          {
            "key": "medio_acido",
            "name": "Balanceo en Medio Ácido",
            "short_description": "Uso de H⁺ y H₂O para balancear en soluciones ácidas.",
            "example_tasks": [
              "Balancea en medio ácido: Cr₂O₇²⁻ + Fe²⁺ → Cr³⁺ + Fe³⁺",
              "Explica por qué se agregan H⁺ y H₂O en el balanceo en medio ácido",
              "Balancea: MnO₄⁻ + H₂O₂ → Mn²⁺ + O₂ en medio ácido"
            ]
          },
          {
            "key": "medio_basico",
            "name": "Balanceo en Medio Básico",
            "short_description": "Uso de OH⁻ y H₂O para balancear en soluciones básicas.",
            "example_tasks": [
              "Balancea en medio básico: MnO₄⁻ + I⁻ → MnO₂ + I₂",
              "Explica los pasos adicionales necesarios para balancear en medio básico versus medio ácido",
              "Balancea: Cr(OH)₃ + ClO⁻ → CrO₄²⁻ + Cl⁻ en medio básico"
            ]
          }
        ]
      },
      {
        "key": "tipos_reacciones_redox",
        "name": "Tipos de Reacciones Redox",
        "short_description": "Clasificación de reacciones según el proceso redox involucrado.",
        "sub_topics": [
          {
            "key": "desplazamiento_redox",
            "name": "Reacciones de Desplazamiento",
            "short_description": "Un metal desplaza a otro de sus compuestos.",
            "example_tasks": [
              "Predice si ocurrirá reacción entre Zn y CuSO₄, y escribe la ecuación",
              "Explica por qué el magnesio puede desplazar al hierro pero no viceversa",
              "Escribe la reacción entre aluminio y óxido de hierro (III) (reacción termita)"
            ]
          },
          {
            "key": "combinacion_redox",
            "name": "Reacciones de Combinación",
            "short_description": "Elementos se combinan formando compuestos mediante transferencia de electrones.",
            "example_tasks": [
              "Escribe la reacción redox de combinación entre sodio y cloro",
              "Identifica qué se oxida y qué se reduce en: 2Mg + O₂ → 2MgO",
              "Explica por qué la formación de óxidos metálicos son reacciones redox"
            ]
          },
          {
            "key": "descomposicion_redox",
            "name": "Reacciones de Descomposición",
            "short_description": "Compuestos se descomponen con cambio en números de oxidación.",
            "example_tasks": [
              "Escribe la descomposición redox del KClO₃",
              "Identifica la oxidación y reducción en: 2H₂O₂ → 2H₂O + O₂",
              "Explica por qué algunas descomposiciones son redox y otras no"
            ]
          },
          {
            "key": "combustion_redox",
            "name": "Reacciones de Combustión",
            "short_description": "Oxidación rápida de sustancias con oxígeno liberando energía.",
            "example_tasks": [
              "Escribe la ecuación de combustión completa del metano",
              "Identifica los cambios de número de oxidación en la combustión: C₃H₈ + 5O₂ → 3CO₂ + 4H₂O",
              "Explica por qué todas las combustiones son reacciones redox"
            ]
          },
          {
            "key": "dismutacion",
            "name": "Reacciones de Dismutación",
            "short_description": "Una misma especie se oxida y se reduce simultáneamente.",
            "example_tasks": [
              "Define dismutación y proporciona un ejemplo",
              "Identifica la dismutación en: Cl₂ + 2NaOH → NaCl + NaClO + H₂O",
              "Explica cómo una sustancia puede actuar como oxidante y reductor al mismo tiempo"
            ]
          }
        ]
      },
      {
        "key": "serie_actividad",
        "name": "Serie de Actividad de los Metales",
        "short_description": "Orden relativo de tendencia de metales a oxidarse.",
        "sub_topics": [
          {
            "key": "tabla_actividad",
            "name": "Tabla de Serie de Actividad",
            "short_description": "Clasificación de metales según su reactividad.",
            "example_tasks": [
              "Ordena los siguientes metales de más a menos reactivos: Cu, Zn, Ag, Mg",
              "Explica qué significa que un metal esté más alto en la serie de actividad",
              "Describe la tendencia general de reactividad en la tabla periódica"
            ]
          },
          {
            "key": "prediccion_reacciones",
            "name": "Predicción de Reacciones usando la Serie",
            "short_description": "Uso de la serie para predecir si ocurrirá una reacción redox.",
            "example_tasks": [
              "Predice si ocurrirá reacción entre: a) Fe + CuSO₄, b) Cu + ZnSO₄",
              "Explica por qué el zinc puede desplazar al cobre de sus sales pero no viceversa",
              "Determina qué metal puede reducir iones Ag⁺: Cu, Zn, Au"
            ]
          },
          {
            "key": "reacciones_con_acidos",
            "name": "Reactividad de Metales con Ácidos",
            "short_description": "Producción de hidrógeno gas por metales activos.",
            "example_tasks": [
              "Predice si los siguientes metales reaccionarán con HCl: Mg, Cu, Al",
              "Escribe la ecuación para la reacción entre zinc y ácido clorhídrico",
              "Explica por qué los metales nobles no reaccionan con ácidos diluidos"
            ]
          }
        ]
      },
      {
        "key": "aplicaciones_redox",
        "name": "Aplicaciones de Reacciones Redox",
        "short_description": "Importancia de procesos redox en tecnología y naturaleza.",
        "sub_topics": [
          {
            "key": "corrosion",
            "name": "Corrosión de Metales",
            "short_description": "Oxidación de metales por exposición al ambiente.",
            "example_tasks": [
              "Explica el proceso de oxidación del hierro (formación de óxido)",
              "Describe métodos para prevenir la corrosión del hierro",
              "Escribe las ecuaciones redox involucradas en la formación de herrumbre"
            ]
          },
          {
            "key": "obtencion_metales",
            "name": "Obtención de Metales",
            "short_description": "Reducción de minerales para extraer metales puros.",
            "example_tasks": [
              "Explica cómo se obtiene el hierro a partir del óxido de hierro (III) en un alto horno",
              "Describe el proceso de obtención del aluminio por electrólisis",
              "Escribe la ecuación redox para la reducción de Cu²⁺ a Cu metálico"
            ]
          },
          {
            "key": "blanqueadores",
            "name": "Blanqueadores y Desinfectantes",
            "short_description": "Agentes oxidantes para eliminar manchas y microorganismos.",
            "example_tasks": [
              "Explica cómo funciona el cloro como blanqueador y desinfectante",
              "Describe el papel del peróxido de hidrógeno como agente oxidante",
              "Menciona precauciones al usar agentes oxidantes fuertes"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "electroquimica",
    "name": "Electroquímica",
    "short_description": "Celdas electroquímicas, potenciales de reducción, celdas galvánicas y electrolíticas, leyes de Faraday y aplicaciones.",
    "sub_topics": [
      {
        "key": "celdas_electroquimicas",
        "name": "Celdas Electroquímicas",
        "short_description": "Dispositivos que convierten energía química en eléctrica o viceversa.",
        "sub_topics": [
          {
            "key": "componentes_celda",
            "name": "Componentes de una Celda Electroquímica",
            "short_description": "Ánodo, cátodo, electrodos, electrolito y puente salino.",
            "example_tasks": [
              "Identifica y describe la función de cada componente de una celda electroquímica",
              "Explica la función del puente salino en una celda galvánica",
              "Define ánodo y cátodo, indicando en cuál ocurre la oxidación y en cuál la reducción"
            ]
          },
          {
            "key": "notacion_celda",
            "name": "Notación de Celdas",
            "short_description": "Representación abreviada de celdas electroquímicas.",
            "example_tasks": [
              "Escribe la notación de celda para: Zn | Zn²⁺ || Cu²⁺ | Cu",
              "Interpreta la siguiente notación de celda e identifica ánodo y cátodo",
              "Explica qué representan las barras simples (|) y dobles (||) en la notación"
            ]
          },
          {
            "key": "semirreacciones_electroquimicas",
            "name": "Semirreacciones en Electrodos",
            "short_description": "Oxidación en ánodo y reducción en cátodo.",
            "example_tasks": [
              "Escribe las semirreacciones de oxidación y reducción para la celda Zn-Cu",
              "Explica por qué los electrones fluyen del ánodo al cátodo en el circuito externo",
              "Describe qué sucede en cada electrodo durante el funcionamiento de una pila"
            ]
          }
        ]
      },
      {
        "key": "celdas_galvanicas",
        "name": "Celdas Galvánicas (Voltaicas)",
        "short_description": "Conversión espontánea de energía química en energía eléctrica.",
        "sub_topics": [
          {
            "key": "funcionamiento_celda_galvanica",
            "name": "Principio de Funcionamiento",
            "short_description": "Reacción redox espontánea genera corriente eléctrica.",
            "example_tasks": [
              "Describe el funcionamiento de una pila Daniell (Zn-Cu)",
              "Explica por qué la reacción en una celda galvánica es espontánea",
              "Dibuja un diagrama de una celda galvánica identificando el flujo de electrones e iones"
            ]
          },
          {
            "key": "potencial_celda",
            "name": "Potencial de Celda (E°celda)",
            "short_description": "Diferencia de potencial entre electrodos que impulsa el flujo de electrones.",
            "example_tasks": [
              "Define potencial de celda y explica qué indica su signo",
              "Calcula el potencial estándar de celda usando: E°celda = E°cátodo - E°ánodo",
              "Explica por qué un E°celda positivo indica una reacción espontánea"
            ]
          },
          {
            "key": "pilas_comunes",
            "name": "Pilas Comerciales",
            "short_description": "Tipos de pilas y baterías de uso cotidiano.",
            "example_tasks": [
              "Describe el funcionamiento de una pila seca (pila de Leclanché)",
              "Compara pilas primarias (no recargables) con pilas secundarias (recargables)",
              "Explica el principio de funcionamiento de una batería de plomo-ácido usada en automóviles"
            ]
          }
        ]
      },
      {
        "key": "potenciales_reduccion",
        "name": "Potenciales Estándar de Reducción",
        "short_description": "Tabla de potenciales y predicción de reacciones redox espontáneas.",
        "sub_topics": [
          {
            "key": "electrodo_hidrogeno",
            "name": "Electrodo Estándar de Hidrógeno",
            "short_description": "Referencia con potencial definido como 0.00 V.",
            "example_tasks": [
              "Describe el electrodo estándar de hidrógeno y por qué se usa como referencia",
              "Explica qué significa que un semirreacción tenga E° = 0.00 V",
              "Indica las condiciones estándar para medir potenciales de reducción"
            ]
          },
          {
            "key": "tabla_potenciales",
            "name": "Uso de la Tabla de Potenciales",
            "short_description": "Interpretación y aplicación de potenciales estándar.",
            "example_tasks": [
              "Consulta una tabla de potenciales y determina cuál es mejor agente oxidante: Cu²⁺ o Ag⁺",
              "Explica por qué especies con E° más positivo son mejores agentes oxidantes",
              "Ordena las siguientes especies de mejor a peor agente reductor: Zn, Cu, Mg"
            ]
          },
          {
            "key": "calculo_potencial_celda",
            "name": "Cálculo de Potencial de Celda",
            "short_description": "Determinación de E°celda usando potenciales de reducción.",
            "example_tasks": [
              "Calcula E°celda para la reacción: Zn + Cu²⁺ → Zn²⁺ + Cu (E°Zn²⁺/Zn = -0.76 V, E°Cu²⁺/Cu = +0.34 V)",
              "Predice si la siguiente reacción es espontánea calculando E°celda: Fe + Ni²⁺ → Fe²⁺ + Ni",
              "Determina el potencial de una celda Ag-Al consultando una tabla de potenciales"
            ]
          },
          {
            "key": "espontaneidad_redox",
            "name": "Predicción de Espontaneidad",
            "short_description": "Uso de potenciales para determinar dirección de reacciones redox.",
            "example_tasks": [
              "Explica la relación entre el signo de E°celda y la espontaneidad de la reacción",
              "Predice si será espontánea la reacción entre Br₂ y I⁻ usando potenciales de reducción",
              "Determina qué metal puede reducir iones Ag⁺ consultando sus potenciales"
            ]
          }
        ]
      },
      {
        "key": "celdas_electroliticas",
        "name": "Celdas Electrolíticas",
        "short_description": "Uso de energía eléctrica para producir reacciones químicas no espontáneas.",
        "sub_topics": [
          {
            "key": "principio_electrolisis",
            "name": "Principio de la Electrólisis",
            "short_description": "Corriente eléctrica fuerza una reacción redox no espontánea.",
            "example_tasks": [
              "Explica la diferencia entre una celda galvánica y una celda electrolítica",
              "Describe qué sucede en los electrodos durante la electrólisis del agua",
              "Explica por qué se necesita una fuente externa de energía en una celda electrolítica"
            ]
          },
          {
            "key": "electrolisis_sales_fundidas",
            "name": "Electrólisis de Sales Fundidas",
            "short_description": "Obtención de elementos mediante electrólisis de compuestos fundidos.",
            "example_tasks": [
              "Describe la electrólisis del NaCl fundido y los productos en cada electrodo",
              "Explica cómo se obtiene aluminio por electrólisis de Al₂O₃ fundido",
              "Escribe las semirreacciones en la electrólisis del CaCl₂ fundido"
            ]
          },
          {
            "key": "electrolisis_soluciones_acuosas",
            "name": "Electrólisis de Soluciones Acuosas",
            "short_description": "Competencia entre agua y iones en solución.",
            "example_tasks": [
              "Describe la electrólisis de una solución de NaCl y explica qué se produce en cada electrodo",
              "Explica por qué se produce H₂ en el cátodo durante la electrólisis de Na₂SO₄(ac)",
              "Predice los productos de la electrólisis de una solución de CuSO₄"
            ]
          },
          {
            "key": "galvanoplastia",
            "name": "Galvanoplastia (Electrodeposición)",
            "short_description": "Recubrimiento de objetos con una capa metálica mediante electrólisis.",
            "example_tasks": [
              "Explica el proceso de galvanoplastia o cromado",
              "Describe cómo se puede recubrir un objeto con plata mediante electrólisis",
              "Menciona aplicaciones industriales y decorativas de la galvanoplastia"
            ]
          }
        ]
      },
      {
        "key": "leyes_faraday",
        "name": "Leyes de Faraday de la Electrólisis",
        "short_description": "Relación cuantitativa entre cantidad de electricidad y sustancia transformada.",
        "sub_topics": [
          {
            "key": "primera_ley_faraday",
            "name": "Primera Ley de Faraday",
            "short_description": "Masa de sustancia depositada es proporcional a la cantidad de carga eléctrica.",
            "example_tasks": [
              "Enuncia la primera ley de Faraday",
              "Calcula cuántos gramos de Cu se depositan al pasar 2 faradays por una solución de CuSO₄",
              "Explica qué es un faraday y cuál es su valor"
            ]
          },
          {
            "key": "segunda_ley_faraday",
            "name": "Segunda Ley de Faraday",
            "short_description": "Masas de diferentes sustancias depositadas por la misma carga son proporcionales a sus equivalentes.",
            "example_tasks": [
              "Enuncia la segunda ley de Faraday",
              "Explica el concepto de equivalente electroquímico",
              "Si se depositan 32 g de Cu, ¿cuántos g de Ag se depositarían con la misma cantidad de carga?"
            ]
          },
          {
            "key": "calculos_electrolisis",
            "name": "Cálculos en Electrólisis",
            "short_description": "Determinación de masa, moles o tiempo en procesos electrolíticos.",
            "example_tasks": [
              "Calcula cuánto tiempo se necesita para depositar 10 g de Ag usando una corriente de 2 A",
              "Determina la masa de Al producida al pasar una corriente de 5 A durante 2 horas por Al₂O₃ fundido",
              "Calcula el volumen de H₂ (en CN) producido en la electrólisis del agua con 3 A durante 1 hora"
            ]
          }
        ]
      },
      {
        "key": "aplicaciones_electroquimica",
        "name": "Aplicaciones de la Electroquímica",
        "short_description": "Usos tecnológicos e industriales de procesos electroquímicos.",
        "sub_topics": [
          {
            "key": "pilas_combustible",
            "name": "Pilas de Combustible",
            "short_description": "Celdas galvánicas que convierten energía química de combustibles en electricidad.",
            "example_tasks": [
              "Describe el principio de funcionamiento de una pila de combustible de hidrógeno",
              "Explica las ventajas ambientales de las pilas de combustible",
              "Compara pilas de combustible con baterías convencionales"
            ]
          },
          {
            "key": "proteccion_catodica",
            "name": "Protección Catódica",
            "short_description": "Prevención de corrosión mediante principios electroquímicos.",
            "example_tasks": [
              "Explica cómo funciona la protección catódica para prevenir corrosión",
              "Describe el uso de ánodos de sacrificio en barcos y tuberías",
              "Explica por qué el zinc se usa como ánodo de sacrificio para proteger hierro"
            ]
          },
          {
            "key": "refinacion_metales",
            "name": "Refinación Electrolítica de Metales",
            "short_description": "Purificación de metales mediante electrólisis.",
            "example_tasks": [
              "Describe el proceso de refinación electrolítica del cobre",
              "Explica por qué el ánodo impuro se disuelve y el cátodo se purifica",
              "Menciona la importancia de obtener cobre de alta pureza para aplicaciones eléctricas"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "termoquimica",
    "name": "Termoquímica",
    "short_description": "Estudio de los cambios de energía en las reacciones químicas, entalpía de reacción, ley de Hess y cálculos calorimétricos.",
    "sub_topics": [
      {
        "key": "conceptos_energia",
        "name": "Conceptos de Energía",
        "short_description": "Energía, calor, trabajo y primera ley de la termodinámica.",
        "sub_topics": [
          {
            "key": "energia_quimica",
            "name": "Energía en Reacciones Químicas",
            "short_description": "Transformaciones de energía durante procesos químicos.",
            "example_tasks": [
              "Explica la diferencia entre energía, calor y trabajo",
              "Define sistema, entorno y universo en el contexto de la termodinámica",
              "Describe cómo se almacena energía en los enlaces químicos"
            ]
          },
          {
            "key": "primera_ley_termodinamica",
            "name": "Primera Ley de la Termodinámica",
            "short_description": "Ley de conservación de la energía: ΔE = q + w.",
            "example_tasks": [
              "Enuncia la primera ley de la termodinámica y escribe su expresión matemática",
              "Explica qué significa que la energía se conserva en procesos químicos",
              "Calcula el cambio de energía interna si un sistema absorbe 500 J de calor y realiza 200 J de trabajo"
            ]
          },
          {
            "key": "procesos_exotermicos_endotermicos",
            "name": "Procesos Exotérmicos y Endotérmicos",
            "short_description": "Reacciones que liberan o absorben energía.",
            "example_tasks": [
              "Define proceso exotérmico y endotérmico, proporcionando dos ejemplos de cada uno",
              "Explica el signo de ΔH en reacciones exotérmicas y endotérmicas",
              "Describe la sensación térmica al tocar un recipiente donde ocurre una reacción exotérmica versus endotérmica"
            ]
          }
        ]
      },
      {
        "key": "entalpia",
        "name": "Entalpía (H)",
        "short_description": "Contenido de calor de un sistema a presión constante.",
        "sub_topics": [
          {
            "key": "definicion_entalpia",
            "name": "Concepto de Entalpía",
            "short_description": "Función de estado que representa el contenido energético de un sistema.",
            "example_tasks": [
              "Define entalpía y explica por qué es útil en química",
              "Explica qué significa que la entalpía sea una función de estado",
              "Describe la relación entre calor a presión constante y cambio de entalpía"
            ]
          },
          {
            "key": "entalpia_reaccion",
            "name": "Entalpía de Reacción (ΔH)",
            "short_description": "Cambio de entalpía durante una reacción química.",
            "example_tasks": [
              "Define entalpía de reacción y explica su significado",
              "Interpreta la ecuación termoquímica: CH₄ + 2O₂ → CO₂ + 2H₂O  ΔH = -890 kJ",
              "Explica por qué ΔH es negativo para reacciones exotérmicas"
            ]
          },
          {
            "key": "ecuaciones_termoquimicas",
            "name": "Ecuaciones Termoquímicas",
            "short_description": "Ecuaciones químicas que incluyen información sobre cambios de energía.",
            "example_tasks": [
              "Escribe la ecuación termoquímica para la combustión del propano (ΔH = -2220 kJ/mol)",
              "Calcula el calor liberado al quemar 5 moles de metano si ΔH = -890 kJ/mol",
              "Explica por qué es importante especificar los estados de agregación en ecuaciones termoquímicas"
            ]
          }
        ]
      },
      {
        "key": "tipos_entalpia",
        "name": "Tipos de Entalpía",
        "short_description": "Entalpías estándar de formación, combustión, neutralización y otras.",
        "sub_topics": [
          {
            "key": "entalpia_formacion",
            "name": "Entalpía Estándar de Formación (ΔH°f)",
            "short_description": "Calor liberado o absorbido al formar 1 mol de compuesto a partir de sus elementos.",
            "example_tasks": [
              "Define entalpía estándar de formación",
              "Explica por qué ΔH°f de elementos en su estado estándar es cero",
              "Escribe la ecuación de formación del agua líquida a partir de sus elementos"
            ]
          },
          {
            "key": "entalpia_combustion",
            "name": "Entalpía de Combustión (ΔH°c)",
            "short_description": "Calor liberado al quemar completamente 1 mol de sustancia.",
            "example_tasks": [
              "Define entalpía de combustión",
              "Calcula el calor liberado al quemar 10 g de etanol si ΔH°c = -1367 kJ/mol",
              "Explica por qué las entalpías de combustión son siempre negativas"
            ]
          },
          {
            "key": "entalpia_neutralizacion",
            "name": "Entalpía de Neutralización",
            "short_description": "Calor liberado al neutralizar 1 mol de ácido con base.",
            "example_tasks": [
              "Define entalpía de neutralización",
              "Explica por qué la neutralización de ácidos fuertes con bases fuertes tiene ΔH ≈ -57 kJ/mol",
              "Calcula el calor liberado al neutralizar 100 mL de HCl 1 M con NaOH 1 M"
            ]
          },
          {
            "key": "entalpia_disolucion",
            "name": "Entalpía de Disolución",
            "short_description": "Cambio de entalpía al disolver una sustancia en un solvente.",
            "example_tasks": [
              "Define entalpía de disolución",
              "Explica por qué algunas sustancias se enfrían al disolverse (como NH₄NO₃) y otras se calientan (como H₂SO₄)",
              "Describe los procesos energéticos involucrados en la disolución de un sólido iónico"
            ]
          }
        ]
      },
      {
        "key": "ley_hess",
        "name": "Ley de Hess",
        "short_description": "El cambio de entalpía de una reacción es independiente de la ruta seguida.",
        "sub_topics": [
          {
            "key": "enunciado_ley_hess",
            "name": "Enunciado de la Ley de Hess",
            "short_description": "ΔH total depende solo de estados inicial y final, no del camino.",
            "example_tasks": [
              "Enuncia la ley de Hess y explica su base termodinámica",
              "Explica por qué la entalpía es una función de estado usando la ley de Hess",
              "Describe cómo la ley de Hess permite calcular ΔH de reacciones difíciles de medir"
            ]
          },
          {
            "key": "aplicacion_ley_hess",
            "name": "Aplicación de la Ley de Hess",
            "short_description": "Cálculo de ΔH usando combinación de ecuaciones termoquímicas.",
            "example_tasks": [
              "Calcula ΔH para C + ½O₂ → CO usando: C + O₂ → CO₂ (ΔH₁ = -394 kJ) y CO + ½O₂ → CO₂ (ΔH₂ = -283 kJ)",
              "Determina ΔH de formación del C₂H₆ usando ecuaciones de combustión dadas",
              "Explica las reglas para manipular ecuaciones termoquímicas (invertir, multiplicar)"
            ]
          },
          {
            "key": "diagramas_entalpia",
            "name": "Diagramas de Entalpía",
            "short_description": "Representación gráfica de cambios energéticos en reacciones.",
            "example_tasks": [
              "Dibuja un diagrama de entalpía para una reacción exotérmica",
              "Interpreta un diagrama de entalpía e identifica reactivos, productos, ΔH y energía de activación",
              "Usa un diagrama para explicar la ley de Hess con rutas alternativas"
            ]
          }
        ]
      },
      {
        "key": "calculos_entalpia",
        "name": "Cálculos de Entalpía",
        "short_description": "Determinación de ΔH usando entalpías de formación y enlaces.",
        "sub_topics": [
          {
            "key": "metodo_entalpias_formacion",
            "name": "Método de Entalpías de Formación",
            "short_description": "ΔH°reacción = ΣΔH°f(productos) - ΣΔH°f(reactivos).",
            "example_tasks": [
              "Escribe la fórmula para calcular ΔH° de reacción usando entalpías de formación",
              "Calcula ΔH° para la reacción: CH₄ + 2O₂ → CO₂ + 2H₂O usando ΔH°f dados",
              "Explica por qué se restan las entalpías de formación de reactivos"
            ]
          },
          {
            "key": "metodo_energias_enlace",
            "name": "Método de Energías de Enlace",
            "short_description": "ΔH = Σ(energía enlaces rotos) - Σ(energía enlaces formados).",
            "example_tasks": [
              "Explica el método de energías de enlace para calcular ΔH",
              "Calcula ΔH para H₂ + Cl₂ → 2HCl usando energías de enlace: H-H (436 kJ/mol), Cl-Cl (243 kJ/mol), H-Cl (431 kJ/mol)",
              "Explica por qué romper enlaces requiere energía y formar enlaces libera energía"
            ]
          }
        ]
      },
      {
        "key": "calorimetria",
        "name": "Calorimetría",
        "short_description": "Medición experimental de cambios de calor.",
        "sub_topics": [
          {
            "key": "calorimetro",
            "name": "Calorímetro y su Uso",
            "short_description": "Dispositivo para medir calor liberado o absorbido en procesos.",
            "example_tasks": [
              "Describe los componentes básicos de un calorímetro",
              "Explica el principio de funcionamiento de un calorímetro de bomba",
              "Menciona precauciones para minimizar pérdidas de calor en calorimetría"
            ]
          },
          {
            "key": "calor_especifico",
            "name": "Calor Específico y Capacidad Calorífica",
            "short_description": "Cantidad de calor necesaria para elevar la temperatura de una sustancia.",
            "example_tasks": [
              "Define calor específico y capacidad calorífica, indicando sus unidades",
              "Calcula el calor necesario para elevar 100 g de agua de 25°C a 100°C (c = 4.18 J/g°C)",
              "Explica por qué el agua tiene un calor específico alto y su importancia biológica"
            ]
          },
          {
            "key": "ecuacion_calorimetrica",
            "name": "Ecuación Calorimétrica",
            "short_description": "q = m·c·ΔT para calcular calor intercambiado.",
            "example_tasks": [
              "Escribe la ecuación calorimétrica e identifica cada término",
              "Calcula la temperatura final cuando se mezclan 50 g de agua a 80°C con 100 g de agua a 20°C",
              "Determina el calor específico de un metal si 50 g a 100°C elevan 100 g de agua de 20°C a 25°C"
            ]
          },
          {
            "key": "calculos_calorimetricos",
            "name": "Cálculos Calorimétricos",
            "short_description": "Determinación de ΔH mediante experimentos de calorimetría.",
            "example_tasks": [
              "En un calorímetro con 200 g de agua a 25°C, se disuelven 10 g de NaOH y la temperatura sube a 35°C. Calcula ΔH de disolución",
              "Determina la entalpía de combustión del etanol si al quemar 1 g, 500 g de agua suben de 20°C a 35°C",
              "Explica el concepto de equivalente en agua del calorímetro"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "equilibrio_quimico",
    "name": "Equilibrio Químico",
    "short_description": "Estado dinámico de reacciones reversibles, constante de equilibrio, principio de Le Chatelier y cálculos de equilibrio.",
    "sub_topics": [
      {
        "key": "concepto_equilibrio",
        "name": "Concepto de Equilibrio Químico",
        "short_description": "Estado donde las velocidades de reacción directa e inversa son iguales.",
        "sub_topics": [
          {
            "key": "reacciones_reversibles",
            "name": "Reacciones Reversibles",
            "short_description": "Reacciones que pueden proceder en ambas direcciones.",
            "example_tasks": [
              "Define reacción reversible y explica su notación con doble flecha (⇌)",
              "Proporciona tres ejemplos de reacciones reversibles importantes",
              "Explica por qué algunas reacciones alcanzan equilibrio y otras van a completarse"
            ]
          },
          {
            "key": "equilibrio_dinamico",
            "name": "Equilibrio Dinámico",
            "short_description": "Las reacciones continúan pero no hay cambio neto en concentraciones.",
            "example_tasks": [
              "Explica qué significa que el equilibrio sea dinámico",
              "Describe qué sucede a nivel molecular cuando un sistema está en equilibrio",
              "Explica por qué las concentraciones permanecen constantes en equilibrio aunque las reacciones continúen"
            ]
          },
          {
            "key": "caracteristicas_equilibrio",
            "name": "Características del Equilibrio",
            "short_description": "Propiedades que definen un sistema en equilibrio químico.",
            "example_tasks": [
              "Enumera cinco características de un sistema en equilibrio químico",
              "Explica por qué el equilibrio solo se alcanza en sistemas cerrados",
              "Describe cómo se puede detectar experimentalmente que un sistema ha alcanzado equilibrio"
            ]
          }
        ]
      },
      {
        "key": "constante_equilibrio",
        "name": "Constante de Equilibrio (K)",
        "short_description": "Expresión cuantitativa de la posición de equilibrio.",
        "sub_topics": [
          {
            "key": "ley_accion_masas",
            "name": "Ley de Acción de Masas",
            "short_description": "Relación entre concentraciones de productos y reactivos en equilibrio.",
            "example_tasks": [
              "Enuncia la ley de acción de masas",
              "Para la reacción aA + bB ⇌ cC + dD, escribe la expresión de la constante de equilibrio Kc",
              "Explica por qué los coeficientes estequiométricos aparecen como exponentes en K"
            ]
          },
          {
            "key": "expresion_kc",
            "name": "Constante de Equilibrio en Concentraciones (Kc)",
            "short_description": "K expresada en términos de molaridad.",
            "example_tasks": [
              "Escribe la expresión de Kc para: N₂ + 3H₂ ⇌ 2NH₃",
              "Explica por qué los sólidos y líquidos puros no aparecen en la expresión de Kc",
              "Calcula Kc si en equilibrio: [N₂] = 0.2 M, [H₂] = 0.3 M, [NH₃] = 0.4 M"
            ]
          },
          {
            "key": "expresion_kp",
            "name": "Constante de Equilibrio en Presiones Parciales (Kp)",
            "short_description": "K expresada en términos de presiones para reacciones gaseosas.",
            "example_tasks": [
              "Escribe la expresión de Kp para: N₂(g) + 3H₂(g) ⇌ 2NH₃(g)",
              "Explica cuándo es conveniente usar Kp en lugar de Kc",
              "Deriva la relación entre Kp y Kc: Kp = Kc(RT)^Δn"
            ]
          },
          {
            "key": "interpretacion_k",
            "name": "Interpretación del Valor de K",
            "short_description": "Significado de valores grandes, pequeños o cercanos a 1 de K.",
            "example_tasks": [
              "Explica qué indica un valor de K >> 1 sobre la posición del equilibrio",
              "¿Qué significa que K << 1 para una reacción?",
              "Si K = 1, ¿qué puedes concluir sobre las concentraciones de reactivos y productos en equilibrio?"
            ]
          }
        ]
      },
      {
        "key": "cociente_reaccion",
        "name": "Cociente de Reacción (Q)",
        "short_description": "Expresión que permite predecir la dirección de una reacción.",
        "sub_topics": [
          {
            "key": "definicion_q",
            "name": "Definición de Q",
            "short_description": "Cociente de reacción calculado con concentraciones en cualquier momento.",
            "example_tasks": [
              "Define cociente de reacción (Q) y explica en qué difiere de K",
              "Escribe la expresión de Q para una reacción genérica",
              "Explica por qué Q puede cambiar con el tiempo mientras que K es constante a temperatura dada"
            ]
          },
          {
            "key": "comparacion_q_k",
            "name": "Comparación de Q con K",
            "short_description": "Predicción de la dirección de la reacción.",
            "example_tasks": [
              "Explica qué sucede cuando Q < K, Q = K y Q > K",
              "Si Q = 0.5 y K = 2, ¿en qué dirección procederá la reacción?",
              "Predice la dirección de reacción si Q = 10 y K = 0.01"
            ]
          },
          {
            "key": "aplicacion_q",
            "name": "Uso de Q para Predecir Cambios",
            "short_description": "Determinación de si el sistema formará más productos o reactivos.",
            "example_tasks": [
              "Para N₂ + 3H₂ ⇌ 2NH₃ con K = 0.5, calcula Q si [N₂] = 1 M, [H₂] = 1 M, [NH₃] = 2 M y predice la dirección",
              "Explica cómo usar Q para determinar si se formará precipitado en una solución",
              "Describe un ejemplo donde Q ayude a decidir si agregar más reactivo favorecerá los productos"
            ]
          }
        ]
      },
      {
        "key": "calculos_equilibrio",
        "name": "Cálculos de Equilibrio",
        "short_description": "Determinación de concentraciones en equilibrio.",
        "sub_topics": [
          {
            "key": "tabla_ice",
            "name": "Tabla ICE (Inicial-Cambio-Equilibrio)",
            "short_description": "Método sistemático para organizar cálculos de equilibrio.",
            "example_tasks": [
              "Explica qué representa cada fila en una tabla ICE",
              "Construye una tabla ICE para: H₂ + I₂ ⇌ 2HI partiendo de 1 M de H₂ y 1 M de I₂",
              "Usa una tabla ICE para calcular concentraciones en equilibrio cuando K y concentraciones iniciales son conocidas"
            ]
          },
          {
            "key": "problemas_equilibrio",
            "name": "Resolución de Problemas de Equilibrio",
            "short_description": "Cálculo de concentraciones o K usando datos de equilibrio.",
            "example_tasks": [
              "Si 2 moles de HI se colocan en 1 L y K = 50 para 2HI ⇌ H₂ + I₂, calcula las concentraciones en equilibrio",
              "Determina K si al inicio hay 1 M de A y 2 M de B, y en equilibrio quedan 0.5 M de A en A + B ⇌ 2C",
              "Calcula el porcentaje de disociación de N₂O₄ en una solución 0.5 M dado que K = 0.36 para N₂O₄ ⇌ 2NO₂"
            ]
          },
          {
            "key": "aproximaciones",
            "name": "Aproximaciones en Cálculos",
            "short_description": "Simplificación cuando K es muy pequeña o muy grande.",
            "example_tasks": [
              "Explica cuándo se puede usar la aproximación x << [inicial]",
              "Verifica si la aproximación es válida comparando x con el 5% de la concentración inicial",
              "Resuelve un problema de equilibrio usando la aproximación y verifica su validez"
            ]
          }
        ]
      },
      {
        "key": "principio_le_chatelier",
        "name": "Principio de Le Chatelier",
        "short_description": "Predicción de cómo el equilibrio responde a perturbaciones externas.",
        "sub_topics": [
          {
            "key": "enunciado_le_chatelier",
            "name": "Enunciado del Principio",
            "short_description": "Un sistema en equilibrio responde a perturbaciones desplazándose para contrarrestarlas.",
            "example_tasks": [
              "Enuncia el principio de Le Chatelier",
              "Explica qué significa que el sistema se desplace para contrarrestar una perturbación",
              "Describe cómo este principio ayuda a optimizar procesos industriales"
            ]
          },
          {
            "key": "efecto_concentracion",
            "name": "Efecto de Cambios en Concentración",
            "short_description": "Desplazamiento del equilibrio al agregar o remover reactivos/productos.",
            "example_tasks": [
              "Para N₂ + 3H₂ ⇌ 2NH₃, predice qué sucede si se agrega más N₂",
              "Explica hacia dónde se desplaza el equilibrio si se remueve NH₃ continuamente",
              "Describe cómo la remoción de productos puede aumentar el rendimiento de una reacción"
            ]
          },
          {
            "key": "efecto_presion_volumen",
            "name": "Efecto de Cambios en Presión y Volumen",
            "short_description": "Desplazamiento hacia el lado con menos moles de gas al aumentar presión.",
            "example_tasks": [
              "Para N₂ + 3H₂ ⇌ 2NH₃, predice el efecto de aumentar la presión",
              "Explica por qué cambios de presión no afectan equilibrios con igual número de moles de gas en ambos lados",
              "Describe qué sucede si se duplica el volumen de un recipiente con la reacción 2NO₂ ⇌ N₂O₄"
            ]
          },
          {
            "key": "efecto_temperatura",
            "name": "Efecto de Cambios en Temperatura",
            "short_description": "Desplazamiento dependiendo de si la reacción es exotérmica o endotérmica.",
            "example_tasks": [
              "Para una reacción exotérmica A ⇌ B + calor, predice el efecto de aumentar la temperatura",
              "Explica por qué la temperatura es la única variable que cambia el valor de K",
              "Para 2NO₂ ⇌ N₂O₄ (exotérmica), describe qué observarías al calentar y enfriar la mezcla gaseosa"
            ]
          },
          {
            "key": "efecto_catalizador",
            "name": "Efecto de Catalizadores",
            "short_description": "Los catalizadores no cambian la posición del equilibrio, solo la velocidad.",
            "example_tasks": [
              "Explica por qué un catalizador no afecta la posición del equilibrio",
              "Describe cómo un catalizador ayuda a alcanzar el equilibrio más rápidamente",
              "Explica el uso de catalizadores en el proceso Haber de síntesis de amoníaco"
            ]
          }
        ]
      },
      {
        "key": "equilibrios_heterogeneos",
        "name": "Equilibrios Heterogéneos",
        "short_description": "Equilibrios donde reactivos y productos están en diferentes fases.",
        "sub_topics": [
          {
            "key": "expresion_k_heterogeneo",
            "name": "Expresión de K para Equilibrios Heterogéneos",
            "short_description": "Exclusión de sólidos y líquidos puros de la expresión de equilibrio.",
            "example_tasks": [
              "Explica por qué sólidos y líquidos puros no aparecen en expresiones de K",
              "Escribe la expresión de K para: CaCO₃(s) ⇌ CaO(s) + CO₂(g)",
              "Para el equilibrio Fe₂O₃(s) + 3H₂(g) ⇌ 2Fe(s) + 3H₂O(g), escribe Kc y Kp"
            ]
          },
          {
            "key": "equilibrios_precipitacion",
            "name": "Equilibrios de Precipitación",
            "short_description": "Producto de solubilidad (Kps) para sales poco solubles.",
            "example_tasks": [
              "Define producto de solubilidad (Kps)",
              "Escribe la expresión de Kps para AgCl(s) ⇌ Ag⁺(aq) + Cl⁻(aq)",
              "Calcula la solubilidad de AgCl si Kps = 1.8 × 10⁻¹⁰"
            ]
          }
        ]
      },
      {
        "key": "aplicaciones_equilibrio",
        "name": "Aplicaciones del Equilibrio Químico",
        "short_description": "Importancia industrial y biológica de equilibrios químicos.",
        "sub_topics": [
          {
            "key": "proceso_haber",
            "name": "Proceso Haber-Bosch",
            "short_description": "Síntesis industrial de amoníaco.",
            "example_tasks": [
              "Describe el proceso Haber para la síntesis de NH₃",
              "Explica cómo se aplica el principio de Le Chatelier para optimizar la producción de amoníaco",
              "Menciona la importancia del amoníaco en la fabricación de fertilizantes"
            ]
          },
          {
            "key": "proceso_contacto",
            "name": "Proceso de Contacto",
            "short_description": "Producción industrial de ácido sulfúrico.",
            "example_tasks": [
              "Describe las etapas del proceso de contacto para producir H₂SO₄",
              "Explica el equilibrio clave: 2SO₂ + O₂ ⇌ 2SO₃ y cómo se optimiza",
              "Menciona la importancia industrial del ácido sulfúrico"
            ]
          },
          {
            "key": "equilibrios_biologicos",
            "name": "Equilibrios en Sistemas Biológicos",
            "short_description": "Equilibrios importantes en fisiología.",
            "example_tasks": [
              "Describe el equilibrio del transporte de oxígeno en la hemoglobina",
              "Explica el sistema buffer bicarbonato en la sangre como equilibrio químico",
              "Describe cómo el equilibrio químico explica el efecto Bohr en el transporte de oxígeno"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "cinetica_quimica",
    "name": "Cinética Química",
    "short_description": "Velocidad de reacción, factores que la afectan, leyes de velocidad, orden de reacción, energía de activación y mecanismos de reacción.",
    "sub_topics": [
      {
        "key": "velocidad_reaccion",
        "name": "Velocidad de Reacción",
        "short_description": "Medida de la rapidez con que ocurren las reacciones químicas.",
        "sub_topics": [
          {
            "key": "definicion_velocidad",
            "name": "Definición de Velocidad de Reacción",
            "short_description": "Cambio en concentración de reactivos o productos por unidad de tiempo.",
            "example_tasks": [
              "Define velocidad de reacción y menciona sus unidades típicas",
              "Explica por qué la velocidad de consumo de reactivos es negativa y la de formación de productos es positiva",
              "Para la reacción 2A → B, relaciona la velocidad de desaparición de A con la velocidad de formación de B"
            ]
          },
          {
            "key": "medicion_velocidad",
            "name": "Medición de Velocidad",
            "short_description": "Métodos experimentales para determinar velocidades de reacción.",
            "example_tasks": [
              "Describe tres métodos para medir la velocidad de una reacción",
              "Explica cómo se puede usar un cambio de color para seguir el progreso de una reacción",
              "Describe el uso de espectrofotometría para medir velocidades de reacción"
            ]
          },
          {
            "key": "velocidad_instantanea_promedio",
            "name": "Velocidad Instantánea y Promedio",
            "short_description": "Distinción entre velocidad en un momento específico y durante un intervalo.",
            "example_tasks": [
              "Explica la diferencia entre velocidad instantánea y velocidad promedio",
              "Describe cómo obtener la velocidad instantánea de una gráfica concentración vs. tiempo",
              "Calcula la velocidad promedio si [A] disminuye de 1.0 M a 0.6 M en 20 segundos"
            ]
          }
        ]
      },
      {
        "key": "factores_afectan_velocidad",
        "name": "Factores que Afectan la Velocidad",
        "short_description": "Variables que modifican la rapidez de las reacciones químicas.",
        "sub_topics": [
          {
            "key": "concentracion_velocidad",
            "name": "Concentración de Reactivos",
            "short_description": "Mayor concentración generalmente aumenta la velocidad.",
            "example_tasks": [
              "Explica por qué aumentar la concentración de reactivos aumenta la velocidad de reacción",
              "Describe cómo afecta la frecuencia de colisiones al cambiar la concentración",
              "Proporciona un ejemplo cotidiano del efecto de concentración en velocidad de reacción"
            ]
          },
          {
            "key": "temperatura_velocidad",
            "name": "Temperatura",
            "short_description": "Incremento de temperatura aumenta considerablemente la velocidad.",
            "example_tasks": [
              "Explica por qué la temperatura afecta la velocidad de reacción usando teoría cinética",
              "Describe la regla general de que la velocidad se duplica por cada 10°C de aumento",
              "Proporciona ejemplos de cómo se usa temperatura para controlar velocidades de reacción"
            ]
          },
          {
            "key": "superficie_contacto_velocidad",
            "name": "Superficie de Contacto",
            "short_description": "Mayor área de contacto aumenta la velocidad para reactivos sólidos.",
            "example_tasks": [
              "Explica por qué un sólido pulverizado reacciona más rápido que uno en bloque",
              "Describe la relación entre tamaño de partícula y velocidad de reacción",
              "Proporciona ejemplos industriales donde se controla el tamaño de partícula"
            ]
          },
          {
            "key": "catalizadores_velocidad",
            "name": "Catalizadores",
            "short_description": "Sustancias que aumentan la velocidad sin consumirse.",
            "example_tasks": [
              "Define catalizador y explica cómo aumenta la velocidad de reacción",
              "Describe la diferencia entre catalizadores homogéneos y heterogéneos",
              "Proporciona tres ejemplos de catalizadores importantes en industria o biología"
            ]
          }
        ]
      },
      {
        "key": "teoria_colisiones",
        "name": "Teoría de Colisiones",
        "short_description": "Modelo que explica cómo ocurren las reacciones químicas.",
        "sub_topics": [
          {
            "key": "postulados_teoria",
            "name": "Postulados de la Teoría de Colisiones",
            "short_description": "Condiciones necesarias para que una colisión sea efectiva.",
            "example_tasks": [
              "Enumera los postulados de la teoría de colisiones",
              "Explica por qué no todas las colisiones resultan en reacción",
              "Define colisión efectiva y factores que la determinan"
            ]
          },
          {
            "key": "energia_activacion",
            "name": "Energía de Activación (Ea)",
            "short_description": "Energía mínima necesaria para que ocurra una reacción.",
            "example_tasks": [
              "Define energía de activación y explica su significado",
              "Describe cómo la energía de activación afecta la velocidad de reacción",
              "Explica por qué reacciones con alta Ea son lentas a temperatura ambiente"
            ]
          },
          {
            "key": "complejo_activado",
            "name": "Complejo Activado (Estado de Transición)",
            "short_description": "Estructura temporal de alta energía durante la transformación de reactivos a productos.",
            "example_tasks": [
              "Define complejo activado o estado de transición",
              "Dibuja un diagrama de energía mostrando reactivos, complejo activado y productos",
              "Explica la diferencia entre complejo activado e intermediario de reacción"
            ]
          },
          {
            "key": "orientacion_molecular",
            "name": "Orientación Molecular",
            "short_description": "Factor estérico que requiere colisiones en orientación adecuada.",
            "example_tasks": [
              "Explica qué es el factor de orientación en colisiones moleculares",
              "Describe por qué algunas moléculas deben colisionar en orientaciones específicas",
              "Proporciona un ejemplo donde la orientación sea crítica para la reacción"
            ]
          }
        ]
      },
      {
        "key": "leyes_velocidad",
        "name": "Leyes de Velocidad",
        "short_description": "Expresiones matemáticas que relacionan velocidad con concentraciones.",
        "sub_topics": [
          {
            "key": "ecuacion_velocidad",
            "name": "Ecuación de Velocidad",
            "short_description": "Expresión v = k[A]^m[B]^n para la velocidad.",
            "example_tasks": [
              "Escribe la ecuación general de velocidad e identifica cada término",
              "Explica qué representa la constante de velocidad (k)",
              "Describe cómo cambia k con la temperatura"
            ]
          },
          {
            "key": "orden_reaccion",
            "name": "Orden de Reacción",
            "short_description": "Exponentes en la ley de velocidad que indican dependencia de concentración.",
            "example_tasks": [
              "Define orden de reacción con respecto a un reactivo y orden total",
              "Si v = k[A]²[B], indica el orden con respecto a A, B y el orden total",
              "Explica por qué el orden de reacción debe determinarse experimentalmente"
            ]
          },
          {
            "key": "determinacion_orden",
            "name": "Determinación del Orden de Reacción",
            "short_description": "Métodos experimentales para encontrar exponentes en ley de velocidad.",
            "example_tasks": [
              "Describe el método de velocidades iniciales para determinar orden de reacción",
              "Si duplicar [A] cuadruplica la velocidad, ¿cuál es el orden con respecto a A?",
              "Usa datos de velocidad inicial a diferentes concentraciones para determinar la ley de velocidad"
            ]
          },
          {
            "key": "reacciones_orden_cero",
            "name": "Reacciones de Orden Cero",
            "short_description": "Velocidad independiente de la concentración del reactivo.",
            "example_tasks": [
              "Describe las características de una reacción de orden cero",
              "Escribe la ecuación integrada para reacciones de orden cero",
              "Proporciona un ejemplo de reacción de orden cero (como catálisis heterogénea)"
            ]
          },
          {
            "key": "reacciones_primer_orden",
            "name": "Reacciones de Primer Orden",
            "short_description": "Velocidad proporcional a [A].",
            "example_tasks": [
              "Escribe la ecuación de velocidad para una reacción de primer orden",
              "Deriva la ecuación integrada: ln[A] = -kt + ln[A]₀",
              "Calcula la constante de velocidad si [A] disminuye de 1.0 M a 0.5 M en 100 segundos"
            ]
          },
          {
            "key": "reacciones_segundo_orden",
            "name": "Reacciones de Segundo Orden",
            "short_description": "Velocidad proporcional a [A]² o [A][B].",
            "example_tasks": [
              "Escribe la ecuación de velocidad para una reacción de segundo orden",
              "Describe la forma de la ecuación integrada para segundo orden",
              "Explica cómo distinguir gráficamente entre reacciones de primer y segundo orden"
            ]
          }
        ]
      },
      {
        "key": "vida_media",
        "name": "Vida Media (t₁/₂)",
        "short_description": "Tiempo necesario para que la concentración se reduzca a la mitad.",
        "sub_topics": [
          {
            "key": "definicion_vida_media",
            "name": "Concepto de Vida Media",
            "short_description": "Tiempo característico de velocidad de reacción.",
            "example_tasks": [
              "Define vida media de una reacción",
              "Explica cómo la vida media se relaciona con la velocidad de reacción",
              "Describe aplicaciones del concepto de vida media"
            ]
          },
          {
            "key": "vida_media_primer_orden",
            "name": "Vida Media en Reacciones de Primer Orden",
            "short_description": "t₁/₂ = 0.693/k, independiente de concentración inicial.",
            "example_tasks": [
              "Deriva la ecuación t₁/₂ = 0.693/k para reacciones de primer orden",
              "Calcula la vida media de una reacción de primer orden con k = 0.0231 s⁻¹",
              "Explica por qué t₁/₂ es constante para reacciones de primer orden"
            ]
          },
          {
            "key": "vida_media_otros_ordenes",
            "name": "Vida Media en Otros Órdenes",
            "short_description": "Dependencia de concentración inicial en órdenes diferentes de 1.",
            "example_tasks": [
              "Explica por qué t₁/₂ depende de [A]₀ en reacciones de segundo orden",
              "Escribe la expresión de t₁/₂ para una reacción de orden cero",
              "Compara cómo cambia t₁/₂ con el tiempo en diferentes órdenes de reacción"
            ]
          }
        ]
      },
      {
        "key": "ecuacion_arrhenius",
        "name": "Ecuación de Arrhenius",
        "short_description": "Relación entre constante de velocidad, temperatura y energía de activación.",
        "sub_topics": [
          {
            "key": "forma_arrhenius",
            "name": "Ecuación de Arrhenius",
            "short_description": "k = A·e^(-Ea/RT) relaciona k con temperatura.",
            "example_tasks": [
              "Escribe la ecuación de Arrhenius e identifica cada término",
              "Define factor pre-exponencial (A) y explica qué representa",
              "Explica cómo la ecuación muestra la dependencia de k con temperatura"
            ]
          },
          {
            "key": "forma_lineal_arrhenius",
            "name": "Forma Lineal de Arrhenius",
            "short_description": "ln k = ln A - Ea/RT para determinar Ea gráficamente.",
            "example_tasks": [
              "Deriva la forma lineal de la ecuación de Arrhenius",
              "Describe cómo obtener Ea de una gráfica ln k vs. 1/T",
              "Calcula Ea usando datos de k a dos temperaturas diferentes"
            ]
          },
          {
            "key": "aplicacion_arrhenius",
            "name": "Aplicaciones de la Ecuación",
            "short_description": "Predicción de constantes de velocidad a diferentes temperaturas.",
            "example_tasks": [
              "Calcula k₂ a 350 K si k₁ = 0.01 s⁻¹ a 300 K y Ea = 50 kJ/mol",
              "Explica por qué pequeños aumentos de temperatura tienen efectos grandes en k",
              "Describe el uso de la ecuación de Arrhenius en estudios de estabilidad de productos"
            ]
          }
        ]
      },
      {
        "key": "mecanismos_reaccion",
        "name": "Mecanismos de Reacción",
        "short_description": "Secuencia de pasos elementales que conducen de reactivos a productos.",
        "sub_topics": [
          {
            "key": "pasos_elementales",
            "name": "Reacciones Elementales",
            "short_description": "Pasos individuales que ocurren a nivel molecular.",
            "example_tasks": [
              "Define reacción elemental y explica en qué difiere de una reacción global",
              "Explica por qué la ley de velocidad de una reacción elemental puede escribirse directamente",
              "Clasifica reacciones elementales según su molecularidad (unimolecular, bimolecular, termolecular)"
            ]
          },
          {
            "key": "intermediarios",
            "name": "Intermediarios de Reacción",
            "short_description": "Especies formadas y consumidas durante el mecanismo.",
            "example_tasks": [
              "Define intermediario de reacción",
              "Explica por qué los intermediarios no aparecen en la ecuación global",
              "Identifica los intermediarios en un mecanismo de reacción dado"
            ]
          },
          {
            "key": "paso_determinante",
            "name": "Paso Determinante de la Velocidad",
            "short_description": "Paso más lento que controla la velocidad global.",
            "example_tasks": [
              "Define paso determinante de la velocidad",
              "Explica por qué el paso más lento controla la velocidad total",
              "Escribe la ley de velocidad basándote en el paso determinante de un mecanismo dado"
            ]
          },
          {
            "key": "validacion_mecanismos",
            "name": "Validación de Mecanismos Propuestos",
            "short_description": "Criterios para aceptar o rechazar un mecanismo.",
            "example_tasks": [
              "Enumera los criterios que debe cumplir un mecanismo propuesto",
              "Verifica si un mecanismo es consistente con la ley de velocidad experimental",
              "Explica por qué múltiples mecanismos pueden ser consistentes con los datos"
            ]
          }
        ]
      },
      {
        "key": "catalisis",
        "name": "Catálisis",
        "short_description": "Función de catalizadores en aumentar velocidad sin consumirse.",
        "sub_topics": [
          {
            "key": "mecanismo_catalitico",
            "name": "Mecanismo de Acción de Catalizadores",
            "short_description": "Disminución de energía de activación mediante ruta alternativa.",
            "example_tasks": [
              "Explica cómo un catalizador disminuye la energía de activación",
              "Dibuja un diagrama de energía comparando reacción catalizada y no catalizada",
              "Explica por qué los catalizadores no afectan ΔH de la reacción"
            ]
          },
          {
            "key": "catalisis_homogenea",
            "name": "Catálisis Homogénea",
            "short_description": "Catalizador en la misma fase que los reactivos.",
            "example_tasks": [
              "Define catálisis homogénea y proporciona ejemplos",
              "Describe el mecanismo de catálisis ácida en la hidrólisis de ésteres",
              "Explica ventajas y desventajas de la catálisis homogénea"
            ]
          },
          {
            "key": "catalisis_heterogenea",
            "name": "Catálisis Heterogénea",
            "short_description": "Catalizador en fase diferente a los reactivos.",
            "example_tasks": [
              "Define catálisis heterogénea y proporciona ejemplos industriales",
              "Describe el proceso de adsorción-reacción-desorción en catálisis heterogénea",
              "Explica el funcionamiento del convertidor catalítico en automóviles"
            ]
          },
          {
            "key": "enzimas",
            "name": "Catálisis Enzimática",
            "short_description": "Catalizadores biológicos de alta especificidad.",
            "example_tasks": [
              "Explica cómo las enzimas funcionan como catalizadores biológicos",
              "Describe el modelo de llave-cerradura para la acción enzimática",
              "Menciona factores que afectan la actividad enzimática (pH, temperatura)"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "termodinamica_quimica",
    "name": "Termodinámica Química",
    "short_description": "Leyes de la termodinámica, entropía, energía libre de Gibbs, espontaneidad de reacciones y relación con equilibrio.",
    "sub_topics": [
      {
        "key": "segunda_ley_termodinamica",
        "name": "Segunda Ley de la Termodinámica",
        "short_description": "Los procesos espontáneos aumentan la entropía del universo.",
        "sub_topics": [
          {
            "key": "concepto_entropia",
            "name": "Entropía (S)",
            "short_description": "Medida del desorden o dispersión de energía en un sistema.",
            "example_tasks": [
              "Define entropía y explica qué representa a nivel molecular",
              "Describe cómo cambia la entropía en procesos de fusión, vaporización y disolución",
              "Explica por qué los gases tienen mayor entropía que los líquidos y sólidos"
            ]
          },
          {
            "key": "segunda_ley",
            "name": "Enunciado de la Segunda Ley",
            "short_description": "ΔSuniverso > 0 para procesos espontáneos.",
            "example_tasks": [
              "Enuncia la segunda ley de la termodinámica",
              "Explica qué significa que la entropía del universo siempre aumenta",
              "Relaciona la segunda ley con la direccionalidad de procesos naturales"
            ]
          },
          {
            "key": "cambios_entropia",
            "name": "Cambios de Entropía",
            "short_description": "ΔSuniverso = ΔSsistema + ΔSentorno.",
            "example_tasks": [
              "Explica cómo calcular el cambio de entropía del universo",
              "Predice el signo de ΔS para: a) sublimación de CO₂, b) condensación de vapor, c) cristalización",
              "Calcula ΔS° de reacción usando: ΔS° = ΣS°(productos) - ΣS°(reactivos)"
            ]
          }
        ]
      },
      {
        "key": "tercera_ley_termodinamica",
        "name": "Tercera Ley de la Termodinámica",
        "short_description": "La entropía de un cristal perfecto a 0 K es cero.",
        "sub_topics": [
          {
            "key": "enunciado_tercera_ley",
            "name": "Tercera Ley",
            "short_description": "Establece un punto de referencia absoluto para entropía.",
            "example_tasks": [
              "Enuncia la tercera ley de la termodinámica",
              "Explica por qué es posible tener valores absolutos de entropía",
              "Describe qué significa que S = 0 a 0 K para un cristal perfecto"
            ]
          },
          {
            "key": "entropias_molares_estandar",
            "name": "Entropías Molares Estándar",
            "short_description": "Valores de S° a 298 K y 1 atm.",
            "example_tasks": [
              "Explica qué son las entropías molares estándar",
              "Compara valores típicos de S° para sólidos, líquidos y gases",
              "Usa valores de S° para calcular ΔS° de una reacción"
            ]
          }
        ]
      },
      {
        "key": "energia_libre_gibbs",
        "name": "Energía Libre de Gibbs (G)",
        "short_description": "Función que predice la espontaneidad de procesos a T y P constantes.",
        "sub_topics": [
          {
            "key": "definicion_gibbs",
            "name": "Definición de Energía Libre",
            "short_description": "G = H - TS combina efectos de entalpía y entropía.",
            "example_tasks": [
              "Define energía libre de Gibbs",
              "Explica por qué G es útil para predecir espontaneidad",
              "Describe qué representa cada término en G = H - TS"
            ]
          },
          {
            "key": "cambio_energia_libre",
            "name": "Cambio de Energía Libre (ΔG)",
            "short_description": "ΔG = ΔH - TΔS predice la dirección de procesos.",
            "example_tasks": [
              "Escribe la ecuación fundamental de Gibbs: ΔG = ΔH - TΔS",
              "Explica qué significa un ΔG negativo, positivo o cero",
              "Calcula ΔG para una reacción con ΔH = -50 kJ, ΔS = 100 J/K a 298 K"
            ]
          },
          {
            "key": "espontaneidad",
            "name": "Criterio de Espontaneidad",
            "short_description": "ΔG < 0 para procesos espontáneos.",
            "example_tasks": [
              "Explica el criterio de espontaneidad basado en ΔG",
              "Describe las cuatro posibilidades según los signos de ΔH y ΔS",
              "Predice la temperatura a la cual una reacción se vuelve espontánea"
            ]
          }
        ]
      },
      {
        "key": "energia_libre_estandar",
        "name": "Energía Libre Estándar",
        "short_description": "ΔG° a condiciones estándar (1 atm, 298 K, 1 M).",
        "sub_topics": [
          {
            "key": "energia_libre_formacion",
            "name": "Energía Libre Estándar de Formación",
            "short_description": "ΔG°f para formar 1 mol de compuesto desde elementos.",
            "example_tasks": [
              "Define ΔG°f y explica su utilidad",
              "Explica por qué ΔG°f de elementos en estado estándar es cero",
              "Calcula ΔG° de reacción usando: ΔG° = ΣΔG°f(productos) - ΣΔG°f(reactivos)"
            ]
          },
          {
            "key": "calculo_energia_libre",
            "name": "Cálculo de ΔG°",
            "short_description": "Métodos para determinar ΔG° de reacciones.",
            "example_tasks": [
              "Calcula ΔG° usando ΔG° = ΔH° - TΔS°",
              "Determina ΔG° de una reacción usando energías libres de formación",
              "Explica cuál método es más conveniente según los datos disponibles"
            ]
          }
        ]
      },
      {
        "key": "gibbs_equilibrio",
        "name": "Energía Libre y Equilibrio",
        "short_description": "Relación entre ΔG°, K y composición en equilibrio.",
        "sub_topics": [
          {
            "key": "relacion_gibbs_k",
            "name": "Relación ΔG° = -RT ln K",
            "short_description": "Conexión entre termodinámica y equilibrio químico.",
            "example_tasks": [
              "Escribe la ecuación que relaciona ΔG° con la constante de equilibrio K",
              "Calcula K a 298 K para una reacción con ΔG° = -20 kJ/mol",
              "Explica qué indica sobre K un valor de ΔG° muy negativo"
            ]
          },
          {
            "key": "gibbs_condiciones_no_estandar",
            "name": "ΔG en Condiciones No Estándar",
            "short_description": "ΔG = ΔG° + RT ln Q relaciona G con composición.",
            "example_tasks": [
              "Escribe la ecuación de ΔG en función de Q (cociente de reacción)",
              "Explica por qué ΔG = 0 en equilibrio",
              "Calcula ΔG cuando Q = 0.1 y ΔG° = -10 kJ/mol a 298 K"
            ]
          },
          {
            "key": "prediccion_direccion",
            "name": "Predicción de Dirección de Reacción",
            "short_description": "Uso de ΔG para determinar si la reacción procede hacia productos o reactivos.",
            "example_tasks": [
              "Predice la dirección de reacción si ΔG < 0, ΔG = 0, ΔG > 0",
              "Relaciona los valores de Q y K con el signo de ΔG",
              "Explica cómo cambiar condiciones para hacer espontánea una reacción no espontánea"
            ]
          }
        ]
      },
      {
        "key": "aplicaciones_termodinamica",
        "name": "Aplicaciones de la Termodinámica",
        "short_description": "Uso de principios termodinámicos en procesos reales.",
        "sub_topics": [
          {
            "key": "acoplamiento_reacciones",
            "name": "Acoplamiento de Reacciones",
            "short_description": "Uso de reacciones espontáneas para impulsar reacciones no espontáneas.",
            "example_tasks": [
              "Explica el concepto de acoplamiento de reacciones",
              "Describe cómo el ATP impulsa reacciones no espontáneas en sistemas biológicos",
              "Calcula ΔG total cuando se acoplan dos reacciones"
            ]
          },
          {
            "key": "termodinamica_vs_cinetica",
            "name": "Control Termodinámico vs. Cinético",
            "short_description": "Distinción entre favorabilidad termodinámica y velocidad de reacción.",
            "example_tasks": [
              "Explica la diferencia entre control termodinámico y control cinético",
              "Proporciona ejemplos de reacciones termodinámicamente favorables pero cinéticamente lentas",
              "Describe el papel de catalizadores en superar barreras cinéticas sin afectar termodinámica"
            ]
          },
          {
            "key": "eficiencia_procesos",
            "name": "Eficiencia de Procesos",
            "short_description": "Evaluación de la eficiencia energética de transformaciones químicas.",
            "example_tasks": [
              "Explica cómo la termodinámica limita la eficiencia de máquinas térmicas",
              "Describe el concepto de energía útil vs. energía disipada",
              "Calcula la eficiencia de un proceso químico usando valores de ΔG"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "equilibrio_acido_base_avanzado",
    "name": "Equilibrio Ácido-Base Avanzado",
    "short_description": "Cálculos de pH para ácidos y bases débiles, hidrólisis, soluciones buffer y titulaciones.",
    "sub_topics": [
      {
        "key": "acidos_bases_debiles",
        "name": "Equilibrios de Ácidos y Bases Débiles",
        "short_description": "Ionización parcial y cálculos de pH.",
        "sub_topics": [
          {
            "key": "ionizacion_acidos_debiles",
            "name": "Ionización de Ácidos Débiles",
            "short_description": "Uso de Ka para calcular pH de soluciones de ácidos débiles.",
            "example_tasks": [
              "Calcula el pH de una solución 0.1 M de ácido acético (Ka = 1.8 × 10⁻⁵)",
              "Determina el porcentaje de ionización de un ácido débil",
              "Explica cuándo se puede usar la aproximación [H⁺] ≈ √(Ka·C)"
            ]
          },
          {
            "key": "ionizacion_bases_debiles",
            "name": "Ionización de Bases Débiles",
            "short_description": "Uso de Kb para calcular pH de soluciones de bases débiles.",
            "example_tasks": [
              "Calcula el pH de una solución 0.2 M de amoníaco (Kb = 1.8 × 10⁻⁵)",
              "Determina el porcentaje de ionización de una base débil",
              "Relaciona Ka de un ácido con Kb de su base conjugada: Ka × Kb = Kw"
            ]
          },
          {
            "key": "acidos_poliproticos",
            "name": "Ácidos Polipróticos",
            "short_description": "Ácidos con múltiples hidrógenos ionizables.",
            "example_tasks": [
              "Define ácido poliprótico y proporciona ejemplos",
              "Escribe las ecuaciones de ionización y constantes Ka1, Ka2 para H₂SO₃",
              "Calcula el pH de una solución de H₃PO₄ considerando principalmente la primera ionización"
            ]
          }
        ]
      },
      {
        "key": "hidrolisis_sales",
        "name": "Hidrólisis de Sales",
        "short_description": "Reacción de iones de sales con agua que afecta el pH.",
        "sub_topics": [
          {
            "key": "sales_acido_fuerte_base_fuerte",
            "name": "Sales de Ácido Fuerte y Base Fuerte",
            "short_description": "Soluciones neutras (pH = 7).",
            "example_tasks": [
              "Explica por qué NaCl produce soluciones neutras",
              "Describe qué iones no experimentan hidrólisis",
              "Proporciona tres ejemplos de sales que dan pH = 7"
            ]
          },
          {
            "key": "sales_acido_debil_base_fuerte",
            "name": "Sales de Ácido Débil y Base Fuerte",
            "short_description": "Soluciones básicas por hidrólisis del anión.",
            "example_tasks": [
              "Explica por qué CH₃COONa produce soluciones básicas",
              "Escribe la ecuación de hidrólisis del ion acetato",
              "Calcula el pH de una solución 0.1 M de NaC₂H₃O₂"
            ]
          },
          {
            "key": "sales_acido_fuerte_base_debil",
            "name": "Sales de Ácido Fuerte y Base Débil",
            "short_description": "Soluciones ácidas por hidrólisis del catión.",
            "example_tasks": [
              "Explica por qué NH₄Cl produce soluciones ácidas",
              "Escribe la ecuación de hidrólisis del ion amonio",
              "Calcula el pH de una solución 0.2 M de NH₄NO₃"
            ]
          },
          {
            "key": "sales_acido_debil_base_debil",
            "name": "Sales de Ácido Débil y Base Débil",
            "short_description": "pH depende de las constantes Ka y Kb.",
            "example_tasks": [
              "Explica cómo predecir si una sal de ácido débil/base débil será ácida o básica",
              "Compara Ka del ácido con Kb de la base para CH₃COONH₄",
              "Describe por qué estas sales son más complejas de analizar"
            ]
          }
        ]
      },
      {
        "key": "soluciones_buffer_avanzado",
        "name": "Soluciones Amortiguadoras (Buffer) - Avanzado",
        "short_description": "Diseño, preparación y capacidad de buffers.",
        "sub_topics": [
          {
            "key": "calculo_ph_buffer",
            "name": "Cálculo de pH de Buffers",
            "short_description": "Uso de Henderson-Hasselbalch en diferentes escenarios.",
            "example_tasks": [
              "Calcula el pH de un buffer con 0.1 M CH₃COOH y 0.15 M CH₃COONa (pKa = 4.74)",
              "Determina cómo cambiar la relación [A⁻]/[HA] para lograr un pH específico",
              "Calcula el pH después de agregar 0.01 moles de HCl a 1 L del buffer anterior"
            ]
          },
          {
            "key": "preparacion_buffer",
            "name": "Preparación de Soluciones Buffer",
            "short_description": "Diseño de buffers con pH y capacidad específicos.",
            "example_tasks": [
              "Describe cómo preparar 500 mL de buffer de fosfato con pH = 7.2",
              "Explica cómo seleccionar el par ácido/base para un pH deseado",
              "Calcula las cantidades de NH₃ y NH₄Cl necesarias para un buffer de pH = 9.0"
            ]
          },
          {
            "key": "rango_buffer",
            "name": "Rango Efectivo de Buffer",
            "short_description": "Intervalo de pH donde el buffer funciona efectivamente.",
            "example_tasks": [
              "Explica la regla del rango efectivo: pKa ± 1",
              "Determina el rango de pH efectivo para un buffer de ácido acético",
              "Explica por qué los buffers pierden efectividad fuera de su rango"
            ]
          },
          {
            "key": "capacidad_buffer_cuantitativa",
            "name": "Capacidad Amortiguadora Cuantitativa",
            "short_description": "Cálculo de cuánto ácido o base puede neutralizar un buffer.",
            "example_tasks": [
              "Calcula cuántos moles de HCl puede neutralizar 1 L de buffer 0.1 M antes de que pH cambie más de 1 unidad",
              "Determina la capacidad buffer comparando dos buffers con diferentes concentraciones",
              "Explica cómo aumentar la capacidad buffer sin cambiar el pH"
            ]
          }
        ]
      },
      {
        "key": "titulaciones_avanzado",
        "name": "Titulaciones - Análisis Avanzado",
        "short_description": "Curvas de titulación, selección de indicadores y cálculos.",
        "sub_topics": [
          {
            "key": "titulacion_acido_fuerte_base_fuerte",
            "name": "Titulación Ácido Fuerte - Base Fuerte",
            "short_description": "Análisis de curva con punto de equivalencia a pH = 7.",
            "example_tasks": [
              "Dibuja y explica la curva de titulación de HCl con NaOH",
              "Calcula el pH después de agregar 10 mL, 25 mL y 30 mL de NaOH 0.1 M a 25 mL de HCl 0.1 M",
              "Explica por qué el pH cambia bruscamente cerca del punto de equivalencia"
            ]
          },
          {
            "key": "titulacion_acido_debil_base_fuerte",
            "name": "Titulación Ácido Débil - Base Fuerte",
            "short_description": "Curva con punto de equivalencia pH > 7 y región buffer.",
            "example_tasks": [
              "Dibuja la curva de titulación de CH₃COOH con NaOH e identifica regiones clave",
              "Calcula el pH en el punto medio de la titulación y relaciona con pKa",
              "Explica por qué el punto de equivalencia está por encima de pH = 7"
            ]
          },
          {
            "key": "titulacion_base_debil_acido_fuerte",
            "name": "Titulación Base Débil - Ácido Fuerte",
            "short_description": "Curva con punto de equivalencia pH < 7.",
            "example_tasks": [
              "Describe las características de la curva de titulación de NH₃ con HCl",
              "Calcula el pH en diferentes puntos de la titulación",
              "Explica por qué el punto de equivalencia está por debajo de pH = 7"
            ]
          },
          {
            "key": "seleccion_indicadores",
            "name": "Selección de Indicadores",
            "short_description": "Elección del indicador apropiado según el tipo de titulación.",
            "example_tasks": [
              "Explica cómo seleccionar un indicador adecuado para una titulación",
              "Indica qué indicador usarías para titular ácido acético con NaOH",
              "Explica por qué la fenolftaleína no es adecuada para titular NH₃ con HCl"
            ]
          },
          {
            "key": "titulacion_poliproticos",
            "name": "Titulación de Ácidos Polipróticos",
            "short_description": "Múltiples puntos de equivalencia en la curva.",
            "example_tasks": [
              "Dibuja la curva de titulación de H₃PO₄ e identifica los tres puntos de equivalencia",
              "Explica por qué algunos puntos de equivalencia son más visibles que otros",
              "Calcula el pH en cada punto de equivalencia de la titulación de H₂SO₃"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "introduccion_quimica_organica",
    "name": "Introducción a la Química Orgánica",
    "short_description": "Características del carbono, hidrocarburos, nomenclatura básica y propiedades de compuestos orgánicos.",
    "sub_topics": [
      {
        "key": "caracteristicas_carbono",
        "name": "Características del Átomo de Carbono",
        "short_description": "Propiedades únicas que permiten la diversidad de compuestos orgánicos.",
        "sub_topics": [
          {
            "key": "tetravalencia_carbono",
            "name": "Tetravalencia del Carbono",
            "short_description": "Capacidad de formar cuatro enlaces covalentes.",
            "example_tasks": [
              "Explica por qué el carbono forma cuatro enlaces y no dos o seis",
              "Dibuja la estructura electrónica del carbono y su capacidad de hibridación",
              "Describe los tres tipos de hibridación del carbono: sp³, sp², sp"
            ]
          },
          {
            "key": "catenacion",
            "name": "Catenación",
            "short_description": "Capacidad de formar cadenas largas con otros átomos de carbono.",
            "example_tasks": [
              "Define catenación y explica por qué el carbono tiene esta propiedad",
              "Compara la capacidad de catenación del carbono con otros elementos como silicio",
              "Explica cómo la catenación permite la existencia de millones de compuestos orgánicos"
            ]
          },
          {
            "key": "enlaces_multiples",
            "name": "Formación de Enlaces Múltiples",
            "short_description": "Capacidad de formar enlaces simples, dobles y triples.",
            "example_tasks": [
              "Dibuja ejemplos de moléculas con enlaces C-C, C=C y C≡C",
              "Explica la diferencia en longitud y energía de enlaces simples, dobles y triples",
              "Describe cómo los enlaces múltiples afectan la geometría molecular"
            ]
          },
          {
            "key": "compuestos_organicos_caracteristicas",
            "name": "Características Generales de Compuestos Orgánicos",
            "short_description": "Propiedades distintivas de sustancias orgánicas.",
            "example_tasks": [
              "Enumera cinco propiedades características de compuestos orgánicos",
              "Explica por qué la mayoría de compuestos orgánicos tienen bajos puntos de fusión",
              "Compara la solubilidad de compuestos orgánicos en agua versus solventes no polares"
            ]
          }
        ]
      },
      {
        "key": "clasificacion_compuestos_organicos",
        "name": "Clasificación de Compuestos Orgánicos",
        "short_description": "Organización según estructura de cadena y grupos funcionales.",
        "sub_topics": [
          {
            "key": "cadenas_carbonadas",
            "name": "Tipos de Cadenas Carbonadas",
            "short_description": "Clasificación según forma: lineales, ramificadas, cíclicas.",
            "example_tasks": [
              "Dibuja ejemplos de cadenas lineales, ramificadas y cíclicas",
              "Clasifica las siguientes estructuras según su tipo de cadena",
              "Explica la diferencia entre hidrocarburos alifáticos y aromáticos"
            ]
          },
          {
            "key": "saturados_insaturados",
            "name": "Hidrocarburos Saturados e Insaturados",
            "short_description": "Presencia o ausencia de enlaces múltiples.",
            "example_tasks": [
              "Define hidrocarburo saturado e insaturado",
              "Clasifica los siguientes como saturados o insaturados: etano, eteno, etino",
              "Explica por qué los hidrocarburos insaturados son más reactivos"
            ]
          },
          {
            "key": "grupos_funcionales_intro",
            "name": "Concepto de Grupo Funcional",
            "short_description": "Átomos o grupos de átomos que determinan propiedades químicas.",
            "example_tasks": [
              "Define grupo funcional y explica su importancia",
              "Enumera cinco grupos funcionales comunes",
              "Explica cómo el grupo funcional determina el comportamiento químico de una molécula"
            ]
          }
        ]
      },
      {
        "key": "hidrocarburos",
        "name": "Hidrocarburos",
        "short_description": "Compuestos formados únicamente por carbono e hidrógeno.",
        "sub_topics": [
          {
            "key": "alcanos",
            "name": "Alcanos",
            "short_description": "Hidrocarburos saturados con enlaces simples: CₙH₂ₙ₊₂.",
            "example_tasks": [
              "Define alcano y escribe su fórmula general",
              "Nombra y dibuja los cinco primeros alcanos lineales",
              "Explica por qué los alcanos se llaman hidrocarburos saturados"
            ]
          },
          {
            "key": "nomenclatura_alcanos",
            "name": "Nomenclatura de Alcanos",
            "short_description": "Reglas IUPAC para nombrar alcanos lineales y ramificados.",
            "example_tasks": [
              "Nombra el siguiente alcano ramificado según IUPAC",
              "Escribe la estructura del 2,3-dimetilpentano",
              "Explica las reglas para numerar la cadena principal en alcanos ramificados"
            ]
          },
          {
            "key": "propiedades_alcanos",
            "name": "Propiedades de Alcanos",
            "short_description": "Características físicas y químicas de alcanos.",
            "example_tasks": [
              "Describe cómo varía el punto de ebullición con el tamaño de la cadena en alcanos",
              "Explica por qué los alcanos son no polares y su solubilidad",
              "Menciona los usos principales de alcanos como el metano, propano y octano"
            ]
          },
          {
            "key": "alquenos",
            "name": "Alquenos",
            "short_description": "Hidrocarburos insaturados con un enlace doble: CₙH₂ₙ.",
            "example_tasks": [
              "Define alqueno y escribe su fórmula general",
              "Nombra y dibuja los tres primeros alquenos",
              "Explica la geometría plana alrededor del enlace doble"
            ]
          },
          {
            "key": "nomenclatura_alquenos",
            "name": "Nomenclatura de Alquenos",
            "short_description": "Reglas IUPAC para nombrar alquenos.",
            "example_tasks": [
              "Nombra el siguiente alqueno: CH₃-CH=CH-CH₃",
              "Escribe la estructura del 2-metil-2-buteno",
              "Explica cómo se numera la cadena para que el doble enlace tenga el número más bajo"
            ]
          },
          {
            "key": "alquinos",
            "name": "Alquinos",
            "short_description": "Hidrocarburos insaturados con un enlace triple: CₙH₂ₙ₋₂.",
            "example_tasks": [
              "Define alquino y escribe su fórmula general",
              "Nombra y dibuja los tres primeros alquinos",
              "Explica la geometría lineal alrededor del enlace triple"
            ]
          },
          {
            "key": "nomenclatura_alquinos",
            "name": "Nomenclatura de Alquinos",
            "short_description": "Reglas IUPAC para nombrar alquinos.",
            "example_tasks": [
              "Nombra el siguiente alquino: CH₃-C≡C-CH₃",
              "Escribe la estructura del 2-pentino",
              "Explica el cambio de terminación de -ano a -eno a -ino"
            ]
          },
          {
            "key": "cicloalcanos",
            "name": "Cicloalcanos",
            "short_description": "Hidrocarburos saturados con estructura cíclica.",
            "example_tasks": [
              "Define cicloalcano y dibuja el ciclopropano, ciclobutano y ciclopentano",
              "Nombra un cicloalcano ramificado",
              "Explica la tensión angular en ciclos pequeños como ciclopropano"
            ]
          },
          {
            "key": "hidrocarburos_aromaticos",
            "name": "Hidrocarburos Aromáticos",
            "short_description": "Compuestos con anillos de benceno y sus derivados.",
            "example_tasks": [
              "Dibuja la estructura del benceno y explica su resonancia",
              "Nombra derivados del benceno: tolueno, xileno",
              "Explica qué significa que un compuesto sea aromático"
            ]
          }
        ]
      },
      {
        "key": "reacciones_hidrocarburos",
        "name": "Reacciones de Hidrocarburos",
        "short_description": "Principales tipos de reacciones que experimentan los hidrocarburos.",
        "sub_topics": [
          {
            "key": "combustion_hidrocarburos",
            "name": "Reacciones de Combustión",
            "short_description": "Oxidación completa produciendo CO₂ y H₂O.",
            "example_tasks": [
              "Escribe la ecuación de combustión completa del propano",
              "Calcula la cantidad de oxígeno necesaria para quemar completamente 1 mol de octano",
              "Explica la diferencia entre combustión completa e incompleta"
            ]
          },
          {
            "key": "halogenacion",
            "name": "Reacciones de Halogenación",
            "short_description": "Sustitución de hidrógenos por halógenos en alcanos.",
            "example_tasks": [
              "Escribe la ecuación de halogenación del metano con cloro",
              "Explica el mecanismo de radicales libres en la halogenación",
              "Describe las condiciones necesarias para la halogenación (luz UV)"
            ]
          },
          {
            "key": "adicion_alquenos",
            "name": "Reacciones de Adición en Alquenos",
            "short_description": "Adición de reactivos al doble enlace.",
            "example_tasks": [
              "Escribe la reacción de adición de HBr al propeno",
              "Explica la regla de Markovnikov para predecir el producto principal",
              "Describe la hidrogenación catalítica de alquenos"
            ]
          },
          {
            "key": "polimerizacion",
            "name": "Polimerización",
            "short_description": "Formación de cadenas largas a partir de monómeros.",
            "example_tasks": [
              "Explica qué es la polimerización de adición",
              "Escribe la reacción de polimerización del etileno para formar polietileno",
              "Menciona tres polímeros importantes derivados de alquenos"
            ]
          }
        ]
      },
      {
        "key": "fuentes_aplicaciones_hidrocarburos",
        "name": "Fuentes y Aplicaciones de Hidrocarburos",
        "short_description": "Origen natural y usos industriales de hidrocarburos.",
        "sub_topics": [
          {
            "key": "petroleo",
            "name": "Petróleo",
            "short_description": "Origen, composición y refinación del petróleo.",
            "example_tasks": [
              "Describe el origen geológico del petróleo",
              "Explica el proceso de destilación fraccionada del petróleo",
              "Enumera los productos principales obtenidos de la refinación del petróleo"
            ]
          },
          {
            "key": "gas_natural",
            "name": "Gas Natural",
            "short_description": "Composición y usos del gas natural.",
            "example_tasks": [
              "Indica los componentes principales del gas natural",
              "Describe los usos domésticos e industriales del gas natural",
              "Explica las ventajas del gas natural como combustible"
            ]
          },
          {
            "key": "combustibles_fosiles",
            "name": "Combustibles Fósiles",
            "short_description": "Importancia energética e impacto ambiental.",
            "example_tasks": [
              "Explica por qué los combustibles fósiles son importantes para la economía global",
              "Describe el impacto ambiental de la quema de combustibles fósiles",
              "Menciona alternativas renovables a los combustibles fósiles"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "grupos_funcionales",
    "name": "Grupos Funcionales Orgánicos",
    "short_description": "Alcoholes, éteres, aldehídos, cetonas, ácidos carboxílicos, ésteres, aminas y amidas: estructura, nomenclatura y propiedades.",
    "sub_topics": [
      {
        "key": "alcoholes",
        "name": "Alcoholes",
        "short_description": "Compuestos con grupo hidroxilo (-OH) unido a carbono saturado.",
        "sub_topics": [
          {
            "key": "estructura_alcoholes",
            "name": "Estructura y Clasificación",
            "short_description": "Alcoholes primarios, secundarios y terciarios.",
            "example_tasks": [
              "Define alcohol y dibuja la estructura general R-OH",
              "Clasifica los siguientes alcoholes como primarios, secundarios o terciarios",
              "Explica la diferencia estructural entre alcoholes 1°, 2° y 3°"
            ]
          },
          {
            "key": "nomenclatura_alcoholes",
            "name": "Nomenclatura de Alcoholes",
            "short_description": "Reglas IUPAC para nombrar alcoholes.",
            "example_tasks": [
              "Nombra el siguiente alcohol: CH₃-CH₂-OH",
              "Escribe la estructura del 2-propanol (isopropanol)",
              "Explica cómo se numera la cadena para que el -OH tenga el número más bajo"
            ]
          },
          {
            "key": "propiedades_alcoholes",
            "name": "Propiedades de Alcoholes",
            "short_description": "Solubilidad, puntos de ebullición y reactividad.",
            "example_tasks": [
              "Explica por qué los alcoholes tienen puntos de ebullición altos comparados con alcanos",
              "Describe la solubilidad de alcoholes en agua y cómo varía con el tamaño de la cadena",
              "Menciona tres usos importantes del etanol y metanol"
            ]
          },
          {
            "key": "oxidacion_alcoholes",
            "name": "Oxidación de Alcoholes",
            "short_description": "Conversión a aldehídos, cetonas o ácidos carboxílicos.",
            "example_tasks": [
              "Explica qué productos se obtienen al oxidar alcoholes primarios, secundarios y terciarios",
              "Escribe la ecuación de oxidación del etanol a etanal y luego a ácido acético",
              "Describe una prueba química para distinguir alcoholes primarios de terciarios"
            ]
          }
        ]
      },
      {
        "key": "eteres",
        "name": "Éteres",
        "short_description": "Compuestos con oxígeno unido a dos grupos alquilo: R-O-R'.",
        "sub_topics": [
          {
            "key": "estructura_eteres",
            "name": "Estructura de Éteres",
            "short_description": "Características del grupo funcional éter.",
            "example_tasks": [
              "Define éter y dibuja su estructura general",
              "Explica la geometría angular alrededor del oxígeno en éteres",
              "Compara la estructura de éteres con alcoholes"
            ]
          },
          {
            "key": "nomenclatura_eteres",
            "name": "Nomenclatura de Éteres",
            "short_description": "Sistemas común e IUPAC para nombrar éteres.",
            "example_tasks": [
              "Nombra el siguiente éter: CH₃-O-CH₂-CH₃ (nombre común y IUPAC)",
              "Escribe la estructura del dietil éter",
              "Explica el sistema de nomenclatura común para éteres simétricos"
            ]
          },
          {
            "key": "propiedades_eteres",
            "name": "Propiedades y Usos",
            "short_description": "Características físicas y aplicaciones de éteres.",
            "example_tasks": [
              "Explica por qué los éteres tienen puntos de ebullición menores que alcoholes de masa similar",
              "Describe la baja reactividad química de los éteres",
              "Menciona el uso histórico del dietil éter como anestésico"
            ]
          }
        ]
      },
      {
        "key": "aldehydos_cetonas",
        "name": "Aldehídos y Cetonas",
        "short_description": "Compuestos con grupo carbonilo (C=O).",
        "sub_topics": [
          {
            "key": "estructura_carbonilo",
            "name": "Grupo Carbonilo",
            "short_description": "Características del enlace C=O.",
            "example_tasks": [
              "Dibuja la estructura del grupo carbonilo y explica su polaridad",
              "Explica la diferencia estructural entre aldehídos (R-CHO) y cetonas (R-CO-R')",
              "Describe la geometría trigonal plana alrededor del carbono carbonílico"
            ]
          },
          {
            "key": "nomenclatura_aldehydos",
            "name": "Nomenclatura de Aldehídos",
            "short_description": "Reglas IUPAC terminación -al.",
            "example_tasks": [
              "Nombra el siguiente aldehído: CH₃-CH₂-CHO",
              "Escribe la estructura del butanal",
              "Menciona los nombres comunes de formaldehído y acetaldehído"
            ]
          },
          {
            "key": "nomenclatura_cetonas",
            "name": "Nomenclatura de Cetonas",
            "short_description": "Reglas IUPAC terminación -ona.",
            "example_tasks": [
              "Nombra la siguiente cetona: CH₃-CO-CH₃",
              "Escribe la estructura de la 2-pentanona",
              "Explica cómo se numera la cadena para indicar la posición del carbonilo"
            ]
          },
          {
            "key": "propiedades_aldehydos_cetonas",
            "name": "Propiedades Químicas",
            "short_description": "Reactividad del grupo carbonilo.",
            "example_tasks": [
              "Explica por qué los aldehídos son más fáciles de oxidar que las cetonas",
              "Describe la prueba de Fehling o Benedict para detectar aldehídos",
              "Menciona usos del formaldehído y la acetona"
            ]
          }
        ]
      },
      {
        "key": "acidos_carboxilicos",
        "name": "Ácidos Carboxílicos",
        "short_description": "Compuestos con grupo carboxilo (-COOH).",
        "sub_topics": [
          {
            "key": "estructura_carboxilo",
            "name": "Grupo Carboxilo",
            "short_description": "Estructura y propiedades ácidas.",
            "example_tasks": [
              "Dibuja la estructura del grupo carboxilo",
              "Explica por qué los ácidos carboxílicos son ácidos débiles",
              "Describe la resonancia en el ion carboxilato"
            ]
          },
          {
            "key": "nomenclatura_acidos",
            "name": "Nomenclatura de Ácidos Carboxílicos",
            "short_description": "Reglas IUPAC con prefijo ácido y terminación -oico.",
            "example_tasks": [
              "Nombra el siguiente ácido: CH₃-COOH",
              "Escribe la estructura del ácido propanoico",
              "Menciona los nombres comunes de ácidos: fórmico, acético, butírico"
            ]
          },
          {
            "key": "propiedades_acidos",
            "name": "Propiedades de Ácidos Carboxílicos",
            "short_description": "Solubilidad, acidez y formación de sales.",
            "example_tasks": [
              "Explica por qué los ácidos carboxílicos de cadena corta son solubles en agua",
              "Describe la reacción de neutralización de un ácido carboxílico con una base",
              "Menciona la importancia del ácido acético (vinagre) y ácido cítrico"
            ]
          },
          {
            "key": "derivados_acidos",
            "name": "Derivados de Ácidos Carboxílicos",
            "short_description": "Ésteres, amidas y haluros de ácido.",
            "example_tasks": [
              "Enumera los principales derivados de ácidos carboxílicos",
              "Explica cómo se forman los ésteres a partir de ácidos y alcoholes",
              "Describe brevemente las amidas y su importancia en proteínas"
            ]
          }
        ]
      },
      {
        "key": "esteres",
        "name": "Ésteres",
        "short_description": "Compuestos formados por ácidos y alcoholes: R-COO-R'.",
        "sub_topics": [
          {
            "key": "formacion_esteres",
            "name": "Esterificación",
            "short_description": "Reacción entre ácido carboxílico y alcohol.",
            "example_tasks": [
              "Escribe la ecuación general de esterificación",
              "Describe el mecanismo de esterificación catalizada por ácido",
              "Explica el equilibrio en reacciones de esterificación"
            ]
          },
          {
            "key": "nomenclatura_esteres",
            "name": "Nomenclatura de Ésteres",
            "short_description": "Nombre del grupo alquilo seguido del ácido terminado en -ato.",
            "example_tasks": [
              "Nombra el siguiente éster: CH₃-COO-CH₂-CH₃",
              "Escribe la estructura del propanoato de metilo",
              "Explica el sistema de nomenclatura de ésteres"
            ]
          },
          {
            "key": "propiedades_esteres",
            "name": "Propiedades y Usos",
            "short_description": "Aromas, sabores y aplicaciones industriales.",
            "example_tasks": [
              "Explica por qué muchos ésteres tienen olores agradables",
              "Menciona tres ésteres comunes y sus aromas característicos",
              "Describe el uso de ésteres en perfumes, saborizantes y solventes"
            ]
          },
          {
            "key": "hidrolisis_esteres",
            "name": "Hidrólisis de Ésteres",
            "short_description": "Ruptura del éster en ácido y alcohol.",
            "example_tasks": [
              "Escribe la ecuación de hidrólisis de un éster",
              "Explica la diferencia entre hidrólisis ácida y básica (saponificación)",
              "Describe el proceso de fabricación de jabón mediante saponificación"
            ]
          }
        ]
      },
      {
        "key": "aminas",
        "name": "Aminas",
        "short_description": "Derivados del amoníaco con grupos alquilo: R-NH₂.",
        "sub_topics": [
          {
            "key": "estructura_aminas",
            "name": "Estructura y Clasificación",
            "short_description": "Aminas primarias, secundarias y terciarias.",
            "example_tasks": [
              "Define amina y dibuja las estructuras de aminas 1°, 2° y 3°",
              "Clasifica las siguientes aminas según su orden",
              "Explica la geometría piramidal alrededor del nitrógeno"
            ]
          },
          {
            "key": "nomenclatura_aminas",
            "name": "Nomenclatura de Aminas",
            "short_description": "Sistemas de nomenclatura para aminas.",
            "example_tasks": [
              "Nombra la siguiente amina: CH₃-NH₂",
              "Escribe la estructura de la etilamina y dietilamina",
              "Explica el sistema de nomenclatura común y IUPAC para aminas"
            ]
          },
          {
            "key": "propiedades_aminas",
            "name": "Propiedades de Aminas",
            "short_description": "Basicidad, solubilidad y reactividad.",
            "example_tasks": [
              "Explica por qué las aminas son bases débiles",
              "Describe la reacción de aminas con ácidos para formar sales",
              "Menciona la importancia biológica de aminas como neurotransmisores"
            ]
          }
        ]
      },
      {
        "key": "amidas",
        "name": "Amidas",
        "short_description": "Derivados de ácidos carboxílicos con grupo amino: R-CO-NH₂.",
        "sub_topics": [
          {
            "key": "estructura_amidas",
            "name": "Estructura de Amidas",
            "short_description": "Grupo funcional carbonilo unido a nitrógeno.",
            "example_tasks": [
              "Dibuja la estructura general de una amida",
              "Explica la resonancia en amidas y su efecto en la planaridad",
              "Describe por qué las amidas son menos básicas que las aminas"
            ]
          },
          {
            "key": "formacion_amidas",
            "name": "Formación de Amidas",
            "short_description": "Reacción entre ácidos carboxílicos y aminas.",
            "example_tasks": [
              "Escribe la ecuación general de formación de una amida",
              "Describe las condiciones necesarias para la formación de amidas",
              "Explica la importancia del enlace amida (enlace peptídico) en proteínas"
            ]
          },
          {
            "key": "nomenclatura_amidas",
            "name": "Nomenclatura de Amidas",
            "short_description": "Terminación -amida.",
            "example_tasks": [
              "Nombra la siguiente amida: CH₃-CO-NH₂",
              "Escribe la estructura de la propanamida",
              "Explica cómo nombrar amidas sustituidas en el nitrógeno"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "isomeria",
    "name": "Isomería",
    "short_description": "Compuestos con la misma fórmula molecular pero diferente estructura o disposición espacial.",
    "sub_topics": [
      {
        "key": "tipos_isomeria",
        "name": "Clasificación de Isómeros",
        "short_description": "Isomería estructural y estereoisomería.",
        "sub_topics": [
          {
            "key": "concepto_isomeria",
            "name": "Concepto de Isomería",
            "short_description": "Definición y importancia de isómeros.",
            "example_tasks": [
              "Define isómeros y explica por qué tienen propiedades diferentes",
              "Explica la importancia de la isomería en química orgánica y biología",
              "Dibuja dos isómeros del butano (C₄H₁₀)"
            ]
          },
          {
            "key": "isomeria_estructural",
            "name": "Isomería Estructural (Constitucional)",
            "short_description": "Diferente conectividad entre átomos.",
            "example_tasks": [
              "Define isomería estructural",
              "Dibuja isómeros estructurales del pentano (C₅H₁₂)",
              "Explica los tres tipos: cadena, posición y función"
            ]
          }
        ]
      },
      {
        "key": "isomeria_cadena",
        "name": "Isomería de Cadena",
        "short_description": "Diferente ordenamiento de la cadena carbonada.",
        "sub_topics": [
          {
            "key": "ejemplos_cadena",
            "name": "Isómeros de Cadena",
            "short_description": "Cadenas lineales versus ramificadas.",
            "example_tasks": [
              "Dibuja todos los isómeros de cadena del pentano",
              "Explica cómo la ramificación afecta el punto de ebullición",
              "Identifica isómeros de cadena entre varias estructuras dadas"
            ]
          }
        ]
      },
      {
        "key": "isomeria_posicion",
        "name": "Isomería de Posición",
        "short_description": "Diferente ubicación de grupos funcionales o insaturaciones.",
        "sub_topics": [
          {
            "key": "ejemplos_posicion",
            "name": "Isómeros de Posición",
            "short_description": "Mismo grupo funcional en diferentes posiciones.",
            "example_tasks": [
              "Dibuja los isómeros de posición del propanol",
              "Explica la diferencia entre 1-buteno y 2-buteno",
              "Identifica isómeros de posición en alcoholes y alquenos"
            ]
          }
        ]
      },
      {
        "key": "isomeria_funcion",
        "name": "Isomería de Función",
        "short_description": "Diferentes grupos funcionales con la misma fórmula molecular.",
        "sub_topics": [
          {
            "key": "ejemplos_funcion",
            "name": "Isómeros de Función",
            "short_description": "Compuestos con diferentes familias orgánicas.",
            "example_tasks": [
              "Dibuja un alcohol y un éter que sean isómeros de función (C₂H₆O)",
              "Explica por qué aldehídos y cetonas pueden ser isómeros de función",
              "Proporciona ejemplos de isómeros de función entre alcoholes y éteres"
            ]
          }
        ]
      },
      {
        "key": "estereoisomeria",
        "name": "Estereoisomería",
        "short_description": "Misma conectividad pero diferente disposición espacial.",
        "sub_topics": [
          {
            "key": "isomeria_geometrica",
            "name": "Isomería Geométrica (cis-trans)",
            "short_description": "Diferente orientación alrededor de dobles enlaces o anillos.",
            "example_tasks": [
              "Define isómeros cis y trans",
              "Dibuja los isómeros cis y trans del 2-buteno",
              "Explica por qué el doble enlace impide la rotación libre"
            ]
          },
          {
            "key": "isomeria_optica",
            "name": "Isomería Óptica (Enantiómeros)",
            "short_description": "Moléculas que son imágenes especulares no superponibles.",
            "example_tasks": [
              "Define quiralidad y carbono asimétrico",
              "Explica qué son enantiómeros y cómo se relacionan",
              "Describe la importancia de la quiralidad en fármacos"
            ]
          },
          {
            "key": "actividad_optica",
            "name": "Actividad Óptica",
            "short_description": "Capacidad de rotar el plano de luz polarizada.",
            "example_tasks": [
              "Define actividad óptica y polarímetro",
              "Explica la diferencia entre dextrógiro y levógiro",
              "Describe el concepto de mezcla racémica"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "reacciones_organicas",
    "name": "Reacciones Orgánicas",
    "short_description": "Tipos principales de reacciones: sustitución, adición, eliminación y oxidación-reducción en compuestos orgánicos.",
    "sub_topics": [
      {
        "key": "sustitucion",
        "name": "Reacciones de Sustitución",
        "short_description": "Reemplazo de un átomo o grupo por otro.",
        "sub_topics": [
          {
            "key": "sustitucion_alcanos",
            "name": "Sustitución en Alcanos",
            "short_description": "Halogenación por radicales libres.",
            "example_tasks": [
              "Escribe la ecuación de cloración del metano",
              "Explica el mecanismo por radicales libres: iniciación, propagación, terminación",
              "Describe las condiciones necesarias (luz UV o calor)"
            ]
          },
          {
            "key": "sustitucion_aromaticos",
            "name": "Sustitución Electrofílica Aromática",
            "short_description": "Sustitución en anillos de benceno.",
            "example_tasks": [
              "Explica qué es una sustitución electrofílica aromática",
              "Describe la nitración del benceno",
              "Menciona otros ejemplos: halogenación, sulfonación, alquilación de Friedel-Crafts"
            ]
          }
        ]
      },
      {
        "key": "adicion",
        "name": "Reacciones de Adición",
        "short_description": "Adición de reactivos a enlaces múltiples.",
        "sub_topics": [
          {
            "key": "adicion_alquenos_alcanos",
            "name": "Hidrogenación de Alquenos",
            "short_description": "Adición de H₂ para formar alcanos.",
            "example_tasks": [
              "Escribe la ecuación de hidrogenación del eteno a etano",
              "Describe el uso de catalizadores (Pt, Pd, Ni)",
              "Explica la importancia industrial de la hidrogenación"
            ]
          },
          {
            "key": "adicion_halogenos",
            "name": "Adición de Halógenos",
            "short_description": "Adición de X₂ a alquenos.",
            "example_tasks": [
              "Escribe la reacción de adición de Br₂ al eteno",
              "Explica cómo se usa esta reacción como prueba de insaturación",
              "Describe el cambio de color cuando bromo reacciona con un alqueno"
            ]
          },
          {
            "key": "adicion_hx",
            "name": "Adición de Halogenuros de Hidrógeno",
            "short_description": "Adición de HX siguiendo la regla de Markovnikov.",
            "example_tasks": [
              "Escribe la adición de HBr al propeno",
              "Enuncia la regla de Markovnikov",
              "Predice el producto principal de la adición de HCl al 2-metil-2-buteno"
            ]
          },
          {
            "key": "hidratacion",
            "name": "Hidratación de Alquenos",
            "short_description": "Adición de agua para formar alcoholes.",
            "example_tasks": [
              "Escribe la hidratación del eteno catalizada por ácido",
              "Explica cómo se aplica la regla de Markovnikov",
              "Describe la importancia de esta reacción en la producción de etanol"
            ]
          }
        ]
      },
      {
        "key": "eliminacion",
        "name": "Reacciones de Eliminación",
        "short_description": "Formación de enlaces múltiples por pérdida de átomos o grupos.",
        "sub_topics": [
          {
            "key": "deshidratacion_alcoholes",
            "name": "Deshidratación de Alcoholes",
            "short_description": "Eliminación de agua para formar alquenos.",
            "example_tasks": [
              "Escribe la deshidratación del etanol catalizada por H₂SO₄",
              "Explica las condiciones necesarias (calor y ácido)",
              "Describe la regla de Saytzeff para predecir el producto principal"
            ]
          },
          {
            "key": "dehidrohalogenacion",
            "name": "Dehidrohalogenación",
            "short_description": "Eliminación de HX de halogenuros de alquilo.",
            "example_tasks": [
              "Escribe la eliminación de HBr del 2-bromobutano",
              "Explica el uso de bases fuertes en esta reacción",
              "Predice el alqueno principal formado"
            ]
          }
        ]
      },
      {
        "key": "oxidacion_reduccion_organica",
        "name": "Oxidación y Reducción",
        "short_description": "Cambios en el estado de oxidación del carbono.",
        "sub_topics": [
          {
            "key": "oxidacion_alcoholes_organica",
            "name": "Oxidación de Alcoholes",
            "short_description": "Conversión a carbonílicos o carboxílicos.",
            "example_tasks": [
              "Explica los productos de oxidación de alcoholes 1°, 2° y 3°",
              "Escribe la oxidación del etanol a etanal y luego a ácido acético",
              "Menciona reactivos oxidantes comunes (K₂Cr₂O₇, KMnO₄)"
            ]
          },
          {
            "key": "reduccion_carbonilos",
            "name": "Reducción de Compuestos Carbonílicos",
            "short_description": "Conversión de aldehídos y cetonas a alcoholes.",
            "example_tasks": [
              "Escribe la reducción del propanal a 1-propanol",
              "Describe el uso de LiAlH₄ o NaBH₄ como agentes reductores",
              "Explica la reducción de cetonas a alcoholes secundarios"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "quimica_sociedad",
    "name": "Química y Sociedad",
    "short_description": "Aplicaciones de la química en la vida cotidiana, industria, medicina, agricultura y desafíos ambientales.",
    "sub_topics": [
      {
        "key": "quimica_vida_cotidiana",
        "name": "Química en la Vida Cotidiana",
        "short_description": "Aplicaciones de principios químicos en el día a día.",
        "sub_topics": [
          {
            "key": "quimica_hogar",
            "name": "Química en el Hogar",
            "short_description": "Productos químicos de uso doméstico.",
            "example_tasks": [
              "Describe la composición química de productos de limpieza (detergentes, blanqueadores)",
              "Explica cómo funcionan los jabones y detergentes a nivel molecular",
              "Menciona precauciones al usar productos químicos domésticos"
            ]
          },
          {
            "key": "quimica_alimentos",
            "name": "Química de los Alimentos",
            "short_description": "Composición, conservación y procesos químicos en alimentos.",
            "example_tasks": [
              "Explica el papel de conservadores químicos en alimentos",
              "Describe procesos químicos como fermentación y caramelización",
              "Menciona la importancia de aditivos y su regulación"
            ]
          },
          {
            "key": "quimica_cosmeticos",
            "name": "Química en Cosméticos",
            "short_description": "Componentes químicos en productos de cuidado personal.",
            "example_tasks": [
              "Describe la química de champús, cremas y perfumes",
              "Explica cómo funcionan los filtros solares",
              "Menciona ingredientes activos comunes en cosméticos"
            ]
          }
        ]
      },
      {
        "key": "quimica_industrial",
        "name": "Química Industrial",
        "short_description": "Procesos químicos en la producción industrial.",
        "sub_topics": [
          {
            "key": "industria_quimica_mexico",
            "name": "Industria Química en México",
            "short_description": "Sectores importantes de la industria química mexicana.",
            "example_tasks": [
              "Menciona las principales industrias químicas en México (petroquímica, fertilizantes, farmacéutica)",
              "Describe la importancia de PEMEX en la industria petroquímica",
              "Explica el papel de la química en la economía mexicana"
            ]
          },
          {
            "key": "procesos_industriales",
            "name": "Procesos Químicos Industriales",
            "short_description": "Producción a gran escala de sustancias químicas.",
            "example_tasks": [
              "Describe el proceso Haber-Bosch para producir amoníaco",
              "Explica la producción de ácido sulfúrico por el proceso de contacto",
              "Menciona la importancia de catalizadores en procesos industriales"
            ]
          },
          {
            "key": "polimeros_plasticos",
            "name": "Polímeros y Plásticos",
            "short_description": "Producción y aplicaciones de materiales poliméricos.",
            "example_tasks": [
              "Explica qué son los polímeros y cómo se forman",
              "Menciona cinco plásticos comunes y sus usos (PET, HDPE, PVC, LDPE, PP)",
              "Describe ventajas y problemas ambientales de los plásticos"
            ]
          }
        ]
      },
      {
        "key": "quimica_medicina",
        "name": "Química y Medicina",
        "short_description": "Aplicaciones químicas en salud y desarrollo de fármacos.",
        "sub_topics": [
          {
            "key": "farmacos",
            "name": "Química Farmacéutica",
            "short_description": "Diseño, síntesis y acción de medicamentos.",
            "example_tasks": [
              "Explica cómo los fármacos interactúan con el cuerpo a nivel molecular",
              "Describe el proceso de desarrollo de un nuevo medicamento",
              "Menciona la importancia de la quiralidad en fármacos"
            ]
          },
          {
            "key": "analisis_clinicos",
            "name": "Química Clínica",
            "short_description": "Análisis químicos para diagnóstico médico.",
            "example_tasks": [
              "Describe análisis químicos comunes en laboratorios clínicos",
              "Explica cómo se miden niveles de glucosa, colesterol y otros metabolitos",
              "Menciona la importancia de marcadores bioquímicos en diagnóstico"
            ]
          },
          {
            "key": "imagenologia",
            "name": "Química en Imagenología Médica",
            "short_description": "Uso de sustancias químicas en técnicas de imagen.",
            "example_tasks": [
              "Explica el uso de contrastes radiológicos",
              "Describe el papel de isótopos radiactivos en medicina nuclear",
              "Menciona aplicaciones de resonancia magnética nuclear"
            ]
          }
        ]
      },
      {
        "key": "quimica_agricultura",
        "name": "Química en Agricultura",
        "short_description": "Fertilizantes, pesticidas y mejora de cultivos.",
        "sub_topics": [
          {
            "key": "fertilizantes",
            "name": "Fertilizantes Químicos",
            "short_description": "Nutrientes esenciales para plantas.",
            "example_tasks": [
              "Explica la importancia de N, P y K en fertilizantes",
              "Describe diferentes tipos de fertilizantes (nitrogenados, fosfatados, potásicos)",
              "Menciona ventajas y desventajas del uso de fertilizantes sintéticos"
            ]
          },
          {
            "key": "pesticidas",
            "name": "Pesticidas y Control de Plagas",
            "short_description": "Sustancias químicas para proteger cultivos.",
            "example_tasks": [
              "Define pesticida, herbicida, fungicida e insecticida",
              "Explica el modo de acción de pesticidas comunes",
              "Describe riesgos ambientales y de salud asociados con pesticidas"
            ]
          },
          {
            "key": "agricultura_sustentable",
            "name": "Química y Agricultura Sustentable",
            "short_description": "Alternativas químicas más amigables con el ambiente.",
            "example_tasks": [
              "Describe el concepto de manejo integrado de plagas",
              "Explica el uso de feromonas y productos naturales en agricultura",
              "Menciona prácticas de agricultura sustentable basadas en química verde"
            ]
          }
        ]
      },
      {
        "key": "quimica_ambiental",
        "name": "Química Ambiental",
        "short_description": "Impacto químico en el ambiente y soluciones.",
        "sub_topics": [
          {
            "key": "contaminacion_aire",
            "name": "Contaminación del Aire",
            "short_description": "Contaminantes atmosféricos y sus efectos.",
            "example_tasks": [
              "Enumera los principales contaminantes del aire (CO, NOₓ, SO₂, O₃, PM)",
              "Explica la formación de smog fotoquímico",
              "Describe el problema de la lluvia ácida y sus causas químicas"
            ]
          },
          {
            "key": "capa_ozono",
            "name": "Capa de Ozono",
            "short_description": "Destrucción por CFCs y Protocolo de Montreal.",
            "example_tasks": [
              "Explica cómo los CFCs destruyen el ozono estratosférico",
              "Describe la importancia de la capa de ozono para la vida",
              "Menciona alternativas a los CFCs y el éxito del Protocolo de Montreal"
            ]
          },
          {
            "key": "cambio_climatico",
            "name": "Cambio Climático",
            "short_description": "Efecto invernadero y gases de efecto invernadero.",
            "example_tasks": [
              "Explica el efecto invernadero natural y el efecto invernadero antropogénico",
              "Enumera los principales gases de efecto invernadero (CO₂, CH₄, N₂O)",
              "Describe cómo la química puede contribuir a mitigar el cambio climático"
            ]
          },
          {
            "key": "contaminacion_agua",
            "name": "Contaminación del Agua",
            "short_description": "Contaminantes acuáticos y tratamiento de agua.",
            "example_tasks": [
              "Enumera fuentes de contaminación del agua (industrial, agrícola, doméstica)",
              "Explica procesos químicos en el tratamiento de aguas residuales",
              "Describe el problema de eutrofización por exceso de nutrientes"
            ]
          },
          {
            "key": "residuos_quimicos",
            "name": "Manejo de Residuos Químicos",
            "short_description": "Tratamiento y disposición de desechos peligrosos.",
            "example_tasks": [
              "Explica la clasificación de residuos peligrosos (CRETIB en México)",
              "Describe métodos de tratamiento de residuos químicos",
              "Menciona la importancia del reciclaje y la economía circular"
            ]
          }
        ]
      },
      {
        "key": "quimica_verde",
        "name": "Química Verde",
        "short_description": "Diseño de productos y procesos químicos sustentables.",
        "sub_topics": [
          {
            "key": "principios_quimica_verde",
            "name": "12 Principios de la Química Verde",
            "short_description": "Fundamentos para química sustentable.",
            "example_tasks": [
              "Enumera al menos 5 de los 12 principios de la química verde",
              "Explica el principio de economía atómica",
              "Describe el concepto de diseñar productos biodegradables"
            ]
          },
          {
            "key": "solventes_verdes",
            "name": "Solventes Verdes",
            "short_description": "Alternativas a solventes orgánicos tradicionales.",
            "example_tasks": [
              "Menciona ejemplos de solventes verdes (agua, CO₂ supercrítico, líquidos iónicos)",
              "Explica ventajas ambientales de usar agua como solvente",
              "Describe aplicaciones de CO₂ supercrítico en industria"
            ]
          },
          {
            "key": "catalisis_verde",
            "name": "Catálisis y Eficiencia Energética",
            "short_description": "Uso de catalizadores para procesos más eficientes.",
            "example_tasks": [
              "Explica cómo los catalizadores contribuyen a la química verde",
              "Describe ejemplos de procesos catalíticos más sustentables",
              "Menciona el papel de enzimas como catalizadores verdes"
            ]
          }
        ]
      },
      {
        "key": "energia_quimica",
        "name": "Química y Energía",
        "short_description": "Fuentes de energía y almacenamiento químico.",
        "sub_topics": [
          {
            "key": "combustibles",
            "name": "Combustibles Químicos",
            "short_description": "Combustibles fósiles y alternativos.",
            "example_tasks": [
              "Compara gasolina, diesel y gas natural como combustibles",
              "Explica el concepto de biocombustibles (etanol, biodiesel)",
              "Describe ventajas y desventajas de diferentes combustibles"
            ]
          },
          {
            "key": "pilas_baterias",
            "name": "Pilas y Baterías",
            "short_description": "Almacenamiento electroquímico de energía.",
            "example_tasks": [
              "Explica el funcionamiento de baterías de ion-litio",
              "Compara diferentes tipos de baterías (plomo-ácido, NiMH, Li-ion)",
              "Describe desafíos en el desarrollo de mejores baterías"
            ]
          },
          {
            "key": "hidrogeno",
            "name": "Hidrógeno como Combustible",
            "short_description": "Producción, almacenamiento y uso de hidrógeno.",
            "example_tasks": [
              "Explica métodos de producción de hidrógeno (electrólisis, reformado de metano)",
              "Describe ventajas del hidrógeno como combustible limpio",
              "Menciona desafíos en el almacenamiento y transporte de hidrógeno"
            ]
          },
          {
            "key": "energia_solar",
            "name": "Química de Energía Solar",
            "short_description": "Celdas solares y conversión fotoquímica.",
            "example_tasks": [
              "Explica el principio de funcionamiento de celdas solares",
              "Describe materiales semiconductores usados en celdas fotovoltaicas",
              "Menciona investigación en fotosíntesis artificial"
            ]
          }
        ]
      },
      {
        "key": "nanotecnologia",
        "name": "Nanoquímica y Nanotecnología",
        "short_description": "Química a escala nanométrica y sus aplicaciones.",
        "sub_topics": [
          {
            "key": "nanomateriales",
            "name": "Nanomateriales",
            "short_description": "Propiedades únicas de materiales a nanoescala.",
            "example_tasks": [
              "Define nanomaterial y nanopartícula",
              "Explica cómo las propiedades cambian a escala nanométrica",
              "Menciona ejemplos: nanotubos de carbono, grafeno, puntos cuánticos"
            ]
          },
          {
            "key": "aplicaciones_nano",
            "name": "Aplicaciones de la Nanotecnología",
            "short_description": "Usos en medicina, electrónica y materiales.",
            "example_tasks": [
              "Describe aplicaciones de nanomateriales en medicina (liberación de fármacos, diagnóstico)",
              "Explica el uso de nanotecnología en electrónica y computación",
              "Menciona aplicaciones en materiales (recubrimientos, textiles)"
            ]
          }
        ]
      },
      {
        "key": "etica_quimica",
        "name": "Ética y Responsabilidad en Química",
        "short_description": "Consideraciones éticas en investigación y aplicación química.",
        "sub_topics": [
          {
            "key": "seguridad_laboratorio",
            "name": "Seguridad y Buenas Prácticas",
            "short_description": "Responsabilidad en el manejo de sustancias químicas.",
            "example_tasks": [
              "Explica la importancia de seguir protocolos de seguridad",
              "Describe responsabilidades éticas de los químicos",
              "Menciona códigos de ética profesional en química"
            ]
          },
          {
            "key": "impacto_social",
            "name": "Impacto Social de la Química",
            "short_description": "Beneficios y riesgos de avances químicos.",
            "example_tasks": [
              "Analiza casos donde la química ha beneficiado a la humanidad",
              "Discute ejemplos de mal uso de la química (armas químicas, contaminación)",
              "Explica la responsabilidad social de científicos e industria química"
            ]
          },
          {
            "key": "regulacion",
            "name": "Regulación y Normatividad",
            "short_description": "Leyes y normas que regulan el uso de químicos.",
            "example_tasks": [
              "Menciona organismos reguladores en México (COFEPRIS, SEMARNAT)",
              "Explica la importancia de regulaciones para proteger salud y ambiente",
              "Describe el proceso de aprobación de nuevos productos químicos"
            ]
          }
        ]
      }
    ]
  }
]
