[
  {
    "key": "culturas_mesoamericanas",
    "name": "Culturas Mesoamericanas y su Desarrollo",
    "short_description": "Estudio de las grandes civilizaciones prehispánicas de México, incluyendo olmecas, teotihuacanos, mayas, toltecas, mexicas y otras culturas, analizando su organización social, política, económica, avances científicos y legado cultural.",
    "sub_topics": [
      {
        "key": "caracteristicas_mesoamerica",
        "name": "Características del Área Cultural Mesoamericana",
        "short_description": "Definición geográfica y cultural de Mesoamérica, elementos comunes de las civilizaciones y periodización histórica.",
        "sub_topics": [
          {
            "key": "definicion_mesoamerica",
            "name": "Definición Geográfica y Cultural de Mesoamérica",
            "short_description": "Identificar los límites geográficos y las características culturales que definen el área mesoamericana.",
            "example_tasks": [
              "Elaborar un mapa que muestre los límites geográficos de Mesoamérica y las principales regiones culturales (Altiplano Central, Oaxaca, Golfo de México, área maya).",
              "Explicar qué elementos culturales comunes permitieron a Paul Kirchhoff definir Mesoamérica como área cultural.",
              "Comparar el área mesoamericana con Aridoamérica y Oasisamérica, identificando diferencias en desarrollo cultural y subsistencia."
            ]
          },
          {
            "key": "periodizacion_mesoamericana",
            "name": "Periodización de la Historia Mesoamericana",
            "short_description": "Comprender las etapas del desarrollo mesoamericano: Preclásico, Clásico y Posclásico.",
            "example_tasks": [
              "Crear una línea de tiempo que muestre los tres grandes periodos mesoamericanos y las culturas principales de cada uno.",
              "Analizar las características distintivas de cada periodo en términos de organización política, urbanización y desarrollo cultural.",
              "Identificar en un cuadro comparativo qué culturas florecieron en cada periodo y sus principales centros ceremoniales."
            ]
          },
          {
            "key": "elementos_comunes_mesoamericanos",
            "name": "Elementos Culturales Comunes",
            "short_description": "Reconocer los rasgos compartidos por las civilizaciones mesoamericanas.",
            "example_tasks": [
              "Enumerar y explicar al menos ocho elementos culturales comunes en Mesoamérica (agricultura de maíz, calendario ritual, escritura, juego de pelota, etc.).",
              "Analizar la importancia del maíz en la cosmovisión y economía mesoamericana mediante fuentes como el Popol Vuh.",
              "Investigar el significado religioso y social del juego de pelota mesoamericano y su presencia en diferentes culturas."
            ]
          }
        ]
      },
      {
        "key": "olmecas_cultura_madre",
        "name": "Los Olmecas: Cultura Madre de Mesoamérica",
        "short_description": "Análisis de la civilización olmeca como la primera gran cultura mesoamericana y su influencia en desarrollos posteriores.",
        "sub_topics": [
          {
            "key": "desarrollo_olmeca",
            "name": "Desarrollo de la Civilización Olmeca",
            "short_description": "Estudiar el surgimiento, ubicación, cronología y características de la cultura olmeca.",
            "example_tasks": [
              "Ubicar en un mapa los principales sitios olmecas (San Lorenzo, La Venta, Tres Zapotes) y explicar su importancia.",
              "Analizar por qué los olmecas son considerados la 'cultura madre' de Mesoamérica a partir de sus innovaciones.",
              "Describir las cabezas colosales olmecas y discutir las teorías sobre su significado y función."
            ]
          },
          {
            "key": "legado_olmeca",
            "name": "Legado e Influencia Olmeca",
            "short_description": "Evaluar las aportaciones olmecas a la civilización mesoamericana.",
            "example_tasks": [
              "Identificar elementos culturales olmecas que fueron adoptados por culturas posteriores (calendario, escritura jeroglífica, juego de pelota).",
              "Analizar representaciones del dios jaguar en el arte olmeca y su importancia en la religión mesoamericana.",
              "Explicar la influencia de las redes comerciales olmecas en la difusión cultural en Mesoamérica."
            ]
          }
        ]
      },
      {
        "key": "teotihuacan_ciudad_dioses",
        "name": "Teotihuacán: La Ciudad de los Dioses",
        "short_description": "Estudio de Teotihuacán como la primera gran urbe de Mesoamérica, su organización, influencia política y legado arquitectónico.",
        "sub_topics": [
          {
            "key": "urbanismo_teotihuacano",
            "name": "Urbanismo y Arquitectura Teotihuacana",
            "short_description": "Analizar la planificación urbana de Teotihuacán y sus monumentos principales.",
            "example_tasks": [
              "Describir la organización espacial de Teotihuacán a partir de la Calzada de los Muertos y los principales conjuntos arquitectónicos.",
              "Explicar las características arquitectónicas del talud-tablero y su función en los templos teotihuacanos.",
              "Analizar el tamaño y la población estimada de Teotihuacán en su apogeo y compararla con otras ciudades antiguas del mundo."
            ]
          },
          {
            "key": "influencia_teotihuacana",
            "name": "Influencia Política y Cultural de Teotihuacán",
            "short_description": "Evaluar el alcance de la influencia teotihuacana en Mesoamérica durante el Clásico.",
            "example_tasks": [
              "Investigar evidencias de la presencia teotihuacana en sitios mayas como Tikal y Kaminaljuyú.",
              "Analizar la iconografía de Tláloc y Quetzalcóatl en el arte teotihuacano y su difusión en otras regiones.",
              "Discutir las teorías sobre el colapso de Teotihuacán hacia el año 650 d.C. y sus consecuencias para Mesoamérica."
            ]
          }
        ]
      },
      {
        "key": "civilizacion_maya",
        "name": "La Civilización Maya",
        "short_description": "Análisis profundo de la cultura maya, incluyendo su desarrollo político, científico, artístico y religioso en diferentes periodos.",
        "sub_topics": [
          {
            "key": "organizacion_politica_maya",
            "name": "Organización Política de los Mayas",
            "short_description": "Comprender el sistema de ciudades-estado mayas y la estructura de poder.",
            "example_tasks": [
              "Explicar el concepto de 'ciudad-estado' maya y cómo se diferenciaba de un imperio centralizado.",
              "Analizar el papel del halach uinik (gobernante) en la sociedad maya y su legitimación divina.",
              "Investigar las alianzas y conflictos entre principales ciudades mayas (Tikal, Calakmul, Palenque, Copán)."
            ]
          },
          {
            "key": "ciencia_matemáticas_maya",
            "name": "Ciencia y Matemáticas Mayas",
            "short_description": "Estudiar los avances científicos mayas, especialmente en astronomía, matemáticas y calendario.",
            "example_tasks": [
              "Explicar el sistema de numeración vigesimal maya y el uso del concepto de cero.",
              "Analizar la precisión del calendario maya (haab, tzolkin y cuenta larga) y su función en la vida religiosa y agrícola.",
              "Investigar los conocimientos astronómicos mayas evidenciados en edificios como El Caracol de Chichén Itzá."
            ]
          },
          {
            "key": "escritura_maya",
            "name": "Sistema de Escritura Maya",
            "short_description": "Comprender el sistema jeroglífico maya y su importancia para el registro histórico.",
            "example_tasks": [
              "Describir las características del sistema de escritura maya como combinación de logogramas y fonogramas.",
              "Analizar estelas mayas que conmemoran eventos históricos y genealogías de gobernantes.",
              "Explicar la importancia del desciframiento de la escritura maya para comprender su historia."
            ]
          },
          {
            "key": "religion_cosmovision_maya",
            "name": "Religión y Cosmovisión Maya",
            "short_description": "Analizar las creencias religiosas mayas y su visión del universo.",
            "example_tasks": [
              "Explicar la concepción maya del universo (inframundo, tierra, cielos) utilizando fuentes como el Popol Vuh.",
              "Analizar los rituales de autosacrificio y sacrificio humano en el contexto de la religión maya.",
              "Investigar las principales deidades mayas (Itzamná, Chaac, Kukulkán) y su representación en el arte."
            ]
          },
          {
            "key": "colapso_maya_clasico",
            "name": "Colapso del Periodo Clásico Maya",
            "short_description": "Examinar las causas del abandono de las grandes ciudades mayas del Clásico.",
            "example_tasks": [
              "Identificar y explicar las múltiples teorías sobre el colapso maya (sobrepoblación, guerra, sequía, deterioro ambiental).",
              "Analizar evidencias arqueológicas del abandono de ciudades como Tikal y Copán hacia el siglo IX.",
              "Discutir la continuidad de la cultura maya en el Posclásico y en la actualidad."
            ]
          }
        ]
      },
      {
        "key": "toltecas_tradicion_militarista",
        "name": "Los Toltecas y la Tradición Militarista",
        "short_description": "Estudio de la cultura tolteca, su capital Tula, el culto a Quetzalcóatl y la expansión del militarismo en el Posclásico.",
        "sub_topics": [
          {
            "key": "tula_capital_tolteca",
            "name": "Tula como Centro Político y Religioso",
            "short_description": "Analizar las características de Tula y su importancia en el periodo Posclásico temprano.",
            "example_tasks": [
              "Describir los elementos arquitectónicos característicos de Tula, como los atlantes y los chac mool.",
              "Explicar la importancia de Quetzalcóatl en la religión tolteca y el mito de su exilio.",
              "Analizar las evidencias de una tradición guerrera en el arte y arquitectura tolteca."
            ]
          },
          {
            "key": "influencia_tolteca_mesoamerica",
            "name": "Expansión e Influencia Tolteca",
            "short_description": "Evaluar el alcance de la influencia tolteca, especialmente en el área maya.",
            "example_tasks": [
              "Comparar las similitudes arquitectónicas y escultóricas entre Tula y Chichén Itzá.",
              "Investigar las teorías sobre la relación entre toltecas y la dinastía Itzá en Yucatán.",
              "Discutir cómo la tradición tolteca fue idealizada por los mexicas como modelo de civilización."
            ]
          }
        ]
      },
      {
        "key": "mexicas_imperio_azteca",
        "name": "Los Mexicas y el Imperio Azteca",
        "short_description": "Análisis detallado de la civilización mexica desde su migración hasta la consolidación de su imperio, incluyendo organización política, social, económica, religión y expansión militar.",
        "sub_topics": [
          {
            "key": "migracion_fundacion_tenochtitlan",
            "name": "Migración y Fundación de Tenochtitlán",
            "short_description": "Estudiar el proceso migratorio de los mexicas y la fundación mítica e histórica de su capital.",
            "example_tasks": [
              "Relatar el mito de la peregrinación mexica desde Aztlán guiados por Huitzilopochtli hasta el valle de México.",
              "Explicar el significado del águila sobre el nopal devorando una serpiente como señal para fundar Tenochtitlán en 1325.",
              "Analizar las primeras décadas de los mexicas como tributarios de Azcapotzalco antes de su independencia."
            ]
          },
          {
            "key": "formacion_triple_alianza",
            "name": "Formación de la Triple Alianza",
            "short_description": "Comprender la alianza entre Tenochtitlán, Texcoco y Tlacopan y el inicio de la expansión.",
            "example_tasks": [
              "Explicar cómo Itzcóatl y Tlacaélel lideraron la rebelión contra Azcapotzalco y formaron la Triple Alianza en 1428.",
              "Analizar el papel de cada ciudad en la alianza y la distribución del tributo conquistado.",
              "Investigar las reformas realizadas por Tlacaélel, incluyendo la reescritura de la historia mexica."
            ]
          },
          {
            "key": "organizacion_politica_mexica",
            "name": "Organización Política del Imperio Mexica",
            "short_description": "Analizar la estructura de gobierno mexica y el papel del tlatoani.",
            "example_tasks": [
              "Describir las funciones y el poder del huey tlatoani (gran gobernante) y el proceso de su elección.",
              "Explicar la organización administrativa del imperio en provincias tributarias y reinos aliados.",
              "Analizar el papel del Tlatocán (consejo de nobles) en las decisiones políticas y militares."
            ]
          },
          {
            "key": "estratificacion_social_mexica",
            "name": "Estratificación Social Mexica",
            "short_description": "Comprender la estructura de clases en la sociedad mexica.",
            "example_tasks": [
              "Elaborar un diagrama que muestre la jerarquía social mexica desde pipiltin (nobles) hasta tlacotin (esclavos).",
              "Explicar el papel de los pochtecas (comerciantes) y su importancia económica y de espionaje.",
              "Analizar las posibilidades de movilidad social a través del mérito militar en la sociedad mexica."
            ]
          },
          {
            "key": "economia_tributo_comercio",
            "name": "Economía: Tributo y Comercio",
            "short_description": "Estudiar la base económica del imperio mexica basada en agricultura, tributo y comercio.",
            "example_tasks": [
              "Describir el sistema de chinampas como técnica agrícola intensiva y su importancia para sostener a la población de Tenochtitlán.",
              "Analizar la Matrícula de Tributos para identificar qué productos y en qué cantidades debían entregar los pueblos sometidos.",
              "Explicar la función de los mercados, especialmente el de Tlatelolco, en la economía mexica."
            ]
          },
          {
            "key": "religion_sacrificios_mexicas",
            "name": "Religión y Práctica del Sacrificio",
            "short_description": "Analizar la cosmovisión mexica y la centralidad del sacrificio humano.",
            "example_tasks": [
              "Explicar la concepción mexica del universo, los cinco soles y la necesidad de alimentar a los dioses para mantener el orden cósmico.",
              "Analizar el papel de Huitzilopochtli como dios tutelar y su relación con las guerras de expansión.",
              "Discutir las guerras floridas (xochiyáoyotl) como medio de obtener prisioneros para el sacrificio."
            ]
          },
          {
            "key": "educacion_cultura_mexica",
            "name": "Educación y Manifestaciones Culturales",
            "short_description": "Comprender los sistemas educativos y las expresiones artísticas y literarias mexicas.",
            "example_tasks": [
              "Comparar la educación en el calmécac (para nobles) y el telpochcalli (para plebeyos) en términos de contenidos y objetivos.",
              "Analizar ejemplos de poesía náhuatl de autores como Nezahualcóyotl para comprender la sensibilidad mexica.",
              "Describir las características de la escultura mexica utilizando ejemplos como la Piedra del Sol o la Coatlicue."
            ]
          },
          {
            "key": "expansion_maxima_mexica",
            "name": "Máxima Expansión del Imperio",
            "short_description": "Evaluar el alcance territorial del imperio bajo los grandes tlatoanis.",
            "example_tasks": [
              "Crear un mapa que muestre la expansión territorial mexica desde Moctezuma I hasta Ahuízotl.",
              "Identificar los límites del imperio y los señoríos que mantuvieron su independencia (Tlaxcala, Michoacán).",
              "Analizar las estrategias militares y diplomáticas utilizadas por los mexicas para someter a otros pueblos."
            ]
          }
        ]
      },
      {
        "key": "otras_culturas_posclasico",
        "name": "Otras Culturas del Posclásico",
        "short_description": "Estudio de civilizaciones contemporáneas a los mexicas, como mixtecas, zapotecas, tarascos y otros pueblos.",
        "sub_topics": [
          {
            "key": "mixtecas_codices",
            "name": "Los Mixtecas y su Tradición de Códices",
            "short_description": "Analizar la cultura mixteca, especialmente su arte y tradición historiográfica.",
            "example_tasks": [
              "Describir las características de los códices mixtecos como registros genealógicos e históricos.",
              "Analizar el arte mixteco en orfebrería y cerámica policroma.",
              "Investigar la biografía del señor 8 Venado Garra de Jaguar a través de códices mixtecos."
            ]
          },
          {
            "key": "tarascos_michoacan",
            "name": "El Imperio Tarasco de Michoacán",
            "short_description": "Estudiar el desarrollo independiente del señorío tarasco y su resistencia ante los mexicas.",
            "example_tasks": [
              "Explicar por qué el imperio tarasco logró mantener su independencia frente a la expansión mexica.",
              "Analizar la organización política centralizada tarasca con capital en Tzintzuntzan.",
              "Describir las habilidades metalúrgicas de los tarascos, superiores a las de otros pueblos mesoamericanos."
            ]
          },
          {
            "key": "mayas_posclasico",
            "name": "Mayas del Posclásico",
            "short_description": "Comprender la continuidad maya después del colapso clásico.",
            "example_tasks": [
              "Analizar las características de ciudades mayas del Posclásico como Mayapán y Chichén Itzá.",
              "Explicar la influencia mexicana (tolteca) en la cultura maya del Posclásico.",
              "Investigar la organización política de los señoríos mayas al momento de la llegada española."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "conquista_mexico",
    "name": "La Conquista de México",
    "short_description": "Análisis del proceso de conquista española de México-Tenochtitlán, desde la llegada de Hernán Cortés hasta la caída del imperio mexica, examinando causas, desarrollo, actores indígenas y españoles, y consecuencias demográficas y culturales.",
    "sub_topics": [
      {
        "key": "antecedentes_conquista",
        "name": "Antecedentes de la Conquista",
        "short_description": "Contexto de la expansión española en América y las primeras expediciones al territorio mexicano.",
        "sub_topics": [
          {
            "key": "expansion_española_caribe",
            "name": "Expansión Española en el Caribe",
            "short_description": "Comprender el proceso de colonización de las Antillas como antecedente de la conquista de México.",
            "example_tasks": [
              "Explicar el establecimiento español en las Antillas desde 1492 y la conquista de Cuba como base para expediciones a México.",
              "Analizar el sistema de encomienda implementado en el Caribe y sus consecuencias para la población indígena.",
              "Describir las expediciones de Francisco Hernández de Córdoba (1517) y Juan de Grijalva (1518) a las costas de Yucatán."
            ]
          },
          {
            "key": "situacion_imperio_mexica_1519",
            "name": "Situación del Imperio Mexica en 1519",
            "short_description": "Analizar la situación política y social del imperio mexica al momento de la llegada española.",
            "example_tasks": [
              "Evaluar las tensiones internas del imperio mexica y el descontento de los pueblos tributarios.",
              "Explicar la interpretación de presagios y señales que, según las crónicas, anunciaban calamidades.",
              "Analizar la personalidad y el reinado de Moctezuma II en el contexto de la llegada de los españoles."
            ]
          }
        ]
      },
      {
        "key": "expedicion_cortes",
        "name": "La Expedición de Hernán Cortés",
        "short_description": "Seguimiento cronológico de la expedición de Cortés desde Cuba hasta México-Tenochtitlán.",
        "sub_topics": [
          {
            "key": "salida_cuba_llegada_costas",
            "name": "Salida de Cuba y Llegada a Costas Mexicanas",
            "short_description": "Estudiar el inicio de la expedición de Cortés y los primeros encuentros.",
            "example_tasks": [
              "Describir las circunstancias de la expedición de Cortés en 1519, incluyendo la desobediencia a Diego Velázquez.",
              "Analizar los primeros encuentros entre españoles y pueblos mayas en Cozumel y Tabasco.",
              "Explicar el papel de Jerónimo de Aguilar y la Malinche como intérpretes y su importancia estratégica."
            ]
          },
          {
            "key": "fundacion_veracruz_alianzas",
            "name": "Fundación de Veracruz y Primeras Alianzas",
            "short_description": "Comprender la estrategia de Cortés para legitimarse y establecer alianzas.",
            "example_tasks": [
              "Explicar la fundación de la Villa Rica de la Vera Cruz y su función para que Cortés se independizara de la autoridad de Velázquez.",
              "Analizar la decisión de hundir las naves como estrategia para comprometer a sus hombres con la expedición.",
              "Describir el primer contacto con embajadores de Moctezuma y el intercambio de presentes."
            ]
          },
          {
            "key": "alianza_tlaxcaltecas",
            "name": "Alianza con Tlaxcala",
            "short_description": "Analizar la importancia de la alianza con los tlaxcaltecas en el éxito de la conquista.",
            "example_tasks": [
              "Explicar por qué Tlaxcala, enemiga tradicional de los mexicas, decidió aliarse con los españoles.",
              "Describir los enfrentamientos iniciales entre españoles y tlaxcaltecas antes de la alianza.",
              "Evaluar la contribución militar tlaxcalteca a la conquista de Tenochtitlán."
            ]
          },
          {
            "key": "masacre_cholula",
            "name": "La Masacre de Cholula",
            "short_description": "Examinar el controvertido episodio de Cholula y sus interpretaciones.",
            "example_tasks": [
              "Describir los acontecimientos de la masacre de Cholula según diferentes fuentes (Cortés, Díaz del Castillo, fuentes indígenas).",
              "Analizar las razones alegadas por Cortés para justificar la violencia en Cholula.",
              "Discutir el impacto psicológico de este evento en otros pueblos mesoamericanos."
            ]
          }
        ]
      },
      {
        "key": "entrada_tenochtitlan",
        "name": "Entrada a Tenochtitlán y Crisis",
        "short_description": "Análisis de la llegada española a la capital mexica y los eventos que llevaron a la crisis.",
        "sub_topics": [
          {
            "key": "recepcion_tenochtitlan",
            "name": "Recepción en Tenochtitlán",
            "short_description": "Estudiar el encuentro entre Cortés y Moctezuma y la estancia española en la ciudad.",
            "example_tasks": [
              "Describir el encuentro entre Cortés y Moctezuma en noviembre de 1519 según las crónicas españolas e indígenas.",
              "Analizar las razones por las que Moctezuma permitió la entrada de los españoles a Tenochtitlán.",
              "Explicar la estrategia de Cortés de tomar como rehén a Moctezuma en su propio palacio."
            ]
          },
          {
            "key": "masacre_templo_mayor",
            "name": "Masacre del Templo Mayor",
            "short_description": "Examinar el evento que desencadenó la rebelión mexica contra los españoles.",
            "example_tasks": [
              "Describir la masacre ordenada por Pedro de Alvarado durante la fiesta de Tóxcatl en mayo de 1520.",
              "Analizar las consecuencias inmediatas de esta masacre en las relaciones entre españoles y mexicas.",
              "Comparar diferentes interpretaciones sobre las motivaciones de Alvarado para atacar a los mexicas."
            ]
          },
          {
            "key": "noche_triste",
            "name": "La Noche Triste",
            "short_description": "Estudiar la expulsión de los españoles de Tenochtitlán.",
            "example_tasks": [
              "Relatar los acontecimientos de la Noche Triste (30 de junio-1 de julio de 1520) y la huida española de Tenochtitlán.",
              "Analizar el papel de Cuitláhuac en la organización de la resistencia mexica.",
              "Explicar las bajas españolas y de sus aliados, y el impacto psicológico de la derrota en Cortés."
            ]
          },
          {
            "key": "batalla_otumba",
            "name": "Batalla de Otumba",
            "short_description": "Comprender cómo los españoles lograron sobrevivir en su retirada.",
            "example_tasks": [
              "Describir la batalla de Otumba el 7 de julio de 1520 y la victoria española a pesar de su inferioridad numérica.",
              "Analizar las ventajas tácticas españolas (caballos, armamento) que les permitieron vencer.",
              "Explicar la reorganización de Cortés en Tlaxcala después de la derrota en Tenochtitlán."
            ]
          }
        ]
      },
      {
        "key": "sitio_caida_tenochtitlan",
        "name": "Sitio y Caída de Tenochtitlán",
        "short_description": "Análisis detallado del asedio final a la capital mexica y su rendición.",
        "sub_topics": [
          {
            "key": "preparativos_sitio",
            "name": "Preparativos para el Sitio",
            "short_description": "Estudiar la estrategia española para el asalto final a Tenochtitlán.",
            "example_tasks": [
              "Explicar la construcción de bergantines para controlar el lago de Texcoco y cortar los suministros a la ciudad.",
              "Analizar la reunión de fuerzas españolas y aliadas indígenas (tlaxcaltecas, texcocanos y otros) para el sitio.",
              "Describir la estrategia de Cortés de dividir sus fuerzas y atacar la ciudad desde tres puntos."
            ]
          },
          {
            "key": "epidemia_viruela",
            "name": "La Epidemia de Viruela",
            "short_description": "Evaluar el impacto de las enfermedades europeas en la caída de Tenochtitlán.",
            "example_tasks": [
              "Explicar cómo la epidemia de viruela de 1520 afectó a la población mexica, incluyendo la muerte de Cuitláhuac.",
              "Analizar la viruela como factor decisivo en la conquista, debilitando la resistencia indígena.",
              "Comparar las distintas formas en que españoles e indígenas interpretaron la enfermedad."
            ]
          },
          {
            "key": "resistencia_cuauhtemoc",
            "name": "Resistencia de Cuauhtémoc",
            "short_description": "Estudiar la defensa mexica bajo el liderazgo de Cuauhtémoc.",
            "example_tasks": [
              "Describir el liderazgo de Cuauhtémoc como último tlatoani mexica y su determinación de resistir.",
              "Analizar las tácticas defensivas mexicas durante los 75 días de asedio (mayo-agosto de 1521).",
              "Explicar las condiciones de hambre y desesperación en Tenochtitlán al final del sitio."
            ]
          },
          {
            "key": "rendicion_13_agosto_1521",
            "name": "Rendición Final (13 de agosto de 1521)",
            "short_description": "Examinar la caída definitiva de Tenochtitlán y la captura de Cuauhtémoc.",
            "example_tasks": [
              "Relatar los acontecimientos del 13 de agosto de 1521, cuando Cuauhtémoc fue capturado intentando escapar en canoa.",
              "Analizar el discurso de Cuauhtémoc ante Cortés según las crónicas y su significado simbólico.",
              "Describir el estado de destrucción de Tenochtitlán al final del sitio."
            ]
          }
        ]
      },
      {
        "key": "factores_exito_conquista",
        "name": "Factores que Explican la Conquista",
        "short_description": "Análisis multicausal de las razones del éxito español en la conquista de México.",
        "sub_topics": [
          {
            "key": "ventajas_tecnologicas_españolas",
            "name": "Ventajas Tecnológicas y Militares",
            "short_description": "Evaluar la importancia del armamento y tácticas europeas.",
            "example_tasks": [
              "Comparar el armamento español (armas de fuego, espadas de acero, caballos, perros) con el mexica.",
              "Analizar el impacto psicológico de caballos y armas de fuego en los pueblos mesoamericanos.",
              "Discutir las limitaciones de las ventajas tecnológicas españolas dado su reducido número."
            ]
          },
          {
            "key": "alianzas_indigenas",
            "name": "Alianzas con Pueblos Indígenas",
            "short_description": "Comprender el papel crucial de los aliados indígenas en la conquista.",
            "example_tasks": [
              "Cuantificar y analizar la participación de guerreros indígenas aliados en comparación con los españoles.",
              "Explicar las motivaciones de pueblos como tlaxcaltecas y texcocanos para aliarse con los españoles contra los mexicas.",
              "Evaluar la conquista como una guerra civil mesoamericana en la que los españoles fueron un factor adicional."
            ]
          },
          {
            "key": "enfermedades_demograficas",
            "name": "Factor Epidemiológico",
            "short_description": "Analizar el impacto devastador de las enfermedades europeas.",
            "example_tasks": [
              "Explicar por qué las enfermedades del Viejo Mundo fueron mortales para las poblaciones americanas sin inmunidad.",
              "Cuantificar la catástrofe demográfica: estimar la población antes y después de la conquista.",
              "Analizar la viruela, el sarampión y otras enfermedades como factores decisivos en la conquista."
            ]
          },
          {
            "key": "factores_culturales_psicologicos",
            "name": "Factores Culturales y Psicológicos",
            "short_description": "Examinar las diferencias en cosmovisión y su impacto en el conflicto.",
            "example_tasks": [
              "Discutir críticamente la teoría del retorno de Quetzalcóatl y su influencia real en la actitud de Moctezuma.",
              "Analizar las diferencias en la concepción de la guerra entre mexicas (captura para sacrificio) y españoles (destrucción del enemigo).",
              "Evaluar la importancia del factor sorpresa y la indecisión inicial mexica."
            ]
          }
        ]
      },
      {
        "key": "consecuencias_conquista",
        "name": "Consecuencias de la Conquista",
        "short_description": "Análisis de los efectos inmediatos y de largo plazo de la conquista en diversos ámbitos.",
        "sub_topics": [
          {
            "key": "colapso_demografico",
            "name": "Colapso Demográfico",
            "short_description": "Estudiar la catástrofe poblacional que siguió a la conquista.",
            "example_tasks": [
              "Analizar estimaciones de la población indígena antes de la conquista y su reducción en el siglo XVI.",
              "Explicar las causas del colapso demográfico: enfermedades, trabajos forzados, disrupción social.",
              "Evaluar las consecuencias sociales y económicas de la despoblación indígena."
            ]
          },
          {
            "key": "destruccion_reconstruccion_urbana",
            "name": "Destrucción y Reconstrucción Urbana",
            "short_description": "Comprender la transformación física de Tenochtitlán en Ciudad de México.",
            "example_tasks": [
              "Describir la destrucción de los templos y edificios mexicas y su reemplazo con construcciones españolas.",
              "Analizar la continuidad urbanística: cómo la traza española respetó parcialmente la organización mexica.",
              "Explicar el simbolismo de construir la catedral sobre el recinto sagrado mexica."
            ]
          },
          {
            "key": "imposicion_cristianismo",
            "name": "Imposición del Cristianismo",
            "short_description": "Estudiar el proceso de evangelización y la supresión de la religión prehispánica.",
            "example_tasks": [
              "Describir la llegada de las órdenes religiosas (franciscanos, dominicos, agustinos) y sus métodos de evangelización.",
              "Analizar la destrucción de ídolos, códices y templos como parte de la extirpación de idolatrías.",
              "Explicar el sincretismo religioso: la mezcla de elementos cristianos e indígenas en la religiosidad popular."
            ]
          },
          {
            "key": "continuidades_cambios_culturales",
            "name": "Continuidades y Cambios Culturales",
            "short_description": "Evaluar qué elementos de la cultura prehispánica sobrevivieron y cuáles desaparecieron.",
            "example_tasks": [
              "Identificar elementos de continuidad cultural: lenguas indígenas, agricultura, organización comunal.",
              "Analizar qué aspectos de la cultura prehispánica fueron suprimidos: escritura jeroglífica, educación tradicional, sacrificios.",
              "Explicar el concepto de mestizaje cultural como fusión de elementos indígenas, españoles y posteriormente africanos."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "virreinato_nueva_espana",
    "name": "El Virreinato de la Nueva España",
    "short_description": "Estudio comprehensivo del periodo colonial en México (1535-1821), incluyendo la organización política y administrativa, estructura social, economía, evangelización, manifestaciones culturales y vida cotidiana durante los tres siglos de dominio español.",
    "sub_topics": [
      {
        "key": "organizacion_politica_virreinal",
        "name": "Organización Política y Administrativa",
        "short_description": "Análisis de las instituciones y estructuras de gobierno que España implementó para controlar la Nueva España.",
        "sub_topics": [
          {
            "key": "instituciones_españa_colonias",
            "name": "Instituciones Españolas para Gobernar las Colonias",
            "short_description": "Comprender las instituciones metropolitanas que controlaban las colonias desde España.",
            "example_tasks": [
              "Explicar las funciones del Consejo de Indias y la Casa de Contratación en el gobierno de las colonias americanas.",
              "Analizar el papel del rey de España como máxima autoridad en el sistema colonial.",
              "Describir el sistema de comunicación y toma de decisiones entre España y sus colonias americanas."
            ]
          },
          {
            "key": "virrey_autoridad_maxima",
            "name": "El Virrey: Máxima Autoridad en Nueva España",
            "short_description": "Estudiar la figura del virrey como representante del rey y sus atribuciones.",
            "example_tasks": [
              "Describir las funciones administrativas, judiciales, militares y religiosas del virrey.",
              "Analizar la importancia simbólica del virrey como encarnación del poder real en América.",
              "Investigar la actuación de virreyes destacados como Antonio de Mendoza (primer virrey) o Luis de Velasco."
            ]
          },
          {
            "key": "real_audiencia",
            "name": "La Real Audiencia",
            "short_description": "Comprender el funcionamiento del máximo tribunal de justicia y órgano consultivo.",
            "example_tasks": [
              "Explicar las funciones judiciales y administrativas de la Real Audiencia de México.",
              "Analizar cómo la Audiencia servía como contrapeso al poder del virrey.",
              "Describir la composición de la Audiencia: oidores, fiscales y su nombramiento."
            ]
          },
          {
            "key": "gobierno_provincial_local",
            "name": "Gobierno Provincial y Local",
            "short_description": "Estudiar la organización administrativa en provincias, corregimientos y cabildos.",
            "example_tasks": [
              "Explicar la división territorial de la Nueva España y el papel de gobernadores y corregidores.",
              "Analizar la función de los cabildos o ayuntamientos en las ciudades españolas.",
              "Describir los cargos concejiles (alcaldes, regidores, alguaciles) y su forma de elección o compra."
            ]
          },
          {
            "key": "republica_indios",
            "name": "La República de Indios",
            "short_description": "Comprender el sistema de gobierno indígena dentro del orden colonial.",
            "example_tasks": [
              "Explicar la división entre República de Españoles y República de Indios como forma de segregación.",
              "Analizar cómo los cabildos indígenas administraban las comunidades bajo supervisión española.",
              "Describir el papel de los gobernadores, alcaldes y principales indígenas en el gobierno local."
            ]
          }
        ]
      },
      {
        "key": "estructura_social_colonial",
        "name": "Estructura Social del Virreinato",
        "short_description": "Análisis de la sociedad estamentaria novohispana basada en origen étnico, ocupación y privilegios.",
        "sub_topics": [
          {
            "key": "sistema_castas",
            "name": "El Sistema de Castas",
            "short_description": "Estudiar la compleja jerarquía social basada en el mestizaje y el origen étnico.",
            "example_tasks": [
              "Elaborar un cuadro que muestre las principales castas coloniales y su jerarquía (españoles, criollos, indios, negros, mestizos, mulatos, etc.).",
              "Analizar las pinturas de castas del siglo XVIII como fuente histórica sobre la sociedad colonial.",
              "Explicar cómo el sistema de castas determinaba derechos, obligaciones y posibilidades de ascenso social."
            ]
          },
          {
            "key": "peninsulares_criollos",
            "name": "Peninsulares y Criollos",
            "short_description": "Comprender las diferencias y tensiones entre españoles nacidos en España y en América.",
            "example_tasks": [
              "Explicar las diferencias legales, económicas y de prestigio entre peninsulares y criollos.",
              "Analizar cómo los peninsulares monopolizaban los altos cargos políticos y eclesiásticos.",
              "Describir el desarrollo de una identidad criolla y su eventual papel en la independencia."
            ]
          },
          {
            "key": "poblacion_indigena_colonial",
            "name": "Población Indígena en el Sistema Colonial",
            "short_description": "Estudiar la situación legal, económica y social de los pueblos indígenas.",
            "example_tasks": [
              "Explicar el estatus legal de los indígenas como menores de edad bajo tutela real y eclesiástica.",
              "Analizar el pago de tributo indígena como obligación fundamental hacia la Corona.",
              "Describir la vida en los pueblos de indios y su relativa autonomía bajo supervisión española."
            ]
          },
          {
            "key": "esclavitud_africana",
            "name": "Esclavitud Africana en Nueva España",
            "short_description": "Comprender la introducción y el papel de la población africana esclavizada.",
            "example_tasks": [
              "Explicar las razones de la introducción de esclavos africanos en la Nueva España.",
              "Analizar las condiciones de vida y trabajo de los esclavos en haciendas, minas y ciudades.",
              "Describir las formas de resistencia esclava: cimarronaje, palenques, rebeliones."
            ]
          },
          {
            "key": "mestizaje_grupos_mixtos",
            "name": "Mestizaje y Grupos Étnicos Mixtos",
            "short_description": "Analizar el proceso de mestizaje y la formación de identidades híbridas.",
            "example_tasks": [
              "Explicar el mestizaje como proceso biológico y cultural que caracterizó a la sociedad novohispana.",
              "Analizar la situación ambigua de mestizos, mulatos y otras castas en la jerarquía social.",
              "Describir los intentos de las autoridades por regular y clasificar la creciente población mixta."
            ]
          }
        ]
      },
      {
        "key": "economia_colonial",
        "name": "Economía del Virreinato",
        "short_description": "Estudio de las actividades económicas, sistemas de explotación de recursos y trabajo, y el comercio colonial.",
        "sub_topics": [
          {
            "key": "mineria_colonial",
            "name": "La Minería como Eje Económico",
            "short_description": "Analizar la importancia de la minería de plata en la economía novohispana.",
            "example_tasks": [
              "Explicar por qué la minería de plata fue la actividad económica más importante de la Nueva España.",
              "Describir los principales centros mineros: Zacatecas, Guanajuato, Taxco, Pachuca.",
              "Analizar el proceso de amalgamación con mercurio para la extracción de plata."
            ]
          },
          {
            "key": "agricultura_haciendas",
            "name": "Agricultura y el Sistema de Haciendas",
            "short_description": "Estudiar la producción agrícola y ganadera en las grandes propiedades.",
            "example_tasks": [
              "Describir el desarrollo de las haciendas como unidades productivas autosuficientes.",
              "Analizar los cultivos principales: maíz, trigo, caña de azúcar, maguey.",
              "Explicar las relaciones laborales en las haciendas: peones, trabajadores endeudados."
            ]
          },
          {
            "key": "encomienda_repartimiento",
            "name": "Sistemas de Trabajo: Encomienda y Repartimiento",
            "short_description": "Comprender los mecanismos de explotación del trabajo indígena.",
            "example_tasks": [
              "Explicar el sistema de encomienda: derechos y obligaciones de encomenderos e indígenas encomendados.",
              "Analizar las críticas a la encomienda por parte de frailes como Bartolomé de las Casas.",
              "Describir el sistema de repartimiento o cuatequil como forma de trabajo forzado rotativo."
            ]
          },
          {
            "key": "comercio_monopolio",
            "name": "Comercio y Monopolio",
            "short_description": "Estudiar el sistema comercial restrictivo impuesto por España.",
            "example_tasks": [
              "Explicar el monopolio comercial español: Nueva España solo podía comerciar con España.",
              "Describir el sistema de flotas y galeones que transportaban mercancías entre España y América.",
              "Analizar la ruta del Galeón de Manila (Nao de China) y su importancia en el comercio transpacífico."
            ]
          },
          {
            "key": "ferias_comercio_interno",
            "name": "Comercio Interno y Ferias",
            "short_description": "Comprender la dinámica del comercio dentro del virreinato.",
            "example_tasks": [
              "Describir las rutas comerciales internas que conectaban diferentes regiones del virreinato.",
              "Analizar la importancia de ferias como la de Jalapa para el intercambio comercial.",
              "Explicar el papel de arrieros y comerciantes en la economía colonial."
            ]
          }
        ]
      },
      {
        "key": "evangelizacion_iglesia",
        "name": "Evangelización y el Papel de la Iglesia",
        "short_description": "Análisis del proceso de conversión religiosa, la labor de las órdenes religiosas y el poder eclesiástico en la colonia.",
        "sub_topics": [
          {
            "key": "ordenes_religiosas",
            "name": "Órdenes Religiosas y Métodos de Evangelización",
            "short_description": "Estudiar el trabajo misionero de franciscanos, dominicos, agustinos y jesuitas.",
            "example_tasks": [
              "Comparar los métodos de evangelización de las diferentes órdenes religiosas.",
              "Describir la labor educativa de los frailes: enseñanza del español, latín, artes y oficios.",
              "Analizar el papel de los frailes en la defensa de los indígenas y en la preservación de su cultura."
            ]
          },
          {
            "key": "inquisicion_nueva_espana",
            "name": "La Inquisición en Nueva España",
            "short_description": "Comprender el funcionamiento del Santo Oficio y su control ideológico.",
            "example_tasks": [
              "Explicar las funciones del Tribunal del Santo Oficio establecido en 1571.",
              "Analizar casos de persecución por herejía, blasfemia, bigamia o criptojudaísmo.",
              "Describir los autos de fe como ceremonias públicas de castigo y su función aleccionadora."
            ]
          },
          {
            "key": "sincretismo_religioso",
            "name": "Sincretismo Religioso",
            "short_description": "Estudiar la fusión de elementos religiosos prehispánicos y católicos.",
            "example_tasks": [
              "Explicar el concepto de sincretismo religioso con ejemplos concretos de Nueva España.",
              "Analizar el culto a la Virgen de Guadalupe como símbolo del sincretismo y la identidad novohispana.",
              "Describir la persistencia de prácticas y creencias prehispánicas bajo apariencia cristiana."
            ]
          },
          {
            "key": "poder_economico_iglesia",
            "name": "Poder Económico de la Iglesia",
            "short_description": "Comprender la riqueza y el poder terrenal de la institución eclesiástica.",
            "example_tasks": [
              "Analizar cómo la Iglesia se convirtió en el mayor terrateniente de Nueva España.",
              "Explicar las fuentes de riqueza eclesiástica: diezmos, donaciones, capellanías, obras pías.",
              "Describir el papel de la Iglesia como institución crediticia a través de los juzgados de capellanías."
            ]
          }
        ]
      },
      {
        "key": "cultura_arte_colonial",
        "name": "Cultura y Arte en el Virreinato",
        "short_description": "Estudio de las manifestaciones culturales, artísticas e intelectuales del periodo colonial.",
        "sub_topics": [
          {
            "key": "arquitectura_colonial",
            "name": "Arquitectura Colonial",
            "short_description": "Analizar los estilos arquitectónicos y las grandes construcciones del virreinato.",
            "example_tasks": [
              "Describir las características del arte plateresco, barroco y churrigueresco en la arquitectura novohispana.",
              "Analizar edificios emblemáticos: Catedral Metropolitana, conventos del siglo XVI, palacios virreinales.",
              "Explicar cómo la arquitectura reflejaba el poder de la Iglesia y el Estado colonial."
            ]
          },
          {
            "key": "pintura_escultura_colonial",
            "name": "Pintura y Escultura",
            "short_description": "Estudiar las artes plásticas coloniales y sus principales exponentes.",
            "example_tasks": [
              "Analizar la pintura religiosa como género dominante: retablos, murales, cuadros devocionales.",
              "Describir el trabajo de artistas destacados como Cristóbal de Villalpando y Miguel Cabrera.",
              "Explicar las pinturas de castas como género artístico particular del siglo XVIII novohispano."
            ]
          },
          {
            "key": "literatura_colonial",
            "name": "Literatura Colonial",
            "short_description": "Comprender la producción literaria del periodo virreinal.",
            "example_tasks": [
              "Analizar la obra de Sor Juana Inés de la Cruz como máxima exponente de las letras coloniales.",
              "Describir crónicas y relatos de la conquista y el virreinato (Bernal Díaz, Sahagún, Torquemada).",
              "Explicar la importancia de la imprenta en Nueva España desde 1539 y su producción editorial."
            ]
          },
          {
            "key": "educacion_universidades",
            "name": "Educación y Universidades",
            "short_description": "Estudiar las instituciones educativas y la vida intelectual colonial.",
            "example_tasks": [
              "Describir la fundación y funcionamiento de la Real y Pontificia Universidad de México (1551).",
              "Analizar el currículum universitario basado en escolástica, teología, derecho y medicina.",
              "Explicar las diferentes opciones educativas según el estamento social: colegios para criollos, escuelas conventuales para indios."
            ]
          },
          {
            "key": "ciencia_tecnologia_colonial",
            "name": "Ciencia y Tecnología",
            "short_description": "Comprender el desarrollo científico y técnico en Nueva España.",
            "example_tasks": [
              "Analizar expediciones científicas como la Expedición Botánica y su contribución al conocimiento.",
              "Describir avances en minería y metalurgia aplicados en Nueva España.",
              "Explicar el papel de los jesuitas en la difusión del conocimiento científico antes de su expulsión."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "reformas_borbonicas",
    "name": "Reformas Borbónicas y Crisis del Sistema Colonial",
    "short_description": "Análisis de los cambios administrativos, económicos y sociales implementados por la dinastía borbónica en el siglo XVIII, sus objetivos de modernización y centralización, y cómo generaron tensiones que contribuyeron al proceso de independencia.",
    "sub_topics": [
      {
        "key": "contexto_reformas_borbonicas",
        "name": "Contexto de las Reformas Borbónicas",
        "short_description": "Comprender las razones políticas y económicas que llevaron a España a reformar el sistema colonial.",
        "sub_topics": [
          {
            "key": "dinastia_borbon_españa",
            "name": "Llegada de la Dinastía Borbón a España",
            "short_description": "Estudiar el cambio dinástico y la nueva orientación política de origen francés.",
            "example_tasks": [
              "Explicar cómo la Guerra de Sucesión Española (1701-1714) llevó a los Borbones al trono.",
              "Analizar las diferencias entre el absolutismo borbónico francés y el sistema de los Habsburgo.",
              "Describir la influencia de la Ilustración en las políticas reformistas borbónicas."
            ]
          },
          {
            "key": "debilidad_españa_siglo_xviii",
            "name": "Debilidad de España frente a Potencias Rivales",
            "short_description": "Comprender la necesidad de fortalecer el imperio ante la competencia europea.",
            "example_tasks": [
              "Analizar la competencia de Inglaterra, Francia y Holanda por el dominio colonial.",
              "Explicar las pérdidas territoriales españolas y la necesidad de defender sus colonias.",
              "Describir el contrabando y la piratería como amenazas al monopolio comercial español."
            ]
          }
        ]
      },
      {
        "key": "reformas_administrativas",
        "name": "Reformas Administrativas y Políticas",
        "short_description": "Análisis de los cambios en la organización gubernamental y el control sobre las colonias.",
        "sub_topics": [
          {
            "key": "sistema_intendencias",
            "name": "Creación del Sistema de Intendencias",
            "short_description": "Estudiar la nueva división administrativa para mejorar el gobierno y la recaudación.",
            "example_tasks": [
              "Explicar cómo el sistema de intendencias (1786) reemplazó a los corregimientos y alcaldías mayores.",
              "Describir las funciones de los intendentes: hacienda, justicia, guerra y policía.",
              "Analizar el objetivo de centralizar el control y aumentar la eficiencia administrativa."
            ]
          },
          {
            "key": "fortalecimiento_poder_real",
            "name": "Fortalecimiento del Poder Real",
            "short_description": "Comprender los esfuerzos por centralizar el poder en la Corona.",
            "example_tasks": [
              "Analizar cómo las reformas buscaban limitar el poder de criollos y corporaciones locales.",
              "Explicar el nombramiento de peninsulares en cargos clave en detrimento de criollos.",
              "Describir la reducción de autonomía de cabildos y audiencias."
            ]
          },
          {
            "key": "reforma_militar",
            "name": "Reforma Militar",
            "short_description": "Estudiar la profesionalización del ejército colonial.",
            "example_tasks": [
              "Explicar la creación de milicias provinciales y el ejército regular en Nueva España.",
              "Analizar el envío de oficiales peninsulares para comandar las fuerzas armadas.",
              "Describir cómo la militarización creó una nueva élite con fuero militar."
            ]
          }
        ]
      },
      {
        "key": "reformas_economicas_fiscales",
        "name": "Reformas Económicas y Fiscales",
        "short_description": "Análisis de las medidas para aumentar los ingresos de la Corona y modernizar la economía.",
        "sub_topics": [
          {
            "key": "liberalizacion_comercial",
            "name": "Liberalización Comercial Parcial",
            "short_description": "Estudiar la apertura del monopolio comercial y sus efectos.",
            "example_tasks": [
              "Explicar el Reglamento de Comercio Libre de 1778 y su impacto en Nueva España.",
              "Analizar la autorización de más puertos españoles y americanos para el comercio.",
              "Describir cómo estas medidas beneficiaron a algunos sectores pero afectaron a comerciantes tradicionales."
            ]
          },
          {
            "key": "aumento_recaudacion_fiscal",
            "name": "Aumento de la Recaudación Fiscal",
            "short_description": "Comprender las medidas para incrementar los ingresos de la Corona.",
            "example_tasks": [
              "Analizar el aumento de impuestos y la creación de nuevos gravámenes (alcabalas, estancos).",
              "Explicar la implementación de monopolios estatales sobre tabaco, pólvora, naipes y mercurio.",
              "Describir el descontento social causado por el aumento de la presión fiscal."
            ]
          },
          {
            "key": "fomento_mineria",
            "name": "Fomento de la Minería",
            "short_description": "Estudiar las políticas para estimular la producción minera.",
            "example_tasks": [
              "Explicar la creación del Tribunal de Minería (1777) y el Colegio de Minería.",
              "Analizar las exenciones fiscales y facilidades crediticias para mineros.",
              "Describir la introducción de nuevas tecnologías mineras desde Europa."
            ]
          }
        ]
      },
      {
        "key": "reformas_iglesia",
        "name": "Reformas sobre la Iglesia",
        "short_description": "Análisis de las medidas para limitar el poder económico y político de la institución eclesiástica.",
        "sub_topics": [
          {
            "key": "expulsion_jesuitas",
            "name": "Expulsión de los Jesuitas (1767)",
            "short_description": "Estudiar las causas y consecuencias de la expulsión de la Compañía de Jesús.",
            "example_tasks": [
              "Explicar las razones políticas de Carlos III para expulsar a los jesuitas de todos los dominios españoles.",
              "Analizar el impacto educativo, económico y social de la expulsión.",
              "Describir la resistencia popular a la expulsión en ciudades como Guanajuato y San Luis Potosí."
            ]
          },
          {
            "key": "secularizacion_bienes_iglesia",
            "name": "Intentos de Secularización",
            "short_description": "Comprender los esfuerzos por limitar la riqueza eclesiástica.",
            "example_tasks": [
              "Analizar la Ley de Consolidación de Vales Reales (1804) que obligaba a la venta de bienes eclesiásticos.",
              "Explicar el impacto económico de retirar capitales de la economía novohispana.",
              "Describir el resentimiento del clero y de terratenientes endeudados con la Iglesia."
            ]
          },
          {
            "key": "control_real_sobre_iglesia",
            "name": "Aumento del Control Real sobre la Iglesia",
            "short_description": "Estudiar el regalismo borbónico y su aplicación en Nueva España.",
            "example_tasks": [
              "Explicar el concepto de regalismo: supremacía del poder real sobre el eclesiástico.",
              "Analizar medidas como el control real sobre nombramientos eclesiásticos y diezmos.",
              "Describir las tensiones entre la Corona y el alto clero."
            ]
          }
        ]
      },
      {
        "key": "impacto_social_reformas",
        "name": "Impacto Social de las Reformas",
        "short_description": "Análisis de las consecuencias sociales y políticas de las reformas borbónicas.",
        "sub_topics": [
          {
            "key": "descontento_criollo",
            "name": "Creciente Descontento Criollo",
            "short_description": "Comprender cómo las reformas alienaron a la élite criolla.",
            "example_tasks": [
              "Analizar cómo el desplazamiento de criollos de cargos importantes generó resentimiento.",
              "Explicar la frustración criolla ante el trato de segunda clase por parte de peninsulares.",
              "Describir el desarrollo de un proto-nacionalismo criollo que reivindicaba lo americano."
            ]
          },
          {
            "key": "protestas_rebeliones",
            "name": "Protestas y Rebeliones",
            "short_description": "Estudiar las manifestaciones de resistencia popular a las reformas.",
            "example_tasks": [
              "Describir rebeliones urbanas contra estancos e impuestos (motines de 1766-1767).",
              "Analizar rebeliones indígenas como la de Jacinto Canek en Yucatán (1761).",
              "Explicar cómo el descontento popular fue reprimido pero no eliminado."
            ]
          },
          {
            "key": "ilustracion_criolla",
            "name": "Difusión de Ideas Ilustradas",
            "short_description": "Comprender cómo las ideas ilustradas permearon la sociedad criolla.",
            "example_tasks": [
              "Analizar la influencia de la Ilustración europea en intelectuales novohispanos.",
              "Describir la formación de sociedades de Amigos del País y la difusión de periódicos.",
              "Explicar cómo las ideas de soberanía popular y derechos naturales circulaban entre criollos educados."
            ]
          }
        ]
      },
      {
        "key": "crisis_monarquia_española",
        "name": "Crisis de la Monarquía Española",
        "short_description": "Análisis de los eventos en Europa que precipitaron la crisis del imperio colonial.",
        "sub_topics": [
          {
            "key": "revolucion_francesa_impacto",
            "name": "Revolución Francesa y su Impacto",
            "short_description": "Estudiar cómo la Revolución Francesa influyó en el pensamiento político americano.",
            "example_tasks": [
              "Explicar los principios de la Revolución Francesa (libertad, igualdad, fraternidad) y su atractivo para criollos.",
              "Analizar el miedo de las autoridades españolas a la difusión de ideas revolucionarias.",
              "Describir casos de censura y persecución por posesión de literatura francesa prohibida."
            ]
          },
          {
            "key": "invasion_napoleonica",
            "name": "Invasión Napoleónica de España (1808)",
            "short_description": "Comprender la crisis de legitimidad creada por la invasión francesa.",
            "example_tasks": [
              "Describir la abdicación forzada de Carlos IV y Fernando VII y la imposición de José Bonaparte.",
              "Explicar la formación de juntas en España para resistir la ocupación francesa.",
              "Analizar cómo la crisis monárquica abrió la posibilidad de autonomía en las colonias."
            ]
          },
          {
            "key": "debate_soberania",
            "name": "Debate sobre la Soberanía",
            "short_description": "Estudiar las discusiones sobre quién debía gobernar en ausencia del rey legítimo.",
            "example_tasks": [
              "Explicar la teoría de la retroversión de la soberanía al pueblo en ausencia del monarca.",
              "Analizar el debate entre quienes apoyaban la fidelidad a España y quienes defendían la autonomía americana.",
              "Describir las primeras juntas autonomistas en América y su justificación teórica."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "independencia_mexico",
    "name": "Movimiento de Independencia de México",
    "short_description": "Estudio comprehensivo del proceso de independencia mexicana (1810-1821), analizando causas internas y externas, las cuatro etapas del movimiento, principales líderes e ideologías, participación de diferentes grupos sociales, y las consecuencias de la separación de España.",
    "sub_topics": [
      {
        "key": "causas_independencia",
        "name": "Causas de la Independencia",
        "short_description": "Análisis de los factores que propiciaron el movimiento independentista.",
        "sub_topics": [
          {
            "key": "causas_internas",
            "name": "Causas Internas",
            "short_description": "Identificar los factores dentro de Nueva España que motivaron la independencia.",
            "example_tasks": [
              "Explicar la desigualdad social y la discriminación hacia criollos, mestizos e indígenas como causas del descontento.",
              "Analizar cómo las reformas borbónicas y el aumento de impuestos generaron malestar.",
              "Describir el desarrollo de una conciencia criolla que reivindicaba lo americano frente a lo peninsular."
            ]
          },
          {
            "key": "causas_externas",
            "name": "Causas Externas",
            "short_description": "Comprender la influencia de acontecimientos internacionales.",
            "example_tasks": [
              "Analizar la influencia de la Ilustración y las ideas de libertad, igualdad y soberanía popular.",
              "Explicar el impacto de la Independencia de Estados Unidos (1776) como ejemplo de emancipación colonial.",
              "Describir cómo la Revolución Francesa y la invasión napoleónica de España crearon una crisis de legitimidad."
            ]
          },
          {
            "key": "crisis_1808",
            "name": "La Crisis de 1808 como Detonante",
            "short_description": "Estudiar cómo los eventos de 1808 precipitaron el movimiento.",
            "example_tasks": [
              "Explicar la invasión napoleónica de España y la abdicación de Fernando VII.",
              "Analizar el golpe de Estado de los peninsulares en Nueva España contra el virrey Iturrigaray (septiembre 1808).",
              "Describir cómo la crisis monárquica abrió el debate sobre la soberanía y el autogobierno."
            ]
          }
        ]
      },
      {
        "key": "inicio_insurgencia",
        "name": "Inicio de la Insurgencia (1810-1811)",
        "short_description": "Análisis de la primera etapa del movimiento independentista bajo el liderazgo de Hidalgo.",
        "sub_topics": [
          {
            "key": "conspiracion_queretaro",
            "name": "Conspiración de Querétaro",
            "short_description": "Estudiar los planes iniciales del movimiento y su descubrimiento.",
            "example_tasks": [
              "Describir la conspiración liderada por criollos como Allende, Aldama y el corregidor Domínguez.",
              "Explicar el papel de Josefa Ortiz de Domínguez en advertir a los conspiradores.",
              "Analizar los objetivos iniciales: formar una junta de gobierno en nombre de Fernando VII."
            ]
          },
          {
            "key": "grito_dolores",
            "name": "Grito de Dolores (16 de septiembre de 1810)",
            "short_description": "Comprender el inicio formal del movimiento independentista.",
            "example_tasks": [
              "Relatar los acontecimientos de la madrugada del 16 de septiembre de 1810 en Dolores.",
              "Analizar el contenido y significado del Grito de Dolores de Miguel Hidalgo.",
              "Explicar por qué Hidalgo convocó al pueblo y no solo a criollos, transformando el movimiento."
            ]
          },
          {
            "key": "hidalgo_lider_popular",
            "name": "Hidalgo como Líder del Movimiento Popular",
            "short_description": "Estudiar el liderazgo de Hidalgo y la naturaleza popular del movimiento.",
            "example_tasks": [
              "Describir la formación del ejército insurgente mayoritariamente indígena y mestizo.",
              "Analizar las tomas de Guanajuato (Alhóndiga de Granaditas), Valladolid y Guadalajara.",
              "Explicar las tensiones entre Hidalgo y los criollos militares como Allende."
            ]
          },
          {
            "key": "abolicion_esclavitud_hidalgo",
            "name": "Decretos de Hidalgo",
            "short_description": "Comprender las medidas sociales promulgadas por Hidalgo.",
            "example_tasks": [
              "Analizar el decreto de abolición de la esclavitud (diciembre 1810) y su significado.",
              "Explicar la supresión del tributo indígena como medida de justicia social.",
              "Describir el uso del estandarte de la Virgen de Guadalupe como símbolo del movimiento."
            ]
          },
          {
            "key": "derrota_captura_hidalgo",
            "name": "Derrota y Ejecución de Hidalgo",
            "short_description": "Estudiar el fin de la primera etapa de la insurgencia.",
            "example_tasks": [
              "Describir la derrota insurgente en Puente de Calderón (enero 1811) y sus consecuencias.",
              "Relatar la captura de los líderes insurgentes en Acatita de Baján (marzo 1811).",
              "Analizar el juicio, degradación eclesiástica y fusilamiento de Hidalgo (julio 1811)."
            ]
          }
        ]
      },
      {
        "key": "organizacion_resistencia",
        "name": "Organización y Resistencia (1811-1815)",
        "short_description": "Análisis de la segunda etapa caracterizada por la organización política y militar de la insurgencia.",
        "sub_topics": [
          {
            "key": "liderazgo_morelos",
            "name": "Liderazgo de José María Morelos",
            "short_description": "Estudiar cómo Morelos organizó y dio dirección política al movimiento.",
            "example_tasks": [
              "Describir el perfil de Morelos como sacerdote, militar y estratega político.",
              "Analizar las campañas militares de Morelos en el sur: Oaxaca, Acapulco, Cuautla.",
              "Explicar cómo Morelos profesionalizó al ejército insurgente con disciplina y tácticas de guerrilla."
            ]
          },
          {
            "key": "sitio_cuautla",
            "name": "Sitio de Cuautla",
            "short_description": "Comprender la resistencia insurgente y su significado simbólico.",
            "example_tasks": [
              "Describir el sitio de Cuautla (febrero-mayo 1812) por las fuerzas realistas de Calleja.",
              "Analizar cómo la resistencia de Morelos elevó la moral insurgente.",
              "Explicar la ruptura del sitio y la continuación de la lucha insurgente."
            ]
          },
          {
            "key": "sentimientos_nacion",
            "name": "Sentimientos de la Nación",
            "short_description": "Estudiar el programa político de Morelos para México independiente.",
            "example_tasks": [
              "Analizar los 23 puntos de los Sentimientos de la Nación presentados en 1813.",
              "Explicar propuestas clave: independencia total, soberanía popular, igualdad ante la ley, abolición de castas.",
              "Describir la visión social de Morelos: distribución de riqueza, educación popular."
            ]
          },
          {
            "key": "congreso_chilpancingo",
            "name": "Congreso de Chilpancingo",
            "short_description": "Comprender la formalización política del movimiento independentista.",
            "example_tasks": [
              "Describir la instalación del Congreso de Anáhuac en Chilpancingo (septiembre 1813).",
              "Analizar la Declaración de Independencia proclamada el 6 de noviembre de 1813.",
              "Explicar la organización del Congreso como legislativo y el papel de Morelos como ejecutivo."
            ]
          },
          {
            "key": "constitucion_apatzingan",
            "name": "Constitución de Apatzingán",
            "short_description": "Estudiar el primer proyecto constitucional mexicano.",
            "example_tasks": [
              "Analizar el contenido de la Constitución de Apatzingán (octubre 1814): división de poderes, derechos ciudadanos.",
              "Explicar las influencias ilustradas y de la Constitución de Cádiz en el documento.",
              "Describir las limitaciones prácticas: nunca entró en vigor por las circunstancias de guerra."
            ]
          },
          {
            "key": "derrota_morelos",
            "name": "Derrota y Fusilamiento de Morelos",
            "short_description": "Comprender el fin de la segunda etapa de la insurgencia.",
            "example_tasks": [
              "Describir el debilitamiento insurgente ante la ofensiva realista de Calleja como virrey.",
              "Relatar la captura de Morelos en Tezmalaca (noviembre 1815) mientras escoltaba al Congreso.",
              "Analizar el juicio y fusilamiento de Morelos en San Cristóbal Ecatepec (diciembre 1815)."
            ]
          }
        ]
      },
      {
        "key": "resistencia_guerra_guerrillas",
        "name": "Resistencia y Guerra de Guerrillas (1815-1820)",
        "short_description": "Análisis de la tercera etapa caracterizada por la fragmentación y resistencia regional.",
        "sub_topics": [
          {
            "key": "dispersión_insurgencia",
            "name": "Dispersión del Movimiento",
            "short_description": "Comprender cómo la insurgencia se fragmentó en focos regionales.",
            "example_tasks": [
              "Describir la situación después de la muerte de Morelos: ausencia de liderazgo unificado.",
              "Analizar cómo los insurgentes se dividieron en grupos guerrilleros autónomos.",
              "Explicar la resistencia de líderes como Guerrero, Bravo, Rayón y Victoria en sus regiones."
            ]
          },
          {
            "key": "guerrero_sur",
            "name": "Vicente Guerrero en el Sur",
            "short_description": "Estudiar la resistencia persistente de Guerrero.",
            "example_tasks": [
              "Describir las tácticas de guerrilla de Vicente Guerrero en las montañas del sur.",
              "Analizar la importancia de Guerrero en mantener viva la causa independentista.",
              "Explicar el conocimiento del terreno y el apoyo popular como bases de su resistencia."
            ]
          },
          {
            "key": "expedicion_mina",
            "name": "Expedición de Xavier Mina",
            "short_description": "Comprender el intento de revitalizar la insurgencia desde el exterior.",
            "example_tasks": [
              "Describir la llegada del español liberal Xavier Mina a México (1817) para apoyar la independencia.",
              "Analizar las campañas de Mina en Guanajuato y el Bajío.",
              "Explicar la captura y fusilamiento de Mina y el fracaso de su expedición."
            ]
          },
          {
            "key": "indultos_realistas",
            "name": "Política de Indultos",
            "short_description": "Estudiar la estrategia realista de pacificación mediante perdones.",
            "example_tasks": [
              "Explicar los ofrecimientos de indulto del gobierno virreinal a insurgentes que se rindieran.",
              "Analizar el éxito parcial de esta política: varios líderes aceptaron el indulto.",
              "Describir cómo otros como Guerrero rechazaron los indultos y continuaron la lucha."
            ]
          }
        ]
      },
      {
        "key": "consumacion_independencia",
        "name": "Consumación de la Independencia (1820-1821)",
        "short_description": "Análisis de la cuarta etapa y el logro final de la independencia mediante una alianza conservadora.",
        "sub_topics": [
          {
            "key": "revolucion_liberal_españa",
            "name": "Revolución Liberal en España (1820)",
            "short_description": "Comprender cómo los eventos en España cambiaron el panorama político.",
            "example_tasks": [
              "Explicar el pronunciamiento de Riego y el restablecimiento de la Constitución de Cádiz.",
              "Analizar el miedo de la élite novohispana ante las reformas liberales españolas.",
              "Describir cómo conservadores, clero y militares vieron en la independencia una forma de preservar privilegios."
            ]
          },
          {
            "key": "plan_iguala",
            "name": "Plan de Iguala",
            "short_description": "Estudiar el documento que estableció las bases de la independencia.",
            "example_tasks": [
              "Analizar las Tres Garantías del Plan de Iguala: Religión (católica única), Independencia, Unión.",
              "Explicar la propuesta de monarquía constitucional con un príncipe europeo.",
              "Describir cómo el Plan buscaba unir a todos los sectores sociales bajo un proyecto conservador."
            ]
          },
          {
            "key": "abrazo_acatempan",
            "name": "Abrazo de Acatempan",
            "short_description": "Comprender la unión de fuerzas insurgentes y realistas.",
            "example_tasks": [
              "Describir el encuentro entre Iturbide y Guerrero en febrero de 1821.",
              "Analizar cómo Guerrero aceptó unirse a Iturbide bajo las Tres Garantías.",
              "Explicar el simbolismo del abrazo como unión de bandos opuestos por la independencia."
            ]
          },
          {
            "key": "ejercito_trigarante",
            "name": "Ejército Trigarante",
            "short_description": "Estudiar la formación del ejército unificado y su campaña final.",
            "example_tasks": [
              "Describir la composición del Ejército Trigarante: insurgentes y realistas unidos.",
              "Analizar la campaña para tomar el control del territorio novohispano.",
              "Explicar cómo la mayoría de fuerzas realistas se unieron o se rindieron sin combatir."
            ]
          },
          {
            "key": "tratados_cordoba",
            "name": "Tratados de Córdoba",
            "short_description": "Comprender el acuerdo final que reconoció la independencia.",
            "example_tasks": [
              "Describir la llegada del último virrey Juan O'Donojú y la firma de los Tratados de Córdoba (agosto 1821).",
              "Analizar cómo los tratados reconocían la independencia y ratificaban el Plan de Iguala.",
              "Explicar las modificaciones: si no venía un príncipe europeo, el Congreso elegiría al emperador."
            ]
          },
          {
            "key": "entrada_ejercito_trigarante",
            "name": "Entrada del Ejército Trigarante a la Ciudad de México",
            "short_description": "Estudiar la consumación simbólica de la independencia.",
            "example_tasks": [
              "Describir la entrada triunfal del Ejército Trigarante a la Ciudad de México el 27 de septiembre de 1821.",
              "Analizar el simbolismo de la bandera trigarante (verde, blanco, rojo) con las Tres Garantías.",
              "Explicar la firma del Acta de Independencia del Imperio Mexicano el 28 de septiembre de 1821."
            ]
          }
        ]
      },
      {
        "key": "consecuencias_independencia",
        "name": "Consecuencias de la Independencia",
        "short_description": "Análisis de los efectos inmediatos y de largo plazo del proceso independentista.",
        "sub_topics": [
          {
            "key": "crisis_economica_postindependencia",
            "name": "Crisis Económica",
            "short_description": "Comprender el impacto económico de once años de guerra.",
            "example_tasks": [
              "Analizar la destrucción de la infraestructura productiva: minas inundadas, haciendas abandonadas.",
              "Explicar la disminución drástica de la producción de plata y agricultura.",
              "Describir la descapitalización y el endeudamiento del nuevo país."
            ]
          },
          {
            "key": "continuidades_sociales",
            "name": "Continuidades en la Estructura Social",
            "short_description": "Evaluar qué cambió y qué permaneció en la sociedad.",
            "example_tasks": [
              "Analizar cómo las élites criollas reemplazaron a peninsulares pero mantuvieron privilegios.",
              "Explicar la situación de indígenas y castas: pocos cambios reales en su condición.",
              "Describir la abolición formal de castas pero persistencia de discriminación racial."
            ]
          },
          {
            "key": "fragmentacion_politica",
            "name": "Fragmentación Política",
            "short_description": "Comprender los conflictos políticos que surgieron tras la independencia.",
            "example_tasks": [
              "Explicar la falta de experiencia política y la ausencia de instituciones democráticas.",
              "Analizar el surgimiento de facciones: centralistas vs federalistas, conservadores vs liberales.",
              "Describir la inestabilidad política que caracterizaría al México del siglo XIX."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "mexico_independiente_primer_imperio",
    "name": "México Independiente y Primer Imperio",
    "short_description": "Análisis de los primeros años de vida independiente, el efímero Primer Imperio de Iturbide, los conflictos políticos iniciales, y los primeros intentos de organización republicana.",
    "sub_topics": [
      {
        "key": "junta_provisional_gubernativa",
        "name": "Junta Provisional Gubernativa",
        "short_description": "Estudio del primer gobierno tras la consumación de la independencia.",
        "sub_topics": [
          {
            "key": "regencia_iturbide",
            "name": "La Regencia y el Poder de Iturbide",
            "short_description": "Comprender la concentración de poder en Iturbide antes de ser emperador.",
            "example_tasks": [
              "Describir la formación de la Junta Provisional Gubernativa y la Regencia del Imperio.",
              "Analizar cómo Iturbide controlaba tanto la Regencia como el ejército.",
              "Explicar las primeras medidas del gobierno: reconocimiento de deuda, organización administrativa."
            ]
          },
          {
            "key": "debates_forma_gobierno",
            "name": "Debates sobre la Forma de Gobierno",
            "short_description": "Estudiar las discusiones sobre monarquía versus república.",
            "example_tasks": [
              "Analizar las posiciones de borbonistas, iturbidistas y republicanos sobre la forma de gobierno.",
              "Explicar por qué ningún príncipe europeo aceptó la corona mexicana.",
              "Describir las tensiones entre el proyecto monárquico conservador y aspiraciones republicanas."
            ]
          }
        ]
      },
      {
        "key": "imperio_iturbide",
        "name": "El Imperio de Agustín I",
        "short_description": "Análisis del breve reinado de Iturbide como emperador de México (1822-1823).",
        "sub_topics": [
          {
            "key": "coronacion_iturbide",
            "name": "Coronación de Iturbide",
            "short_description": "Comprender cómo Iturbide se convirtió en emperador.",
            "example_tasks": [
              "Describir el motín del Regimiento de Celaya que proclamó a Iturbide emperador (mayo 1822).",
              "Analizar si la proclamación fue espontánea o manipulada por Iturbide.",
              "Explicar la coronación de Agustín I y Doña Ana María como emperadores (julio 1822)."
            ]
          },
          {
            "key": "gobierno_autoritario",
            "name": "Gobierno Autoritario y Oposición",
            "short_description": "Estudiar el estilo de gobierno de Iturbide y la creciente oposición.",
            "example_tasks": [
              "Analizar las medidas autoritarias de Iturbide: disolución del Congreso, persecución de opositores.",
              "Describir el encarcelamiento de diputados republicanos y periodistas críticos.",
              "Explicar el deterioro económico y la falta de fondos para sostener el aparato imperial."
            ]
          },
          {
            "key": "plan_casa_mata",
            "name": "Plan de Casa Mata y Caída del Imperio",
            "short_description": "Comprender la rebelión que derrocó a Iturbide.",
            "example_tasks": [
              "Describir el Plan de Casa Mata proclamado por Santa Anna (febrero 1823).",
              "Analizar cómo el Plan exigía reinstalar el Congreso y no reconocía a Iturbide.",
              "Explicar la rápida adhesión de guarniciones militares al Plan y el aislamiento de Iturbide."
            ]
          },
          {
            "key": "abdicacion_exilio_iturbide",
            "name": "Abdicación, Exilio y Muerte de Iturbide",
            "short_description": "Estudiar el final de Iturbide y el imperio.",
            "example_tasks": [
              "Describir la abdicación de Iturbide en marzo de 1823 y su exilio a Italia.",
              "Explicar el decreto del Congreso que declaraba a Iturbide traidor si regresaba a México.",
              "Relatar el regreso ignorante de Iturbide y su fusilamiento en Tamaulipas (julio 1824)."
            ]
          }
        ]
      },
      {
        "key": "establecimiento_republica",
        "name": "Establecimiento de la República",
        "short_description": "Análisis de la transición hacia un sistema republicano y la primera constitución.",
        "sub_topics": [
          {
            "key": "triunvirato_ejecutivo",
            "name": "Supremo Poder Ejecutivo (Triunvirato)",
            "short_description": "Comprender el gobierno provisional tras la caída de Iturbide.",
            "example_tasks": [
              "Describir la formación del Supremo Poder Ejecutivo con tres miembros: Bravo, Negrete, Victoria.",
              "Analizar la función transitoria del triunvirato mientras se elaboraba la Constitución.",
              "Explicar los retos inmediatos: orden público, economía, legitimidad internacional."
            ]
          },
          {
            "key": "constitucion_1824",
            "name": "Constitución Federal de 1824",
            "short_description": "Estudiar la primera constitución mexicana y sus características.",
            "example_tasks": [
              "Analizar la estructura de la Constitución de 1824: República Federal, División de Poderes.",
              "Describir la organización en 19 estados libres y soberanos más territorios federales.",
              "Explicar las influencias de la Constitución de EE.UU. y la de Cádiz en el documento mexicano."
            ]
          },
          {
            "key": "guadalupe_victoria_presidente",
            "name": "Guadalupe Victoria: Primer Presidente",
            "short_description": "Comprender el primer gobierno constitucional de México.",
            "example_tasks": [
              "Describir la elección de Guadalupe Victoria como primer presidente (1824-1829).",
              "Analizar los logros de su gobierno: estabilidad relativa, reconocimiento internacional, intentos de orden fiscal.",
              "Explicar las dificultades: economía débil, deuda pública, descontento en varios sectores."
            ]
          }
        ]
      },
      {
        "key": "primeras_logias_facciones",
        "name": "Logias Masónicas y Facciones Políticas",
        "short_description": "Análisis del surgimiento de los primeros grupos políticos organizados.",
        "sub_topics": [
          {
            "key": "yorkinos_escoceses",
            "name": "Yorkinos y Escoceses",
            "short_description": "Comprender las primeras divisiones políticas canalizadas por logias masónicas.",
            "example_tasks": [
              "Explicar el surgimiento del rito escocés (aristocrático, centralista, conservador) y yorkino (popular, federalista, liberal).",
              "Analizar cómo estas logias funcionaban como proto-partidos políticos.",
              "Describir la influencia extranjera: el embajador estadounidense Poinsett y los yorkinos."
            ]
          },
          {
            "key": "conflictos_facciones",
            "name": "Conflictos entre Facciones",
            "short_description": "Estudiar la violencia política entre grupos rivales.",
            "example_tasks": [
              "Describir conspiraciones y asonadas militares promovidas por las facciones.",
              "Analizar la expulsión de españoles promovida por yorkinos (1827-1829).",
              "Explicar cómo la lucha faccionaria debilitó las instituciones republicanas."
            ]
          }
        ]
      },
      {
        "key": "inestabilidad_1828_1832",
        "name": "Inestabilidad y Primeros Golpes de Estado",
        "short_description": "Análisis de los conflictos políticos y militares que caracterizaron los primeros años.",
        "sub_topics": [
          {
            "key": "rebelion_acordada",
            "name": "Motín de la Acordada (1828)",
            "short_description": "Estudiar el primer golpe de Estado en México independiente.",
            "example_tasks": [
              "Describir las elecciones de 1828 y la controversia sobre la victoria de Gómez Pedraza.",
              "Explicar el motín encabezado por Santa Anna y Lorenzo de Zavala contra los resultados.",
              "Analizar cómo Vicente Guerrero llegó a la presidencia mediante un golpe de Estado."
            ]
          },
          {
            "key": "gobierno_guerrero",
            "name": "Gobierno de Vicente Guerrero",
            "short_description": "Comprender el breve gobierno del héroe insurgente.",
            "example_tasks": [
              "Describir las dificultades de Guerrero: falta de experiencia administrativa, oposición conservadora.",
              "Analizar el decreto de abolición definitiva de la esclavitud (septiembre 1829).",
              "Explicar la exitosa defensa contra el intento español de reconquista comandado por Barradas."
            ]
          },
          {
            "key": "plan_jalapa_bustamante",
            "name": "Plan de Jalapa y Gobierno de Bustamante",
            "short_description": "Estudiar el derrocamiento de Guerrero y el gobierno conservador.",
            "example_tasks": [
              "Describir la rebelión de Bustamante contra Guerrero mediante el Plan de Jalapa (1829).",
              "Analizar el carácter centralista y conservador del gobierno de Bustamante (1830-1832).",
              "Explicar la captura, juicio sumario y fusilamiento de Vicente Guerrero (1831)."
            ]
          },
          {
            "key": "retorno_santa_anna",
            "name": "Retorno de Santa Anna al Poder",
            "short_description": "Comprender el inicio del dominio político de Santa Anna.",
            "example_tasks": [
              "Describir la rebelión de Santa Anna contra Bustamante que restauró el federalismo.",
              "Analizar cómo Santa Anna se convirtió en la figura política dominante de la época.",
              "Explicar el patrón que se repetiría: Santa Anna como 'salvador' periódico de la nación."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "republica_federal_centralismo",
    "name": "República Federal y Centralismo",
    "short_description": "Estudio de la lucha entre federalistas y centralistas, la secesión de Texas, las intervenciones extranjeras, la guerra con Estados Unidos y la pérdida de más de la mitad del territorio nacional.",
    "sub_topics": [
      {
        "key": "conflicto_federalismo_centralismo",
        "name": "Conflicto entre Federalismo y Centralismo",
        "short_description": "Análisis de las dos visiones opuestas sobre la organización del Estado mexicano.",
        "sub_topics": [
          {
            "key": "proyecto_federalista",
            "name": "Proyecto Federalista",
            "short_description": "Comprender las características e ideales del federalismo mexicano.",
            "example_tasks": [
              "Explicar los principios federalistas: autonomía de los estados, democracia, división de poderes.",
              "Analizar quiénes apoyaban el federalismo: liberales, clases medias, provincias.",
              "Describir la Constitución de 1824 como expresión del proyecto federalista."
            ]
          },
          {
            "key": "proyecto_centralista",
            "name": "Proyecto Centralista",
            "short_description": "Comprender las características del centralismo conservador.",
            "example_tasks": [
              "Explicar los principios centralistas: poder concentrado, orden, autoridad fuerte.",
              "Analizar quiénes apoyaban el centralismo: conservadores, Iglesia, ejército, élite económica.",
              "Describir las Siete Leyes de 1836 como expresión del proyecto centralista."
            ]
          }
        ]
      },
      {
        "key": "siete_leyes_republica_central",
        "name": "Las Siete Leyes y la República Central",
        "short_description": "Estudio del establecimiento del régimen centralista en 1836.",
        "sub_topics": [
          {
            "key": "contenido_siete_leyes",
            "name": "Contenido de las Siete Leyes",
            "short_description": "Analizar la nueva estructura constitucional centralista.",
            "example_tasks": [
              "Describir cómo las Siete Leyes convertían a los estados en departamentos sin autonomía.",
              "Explicar la creación del Supremo Poder Conservador como cuarto poder arbitral.",
              "Analizar las restricciones al sufragio basadas en requisitos de riqueza."
            ]
          },
          {
            "key": "oposicion_centralismo",
            "name": "Oposición al Centralismo",
            "short_description": "Comprender las reacciones contra el régimen centralista.",
            "example_tasks": [
              "Describir las rebeliones federalistas en varios estados contra el centralismo.",
              "Analizar casos como la República del Río Grande y la República de Yucatán.",
              "Explicar cómo el centralismo debilitó la unidad nacional y propició separatismos."
            ]
          }
        ]
      },
      {
        "key": "independencia_texas",
        "name": "Independencia de Texas",
        "short_description": "Análisis detallado del proceso de separación de Texas y sus causas.",
        "sub_topics": [
          {
            "key": "colonizacion_texas",
            "name": "Colonización Anglosajona de Texas",
            "short_description": "Comprender cómo se pobló Texas con colonos estadounidenses.",
            "example_tasks": [
              "Explicar las políticas de colonización mexicanas que permitieron asentamientos anglosajones.",
              "Describir la llegada de colonos estadounidenses bajo empresarios como Stephen Austin.",
              "Analizar las diferencias culturales, lingüísticas y de intereses entre colonos y gobierno mexicano."
            ]
          },
          {
            "key": "causas_rebelion_texas",
            "name": "Causas de la Rebelión Texana",
            "short_description": "Identificar los factores que motivaron la separación de Texas.",
            "example_tasks": [
              "Explicar las restricciones mexicanas: prohibición de más inmigración, abolición de esclavitud, impuestos.",
              "Analizar el cambio de Texas de estado federal autónomo a departamento centralista.",
              "Describir el deseo de los colonos anglosajones de unirse a Estados Unidos."
            ]
          },
          {
            "key": "guerra_texas",
            "name": "Guerra de Texas (1835-1836)",
            "short_description": "Estudiar el conflicto armado entre Texas y México.",
            "example_tasks": [
              "Describir batallas como El Álamo (derrota texana pero mártires simbólicos) y San Jacinto (derrota mexicana).",
              "Analizar la campaña de Santa Anna para sofocar la rebelión y su captura en San Jacinto.",
              "Explicar los Tratados de Velasco firmados por Santa Anna bajo presión (mayo 1836)."
            ]
          },
          {
            "key": "consecuencias_perdida_texas",
            "name": "Consecuencias de la Pérdida de Texas",
            "short_description": "Evaluar el impacto de la independencia texana.",
            "example_tasks": [
              "Analizar la pérdida territorial y el golpe al orgullo nacional mexicano.",
              "Explicar por qué México no reconoció la independencia de Texas hasta 1845.",
              "Describir cómo la cuestión de Texas sería causa de la guerra con Estados Unidos."
            ]
          }
        ]
      },
      {
        "key": "primera_intervencion_francesa",
        "name": "Primera Intervención Francesa (Guerra de los Pasteles)",
        "short_description": "Estudio del conflicto con Francia y sus causas económicas.",
        "sub_topics": [
          {
            "key": "causas_guerra_pasteles",
            "name": "Causas del Conflicto",
            "short_description": "Comprender las reclamaciones francesas que motivaron la intervención.",
            "example_tasks": [
              "Explicar las reclamaciones de ciudadanos franceses por daños en sus propiedades durante conflictos internos.",
              "Describir el caso del pastelero Remontel que reclamaba 60,000 pesos (origen del nombre 'Guerra de los Pasteles').",
              "Analizar la desproporción entre las reclamaciones (600,000 pesos) y la respuesta militar francesa."
            ]
          },
          {
            "key": "bloqueo_bombardeo_veracruz",
            "name": "Bloqueo y Bombardeo de Veracruz",
            "short_description": "Estudiar las acciones militares francesas.",
            "example_tasks": [
              "Describir el bloqueo naval francés de los puertos mexicanos (1838).",
              "Analizar el bombardeo y toma de San Juan de Ulúa en Veracruz.",
              "Explicar la resistencia mexicana limitada por debilidad naval."
            ]
          },
          {
            "key": "resolucion_guerra_pasteles",
            "name": "Resolución del Conflicto",
            "short_description": "Comprender cómo terminó la guerra.",
            "example_tasks": [
              "Describir la intervención británica para mediar el conflicto.",
              "Analizar el acuerdo mexicano de pagar 600,000 pesos a Francia.",
              "Explicar el episodio de Santa Anna perdiendo una pierna en combate y su uso propagandístico posterior."
            ]
          }
        ]
      },
      {
        "key": "guerra_mexico_estados_unidos",
        "name": "Guerra México-Estados Unidos (1846-1848)",
        "short_description": "Análisis comprehensivo del conflicto que resultó en la mayor pérdida territorial de México.",
        "sub_topics": [
          {
            "key": "causas_guerra_eeuu",
            "name": "Causas de la Guerra",
            "short_description": "Identificar los factores que condujeron al conflicto.",
            "example_tasks": [
              "Explicar el concepto del 'Destino Manifiesto' estadounidense como justificación ideológica de expansión.",
              "Analizar la anexión de Texas por Estados Unidos (1845) como detonante inmediato.",
              "Describir la disputa fronteriza: México reclamaba el río Nueces, EE.UU. el río Bravo como límite."
            ]
          },
          {
            "key": "desarrollo_conflicto_norte",
            "name": "Campañas en el Norte",
            "short_description": "Estudiar las operaciones militares en la frontera norte.",
            "example_tasks": [
              "Describir la campaña del general Zachary Taylor que tomó Monterrey y avanzó hacia Saltillo.",
              "Analizar la Batalla de La Angostura (Buena Vista) donde Santa Anna casi derrota a Taylor.",
              "Explicar la toma de Nuevo México y California por fuerzas estadounidenses."
            ]
          },
          {
            "key": "invasion_centro_mexico",
            "name": "Invasión al Centro de México",
            "short_description": "Estudiar la campaña que llevó a la ocupación de la capital.",
            "example_tasks": [
              "Describir el desembarco del general Winfield Scott en Veracruz (marzo 1847).",
              "Analizar batallas como Cerro Gordo, Contreras, Churubusco en el avance hacia la Ciudad de México.",
              "Explicar la superioridad militar estadounidense en armamento, disciplina y logística."
            ]
          },
          {
            "key": "defensa_ciudad_mexico",
            "name": "Defensa de la Ciudad de México",
            "short_description": "Comprender los últimos combates antes de la ocupación.",
            "example_tasks": [
              "Describir la batalla de Molino del Rey y la pérdida de este punto estratégico.",
              "Analizar la defensa del Castillo de Chapultepec y el mito de los Niños Héroes.",
              "Explicar la entrada de tropas estadounidenses a la Ciudad de México (septiembre 1847)."
            ]
          },
          {
            "key": "tratados_guadalupe_hidalgo",
            "name": "Tratados de Guadalupe Hidalgo",
            "short_description": "Estudiar el tratado de paz y sus devastadoras consecuencias.",
            "example_tasks": [
              "Analizar los términos del tratado firmado en febrero de 1848.",
              "Describir la pérdida territorial: más de la mitad del territorio nacional (Texas, California, Nuevo México, Arizona, Nevada, Utah, parte de Colorado, Wyoming, Kansas, Oklahoma).",
              "Explicar la compensación estadounidense de 15 millones de pesos y la cancelación de reclamaciones."
            ]
          },
          {
            "key": "consecuencias_guerra",
            "name": "Consecuencias de la Guerra",
            "short_description": "Evaluar el impacto del conflicto en México.",
            "example_tasks": [
              "Analizar la crisis nacional: trauma psicológico, humillación, cuestionamiento de viabilidad del país.",
              "Explicar cómo la derrota intensificó el debate entre liberales y conservadores sobre el futuro de México.",
              "Describir el surgimiento de un movimiento liberal reformista que culpaba a las instituciones coloniales de la debilidad nacional."
            ]
          }
        ]
      },
      {
        "key": "venta_mesilla",
        "name": "Venta de La Mesilla",
        "short_description": "Análisis de la última pérdida territorial ante Estados Unidos.",
        "sub_topics": [
          {
            "key": "tratado_gadsden",
            "name": "Tratado de La Mesilla (Gadsden Purchase)",
            "short_description": "Comprender las circunstancias de esta venta territorial.",
            "example_tasks": [
              "Explicar por qué Santa Anna vendió territorio adicional (sur de Arizona y Nuevo México) en 1853.",
              "Analizar las necesidades financieras del gobierno santannista como motivación.",
              "Describir el monto pagado (10 millones de pesos) y el uso que se dio a esos fondos."
            ]
          },
          {
            "key": "repudio_venta_mesilla",
            "name": "Rechazo Nacional a la Venta",
            "short_description": "Comprender la reacción mexicana ante esta transacción.",
            "example_tasks": [
              "Analizar la indignación nacional ante una nueva pérdida territorial.",
              "Explicar cómo este acto contribuyó al desprestigio final de Santa Anna.",
              "Describir la venta como catalizador del movimiento liberal que lo derrocaría."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "reforma_liberal",
    "name": "La Reforma Liberal",
    "short_description": "Estudio del movimiento liberal reformista, las Leyes de Reforma que transformaron la estructura jurídica y social de México, la Guerra de Reforma entre liberales y conservadores, y la consolidación del Estado laico.",
    "sub_topics": [
      {
        "key": "revolucion_ayutla",
        "name": "Revolución de Ayutla",
        "short_description": "Análisis del movimiento que derrocó a Santa Anna y abrió paso a la Reforma.",
        "sub_topics": [
          {
            "key": "plan_ayutla",
            "name": "Plan de Ayutla (1854)",
            "short_description": "Comprender el pronunciamiento que inició la revolución liberal.",
            "example_tasks": [
              "Describir el Plan proclamado por Florencio Villarreal, Juan Álvarez e Ignacio Comonfort.",
              "Analizar las demandas del Plan: desconocimiento de Santa Anna, convocatoria a congreso para nueva constitución.",
              "Explicar cómo diversos grupos se unieron contra la dictadura santannista."
            ]
          },
          {
            "key": "triunfo_liberales",
            "name": "Triunfo del Movimiento Liberal",
            "short_description": "Estudiar la victoria sobre Santa Anna y sus consecuencias.",
            "example_tasks": [
              "Describir la expansión del movimiento y el aislamiento de Santa Anna.",
              "Analizar la salida definitiva de Santa Anna al exilio (agosto 1855).",
              "Explicar la llegada al poder de liberales moderados (Comonfort) y puros (Juárez, Ocampo)."
            ]
          }
        ]
      },
      {
        "key": "leyes_reforma",
        "name": "Leyes de Reforma",
        "short_description": "Análisis de las leyes que transformaron la estructura social, económica y religiosa de México.",
        "sub_topics": [
          {
            "key": "ley_juarez",
            "name": "Ley Juárez (1855)",
            "short_description": "Estudiar la primera ley reformista sobre fueros especiales.",
            "example_tasks": [
              "Explicar la supresión de los tribunales especiales eclesiásticos y militares para casos civiles.",
              "Analizar el objetivo: igualdad ante la ley, eliminación de privilegios corporativos.",
              "Describir la reacción del clero y el ejército ante esta medida."
            ]
          },
          {
            "key": "ley_lerdo",
            "name": "Ley Lerdo (1856)",
            "short_description": "Comprender la desamortización de bienes corporativos.",
            "example_tasks": [
              "Explicar la prohibición de que corporaciones (Iglesia y comunidades indígenas) poseyeran bienes raíces.",
              "Analizar el objetivo económico: poner tierras en circulación, crear clase de pequeños propietarios.",
              "Describir las consecuencias no intencionadas: concentración de tierras, despojo de comunidades indígenas."
            ]
          },
          {
            "key": "ley_iglesias",
            "name": "Ley Iglesias (1857)",
            "short_description": "Estudiar la regulación de servicios religiosos.",
            "example_tasks": [
              "Explicar la prohibición del cobro de derechos parroquiales (bautizos, casamientos, entierros) a pobres.",
              "Analizar cómo esta ley limitaba ingresos eclesiásticos y favorecía a clases populares.",
              "Describir la oposición del clero a esta intervención estatal."
            ]
          },
          {
            "key": "leyes_reforma_1859_1860",
            "name": "Leyes de Reforma de 1859-1860",
            "short_description": "Comprender las leyes más radicales promulgadas durante la guerra.",
            "example_tasks": [
              "Analizar la Ley de Nacionalización de Bienes Eclesiásticos (julio 1859): confiscación sin indemnización.",
              "Explicar la Ley de Matrimonio Civil y la Ley del Registro Civil: secularización de estos actos.",
              "Describir la Ley de Libertad de Cultos y la separación definitiva Iglesia-Estado."
            ]
          }
        ]
      },
      {
        "key": "constitucion_1857",
        "name": "Constitución de 1857",
        "short_description": "Estudio de la carta magna liberal y sus principios fundamentales.",
        "sub_topics": [
          {
            "key": "caracteristicas_constitucion_1857",
            "name": "Características y Contenido",
            "short_description": "Analizar los principios y estructura de la Constitución liberal.",
            "example_tasks": [
              "Describir el sistema federal republicano y la división de poderes establecida.",
              "Analizar la declaración de derechos individuales: libertad de expresión, asociación, enseñanza.",
              "Explicar elementos controversiales: libertad de cultos (implícita), eliminación de fueros."
            ]
          },
          {
            "key": "debates_constituyentes",
            "name": "Debates en el Congreso Constituyente",
            "short_description": "Comprender las posiciones enfrentadas durante la elaboración constitucional.",
            "example_tasks": [
              "Analizar el debate entre liberales moderados (Comonfort) y liberales puros (Arriaga, Zarco).",
              "Explicar las controversias sobre tolerancia religiosa, libertad de prensa, fueros.",
              "Describir la ausencia de representación conservadora en el Congreso."
            ]
          },
          {
            "key": "oposicion_iglesia_conservadores",
            "name": "Oposición de la Iglesia y Conservadores",
            "short_description": "Estudiar el rechazo a la Constitución por sectores conservadores.",
            "example_tasks": [
              "Describir la excomunión papal a quienes juraran la Constitución.",
              "Analizar el dilema de conciencia de católicos entre obedecer a la Iglesia o al Estado.",
              "Explicar cómo esta polarización condujo a la Guerra de Reforma."
            ]
          }
        ]
      },
      {
        "key": "guerra_reforma",
        "name": "Guerra de Reforma (1858-1861)",
        "short_description": "Análisis del conflicto armado entre liberales y conservadores por el control del país.",
        "sub_topics": [
          {
            "key": "golpe_tacubaya",
            "name": "Golpe de Tacubaya y Inicio de la Guerra",
            "short_description": "Comprender cómo comenzó el conflicto civil.",
            "example_tasks": [
              "Describir el Plan de Tacubaya de Comonfort que desconocía la Constitución de 1857.",
              "Analizar las razones de Comonfort: intentar un compromiso entre liberales y conservadores.",
              "Explicar cómo conservadores traicionaron a Comonfort y establecieron su propio gobierno con Zuloaga."
            ]
          },
          {
            "key": "dos_gobiernos",
            "name": "Dos Gobiernos Rivales",
            "short_description": "Estudiar la división de México en dos administraciones.",
            "example_tasks": [
              "Describir el gobierno conservador en Ciudad de México con Zuloaga y luego Miramón.",
              "Explicar el gobierno liberal itinerante encabezado por Benito Juárez (Guanajuato, Guadalajara, Veracruz).",
              "Analizar el apoyo social: liberales (clases medias urbanas, algunos estados del norte), conservadores (Iglesia, ejército, élites tradicionales, centro del país)."
            ]
          },
          {
            "key": "desarrollo_guerra_tres_años",
            "name": "Desarrollo del Conflicto",
            "short_description": "Comprender las principales campañas militares de la guerra.",
            "example_tasks": [
              "Describir batallas importantes y el control territorial cambiante.",
              "Analizar las ventajas iniciales conservadoras: mejor organización militar, recursos de la Iglesia.",
              "Explicar el fortalecimiento liberal con las Leyes de Reforma que les dieron recursos económicos."
            ]
          },
          {
            "key": "triunfo_liberal_1861",
            "name": "Triunfo Liberal (1861)",
            "short_description": "Estudiar la victoria liberal y sus implicaciones.",
            "example_tasks": [
              "Describir la batalla decisiva de Calpulalpan (diciembre 1860) y la derrota conservadora.",
              "Analizar la entrada triunfal de Juárez a la Ciudad de México (enero 1861).",
              "Explicar el establecimiento definitivo del régimen liberal y constitucional."
            ]
          }
        ]
      },
      {
        "key": "figuras_reforma",
        "name": "Figuras Principales de la Reforma",
        "short_description": "Estudio de los líderes liberales y conservadores del periodo.",
        "sub_topics": [
          {
            "key": "benito_juarez",
            "name": "Benito Juárez: Líder de la Reforma",
            "short_description": "Comprender el papel y el pensamiento de Juárez.",
            "example_tasks": [
              "Analizar la biografía de Juárez: origen indígena, formación liberal, carrera política.",
              "Explicar sus principios: legalidad constitucional, Estado laico, República sobre imperio.",
              "Describir su papel como símbolo de resistencia liberal durante la Reforma y la Intervención."
            ]
          },
          {
            "key": "melchor_ocampo",
            "name": "Melchor Ocampo: Ideólogo Liberal",
            "short_description": "Estudiar las contribuciones intelectuales de Ocampo.",
            "example_tasks": [
              "Describir su pensamiento liberal avanzado en temas sociales, educativos y religiosos.",
              "Analizar su papel en la redacción de las Leyes de Reforma.",
              "Explicar su captura y fusilamiento por fuerzas conservadoras (1861)."
            ]
          },
          {
            "key": "santos_degollado",
            "name": "Santos Degollado: Militar Liberal",
            "short_description": "Comprender el papel militar de este líder.",
            "example_tasks": [
              "Describir su liderazgo militar a pesar de derrotas frecuentes.",
              "Analizar su perseverancia y lealtad a la causa liberal.",
              "Explicar su muerte en combate y su legado como mártir liberal."
            ]
          },
          {
            "key": "felix_zuloaga_miramon",
            "name": "Félix Zuloaga y Miguel Miramón: Líderes Conservadores",
            "short_description": "Estudiar a los principales jefes del bando conservador.",
            "example_tasks": [
              "Describir a Zuloaga como iniciador del gobierno conservador.",
              "Analizar a Miramón como brillante militar joven, el 'Macabeo' conservador.",
              "Explicar sus motivaciones: preservar el orden tradicional, defender la religión católica."
            ]
          }
        ]
      },
      {
        "key": "consolidacion_estado_laico",
        "name": "Consolidación del Estado Laico",
        "short_description": "Análisis de las consecuencias de largo plazo de la Reforma.",
        "sub_topics": [
          {
            "key": "separacion_iglesia_estado",
            "name": "Separación Iglesia-Estado",
            "short_description": "Comprender la transformación fundamental en la relación religión-política.",
            "example_tasks": [
              "Analizar cómo las Leyes de Reforma establecieron la supremacía del Estado sobre la Iglesia.",
              "Explicar la secularización de funciones antes eclesiásticas: educación, registro civil, cementerios.",
              "Describir la resistencia católica y la negociación implícita en las décadas siguientes."
            ]
          },
          {
            "key": "transformacion_propiedad",
            "name": "Transformación de la Propiedad",
            "short_description": "Evaluar los efectos de la desamortización.",
            "example_tasks": [
              "Analizar cómo la nacionalización de bienes eclesiásticos cambió la estructura de propiedad.",
              "Explicar los efectos negativos: concentración de tierras, afectación de comunidades indígenas.",
              "Describir la formación de una nueva élite económica liberal."
            ]
          },
          {
            "key": "herencia_reforma",
            "name": "Herencia de la Reforma",
            "short_description": "Comprender el legado ideológico y político de este periodo.",
            "example_tasks": [
              "Analizar la Reforma como momento fundacional del México moderno.",
              "Explicar cómo los principios reformistas se mantuvieron en constituciones posteriores.",
              "Describir la Reforma como fuente de identidad liberal-nacionalista mexicana."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "segundo_imperio_republica_restaurada",
    "name": "Segundo Imperio y República Restaurada",
    "short_description": "Estudio de la intervención francesa, el establecimiento del Imperio de Maximiliano, la resistencia republicana, la restauración de la República bajo Juárez y Lerdo, y los intentos de consolidación nacional tras décadas de inestabilidad.",
    "sub_topics": [
      {
        "key": "intervencion_tripartita",
        "name": "Intervención Tripartita",
        "short_description": "Análisis de la intervención extranjera que precedió al Segundo Imperio.",
        "sub_topics": [
          {
            "key": "suspension_deuda_externa",
            "name": "Suspensión de Pagos de Deuda Externa",
            "short_description": "Comprender la crisis financiera que motivó la intervención.",
            "example_tasks": [
              "Explicar la situación económica crítica de México tras la Guerra de Reforma.",
              "Describir el decreto de Juárez de suspender pagos de deuda externa por dos años (julio 1861).",
              "Analizar las reacciones de Francia, España e Inglaterra ante la moratoria."
            ]
          },
          {
            "key": "convenio_londres",
            "name": "Convenio de Londres",
            "short_description": "Estudiar el acuerdo entre potencias para intervenir en México.",
            "example_tasks": [
              "Describir el Convenio de Londres (octubre 1861) entre Francia, España e Inglaterra.",
              "Explicar el objetivo declarado: cobrar las deudas mexicanas.",
              "Analizar las verdaderas intenciones francesas: establecer una monarquía en México."
            ]
          },
          {
            "key": "llegada_fuerzas_europeas",
            "name": "Llegada de Fuerzas Europeas",
            "short_description": "Comprender la ocupación inicial de Veracruz.",
            "example_tasks": [
              "Describir el desembarco de tropas españolas, francesas e inglesas en Veracruz (diciembre 1861-enero 1862).",
              "Analizar las negociaciones de La Soledad entre México y las potencias.",
              "Explicar el retiro de España e Inglaterra al comprender las ambiciones francesas de conquista."
            ]
          }
        ]
      },
      {
        "key": "intervencion_francesa",
        "name": "Intervención Francesa",
        "short_description": "Análisis del conflicto armado entre México y Francia.",
        "sub_topics": [
          {
            "key": "batalla_cinco_mayo",
            "name": "Batalla del 5 de Mayo de 1862",
            "short_description": "Estudiar la victoria mexicana en Puebla.",
            "example_tasks": [
              "Describir la defensa de Puebla por el general Ignacio Zaragoza contra el ejército francés.",
              "Analizar la importancia simbólica de la victoria contra el 'mejor ejército del mundo'.",
              "Explicar el impacto psicológico: demostración de que México podía resistir."
            ]
          },
          {
            "key": "sitio_caida_puebla",
            "name": "Sitio y Caída de Puebla",
            "short_description": "Comprender la eventual conquista francesa.",
            "example_tasks": [
              "Describir el segundo sitio de Puebla con fuerzas francesas reforzadas (marzo-mayo 1863).",
              "Analizar la resistencia heroica de González Ortega antes de la capitulación.",
              "Explicar la apertura del camino a la Ciudad de México tras la caída de Puebla."
            ]
          },
          {
            "key": "avance_frances_ocupacion",
            "name": "Avance Francés y Ocupación",
            "short_description": "Estudiar la conquista del centro de México por Francia.",
            "example_tasks": [
              "Describir la entrada de tropas francesas a la Ciudad de México (junio 1863).",
              "Explicar la retirada del gobierno de Juárez hacia el norte (San Luis Potosí, Chihuahua).",
              "Analizar las zonas de control: franceses en el centro, republicanos en regiones periféricas."
            ]
          }
        ]
      },
      {
        "key": "establecimiento_imperio",
        "name": "Establecimiento del Segundo Imperio",
        "short_description": "Análisis de la imposición de la monarquía y el gobierno de Maximiliano.",
        "sub_topics": [
          {
            "key": "junta_notables_ofrecimiento",
            "name": "Junta de Notables y Ofrecimiento de la Corona",
            "short_description": "Comprender cómo se legitimó formalmente el imperio.",
            "example_tasks": [
              "Describir la Asamblea de Notables convocada por franceses y conservadores mexicanos.",
              "Analizar el 'plebiscito' manipulado que supuestamente pidió una monarquía.",
              "Explicar el ofrecimiento de la corona al archiduque Maximiliano de Habsburgo."
            ]
          },
          {
            "key": "maximiliano_carlota",
            "name": "Maximiliano y Carlota",
            "short_description": "Estudiar a los nuevos emperadores de México.",
            "example_tasks": [
              "Describir la biografía de Maximiliano: príncipe austriaco, hermano del emperador.",
              "Analizar las motivaciones de Maximiliano: idealismo liberal, ambición de gobernar.",
              "Explicar el papel de Carlota como emperatriz y su apoyo al proyecto."
            ]
          },
          {
            "key": "llegada_gobierno_maximiliano",
            "name": "Llegada y Gobierno de Maximiliano",
            "short_description": "Comprender las políticas del emperador.",
            "example_tasks": [
              "Describir la llegada de Maximiliano y Carlota a México (mayo 1864) y su recepción.",
              "Analizar el programa de gobierno: sorprendentemente liberal, decepcionando a conservadores.",
              "Explicar medidas como: respeto a algunas Leyes de Reforma, proyectos sociales, protección indígena."
            ]
          },
          {
            "key": "desilusión_conservadores",
            "name": "Desilusión de los Conservadores",
            "short_description": "Comprender las tensiones entre Maximiliano y quienes lo apoyaron.",
            "example_tasks": [
              "Analizar cómo las políticas liberales de Maximiliano alienaron a conservadores mexicanos.",
              "Explicar la negativa de Maximiliano a derogar completamente las Leyes de Reforma.",
              "Describir la pérdida de apoyo de la Iglesia y sectores conservadores."
            ]
          }
        ]
      },
      {
        "key": "resistencia_republicana",
        "name": "Resistencia Republicana",
        "short_description": "Análisis de la lucha del gobierno de Juárez contra el imperio.",
        "sub_topics": [
          {
            "key": "gobierno_itinerante_juarez",
            "name": "Gobierno Itinerante de Juárez",
            "short_description": "Comprender la resistencia en condiciones adversas.",
            "example_tasks": [
              "Describir el peregrinaje del gobierno republicano: Saltillo, Monterrey, Chihuahua, Paso del Norte.",
              "Analizar la determinación de Juárez de mantener la legalidad constitucional.",
              "Explicar las dificultades: falta de recursos, amenazas militares, aislamiento."
            ]
          },
          {
            "key": "guerra_guerrillas_republicana",
            "name": "Guerra de Guerrillas",
            "short_description": "Estudiar las tácticas de resistencia republicana.",
            "example_tasks": [
              "Describir las guerrillas republicanas en diversos estados contra fuerzas imperiales.",
              "Analizar líderes guerrilleros como Porfirio Díaz en Oaxaca, Corona en Jalisco, Escobedo en el norte.",
              "Explicar cómo el apoyo popular sostuvo la resistencia."
            ]
          },
          {
            "key": "apoyo_eeuu_republicanos",
            "name": "Apoyo de Estados Unidos",
            "short_description": "Comprender el rol estadounidense en el conflicto.",
            "example_tasks": [
              "Explicar cómo la Guerra Civil estadounidense impidió inicialmente su intervención.",
              "Analizar el apoyo estadounidense tras 1865: presión diplomática, suministro de armas a republicanos.",
              "Describir la invocación de la Doctrina Monroe contra la presencia europea."
            ]
          }
        ]
      },
      {
        "key": "caida_imperio",
        "name": "Caída del Imperio",
        "short_description": "Análisis del colapso del Segundo Imperio y la ejecución de Maximiliano.",
        "sub_topics": [
          {
            "key": "retiro_tropas_francesas",
            "name": "Retiro de Tropas Francesas",
            "short_description": "Comprender las razones del abandono francés.",
            "example_tasks": [
              "Explicar las presiones sobre Napoleón III: guerra con Prusia, oposición interna, presión estadounidense.",
              "Describir el retiro gradual de tropas francesas (1866-1867).",
              "Analizar cómo este retiro dejó al imperio sin su principal apoyo militar."
            ]
          },
          {
            "key": "mision_carlota_europa",
            "name": "Misión de Carlota en Europa",
            "short_description": "Estudiar el intento desesperado de obtener ayuda.",
            "example_tasks": [
              "Describir el viaje de Carlota a Europa para pedir apoyo a Napoleón III y el Papa (1866).",
              "Analizar el fracaso de su misión y el deterioro de su salud mental.",
              "Explicar la permanencia de Carlota en Europa, ya sin retorno posible a México."
            ]
          },
          {
            "key": "sitio_queretaro",
            "name": "Sitio de Querétaro",
            "short_description": "Comprender el cerco final a Maximiliano.",
            "example_tasks": [
              "Describir el sitio de Querétaro por fuerzas republicanas de Escobedo y Corona (marzo-mayo 1867).",
              "Analizar la decisión de Maximiliano de quedarse y luchar en lugar de huir.",
              "Explicar la traición del coronel López que facilitó la captura del emperador."
            ]
          },
          {
            "key": "juicio_fusilamiento_maximiliano",
            "name": "Juicio y Fusilamiento de Maximiliano",
            "short_description": "Estudiar el fin del emperador y del imperio.",
            "example_tasks": [
              "Describir el juicio de Maximiliano, Miramón y Mejía por un tribunal militar.",
              "Analizar las peticiones internacionales de clemencia y la negativa de Juárez.",
              "Explicar el fusilamiento en el Cerro de las Campanas (19 de junio de 1867) y su significado: triunfo republicano definitivo."
            ]
          }
        ]
      },
      {
        "key": "republica_restaurada",
        "name": "La República Restaurada (1867-1876)",
        "short_description": "Análisis del periodo de reconstrucción nacional bajo Juárez y Lerdo.",
        "sub_topics": [
          {
            "key": "retorno_juarez",
            "name": "Retorno Triunfal de Juárez",
            "short_description": "Comprender la restauración del orden constitucional.",
            "example_tasks": [
              "Describir la entrada triunfal de Juárez a la Ciudad de México (julio 1867).",
              "Analizar el prestigio de Juárez como salvador de la República y símbolo de resistencia.",
              "Explicar la restauración de la legalidad constitucional y las instituciones republicanas."
            ]
          },
          {
            "key": "reconstruccion_nacional",
            "name": "Esfuerzos de Reconstrucción",
            "short_description": "Estudiar los intentos de modernización del país.",
            "example_tasks": [
              "Describir los esfuerzos de Juárez por reconstruir la economía devastada.",
              "Analizar proyectos de infraestructura: ferrocarriles, telégrafos, caminos.",
              "Explicar la reforma educativa de Gabino Barreda basada en el positivismo."
            ]
          },
          {
            "key": "reelecciones_juarez",
            "name": "Reelecciones de Juárez y Oposición",
            "short_description": "Comprender las controversias sobre la perpetuación en el poder.",
            "example_tasks": [
              "Analizar las reelecciones de Juárez en 1867 y 1871 y el debate sobre el caudillismo.",
              "Describir la oposición de liberales como Porfirio Díaz que proclamaron el Plan de la Noria.",
              "Explicar el lema 'Sufragio Efectivo, No Reelección' enarbolado contra Juárez."
            ]
          },
          {
            "key": "muerte_juarez",
            "name": "Muerte de Juárez (1872)",
            "short_description": "Estudiar el fin de la era juarista.",
            "example_tasks": [
              "Describir la muerte de Juárez por causas naturales en julio de 1872.",
              "Analizar su legado: defensa de la República, Estado laico, legalidad constitucional.",
              "Explicar cómo Juárez se convirtió en símbolo nacional del liberalismo."
            ]
          },
          {
            "key": "gobierno_lerdo",
            "name": "Gobierno de Sebastián Lerdo de Tejada",
            "short_description": "Comprender la continuación del proyecto liberal.",
            "example_tasks": [
              "Describir el gobierno de Lerdo (1872-1876) como presidente constitucional.",
              "Analizar sus políticas: continuidad con Juárez, modernización, ferrocarriles.",
              "Explicar la incorporación de las Leyes de Reforma a la Constitución como legado de Lerdo."
            ]
          },
          {
            "key": "plan_tuxtepec",
            "name": "Plan de Tuxtepec y Fin de la República Restaurada",
            "short_description": "Estudiar la rebelión que dio paso al Porfiriato.",
            "example_tasks": [
              "Describir el Plan de Tuxtepec proclamado por Porfirio Díaz contra la reelección de Lerdo (1876).",
              "Analizar la ironía: Díaz usando la no-reelección como bandera para llegar al poder.",
              "Explicar el triunfo de Díaz y el fin del periodo de la República Restaurada."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "porfiriato",
    "name": "El Porfiriato",
    "short_description": "Estudio del largo periodo de gobierno de Porfirio Díaz (1876-1911), caracterizado por estabilidad política, modernización económica, inversión extranjera, y represión social, que generó las contradicciones que desembocaron en la Revolución Mexicana.",
    "sub_topics": [
      {
        "key": "consolidacion_poder_diaz",
        "name": "Consolidación del Poder de Díaz",
        "short_description": "Análisis de cómo Díaz logró controlar el país y perpetuarse en el poder.",
        "sub_topics": [
          {
            "key": "primera_presidencia",
            "name": "Primera Presidencia (1876-1880)",
            "short_description": "Comprender el inicio del gobierno de Díaz.",
            "example_tasks": [
              "Describir cómo Díaz llegó al poder mediante el Plan de Tuxtepec bajo la bandera de no-reelección.",
              "Analizar las primeras medidas: pacificación, negociaciones con grupos opositores.",
              "Explicar la aparente adherencia al principio de no-reelección al entregar el poder a Manuel González."
            ]
          },
          {
            "key": "presidencia_manuel_gonzalez",
            "name": "Interregno: Manuel González (1880-1884)",
            "short_description": "Estudiar el periodo que separó las presidencias de Díaz.",
            "example_tasks": [
              "Describir el gobierno de Manuel González como subordinado a Díaz.",
              "Analizar medidas importantes: concesiones ferrocarrileras, renegociación de deuda.",
              "Explicar la corrupción y desprestigio de González que facilitó el retorno de Díaz."
            ]
          },
          {
            "key": "retorno_perpetuacion",
            "name": "Retorno y Perpetuación en el Poder",
            "short_description": "Comprender cómo Díaz abandonó el principio de no-reelección.",
            "example_tasks": [
              "Describir el retorno de Díaz a la presidencia en 1884.",
              "Analizar la reforma constitucional de 1887 que permitía una reelección inmediata.",
              "Explicar la eliminación total del límite de reelecciones en 1890 y las sucesivas 'reelecciones' hasta 1911."
            ]
          },
          {
            "key": "metodos_control_politico",
            "name": "Métodos de Control Político",
            "short_description": "Estudiar las estrategias de Díaz para mantener el poder.",
            "example_tasks": [
              "Analizar la política de 'pan o palo': cooptación de adversarios o represión de opositores.",
              "Explicar el sistema de cacicazgos: Díaz como árbitro entre caciques regionales.",
              "Describir la manipulación electoral y el control del Congreso y la prensa."
            ]
          }
        ]
      },
      {
        "key": "modernizacion_economica",
        "name": "Modernización Económica",
        "short_description": "Análisis del desarrollo económico durante el Porfiriato.",
        "sub_topics": [
          {
            "key": "ferrocarriles",
            "name": "Expansión Ferrocarrilera",
            "short_description": "Comprender la construcción de la red ferroviaria nacional.",
            "example_tasks": [
              "Describir el crecimiento de la red ferroviaria: de 640 km en 1876 a más de 19,000 km en 1910.",
              "Analizar el impacto económico: integración de mercados, exportación de materias primas.",
              "Explicar el predominio de capital extranjero (principalmente estadounidense) en los ferrocarriles."
            ]
          },
          {
            "key": "inversion_extranjera",
            "name": "Inversión Extranjera",
            "short_description": "Estudiar la entrada masiva de capitales externos.",
            "example_tasks": [
              "Analizar el papel de inversiones estadounidenses, británicas, francesas y alemanas.",
              "Describir sectores de inversión: minería, petróleo, textiles, ferrocarriles, bancos.",
              "Explicar las concesiones generosas otorgadas a inversionistas extranjeros."
            ]
          },
          {
            "key": "hacienda_porfiriana",
            "name": "Reorganización de la Hacienda Pública",
            "short_description": "Comprender los logros fiscales del régimen.",
            "example_tasks": [
              "Describir el saneamiento de las finanzas públicas bajo José Yves Limantour.",
              "Analizar los primeros superávits fiscales en la historia del México independiente.",
              "Explicar la reorganización del sistema tributario y bancario."
            ]
          },
          {
            "key": "auge_minero_petrolero",
            "name": "Auge Minero y Petrolero",
            "short_description": "Estudiar la explotación de recursos naturales.",
            "example_tasks": [
              "Describir el crecimiento de la producción minera: plata, oro, cobre.",
              "Analizar el inicio de la industria petrolera, especialmente en Veracruz y Tamaulipas.",
              "Explicar cómo la explotación beneficiaba principalmente a empresas extranjeras."
            ]
          },
          {
            "key": "industria_comercio",
            "name": "Desarrollo Industrial y Comercial",
            "short_description": "Comprender el crecimiento del sector secundario.",
            "example_tasks": [
              "Describir el desarrollo de la industria textil en Puebla, Veracruz y Jalisco.",
              "Analizar el surgimiento de otras industrias: tabaco, cerveza, papel, cemento.",
              "Explicar el crecimiento del comercio interno y externo."
            ]
          }
        ]
      },
      {
        "key": "estructura_social_porfiriana",
        "name": "Estructura Social Porfiriana",
        "short_description": "Análisis de la profundización de desigualdades sociales.",
        "sub_topics": [
          {
            "key": "oligarquia_cientificos",
            "name": "La Oligarquía y los Científicos",
            "short_description": "Comprender la élite que controló el país.",
            "example_tasks": [
              "Describir a los 'científicos': grupo tecnocrático positivista que asesoraba a Díaz.",
              "Analizar la concentración de riqueza y poder en pocas familias.",
              "Explicar la conexión entre élite política, económica y terrateniente."
            ]
          },
          {
            "key": "concentracion_tierra",
            "name": "Concentración de la Propiedad Agraria",
            "short_description": "Estudiar el despojo de tierras comunales y campesinas.",
            "example_tasks": [
              "Analizar la aplicación de la Ley Lerdo para privatizar tierras comunales indígenas.",
              "Describir las Compañías Deslindadoras y el despojo legalizado de tierras.",
              "Explicar cómo menos del 1% de la población controlaba más del 85% de la tierra cultivable."
            ]
          },
          {
            "key": "condiciones_campesinos",
            "name": "Condiciones de Campesinos y Peones",
            "short_description": "Comprender la situación de miseria rural.",
            "example_tasks": [
              "Describir el sistema de peonaje por deuda en las haciendas.",
              "Analizar las tiendas de raya y la explotación económica de los trabajadores.",
              "Explicar la desnutrición, analfabetismo y falta de derechos de la mayoría campesina."
            ]
          },
          {
            "key": "clase_obrera_incipiente",
            "name": "Formación de la Clase Obrera",
            "short_description": "Estudiar el surgimiento del proletariado industrial.",
            "example_tasks": [
              "Describir las condiciones laborales: jornadas de 12-14 horas, salarios bajos, inseguridad.",
              "Analizar la discriminación: salarios más altos para trabajadores extranjeros que mexicanos.",
              "Explicar el surgimiento de organizaciones obreras mutualistas y primeras huelgas."
            ]
          },
          {
            "key": "situacion_indigenas",
            "name": "Situación de los Pueblos Indígenas",
            "short_description": "Comprender la marginación y represión de indígenas.",
            "example_tasks": [
              "Describir las campañas militares contra pueblos indígenas: yaquis en Sonora, mayas en Yucatán.",
              "Analizar la deportación de yaquis a Yucatán y mayas a Valle Nacional (esclavitud encubierta).",
              "Explicar el racismo científico que justificaba la opresión indígena."
            ]
          }
        ]
      },
      {
        "key": "politica_represiva",
        "name": "Política Represiva y Control Social",
        "short_description": "Análisis de los mecanismos de represión durante el Porfiriato.",
        "sub_topics": [
          {
            "key": "rurales_ejercito",
            "name": "Los Rurales y el Ejército",
            "short_description": "Comprender los cuerpos represivos del régimen.",
            "example_tasks": [
              "Describir la policía rural como fuerza para mantener el orden y reprimir disidencia.",
              "Analizar la política de 'mátalos en caliente' contra bandidos y opositores.",
              "Explicar la profesionalización del ejército como garante del régimen."
            ]
          },
          {
            "key": "represion_huelgas",
            "name": "Represión de Movimientos Obreros",
            "short_description": "Estudiar la violencia contra trabajadores organizados.",
            "example_tasks": [
              "Describir la represión de la huelga de Cananea, Sonora (1906) contra mina estadounidense.",
              "Analizar la masacre de Río Blanco, Veracruz (1907) contra trabajadores textiles.",
              "Explicar cómo estas represiones evidenciaron la naturaleza antilaboral del régimen."
            ]
          },
          {
            "key": "control_prensa_educacion",
            "name": "Control de la Prensa y la Educación",
            "short_description": "Comprender la manipulación informativa e ideológica.",
            "example_tasks": [
              "Describir el control de la prensa mediante subsidios y censura.",
              "Analizar el uso de la educación para difundir el positivismo y legitimar el orden social.",
              "Explicar la persecución de periodistas críticos como los hermanos Flores Magón."
            ]
          }
        ]
      },
      {
        "key": "cultura_porfiriana",
        "name": "Cultura Durante el Porfiriato",
        "short_description": "Análisis de las manifestaciones culturales de la época.",
        "sub_topics": [
          {
            "key": "afrancesamiento_elite",
            "name": "Afrancesamiento de la Élite",
            "short_description": "Comprender la imitación de modelos culturales europeos.",
            "example_tasks": [
              "Describir la adopción de costumbres, moda y arquitectura francesas por la élite.",
              "Analizar el desprecio por lo indígena y mestizo, considerado 'atrasado'.",
              "Explicar cómo el Palacio de Bellas Artes simbolizaba esta admiración por Europa."
            ]
          },
          {
            "key": "positivismo_educacion",
            "name": "Positivismo en la Educación",
            "short_description": "Estudiar la filosofía educativa del régimen.",
            "example_tasks": [
              "Explicar los principios del positivismo: orden, progreso, ciencia sobre metafísica.",
              "Analizar la influencia de Auguste Comte y Herbert Spencer en el pensamiento porfiriano.",
              "Describir la Escuela Nacional Preparatoria como institución emblemática del positivismo."
            ]
          },
          {
            "key": "festejos_centenario",
            "name": "Festejos del Centenario (1910)",
            "short_description": "Comprender la celebración propagandística del régimen.",
            "example_tasks": [
              "Describir los fastuosos festejos del centenario de la Independencia en septiembre 1910.",
              "Analizar la construcción de monumentos: Monumento a la Independencia (Ángel), Hemiciclo a Juárez.",
              "Explicar el contraste entre el lujo de los festejos y la miseria de la mayoría de la población."
            ]
          }
        ]
      },
      {
        "key": "crisis_final_porfiriato",
        "name": "Crisis Final del Porfiriato",
        "short_description": "Análisis de los factores que condujeron a la caída del régimen.",
        "sub_topics": [
          {
            "key": "envejecimiento_diaz",
            "name": "Problema Sucesorio",
            "short_description": "Comprender las preocupaciones sobre el futuro del país.",
            "example_tasks": [
              "Describir el envejecimiento de Díaz (80 años en 1910) y la ausencia de sucesión clara.",
              "Analizar la entrevista Díaz-Creelman (1908) donde Díaz promete no reelegirse.",
              "Explicar cómo esta declaración desató expectativas de cambio político."
            ]
          },
          {
            "key": "crisis_economica_1907",
            "name": "Crisis Económica de 1907-1908",
            "short_description": "Estudiar el impacto de la crisis económica mundial.",
            "example_tasks": [
              "Describir cómo la crisis estadounidense afectó la economía mexicana dependiente.",
              "Analizar el desempleo, caída de salarios y hambrunas que afectaron a la población.",
              "Explicar cómo la crisis erosionó la legitimidad del régimen basada en 'progreso'."
            ]
          },
          {
            "key": "movimientos_opositores",
            "name": "Surgimiento de Movimientos Opositores",
            "short_description": "Comprender la organización de la oposición política.",
            "example_tasks": [
              "Describir el Partido Liberal Mexicano de los hermanos Flores Magón con ideología anarquista.",
              "Analizar el movimiento antirreeleccionista de Francisco I. Madero.",
              "Explicar cómo diversos grupos (liberales, anarquistas, campesinos, obreros) convergían en oposición a Díaz."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "revolucion_mexicana",
    "name": "Revolución Mexicana",
    "short_description": "Estudio comprehensivo del movimiento armado que transformó México (1910-1920), analizando sus múltiples etapas, líderes, facciones, demandas sociales, conflictos internos, y el proceso de institucionalización revolucionaria que culminó con la Constitución de 1917.",
    "sub_topics": [
      {
        "key": "maderismo_inicio_revolucion",
        "name": "Maderismo e Inicio de la Revolución",
        "short_description": "Análisis de la fase inicial del movimiento revolucionario bajo el liderazgo de Francisco I. Madero.",
        "sub_topics": [
          {
            "key": "francisco_madero_antirreeleccionismo",
            "name": "Francisco I. Madero y el Movimiento Antirreeleccionista",
            "short_description": "Comprender el perfil de Madero y su propuesta política.",
            "example_tasks": [
              "Describir el origen de Madero: empresario coahuilense, educado, idealista.",
              "Analizar su libro 'La Sucesión Presidencial en 1910' y sus propuestas de democracia.",
              "Explicar la formación del Partido Nacional Antirreeleccionista con el lema 'Sufragio Efectivo, No Reelección'."
            ]
          },
          {
            "key": "elecciones_1910",
            "name": "Elecciones Fraudulentas de 1910",
            "short_description": "Estudiar el proceso electoral que desencadenó la revolución.",
            "example_tasks": [
              "Describir la campaña de Madero que generó entusiasmo popular.",
              "Analizar el encarcelamiento de Madero en San Luis Potosí durante las elecciones.",
              "Explicar el fraude electoral que dio el triunfo a Díaz y la indignación que provocó."
            ]
          },
          {
            "key": "plan_san_luis",
            "name": "Plan de San Luis (Octubre 1910)",
            "short_description": "Comprender el llamado a la insurrección armada.",
            "example_tasks": [
              "Describir cómo Madero huyó a Estados Unidos y proclamó el Plan de San Luis.",
              "Analizar el contenido: desconocimiento de Díaz, llamado a levantamiento el 20 de noviembre de 1910.",
              "Explicar el artículo 3° sobre restitución de tierras a comunidades despojadas."
            ]
          },
          {
            "key": "levantamientos_norte",
            "name": "Levantamientos en el Norte",
            "short_description": "Estudiar las primeras insurrecciones revolucionarias.",
            "example_tasks": [
              "Describir los levantamientos en Chihuahua liderados por Pascual Orozco y Pancho Villa.",
              "Analizar las victorias revolucionarias: toma de Ciudad Juárez (mayo 1911).",
              "Explicar la rápida extensión del movimiento y el debilitamiento del régimen."
            ]
          },
          {
            "key": "renuncia_diaz",
            "name": "Renuncia de Porfirio Díaz",
            "short_description": "Comprender el fin del Porfiriato.",
            "example_tasks": [
              "Describir los Tratados de Ciudad Juárez (mayo 1911) que pactaron la salida de Díaz.",
              "Analizar el discurso de renuncia de Díaz y su exilio a Francia.",
              "Explicar el triunfo aparente del movimiento maderista y la euforia democrática."
            ]
          }
        ]
      },
      {
        "key": "gobierno_madero",
        "name": "Gobierno de Francisco I. Madero",
        "short_description": "Análisis del breve gobierno democrático de Madero y los conflictos que enfrentó.",
        "sub_topics": [
          {
            "key": "presidencia_madero",
            "name": "Presidencia de Madero (1911-1913)",
            "short_description": "Comprender las políticas y dificultades del gobierno maderista.",
            "example_tasks": [
              "Describir la elección democrática de Madero con más del 90% de los votos.",
              "Analizar sus políticas: libertad de prensa, respeto a la ley, democracia política.",
              "Explicar las limitaciones: reforma social moderada, permanencia de estructuras porfirianas."
            ]
          },
          {
            "key": "oposicion_madero",
            "name": "Oposición desde Múltiples Frentes",
            "short_description": "Estudiar los enemigos que Madero enfrentaba.",
            "example_tasks": [
              "Describir la oposición conservadora: porfiristas, Iglesia, terratenientes que lo consideraban radical.",
              "Analizar la oposición revolucionaria: Zapata, Orozco que lo consideraban traidor por no realizar reformas.",
              "Explicar cómo Madero estaba atrapado entre conservadores y revolucionarios radicales."
            ]
          },
          {
            "key": "plan_ayala_zapatismo",
            "name": "Plan de Ayala y el Zapatismo",
            "short_description": "Comprender la ruptura de Zapata con Madero.",
            "example_tasks": [
              "Describir el Plan de Ayala proclamado por Zapata (noviembre 1911).",
              "Analizar las demandas agrarias radicales: 'Tierra y Libertad', restitución y reparto de tierras.",
              "Explicar por qué Zapata desconoció a Madero por no cumplir promesas agrarias."
            ]
          },
          {
            "key": "rebelion_orozco",
            "name": "Rebelión de Pascual Orozco",
            "short_description": "Estudiar otro levantamiento contra Madero.",
            "example_tasks": [
              "Describir la rebelión de Orozco en Chihuahua (marzo 1912) contra Madero.",
              "Analizar el Plan de la Empacadora con demandas sociales más radicales.",
              "Explicar cómo Victoriano Huerta derrotó a Orozco fortaleciendo su posición militar."
            ]
          },
          {
            "key": "decena_tragica",
            "name": "La Decena Trágica",
            "short_description": "Comprender el golpe de Estado que derrocó a Madero.",
            "example_tasks": [
              "Describir el golpe militar de Félix Díaz y Bernardo Reyes en febrero de 1913.",
              "Analizar el bombardeo de la Ciudad de México durante diez días.",
              "Explicar el Pacto de la Embajada negociado por el embajador estadounidense Henry Lane Wilson."
            ]
          },
          {
            "key": "asesinato_madero",
            "name": "Asesinato de Madero y Pino Suárez",
            "short_description": "Estudiar el trágico fin del gobierno democrático.",
            "example_tasks": [
              "Describir la renuncia forzada de Madero y Pino Suárez el 19 de febrero de 1913.",
              "Analizar el asesinato de ambos el 22 de febrero durante un supuesto traslado.",
              "Explicar el impacto nacional: indignación, radicalización del movimiento revolucionario."
            ]
          }
        ]
      },
      {
        "key": "usurpacion_huertista",
        "name": "Usurpación Huertista y Lucha Constitucionalista",
        "short_description": "Análisis de la dictadura de Huerta y la resistencia revolucionaria que la derrocó.",
        "sub_topics": [
          {
            "key": "dictadura_huerta",
            "name": "Dictadura de Victoriano Huerta",
            "short_description": "Comprender el régimen militar y represivo de Huerta.",
            "example_tasks": [
              "Describir cómo Huerta asumió la presidencia mediante traición y violencia.",
              "Analizar su intento de restaurar un régimen porfirista: represión, militarización.",
              "Explicar la falta de legitimidad interna y el rechazo internacional (gobierno de Wilson en EE.UU.)."
            ]
          },
          {
            "key": "plan_guadalupe",
            "name": "Plan de Guadalupe y Constitucionalismo",
            "short_description": "Estudiar la respuesta revolucionaria contra Huerta.",
            "example_tasks": [
              "Describir el Plan de Guadalupe proclamado por Venustiano Carranza (marzo 1913).",
              "Analizar el contenido: desconocimiento de Huerta, restauración del orden constitucional.",
              "Explicar la formación del Ejército Constitucionalista con Carranza como Primer Jefe."
            ]
          },
          {
            "key": "division_del_norte",
            "name": "División del Norte de Pancho Villa",
            "short_description": "Comprender el papel militar de Villa en la lucha contra Huerta.",
            "example_tasks": [
              "Describir la formación de la poderosa División del Norte bajo Villa en Chihuahua.",
              "Analizar las victorias militares: Torreón, Zacatecas, avance hacia la capital.",
              "Explicar el carisma de Villa y su apoyo popular entre campesinos y trabajadores."
            ]
          },
          {
            "key": "ejercito_libertador_sur",
            "name": "Ejército Libertador del Sur de Zapata",
            "short_description": "Estudiar la continuación de la lucha zapatista.",
            "example_tasks": [
              "Describir la resistencia zapatista en Morelos contra Huerta.",
              "Analizar la implementación del Plan de Ayala en territorios controlados por Zapata.",
              "Explicar la organización comunal agraria en zonas zapatistas."
            ]
          },
          {
            "key": "intervencion_estadounidense_veracruz",
            "name": "Intervención Estadounidense en Veracruz",
            "short_description": "Comprender la ocupación estadounidense y sus efectos.",
            "example_tasks": [
              "Describir la ocupación de Veracruz por marines estadounidenses (abril 1914).",
              "Analizar las razones: oposición de Wilson a Huerta, incidente en Tampico.",
              "Explicar la resistencia popular mexicana y el nacionalismo que generó."
            ]
          },
          {
            "key": "caida_huerta",
            "name": "Caída de Huerta",
            "short_description": "Estudiar el colapso de la dictadura huertista.",
            "example_tasks": [
              "Describir la ofensiva final constitucionalista desde múltiples frentes.",
              "Analizar la renuncia y huida de Huerta en julio de 1914.",
              "Explicar la entrada triunfal de Obregón a la Ciudad de México en agosto de 1914."
            ]
          }
        ]
      },
      {
        "key": "lucha_facciones",
        "name": "Lucha entre Facciones Revolucionarias",
        "short_description": "Análisis del conflicto entre constitucionalistas y convencionistas por el control del país.",
        "sub_topics": [
          {
            "key": "convencion_aguascalientes",
            "name": "Convención de Aguascalientes",
            "short_description": "Comprender el intento de unificar a los revolucionarios.",
            "example_tasks": [
              "Describir la Convención convocada en octubre de 1914 para acordar el futuro del país.",
              "Analizar las tensiones entre Carranza (moderado) y Villa-Zapata (radicales agrarios).",
              "Explicar la ruptura: nombramiento de Eulalio Gutiérrez como presidente provisional y rechazo de Carranza."
            ]
          },
          {
            "key": "division_revolucionarios",
            "name": "División: Constitucionalistas vs Convencionistas",
            "short_description": "Estudiar los dos bandos en conflicto.",
            "example_tasks": [
              "Describir el bando constitucionalista: Carranza y Obregón, base en Veracruz.",
              "Analizar el bando convencionista: Villa y Zapata, control de la capital.",
              "Explicar las diferencias ideológicas: reforma social radical vs consolidación institucional."
            ]
          },
          {
            "key": "encuentro_villa_zapata",
            "name": "Encuentro Villa-Zapata en Xochimilco",
            "short_description": "Comprender la alianza entre los líderes populares.",
            "example_tasks": [
              "Describir el encuentro histórico en diciembre de 1914.",
              "Analizar las coincidencias: demandas agrarias, desconfianza hacia Carranza.",
              "Explicar las limitaciones de la alianza: falta de coordinación militar efectiva."
            ]
          },
          {
            "key": "triunfo_obregon",
            "name": "Triunfo Militar de Obregón",
            "short_description": "Estudiar las victorias decisivas constitucionalistas.",
            "example_tasks": [
              "Describir las batallas de Celaya (abril 1915) donde Obregón derrotó a Villa.",
              "Analizar la superioridad táctica de Obregón: uso de ametralladoras, trincheras, estrategia moderna.",
              "Explicar cómo estas derrotas debilitaron permanentemente a Villa."
            ]
          },
          {
            "key": "repliegue_villa_zapata",
            "name": "Repliegue de Villa y Zapata",
            "short_description": "Comprender la derrota de los revolucionarios populares.",
            "example_tasks": [
              "Describir el repliegue de Villa al norte, convertido en guerrillero.",
              "Analizar el retorno de Zapata a Morelos, continuando la lucha local.",
              "Explicar el control progresivo de Carranza sobre el país."
            ]
          },
          {
            "key": "expedicion_punitiva",
            "name": "Expedición Punitiva de Pershing",
            "short_description": "Estudiar la incursión estadounidense contra Villa.",
            "example_tasks": [
              "Describir el ataque de Villa a Columbus, Nuevo México (marzo 1916) y sus motivaciones.",
              "Analizar la entrada de tropas estadounidenses a México en persecución de Villa.",
              "Explicar la resistencia nacional a la invasión y el fracaso de capturar a Villa."
            ]
          }
        ]
      },
      {
        "key": "constitucion_1917",
        "name": "Constitución de 1917",
        "short_description": "Análisis de la carta magna que institucionalizó las conquistas revolucionarias.",
        "sub_topics": [
          {
            "key": "congreso_constituyente",
            "name": "Congreso Constituyente de Querétaro",
            "short_description": "Comprender la elaboración de la nueva constitución.",
            "example_tasks": [
              "Describir la convocatoria de Carranza al Congreso Constituyente en diciembre de 1916.",
              "Analizar la composición: diputados revolucionarios, ausencia de conservadores y villistas-zapatistas.",
              "Explicar los debates entre moderados carrancistas y radicales jacobinos."
            ]
          },
          {
            "key": "articulo_3_educacion",
            "name": "Artículo 3°: Educación Laica y Gratuita",
            "short_description": "Estudiar las disposiciones sobre educación.",
            "example_tasks": [
              "Explicar la educación laica, gratuita y obligatoria establecida en el artículo 3°.",
              "Analizar la prohibición a corporaciones religiosas de impartir educación primaria.",
              "Describir el objetivo: formar ciudadanos libres del control eclesiástico."
            ]
          },
          {
            "key": "articulo_27_propiedad",
            "name": "Artículo 27: Propiedad de la Nación",
            "short_description": "Comprender el artículo más revolucionario sobre la tierra.",
            "example_tasks": [
              "Explicar el concepto de propiedad originaria de la nación sobre tierras y aguas.",
              "Analizar las bases para reforma agraria: restitución y dotación de ejidos.",
              "Describir la propiedad nacional del subsuelo y los recursos naturales (petróleo, minerales)."
            ]
          },
          {
            "key": "articulo_123_trabajo",
            "name": "Artículo 123: Derechos Laborales",
            "short_description": "Estudiar las garantías constitucionales para los trabajadores.",
            "example_tasks": [
              "Analizar los derechos laborales: jornada de 8 horas, salario mínimo, descanso semanal.",
              "Explicar los derechos de huelga y asociación sindical.",
              "Describir protecciones especiales: mujeres embarazadas, trabajo infantil, seguridad laboral."
            ]
          },
          {
            "key": "articulo_130_iglesia",
            "name": "Artículo 130: Restricciones a la Iglesia",
            "short_description": "Comprender las limitaciones al poder eclesiástico.",
            "example_tasks": [
              "Explicar las restricciones: prohibición de participación política del clero, no personalidad jurídica de iglesias.",
              "Analizar la regulación estatal del culto religioso.",
              "Describir la reacción del clero católico ante estas disposiciones."
            ]
          },
          {
            "key": "promulgacion_constitucion",
            "name": "Promulgación de la Constitución",
            "short_description": "Estudiar la aprobación y significado de la carta magna.",
            "example_tasks": [
              "Describir la promulgación el 5 de febrero de 1917 en Querétaro.",
              "Analizar el carácter avanzado de la Constitución: primera en el mundo con derechos sociales.",
              "Explicar su función: marco legal para transformar las demandas revolucionarias en instituciones."
            ]
          }
        ]
      },
      {
        "key": "final_revolucion_armada",
        "name": "Final de la Revolución Armada",
        "short_description": "Análisis del cierre del conflicto armado y el asesinato de los principales líderes.",
        "sub_topics": [
          {
            "key": "asesinato_zapata",
            "name": "Asesinato de Emiliano Zapata",
            "short_description": "Comprender la eliminación del líder agrario.",
            "example_tasks": [
              "Describir la emboscada en la Hacienda de Chinameca (10 de abril de 1919).",
              "Analizar la traición del coronel Jesús Guajardo que atrajo a Zapata.",
              "Explicar el impacto: fin del zapatismo organizado, pero permanencia de su legado."
            ]
          },
          {
            "key": "asesinato_carranza",
            "name": "Asesinato de Venustiano Carranza",
            "short_description": "Estudiar la muerte del Primer Jefe.",
            "example_tasks": [
              "Describir la rebelión de Agua Prieta (abril 1920) de Obregón y Calles contra Carranza.",
              "Analizar la huida de Carranza hacia Veracruz y su asesinato en Tlaxcalaltongo (mayo 1920).",
              "Explicar las causas: intento de Carranza de imponer sucesor, descontento militar."
            ]
          },
          {
            "key": "asesinato_villa",
            "name": "Asesinato de Francisco Villa",
            "short_description": "Comprender el fin del Centauro del Norte.",
            "example_tasks": [
              "Describir el retiro de Villa a la Hacienda de Canutillo tras los Convenios de Sabinas.",
              "Analizar su asesinato en Parral, Chihuahua (20 de julio de 1923).",
              "Explicar las teorías sobre los autores intelectuales: temor a su posible retorno político."
            ]
          },
          {
            "key": "balance_revolucion",
            "name": "Balance de la Revolución",
            "short_description": "Evaluar las consecuencias del movimiento armado.",
            "example_tasks": [
              "Analizar el costo humano: entre 1 y 2 millones de muertos, 10% de la población.",
              "Describir la destrucción económica y el desplazamiento de población.",
              "Explicar las conquistas: Constitución social, fin del porfirismo, bases para Estado moderno."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "reconstruccion_caudillismo",
    "name": "Reconstrucción Nacional y Caudillismo",
    "short_description": "Estudio del periodo de reconstrucción (1920-1934) bajo los gobiernos de Obregón, Calles y el Maximato, incluyendo la consolidación institucional, el conflicto religioso (Guerra Cristera), y la formación del partido oficial.",
    "sub_topics": [
      {
        "key": "gobierno_obregon",
        "name": "Gobierno de Álvaro Obregón (1920-1924)",
        "short_description": "Análisis del primer gobierno de la reconstrucción nacional.",
        "sub_topics": [
          {
            "key": "pacificacion_nacional",
            "name": "Pacificación del País",
            "short_description": "Comprender los esfuerzos por terminar con la violencia.",
            "example_tasks": [
              "Describir las negociaciones con jefes militares regionales y caudillos locales.",
              "Analizar el licenciamiento de tropas y la reducción del ejército.",
              "Explicar la estrategia de cooptación: incorporar líderes al sistema político."
            ]
          },
          {
            "key": "vasconcelos_educacion",
            "name": "José Vasconcelos y la Cruzada Educativa",
            "short_description": "Estudiar el proyecto educativo y cultural posrevolucionario.",
            "example_tasks": [
              "Describir la creación de la Secretaría de Educación Pública (SEP) con Vasconcelos.",
              "Analizar el programa de educación rural: maestros misioneros, construcción de escuelas.",
              "Explicar el proyecto cultural: promoción del mestizaje, murales, publicación de clásicos."
            ]
          },
          {
            "key": "tratados_bucareli",
            "name": "Tratados de Bucareli",
            "short_description": "Comprender las negociaciones con Estados Unidos.",
            "example_tasks": [
              "Describir las pláticas de 1923 para obtener reconocimiento estadounidense.",
              "Analizar las concesiones: protección a intereses petroleros estadounidenses.",
              "Explicar la controversia: acusaciones de traicionar el artículo 27 constitucional."
            ]
          },
          {
            "key": "reforma_agraria_obregon",
            "name": "Inicio de la Reforma Agraria",
            "short_description": "Estudiar los primeros repartos de tierra.",
            "example_tasks": [
              "Describir el reparto agrario limitado: aproximadamente 1.7 millones de hectáreas.",
              "Analizar la creación de ejidos y restitución de tierras comunales.",
              "Explicar las resistencias: terratenientes, limitaciones presupuestales."
            ]
          },
          {
            "key": "rebelion_delahuertista",
            "name": "Rebelión Delahuertista",
            "short_description": "Comprender el último gran levantamiento militar.",
            "example_tasks": [
              "Describir la rebelión de Adolfo de la Huerta contra la designación de Calles como sucesor (1923-1924).",
              "Analizar el apoyo de militares descontentos a De la Huerta.",
              "Explicar la derrota de la rebelión y consolidación del grupo Sonora."
            ]
          }
        ]
      },
      {
        "key": "gobierno_calles",
        "name": "Gobierno de Plutarco Elías Calles (1924-1928)",
        "short_description": "Análisis del gobierno que consolidó las instituciones revolucionarias y provocó el conflicto religioso.",
        "sub_topics": [
          {
            "key": "reformas_institucionales",
            "name": "Reformas Institucionales",
            "short_description": "Comprender la modernización del Estado.",
            "example_tasks": [
              "Describir la creación del Banco de México (1925) para controlar la política monetaria.",
              "Analizar la organización del sistema bancario y fiscal.",
              "Explicar la profesionalización de la burocracia estatal."
            ]
          },
          {
            "key": "ley_calles_petroleo",
            "name": "Ley Calles del Petróleo",
            "short_description": "Estudiar el intento de aplicar el artículo 27 al petróleo.",
            "example_tasks": [
              "Describir la Ley del Petróleo de 1925 que limitaba concesiones a 50 años.",
              "Analizar el conflicto con compañías estadounidenses y británicas.",
              "Explicar la presión internacional y las negociaciones con embajador Morrow."
            ]
          },
          {
            "key": "anticlericalismo_calles",
            "name": "Anticlericalismo y Aplicación del Artículo 130",
            "short_description": "Comprender las políticas anticlericales que provocaron el conflicto.",
            "example_tasks": [
              "Describir las medidas de Calles: cierre de escuelas religiosas, deportación de sacerdotes extranjeros.",
              "Analizar la Ley Calles (1926) que reglamentaba estrictamente el culto religioso.",
              "Explicar la suspensión de cultos por la Iglesia como protesta (julio 1926)."
            ]
          }
        ]
      },
      {
        "key": "guerra_cristera",
        "name": "Guerra Cristera (1926-1929)",
        "short_description": "Análisis del conflicto armado entre el gobierno y los católicos.",
        "sub_topics": [
          {
            "key": "levantamiento_cristero",
            "name": "Levantamiento de los Cristeros",
            "short_description": "Comprender el inicio de la rebelión católica.",
            "example_tasks": [
              "Describir el levantamiento armado de campesinos católicos en el Bajío, Jalisco, Michoacán.",
              "Analizar el lema 'Viva Cristo Rey' y la defensa de la libertad religiosa.",
              "Explicar la composición social: mayoría campesina dirigida por líderes locales."
            ]
          },
          {
            "key": "desarrollo_conflicto_cristero",
            "name": "Desarrollo del Conflicto",
            "short_description": "Estudiar las características de la guerra.",
            "example_tasks": [
              "Describir la guerra de guerrillas en zonas rurales del centro-occidente.",
              "Analizar la brutalidad del conflicto: atrocidades de ambos bandos.",
              "Explicar el apoyo de la Liga Nacional Defensora de la Libertad Religiosa."
            ]
          },
          {
            "key": "arreglos_1929",
            "name": "Arreglos de 1929",
            "short_description": "Comprender el fin negociado del conflicto.",
            "example_tasks": [
              "Describir las negociaciones mediadas por el embajador estadounidense Morrow y el arzobispo Ruiz y Flores.",
              "Analizar los términos: reanudación del culto, amnistía, sin derogar leyes anticlericales.",
              "Explicar el sentimiento de traición entre algunos cristeros que continuaron luchando."
            ]
          },
          {
            "key": "balance_guerra_cristera",
            "name": "Balance de la Guerra Cristera",
            "short_description": "Evaluar las consecuencias del conflicto.",
            "example_tasks": [
              "Analizar el costo: aproximadamente 70,000-90,000 muertos.",
              "Explicar la permanencia de tensiones Estado-Iglesia en décadas posteriores.",
              "Describir cómo el conflicto evidenció la necesidad de pragmatismo político."
            ]
          }
        ]
      },
      {
        "key": "maximato",
        "name": "El Maximato (1928-1934)",
        "short_description": "Análisis del periodo de control de Calles sobre presidentes nominales.",
        "sub_topics": [
          {
            "key": "asesinato_obregon",
            "name": "Reelección y Asesinato de Obregón",
            "short_description": "Comprender la crisis política de 1928.",
            "example_tasks": [
              "Describir la reforma constitucional que permitió la reelección no inmediata.",
              "Analizar el asesinato de Obregón electo por José de León Toral (julio 1928).",
              "Explicar el vacío de poder y la oportunidad de Calles."
            ]
          },
          {
            "key": "fundacion_pnr",
            "name": "Fundación del Partido Nacional Revolucionario",
            "short_description": "Estudiar la creación del partido oficial.",
            "example_tasks": [
              "Describir la fundación del PNR en 1929 por iniciativa de Calles.",
              "Analizar el objetivo: institucionalizar el poder, evitar conflictos violentos por la sucesión.",
              "Explicar la estructura corporativa: sectores agrario, obrero, popular, militar."
            ]
          },
          {
            "key": "jefe_maximo",
            "name": "Calles como 'Jefe Máximo de la Revolución'",
            "short_description": "Comprender el poder tras el trono.",
            "example_tasks": [
              "Describir cómo Calles controlaba a presidentes nominales: Portes Gil, Ortiz Rubio, Abelardo Rodríguez.",
              "Analizar el sistema del Maximato: presidente débil, Calles tomaba decisiones clave.",
              "Explicar las resistencias y conspiraciones contra el dominio callista."
            ]
          },
          {
            "key": "presidentes_maximato",
            "name": "Los Presidentes del Maximato",
            "short_description": "Estudiar los gobiernos de transición.",
            "example_tasks": [
              "Describir el gobierno de Emilio Portes Gil (1928-1930): arreglos con la Iglesia.",
              "Analizar la presidencia de Pascual Ortiz Rubio (1930-1932): renuncia por presiones de Calles.",
              "Explicar el gobierno de Abelardo L. Rodríguez (1932-1934): preparación para Cárdenas."
            ]
          },
          {
            "key": "plan_sexenal",
            "name": "Plan Sexenal",
            "short_description": "Comprender el programa de gobierno institucionalizado.",
            "example_tasks": [
              "Describir la elaboración del primer Plan Sexenal para 1934-1940.",
              "Analizar su contenido: reforma agraria ampliada, educación socialista, nacionalizaciones.",
              "Explicar cómo Cárdenas usaría este plan para justificar políticas radicales."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "cardenismo",
    "name": "Cardenismo y Consolidación Institucional",
    "short_description": "Estudio del gobierno transformador de Lázaro Cárdenas (1934-1940), caracterizado por la reforma agraria masiva, la expropiación petrolera, el fortalecimiento de organizaciones obreras y campesinas, y la consolidación del Estado posrevolucionario.",
    "sub_topics": [
      {
        "key": "ruptura_calles",
        "name": "Ruptura con Calles",
        "short_description": "Análisis de cómo Cárdenas se liberó del control del Jefe Máximo.",
        "sub_topics": [
          {
            "key": "inicio_gobierno_cardenas",
            "name": "Inicio del Gobierno de Cárdenas",
            "short_description": "Comprender la situación inicial de Cárdenas.",
            "example_tasks": [
              "Describir la elección de Cárdenas como candidato del PNR en 1934.",
              "Analizar la percepción inicial: otro presidente títere de Calles.",
              "Explicar las primeras señales de independencia: giras por el país, escuchar demandas populares."
            ]
          },
          {
            "key": "crisis_junio_1935",
            "name": "Crisis de Junio de 1935",
            "short_description": "Estudiar el enfrentamiento entre Cárdenas y Calles.",
            "example_tasks": [
              "Describir las declaraciones públicas de Calles criticando las huelgas y políticas de Cárdenas.",
              "Analizar la respuesta de Cárdenas: exigir renuncia del gabinete callista.",
              "Explicar la movilización popular y sindical en apoyo a Cárdenas."
            ]
          },
          {
            "key": "expulsion_calles",
            "name": "Expulsión de Calles",
            "short_description": "Comprender el fin definitivo del Maximato.",
            "example_tasks": [
              "Describir la deportación de Calles a Estados Unidos en abril de 1936.",
              "Analizar el desmantelamiento del grupo callista del gobierno y el PNR.",
              "Explicar la consolidación del poder presidencial en manos de Cárdenas."
            ]
          }
        ]
      },
      {
        "key": "reforma_agraria_cardenista",
        "name": "Reforma Agraria Masiva",
        "short_description": "Análisis del reparto agrario más extenso de la historia mexicana.",
        "sub_topics": [
          {
            "key": "magnitud_reparto",
            "name": "Magnitud del Reparto Agrario",
            "short_description": "Comprender la escala sin precedentes de la reforma.",
            "example_tasks": [
              "Cuantificar el reparto: más de 18 millones de hectáreas distribuidas.",
              "Comparar con gobiernos anteriores: Cárdenas repartió más que todos los gobiernos previos juntos.",
              "Analizar el número de beneficiarios: más de 800,000 ejidatarios."
            ]
          },
          {
            "key": "ejido_colectivo",
            "name": "Promoción del Ejido Colectivo",
            "short_description": "Estudiar el modelo de organización agraria promovido.",
            "example_tasks": [
              "Describir el ejido colectivo como alternativa al minifundio.",
              "Analizar casos exitosos: ejido henequenero de Yucatán, ejido algodonero de La Laguna.",
              "Explicar la visión cooperativista y socialista del proyecto agrario cardenista."
            ]
          },
          {
            "key": "credito_ejidal",
            "name": "Apoyo Institucional al Ejido",
            "short_description": "Comprender los mecanismos de apoyo a ejidatarios.",
            "example_tasks": [
              "Describir la creación del Banco Nacional de Crédito Ejidal.",
              "Analizar los programas de asistencia técnica y capacitación agrícola.",
              "Explicar las limitaciones: recursos insuficientes, problemas de productividad."
            ]
          }
        ]
      },
      {
        "key": "organizacion_masas",
        "name": "Organización de Masas",
        "short_description": "Análisis del fortalecimiento de organizaciones obreras y campesinas.",
        "sub_topics": [
          {
            "key": "ctm_obrera",
            "name": "Confederación de Trabajadores de México (CTM)",
            "short_description": "Comprender la organización de la clase obrera.",
            "example_tasks": [
              "Describir la fundación de la CTM en 1936 bajo liderazgo de Vicente Lombardo Toledano.",
              "Analizar la incorporación de la CTM al partido oficial como sector obrero.",
              "Explicar la relación: apoyo obrero al gobierno a cambio de concesiones laborales."
            ]
          },
          {
            "key": "cnc_campesina",
            "name": "Confederación Nacional Campesina (CNC)",
            "short_description": "Estudiar la organización de ejidatarios y campesinos.",
            "example_tasks": [
              "Describir la fundación de la CNC en 1938 para organizar a beneficiarios de la reforma agraria.",
              "Analizar su función: movilización campesina en apoyo al gobierno.",
              "Explicar la incorporación al PRM como sector campesino."
            ]
          },
          {
            "key": "transformacion_prm",
            "name": "Transformación del PNR en PRM",
            "short_description": "Comprender la reestructuración del partido oficial.",
            "example_tasks": [
              "Describir la refundación como Partido de la Revolución Mexicana (PRM) en 1938.",
              "Analizar la estructura corporativa: sectores obrero, campesino, popular y militar.",
              "Explicar el objetivo: control estatal sobre organizaciones de masas."
            ]
          }
        ]
      },
      {
        "key": "expropiacion_petrolera",
        "name": "Expropiación Petrolera",
        "short_description": "Análisis del acto nacionalista más importante del cardenismo.",
        "sub_topics": [
          {
            "key": "antecedentes_conflicto",
            "name": "Antecedentes del Conflicto Petrolero",
            "short_description": "Comprender las causas de la expropiación.",
            "example_tasks": [
              "Describir la huelga de trabajadores petroleros (1937) demandando mejores condiciones.",
              "Analizar el fallo de la Junta de Conciliación y Arbitraje favorable a los trabajadores.",
              "Explicar la negativa de las compañías extranjeras a acatar el fallo."
            ]
          },
          {
            "key": "decreto_expropiacion",
            "name": "Decreto de Expropiación (18 de marzo de 1938)",
            "short_description": "Estudiar el acto de nacionalización.",
            "example_tasks": [
              "Describir el decreto de Cárdenas que expropiaba la industria petrolera por causa de utilidad pública.",
              "Analizar la justificación legal basada en el artículo 27 constitucional.",
              "Explicar el impacto simbólico: afirmación de soberanía nacional sobre recursos naturales."
            ]
          },
          {
            "key": "apoyo_popular_expropiacion",
            "name": "Apoyo Popular a la Expropiación",
            "short_description": "Comprender la movilización nacional.",
            "example_tasks": [
              "Describir las manifestaciones masivas de apoyo en todo el país.",
              "Analizar la colecta popular para pagar la deuda petrolera.",
              "Explicar el consenso nacional: izquierda, centro y derecha apoyaron la medida."
            ]
          },
          {
            "key": "reacciones_internacionales",
            "name": "Reacciones Internacionales",
            "short_description": "Estudiar las consecuencias diplomáticas y económicas.",
            "example_tasks": [
              "Describir el boicot de las compañías expropiadas: bloqueo de venta de petróleo mexicano.",
              "Analizar la ruptura de relaciones diplomáticas con Gran Bretaña.",
              "Explicar cómo México diversificó mercados: ventas a Alemania, Italia, Japón."
            ]
          },
          {
            "key": "pemex",
            "name": "Creación de Petróleos Mexicanos (PEMEX)",
            "short_description": "Comprender la formación de la empresa estatal.",
            "example_tasks": [
              "Describir la creación de PEMEX en junio de 1938 para administrar la industria nacionalizada.",
              "Analizar los retos iniciales: falta de técnicos, boicot internacional, problemas financieros.",
              "Explicar la importancia de PEMEX como símbolo de la soberanía económica nacional."
            ]
          }
        ]
      },
      {
        "key": "educacion_socialista",
        "name": "Educación Socialista",
        "short_description": "Análisis de la política educativa cardenista.",
        "sub_topics": [
          {
            "key": "reforma_articulo_3",
            "name": "Reforma al Artículo 3° Constitucional",
            "short_description": "Comprender el cambio hacia educación socialista.",
            "example_tasks": [
              "Describir la reforma de 1934 que establecía la educación socialista.",
              "Analizar el contenido: educación basada en racionalismo científico, combate a fanatismos.",
              "Explicar la oposición conservadora y católica a esta reforma."
            ]
          },
          {
            "key": "expansion_educativa",
            "name": "Expansión de la Educación Rural",
            "short_description": "Estudiar los esfuerzos de alfabetización y escolarización.",
            "example_tasks": [
              "Describir la construcción masiva de escuelas rurales.",
              "Analizar las misiones culturales y la educación indígena.",
              "Explicar la capacitación de maestros rurales como agentes de cambio social."
            ]
          }
        ]
      },
      {
        "key": "politica_exterior_cardenas",
        "name": "Política Exterior Cardenista",
        "short_description": "Análisis de la postura internacional de México.",
        "sub_topics": [
          {
            "key": "doctrina_estrada",
            "name": "Aplicación de la Doctrina Estrada",
            "short_description": "Comprender el principio de no intervención.",
            "example_tasks": [
              "Explicar la Doctrina Estrada: no reconocimiento/desconocimiento de gobiernos, solo mantener o romper relaciones.",
              "Analizar cómo esta doctrina protegía la soberanía de países débiles.",
              "Describir la aplicación en relaciones con América Latina."
            ]
          },
          {
            "key": "apoyo_republica_española",
            "name": "Apoyo a la República Española",
            "short_description": "Estudiar la solidaridad con España en la Guerra Civil.",
            "example_tasks": [
              "Describir el apoyo de Cárdenas a la República Española contra Franco (1936-1939).",
              "Analizar el envío de armas y la acogida de refugiados españoles (aproximadamente 25,000).",
              "Explicar la contribución cultural e intelectual del exilio español en México."
            ]
          },
          {
            "key": "asilo_trotsky",
            "name": "Asilo a León Trotsky",
            "short_description": "Comprender la política de asilo político.",
            "example_tasks": [
              "Describir la concesión de asilo a Trotsky en 1937, perseguido por Stalin.",
              "Analizar la controversia: críticas de comunistas mexicanos, apoyo de intelectuales.",
              "Explicar el asesinato de Trotsky en 1940 y sus implicaciones."
            ]
          }
        ]
      },
      {
        "key": "sucesion_1940",
        "name": "Sucesión de 1940",
        "short_description": "Análisis de la transición al gobierno de Ávila Camacho.",
        "sub_topics": [
          {
            "key": "candidaturas_1940",
            "name": "Proceso Sucesorio",
            "short_description": "Comprender la elección presidencial.",
            "example_tasks": [
              "Describir la designación de Manuel Ávila Camacho como candidato oficial.",
              "Analizar la candidatura opositora de Juan Andrew Almazán.",
              "Explicar las acusaciones de fraude y la tensión poselectoral."
            ]
          },
          {
            "key": "legado_cardenas",
            "name": "Legado del Cardenismo",
            "short_description": "Evaluar el impacto histórico del gobierno de Cárdenas.",
            "example_tasks": [
              "Analizar las transformaciones estructurales: reforma agraria, nacionalización petrolera, fortalecimiento estatal.",
              "Explicar la consolidación del sistema político posrevolucionario.",
              "Describir a Cárdenas como el presidente más querido del siglo XX mexicano."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "mexico_segunda_mitad_siglo_xx",
    "name": "México en la Segunda Mitad del Siglo XX",
    "short_description": "Estudio del periodo de estabilidad política y desarrollo económico conocido como 'Milagro Mexicano', seguido por crisis económicas, movimientos sociales, y transformaciones políticas que llevaron a la apertura democrática.",
    "sub_topics": [
      {
        "key": "unidad_nacional_alemanismo",
        "name": "Unidad Nacional y Alemanismo (1940-1952)",
        "short_description": "Análisis de la consolidación del régimen y el inicio del desarrollo industrial.",
        "sub_topics": [
          {
            "key": "gobierno_avila_camacho",
            "name": "Gobierno de Manuel Ávila Camacho (1940-1946)",
            "short_description": "Comprender el giro moderado después del cardenismo.",
            "example_tasks": [
              "Describir la política de 'Unidad Nacional' que buscaba conciliar a todos los sectores.",
              "Analizar el alejamiento de las políticas radicales cardenistas y acercamiento a la Iglesia.",
              "Explicar la participación de México en la Segunda Guerra Mundial al lado de los Aliados (1942)."
            ]
          },
          {
            "key": "segunda_guerra_mundial_mexico",
            "name": "México en la Segunda Guerra Mundial",
            "short_description": "Estudiar la participación mexicana en el conflicto global.",
            "example_tasks": [
              "Describir el hundimiento de barcos petroleros mexicanos por submarinos alemanes.",
              "Analizar la declaración de guerra de México a las potencias del Eje (mayo 1942).",
              "Explicar la participación del Escuadrón 201 en el Pacífico y el impacto económico de la guerra."
            ]
          },
          {
            "key": "industrializacion_sustitucion",
            "name": "Inicio de la Industrialización por Sustitución de Importaciones",
            "short_description": "Comprender el modelo económico adoptado.",
            "example_tasks": [
              "Explicar el modelo de sustitución de importaciones: producir internamente lo que antes se importaba.",
              "Analizar el crecimiento industrial durante la guerra por demanda externa.",
              "Describir el proteccionismo comercial y el apoyo estatal a la industria."
            ]
          },
          {
            "key": "gobierno_aleman",
            "name": "Gobierno de Miguel Alemán Valdés (1946-1952)",
            "short_description": "Estudiar el primer presidente civil posrevolucionario.",
            "example_tasks": [
              "Describir la orientación pro-empresarial y modernizadora de Alemán.",
              "Analizar grandes obras de infraestructura: Ciudad Universitaria, carreteras, presas.",
              "Explicar la corrupción y el enriquecimiento de funcionarios durante su gobierno."
            ]
          },
          {
            "key": "transformacion_pri",
            "name": "Transformación del PRM en PRI",
            "short_description": "Comprender la reestructuración del partido oficial.",
            "example_tasks": [
              "Describir la transformación en Partido Revolucionario Institucional (PRI) en 1946.",
              "Analizar la eliminación del sector militar y el predominio de sectores obrero, campesino y popular.",
              "Explicar la consolidación del PRI como instrumento de control político."
            ]
          }
        ]
      },
      {
        "key": "desarrollo_estabilizador",
        "name": "Desarrollo Estabilizador (1952-1970)",
        "short_description": "Análisis del periodo de crecimiento económico sostenido con estabilidad de precios.",
        "sub_topics": [
          {
            "key": "milagro_mexicano",
            "name": "El 'Milagro Mexicano'",
            "short_description": "Comprender el periodo de crecimiento económico acelerado.",
            "example_tasks": [
              "Cuantificar el crecimiento: promedio de 6-7% anual del PIB durante dos décadas.",
              "Analizar sectores de crecimiento: industria manufacturera, construcción, servicios.",
              "Explicar factores: estabilidad política, proteccionismo, inversión pública, mercado interno creciente."
            ]
          },
          {
            "key": "politica_ortiz_mena",
            "name": "Política Económica de Antonio Ortiz Mena",
            "short_description": "Estudiar la gestión del secretario de Hacienda que dirigió el modelo.",
            "example_tasks": [
              "Describir la estabilidad cambiaria: tipo de cambio fijo de 12.50 pesos por dólar.",
              "Analizar el equilibrio fiscal y control de inflación.",
              "Explicar las críticas: concentración de riqueza, abandono del campo, desigualdad creciente."
            ]
          },
          {
            "key": "ruiz_cortines_lopez_mateos",
            "name": "Gobiernos de Ruiz Cortines y López Mateos",
            "short_description": "Comprender los gobiernos del auge económico.",
            "example_tasks": [
              "Describir el gobierno austero de Adolfo Ruiz Cortines (1952-1958) y el voto femenino (1953).",
              "Analizar el gobierno de Adolfo López Mateos (1958-1964): 'desarrollo con justicia social', nacionalización de la industria eléctrica.",
              "Explicar el equilibrio entre retórica revolucionaria y política pro-empresarial."
            ]
          },
          {
            "key": "represion_movimientos",
            "name": "Represión de Movimientos Sociales",
            "short_description": "Estudiar el autoritarismo bajo la estabilidad aparente.",
            "example_tasks": [
              "Describir la represión del movimiento ferrocarrilero de Demetrio Vallejo (1958-1959).",
              "Analizar el encarcelamiento de líderes sindicales independientes.",
              "Explicar el control corporativo de sindicatos y organizaciones sociales."
            ]
          }
        ]
      },
      {
        "key": "movimiento_1968",
        "name": "Movimiento Estudiantil de 1968",
        "short_description": "Análisis del movimiento social más importante del siglo XX mexicano y su represión.",
        "sub_topics": [
          {
            "key": "gobierno_diaz_ordaz",
            "name": "Gobierno de Gustavo Díaz Ordaz",
            "short_description": "Comprender el contexto político del movimiento.",
            "example_tasks": [
              "Describir el autoritarismo y conservadurismo de Díaz Ordaz (1964-1970).",
              "Analizar la preparación de los Juegos Olímpicos de México 1968.",
              "Explicar la intolerancia del gobierno ante la disidencia."
            ]
          },
          {
            "key": "surgimiento_movimiento",
            "name": "Surgimiento del Movimiento Estudiantil",
            "short_description": "Estudiar el origen y desarrollo del movimiento.",
            "example_tasks": [
              "Describir los incidentes de julio de 1968 entre estudiantes y policía que desencadenaron el movimiento.",
              "Analizar la formación del Consejo Nacional de Huelga (CNH) que unificó a universidades.",
              "Explicar las demandas: libertad de presos políticos, derogación del delito de disolución social, diálogo público."
            ]
          },
          {
            "key": "desarrollo_movimiento",
            "name": "Desarrollo del Movimiento",
            "short_description": "Comprender la expansión y radicalización.",
            "example_tasks": [
              "Describir las marchas masivas de agosto-septiembre con cientos de miles de participantes.",
              "Analizar el apoyo social: profesores, obreros, clases medias urbanas.",
              "Explicar la influencia del contexto internacional: Mayo Francés, Primavera de Praga, movimientos contraculturales."
            ]
          },
          {
            "key": "masacre_tlatelolco",
            "name": "Masacre de Tlatelolco (2 de octubre de 1968)",
            "short_description": "Estudiar la represión violenta del movimiento.",
            "example_tasks": [
              "Describir el mitin en la Plaza de las Tres Culturas y la intervención militar.",
              "Analizar las versiones oficiales vs testimonios sobre el número de muertos (gobierno: 30, testimonios: 300-400).",
              "Explicar el encubrimiento y la impunidad: responsabilidad de Díaz Ordaz y Luis Echeverría."
            ]
          },
          {
            "key": "consecuencias_1968",
            "name": "Consecuencias del Movimiento de 1968",
            "short_description": "Evaluar el impacto histórico.",
            "example_tasks": [
              "Analizar el quiebre de legitimidad del sistema político priista.",
              "Explicar el surgimiento de movimientos guerrilleros (Liga 23 de Septiembre, Partido de los Pobres).",
              "Describir el cuestionamiento de la 'familia revolucionaria' y demanda de democratización."
            ]
          }
        ]
      },
      {
        "key": "crisis_decada_perdida",
        "name": "Crisis Económicas y la 'Década Perdida'",
        "short_description": "Análisis del agotamiento del modelo de desarrollo y las crisis económicas.",
        "sub_topics": [
          {
            "key": "gobierno_echeverria",
            "name": "Gobierno de Luis Echeverría (1970-1976)",
            "short_description": "Comprender el intento de legitimación mediante populismo.",
            "example_tasks": [
              "Describir la 'apertura democrática' y el intento de distanciarse de Díaz Ordaz.",
              "Analizar el gasto público expansivo y la 'economía mixta' con intervención estatal.",
              "Explicar la matanza del Jueves de Corpus (10 de junio de 1971) y la continuidad represiva."
            ]
          },
          {
            "key": "auge_petrolero_lopez_portillo",
            "name": "Auge Petrolero y Gobierno de López Portillo",
            "short_description": "Estudiar el boom y colapso petrolero.",
            "example_tasks": [
              "Describir el descubrimiento de enormes reservas petroleras y el optimismo ('administrar la abundancia').",
              "Analizar el endeudamiento externo masivo basado en expectativas petroleras.",
              "Explicar la caída de precios del petróleo en 1981 y el inicio de la crisis."
            ]
          },
          {
            "key": "crisis_1982",
            "name": "Crisis de 1982",
            "short_description": "Comprender el colapso económico más grave del siglo.",
            "example_tasks": [
              "Describir la fuga de capitales, agotamiento de reservas, insolvencia para pagar deuda.",
              "Analizar la nacionalización de la banca por López Portillo (septiembre 1982).",
              "Explicar las consecuencias: devaluación, inflación, caída del salario real, desempleo."
            ]
          },
          {
            "key": "decada_perdida",
            "name": "La 'Década Perdida' de los Ochenta",
            "short_description": "Estudiar el estancamiento económico prolongado.",
            "example_tasks": [
              "Analizar el crecimiento económico nulo o negativo durante la década de 1980.",
              "Describir la crisis de deuda latinoamericana y los programas de ajuste del FMI.",
              "Explicar el deterioro del nivel de vida y el aumento de la pobreza."
            ]
          },
          {
            "key": "terremoto_1985",
            "name": "Terremoto de 1985 y Organización Civil",
            "short_description": "Comprender el desastre natural y la respuesta social.",
            "example_tasks": [
              "Describir el terremoto del 19 de septiembre de 1985 y sus devastadores efectos en la Ciudad de México.",
              "Analizar la ineficacia gubernamental y la autoorganización de la sociedad civil.",
              "Explicar cómo este evento fortaleció a la sociedad civil organizada."
            ]
          }
        ]
      },
      {
        "key": "neoliberalismo_apertura",
        "name": "Giro Neoliberal y Apertura Política",
        "short_description": "Análisis del cambio de modelo económico y la gradual democratización.",
        "sub_topics": [
          {
            "key": "gobierno_salinas",
            "name": "Gobierno de Carlos Salinas de Gortari (1988-1994)",
            "short_description": "Comprender las reformas estructurales neoliberales.",
            "example_tasks": [
              "Describir la controvertida elección de 1988 y el fraude electoral ('caída del sistema').",
              "Analizar las reformas: privatizaciones masivas, apertura comercial, desregulación.",
              "Explicar la firma del Tratado de Libre Comercio de América del Norte (TLCAN/NAFTA) en 1992."
            ]
          },
          {
            "key": "levantamiento_zapatista",
            "name": "Levantamiento Zapatista de 1994",
            "short_description": "Estudiar la rebelión indígena en Chiapas.",
            "example_tasks": [
              "Describir el levantamiento del Ejército Zapatista de Liberación Nacional (EZLN) el 1 de enero de 1994.",
              "Analizar las demandas: tierra, trabajo, techo, alimentación, salud, educación, independencia, libertad, democracia, justicia, paz.",
              "Explicar el liderazgo del Subcomandante Marcos y el uso innovador de medios de comunicación."
            ]
          },
          {
            "key": "crisis_1994_efecto_tequila",
            "name": "Crisis de 1994 ('Efecto Tequila')",
            "short_description": "Comprender el colapso financiero de fin de sexenio.",
            "example_tasks": [
              "Describir la devaluación de diciembre de 1994 y sus causas (déficit, reservas agotadas).",
              "Analizar el rescate financiero estadounidense ('paquete Clinton').",
              "Explicar las consecuencias: crisis bancaria, cierre de empresas, caída de salarios."
            ]
          },
          {
            "key": "reformas_electorales",
            "name": "Reformas Electorales y Pluralismo",
            "short_description": "Estudiar la gradual apertura democrática.",
            "example_tasks": [
              "Describir las reformas electorales de 1977, 1990, 1996 que democratizaron el sistema.",
              "Analizar la creación del Instituto Federal Electoral (IFE) autónomo.",
              "Explicar el crecimiento de partidos opositores: PAN (derecha), PRD (izquierda)."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "mexico_contemporaneo",
    "name": "México Contemporáneo",
    "short_description": "Estudio de la transición democrática, la alternancia en el poder, los retos de seguridad pública, la violencia del narcotráfico, y los desafíos económicos y sociales del México del siglo XXI.",
    "sub_topics": [
      {
        "key": "alternancia_democratica",
        "name": "Alternancia Democrática",
        "short_description": "Análisis del fin del régimen de partido hegemónico.",
        "sub_topics": [
          {
            "key": "eleccion_2000",
            "name": "Elección del 2000 y Gobierno de Vicente Fox",
            "short_description": "Comprender la primera alternancia después de 71 años de PRI.",
            "example_tasks": [
              "Describir la elección de Vicente Fox del PAN derrotando al PRI (julio 2000).",
              "Analizar el optimismo inicial y las expectativas de cambio ('Ya ganamos').",
              "Explicar las limitaciones: gobierno dividido, falta de reformas estructurales, decepción."
            ]
          },
          {
            "key": "gobierno_calderon",
            "name": "Gobierno de Felipe Calderón (2006-2012)",
            "short_description": "Estudiar la 'guerra contra el narcotráfico' y sus consecuencias.",
            "example_tasks": [
              "Describir la elección controvertida de 2006 con margen mínimo sobre López Obrador.",
              "Analizar la estrategia de militarización contra el crimen organizado.",
              "Explicar el incremento dramático de la violencia: más de 60,000 muertes relacionadas con el narco."
            ]
          },
          {
            "key": "retorno_pri_peña",
            "name": "Retorno del PRI con Enrique Peña Nieto (2012-2018)",
            "short_description": "Comprender el regreso del PRI al poder.",
            "example_tasks": [
              "Describir la elección de Peña Nieto con promesas de reformas y 'Pacto por México'.",
              "Analizar las reformas estructurales: energética, educativa, telecomunicaciones, laboral.",
              "Explicar escándalos de corrupción: Casa Blanca, ayotzinapa, y desprestigio del gobierno."
            ]
          }
        ]
      },
      {
        "key": "violencia_seguridad",
        "name": "Violencia y Crisis de Seguridad",
        "short_description": "Análisis del problema de inseguridad pública y crimen organizado.",
        "sub_topics": [
          {
            "key": "narcotrafico_carteles",
            "name": "Narcotráfico y Carteles",
            "short_description": "Comprender la evolución del crimen organizado.",
            "example_tasks": [
              "Describir el surgimiento y fragmentación de carteles: Sinaloa, Golfo, Zetas, Jalisco Nueva Generación.",
              "Analizar la violencia entre carteles y contra autoridades.",
              "Explicar la penetración del crimen organizado en instituciones estatales."
            ]
          },
          {
            "key": "ayotzinapa",
            "name": "Caso Ayotzinapa (2014)",
            "short_description": "Estudiar la desaparición de los 43 estudiantes normalistas.",
            "example_tasks": [
              "Describir la desaparición forzada de 43 estudiantes de Ayotzinapa en Iguala, Guerrero.",
              "Analizar la 'verdad histórica' del gobierno vs investigaciones independientes.",
              "Explicar el impacto: cuestionamiento del Estado de derecho, movimiento 'Fue el Estado'."
            ]
          },
          {
            "key": "feminicidios_violencia_genero",
            "name": "Feminicidios y Violencia de Género",
            "short_description": "Comprender la crisis de violencia contra las mujeres.",
            "example_tasks": [
              "Analizar las tasas alarmantes de feminicidios en México.",
              "Describir movimientos como #NiUnaMenos y protestas feministas.",
              "Explicar la impunidad y falta de acceso a la justicia para víctimas."
            ]
          }
        ]
      },
      {
        "key": "retos_economicos_sociales",
        "name": "Retos Económicos y Sociales",
        "short_description": "Análisis de los desafíos estructurales del país.",
        "sub_topics": [
          {
            "key": "desigualdad_pobreza",
            "name": "Desigualdad y Pobreza",
            "short_description": "Comprender la persistencia de la desigualdad social.",
            "example_tasks": [
              "Analizar los índices de desigualdad: México como uno de los países más desiguales de la OCDE.",
              "Describir las dimensiones de la pobreza: aproximadamente 40% de la población.",
              "Explicar los retos de movilidad social y concentración de riqueza."
            ]
          },
          {
            "key": "migracion",
            "name": "Migración",
            "short_description": "Estudiar los flujos migratorios desde y hacia México.",
            "example_tasks": [
              "Describir la migración mexicana hacia Estados Unidos y su importancia económica (remesas).",
              "Analizar a México como país de tránsito para migrantes centroamericanos.",
              "Explicar las políticas migratorias estadounidenses y su impacto en México."
            ]
          },
          {
            "key": "reforma_energetica_controversias",
            "name": "Reforma Energética y Controversias",
            "short_description": "Comprender los debates sobre la apertura del sector energético.",
            "example_tasks": [
              "Describir la reforma energética de 2013 que permitió inversión privada en petróleo y electricidad.",
              "Analizar argumentos a favor: inversión, tecnología, eficiencia.",
              "Explicar oposición: pérdida de soberanía energética, privatización encubierta de PEMEX."
            ]
          }
        ]
      },
      {
        "key": "mexico_siglo_xxi",
        "name": "México en el Siglo XXI",
        "short_description": "Análisis de la situación actual y perspectivas futuras.",
        "sub_topics": [
          {
            "key": "cuarta_transformacion",
            "name": "La 'Cuarta Transformación'",
            "short_description": "Comprender el proyecto político actual (2018-presente).",
            "example_tasks": [
              "Describir la elección de Andrés Manuel López Obrador en 2018 y su proyecto de transformación.",
              "Analizar políticas emblemáticas: programas sociales, austeridad, combate a corrupción.",
              "Explicar polarización política y debates sobre el rumbo del país."
            ]
          },
          {
            "key": "pandemia_covid19",
            "name": "Pandemia de COVID-19",
            "short_description": "Estudiar el impacto de la crisis sanitaria.",
            "example_tasks": [
              "Describir el impacto sanitario: altas tasas de mortalidad, colapso de sistemas de salud.",
              "Analizar las consecuencias económicas: cierre de empresas, pérdida de empleos.",
              "Explicar la estrategia gubernamental y las controversias sobre su manejo."
            ]
          },
          {
            "key": "retos_futuro",
            "name": "Retos y Perspectivas Futuras",
            "short_description": "Comprender los desafíos del México contemporáneo.",
            "example_tasks": [
              "Analizar retos estructurales: Estado de derecho, combate a corrupción, desarrollo económico incluyente.",
              "Describir transformaciones sociales: empoderamiento juvenil, movimientos feministas, conciencia ambiental.",
              "Explicar debates sobre el futuro: modelos de desarrollo, democracia, justicia social."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "civilizaciones_antiguas_mundo",
    "name": "Civilizaciones Antiguas del Mundo",
    "short_description": "Estudio de las primeras civilizaciones de la humanidad en diferentes regiones del mundo, analizando sus características políticas, sociales, económicas, culturales y religiosas, así como sus aportes al desarrollo humano.",
    "sub_topics": [
      {
        "key": "mesopotamia_creciente_fertil",
        "name": "Mesopotamia y la Creciente Fértil",
        "short_description": "Análisis de las civilizaciones que surgieron entre los ríos Tigris y Éufrates.",
        "sub_topics": [
          {
            "key": "sumerios",
            "name": "Los Sumerios: Primera Civilización",
            "short_description": "Comprender el surgimiento de la civilización en Mesopotamia.",
            "example_tasks": [
              "Describir las ciudades-estado sumerias (Ur, Uruk, Lagash) y su organización política.",
              "Analizar los aportes sumerios: escritura cuneiforme, rueda, sistema sexagesimal, zigurat.",
              "Explicar la religión politeísta sumeria y el papel de los sacerdotes."
            ]
          },
          {
            "key": "imperios_mesopotamicos",
            "name": "Imperios Mesopotamicos: Acadio, Babilónico, Asirio",
            "short_description": "Estudiar los grandes imperios que dominaron Mesopotamia.",
            "example_tasks": [
              "Describir el Imperio Acadio de Sargón: primer gran imperio de la historia.",
              "Analizar el Imperio Babilónico de Hammurabi y su código de leyes.",
              "Explicar el Imperio Asirio: militarismo, expansión, biblioteca de Nínive."
            ]
          },
          {
            "key": "persas",
            "name": "El Imperio Persa",
            "short_description": "Comprender la organización del primer gran imperio multiétnico.",
            "example_tasks": [
              "Describir la expansión persa bajo Ciro el Grande y Darío I.",
              "Analizar la administración: satrapías, sistema de correos, tolerancia religiosa.",
              "Explicar el zoroastrismo como religión oficial persa."
            ]
          }
        ]
      },
      {
        "key": "antiguo_egipto",
        "name": "Antiguo Egipto",
        "short_description": "Estudio de la civilización egipcia a lo largo del Nilo.",
        "sub_topics": [
          {
            "key": "periodos_egipcios",
            "name": "Periodización del Antiguo Egipto",
            "short_description": "Comprender las etapas de la civilización egipcia.",
            "example_tasks": [
              "Describir las divisiones: Reino Antiguo, Medio, Nuevo, y periodos intermedios.",
              "Analizar características de cada periodo: construcción de pirámides (Antiguo), expansión (Nuevo).",
              "Explicar la unificación del Alto y Bajo Egipto bajo Narmer."
            ]
          },
          {
            "key": "faraon_sociedad",
            "name": "El Faraón y la Sociedad Egipcia",
            "short_description": "Estudiar la organización política y social egipcia.",
            "example_tasks": [
              "Describir el poder teocrático del faraón como dios viviente.",
              "Analizar la jerarquía social: sacerdotes, escribas, artesanos, campesinos, esclavos.",
              "Explicar el papel de los escribas y la importancia de la escritura jeroglífica."
            ]
          },
          {
            "key": "religion_muerte_egipcia",
            "name": "Religión y Culto a la Muerte",
            "short_description": "Comprender las creencias religiosas egipcias.",
            "example_tasks": [
              "Describir el panteón egipcio: Ra, Osiris, Isis, Anubis, Horus.",
              "Analizar las prácticas funerarias: momificación, tumbas, Libro de los Muertos.",
              "Explicar la construcción de pirámides como tumbas monumentales de faraones."
            ]
          },
          {
            "key": "aportes_egipcios",
            "name": "Aportes Culturales Egipcios",
            "short_description": "Estudiar las contribuciones egipcias a la civilización.",
            "example_tasks": [
              "Describir avances en medicina: cirugía, momificación, conocimiento anatómico.",
              "Analizar los logros en matemáticas y astronomía: calendario solar, geometría.",
              "Explicar el arte y arquitectura egipcias: templos, estatuas colosales, relieves."
            ]
          }
        ]
      },
      {
        "key": "civilizacion_griega",
        "name": "Civilización Griega",
        "short_description": "Análisis de la cultura que sentó las bases del pensamiento occidental.",
        "sub_topics": [
          {
            "key": "polis_griega",
            "name": "La Polis Griega",
            "short_description": "Comprender la organización política de las ciudades-estado griegas.",
            "example_tasks": [
              "Describir el concepto de polis como ciudad-estado independiente.",
              "Analizar las principales polis: Atenas (democracia), Esparta (oligarquía militar).",
              "Explicar la vida ciudadana: participación política, identidad cívica, exclusiones (mujeres, esclavos)."
            ]
          },
          {
            "key": "democracia_ateniense",
            "name": "Democracia Ateniense",
            "short_description": "Estudiar el origen de la democracia occidental.",
            "example_tasks": [
              "Describir las reformas de Solón, Clístenes y Pericles hacia la democracia.",
              "Analizar las instituciones: Asamblea (Ekklesia), Consejo de los 500 (Boulé), tribunales populares.",
              "Explicar las limitaciones: democracia directa solo para ciudadanos varones, exclusión de mujeres, metecos y esclavos."
            ]
          },
          {
            "key": "guerras_medicas_peloponeso",
            "name": "Guerras Médicas y del Peloponeso",
            "short_description": "Comprender los conflictos que marcaron la historia griega.",
            "example_tasks": [
              "Describir las Guerras Médicas contra Persia: batallas de Maratón, Termópilas, Salamina.",
              "Analizar la Guerra del Peloponeso entre Atenas y Esparta y sus consecuencias.",
              "Explicar cómo estos conflictos llevaron a la decadencia de las polis."
            ]
          },
          {
            "key": "imperio_alejandro",
            "name": "Alejandro Magno y el Helenismo",
            "short_description": "Estudiar la expansión macedonia y la difusión de la cultura griega.",
            "example_tasks": [
              "Describir las conquistas de Alejandro Magno: desde Grecia hasta India.",
              "Analizar el periodo helenístico: fusión de cultura griega con orientales.",
              "Explicar ciudades helenísticas como Alejandría y su importancia cultural."
            ]
          },
          {
            "key": "legado_cultural_griego",
            "name": "Legado Cultural Griego",
            "short_description": "Comprender las aportaciones griegas a la civilización occidental.",
            "example_tasks": [
              "Describir la filosofía griega: Sócrates, Platón, Aristóteles y sus aportes al pensamiento.",
              "Analizar el teatro griego: tragedia (Sófocles, Eurípides) y comedia (Aristófanes).",
              "Explicar las artes y ciencias: Partenón, escultura clásica, matemáticas (Pitágoras, Euclides), medicina (Hipócrates)."
            ]
          }
        ]
      },
      {
        "key": "imperio_romano",
        "name": "Imperio Romano",
        "short_description": "Estudio de la civilización que dominó el Mediterráneo y sentó las bases del derecho occidental.",
        "sub_topics": [
          {
            "key": "republica_romana",
            "name": "La República Romana",
            "short_description": "Comprender la organización política republicana.",
            "example_tasks": [
              "Describir las instituciones: Senado, cónsules, tribunos de la plebe, asambleas.",
              "Analizar la expansión romana por la península itálica y el Mediterráneo.",
              "Explicar las Guerras Púnicas contra Cartago y el dominio del Mediterráneo."
            ]
          },
          {
            "key": "crisis_republica",
            "name": "Crisis de la República",
            "short_description": "Estudiar la transformación de República a Imperio.",
            "example_tasks": [
              "Describir las guerras civiles y el primer triunvirato (Pompeyo, Craso, César).",
              "Analizar el gobierno de Julio César y su asesinato.",
              "Explicar el segundo triunvirato y la victoria de Octavio Augusto."
            ]
          },
          {
            "key": "alto_imperio",
            "name": "El Alto Imperio",
            "short_description": "Comprender la época de esplendor romano.",
            "example_tasks": [
              "Describir la Pax Romana bajo Augusto y los emperadores julioclaudios y flavios.",
              "Analizar la máxima expansión territorial bajo Trajano.",
              "Explicar la romanización: difusión de lengua latina, derecho romano, urbanización."
            ]
          },
          {
            "key": "cristianismo_romano",
            "name": "Surgimiento y Expansión del Cristianismo",
            "short_description": "Estudiar la nueva religión que transformaría el imperio.",
            "example_tasks": [
              "Describir el contexto histórico del nacimiento de Jesús y el cristianismo primitivo.",
              "Analizar las persecuciones cristianas y el martirio.",
              "Explicar el Edicto de Milán (313) y el Concilio de Nicea (325): cristianismo como religión oficial."
            ]
          },
          {
            "key": "caida_imperio_romano",
            "name": "Caída del Imperio Romano de Occidente",
            "short_description": "Comprender las causas del colapso del imperio occidental.",
            "example_tasks": [
              "Describir la división del imperio en Oriente y Occidente (395).",
              "Analizar causas de la caída: invasiones bárbaras, crisis económica, inestabilidad política, cristianización.",
              "Explicar la deposición del último emperador Rómulo Augústulo (476) como fin simbólico."
            ]
          },
          {
            "key": "legado_romano",
            "name": "Legado Romano",
            "short_description": "Estudiar las aportaciones romanas a la civilización occidental.",
            "example_tasks": [
              "Describir el derecho romano: códigos, principios jurídicos que perviven hoy.",
              "Analizar la ingeniería romana: acueductos, calzadas, puentes, arquitectura (Coliseo, Panteón).",
              "Explicar la lengua latina como base de las lenguas romances."
            ]
          }
        ]
      },
      {
        "key": "civilizaciones_asiaticas",
        "name": "Civilizaciones de Asia",
        "short_description": "Análisis de las grandes civilizaciones de Oriente.",
        "sub_topics": [
          {
            "key": "india_antigua",
            "name": "India Antigua",
            "short_description": "Comprender las civilizaciones del valle del Indo y posteriores.",
            "example_tasks": [
              "Describir la civilización del valle del Indo: Mohenjo-Daro, Harappa.",
              "Analizar el sistema de castas y su influencia en la sociedad.",
              "Explicar el hinduismo y el budismo: origen, creencias, expansión."
            ]
          },
          {
            "key": "china_antigua",
            "name": "China Antigua",
            "short_description": "Estudiar las dinastías chinas y sus aportes.",
            "example_tasks": [
              "Describir las dinastías Shang, Zhou, Qin y Han.",
              "Analizar la construcción de la Gran Muralla y la unificación bajo Qin Shi Huang.",
              "Explicar el confucianismo, taoísmo y legismo como filosofías chinas, y los inventos: papel, pólvora, brújula, imprenta."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "edad_media_europea",
    "name": "Edad Media Europea",
    "short_description": "Estudio del periodo medieval europeo (siglos V-XV), incluyendo el feudalismo, el papel de la Iglesia, el Islam, el Imperio Bizantino, y las transformaciones que prepararon el camino hacia la modernidad.",
    "sub_topics": [
      {
        "key": "alta_edad_media",
        "name": "Alta Edad Media (siglos V-X)",
        "short_description": "Análisis del periodo de formación de la Europa medieval.",
        "sub_topics": [
          {
            "key": "reinos_germanicos",
            "name": "Reinos Germánicos",
            "short_description": "Comprender la fragmentación política tras la caída de Roma.",
            "example_tasks": [
              "Describir los principales reinos germánicos: visigodos, francos, ostrogodos, anglosajones.",
              "Analizar la fusión de elementos romanos y germánicos en estos reinos.",
              "Explicar la conversión de los bárbaros al cristianismo."
            ]
          },
          {
            "key": "imperio_carolingio",
            "name": "Imperio Carolingio",
            "short_description": "Estudiar el intento de restaurar el imperio en Occidente.",
            "example_tasks": [
              "Describir la expansión franca bajo Carlomagno y su coronación como emperador (800).",
              "Analizar el Renacimiento Carolingio: recuperación cultural, escuelas palatinas.",
              "Explicar la división del imperio en el Tratado de Verdún (843) y sus consecuencias."
            ]
          },
          {
            "key": "sistema_feudal",
            "name": "El Sistema Feudal",
            "short_description": "Comprender la organización social, política y económica medieval.",
            "example_tasks": [
              "Describir la estructura feudal: señor-vasallo, feudo, obligaciones mutuas.",
              "Analizar la sociedad estamental: nobleza, clero, campesinos (siervos).",
              "Explicar la economía agraria y autosuficiente del feudo."
            ]
          }
        ]
      },
      {
        "key": "iglesia_medieval",
        "name": "La Iglesia en la Edad Media",
        "short_description": "Análisis del poder temporal y espiritual de la Iglesia católica.",
        "sub_topics": [
          {
            "key": "organizacion_eclesiastica",
            "name": "Organización y Poder de la Iglesia",
            "short_description": "Comprender la estructura y autoridad eclesiástica.",
            "example_tasks": [
              "Describir la jerarquía eclesiástica: Papa, obispos, clero regular y secular.",
              "Analizar el poder económico de la Iglesia: diezmos, propiedades territoriales.",
              "Explicar las disputas entre poder papal y poder real (Querella de las Investiduras)."
            ]
          },
          {
            "key": "monacato_ordenes",
            "name": "Monacato y Órdenes Religiosas",
            "short_description": "Estudiar la vida monástica y su influencia cultural.",
            "example_tasks": [
              "Describir la Regla de San Benito y la vida en los monasterios.",
              "Analizar el papel de los monasterios: conservación del conocimiento, agricultura, hospitales.",
              "Explicar el surgimiento de órdenes mendicantes: franciscanos, dominicos."
            ]
          },
          {
            "key": "cruzadas",
            "name": "Las Cruzadas",
            "short_description": "Comprender las expediciones militares cristianas a Tierra Santa.",
            "example_tasks": [
              "Describir el contexto: llamado del Papa Urbano II en 1095.",
              "Analizar las principales cruzadas (1095-1291) y sus resultados militares.",
              "Explicar las consecuencias: contacto cultural con Oriente, debilitamiento del feudalismo, comercio."
            ]
          }
        ]
      },
      {
        "key": "islam_medieval",
        "name": "El Islam y su Expansión",
        "short_description": "Estudio del surgimiento y desarrollo de la civilización islámica.",
        "sub_topics": [
          {
            "key": "mahoma_islam",
            "name": "Mahoma y el Nacimiento del Islam",
            "short_description": "Comprender el origen de la religión musulmana.",
            "example_tasks": [
              "Describir la vida de Mahoma y la revelación del Corán.",
              "Analizar los Cinco Pilares del Islam y las creencias fundamentales.",
              "Explicar la Hégira (622) y la expansión inicial desde La Meca."
            ]
          },
          {
            "key": "expansion_islamica",
            "name": "Expansión del Islam",
            "short_description": "Estudiar la rápida conquista musulmana.",
            "example_tasks": [
              "Describir la expansión bajo los califas: Península Arábiga, norte de África, Península Ibérica, Persia.",
              "Analizar los califatos: Omeya (Damasco), Abasí (Bagdad).",
              "Explicar la batalla de Poitiers (732) como límite de expansión en Europa occidental."
            ]
          },
          {
            "key": "cultura_islamica",
            "name": "Civilización Islámica Medieval",
            "short_description": "Comprender los aportes culturales del mundo musulmán.",
            "example_tasks": [
              "Describir la Edad de Oro islámica: ciencia, filosofía, literatura.",
              "Analizar aportes: álgebra, medicina (Avicena), filosofía (Averroes), traducción de textos clásicos.",
              "Explicar Al-Ándalus como ejemplo de convivencia entre musulmanes, cristianos y judíos."
            ]
          }
        ]
      },
      {
        "key": "imperio_bizantino",
        "name": "Imperio Bizantino",
        "short_description": "Análisis de la continuidad del Imperio Romano de Oriente.",
        "sub_topics": [
          {
            "key": "constantinopla_justiniano",
            "name": "Constantinopla y Justiniano",
            "short_description": "Comprender el esplendor bizantino.",
            "example_tasks": [
              "Describir Constantinopla como centro político, económico y cultural.",
              "Analizar el reinado de Justiniano: reconquistas, Código Justiniano, construcción de Santa Sofía.",
              "Explicar la importancia de Bizancio como puente entre Oriente y Occidente."
            ]
          },
          {
            "key": "cisma_oriente",
            "name": "Cisma de Oriente",
            "short_description": "Estudiar la división de la cristiandad.",
            "example_tasks": [
              "Describir las diferencias teológicas y políticas entre Roma y Constantinopla.",
              "Analizar el Gran Cisma de 1054: separación entre católicos y ortodoxos.",
              "Explicar las consecuencias de la división religiosa."
            ]
          },
          {
            "key": "caida_constantinopla",
            "name": "Caída de Constantinopla (1453)",
            "short_description": "Comprender el fin del Imperio Bizantino.",
            "example_tasks": [
              "Describir el asedio y conquista otomana de Constantinopla.",
              "Analizar las causas del colapso bizantino: debilitamiento, presión turca.",
              "Explicar las consecuencias: fin de la Edad Media, éxodo de intelectuales a Occidente, impulso al Renacimiento."
            ]
          }
        ]
      },
      {
        "key": "baja_edad_media",
        "name": "Baja Edad Media (siglos XI-XV)",
        "short_description": "Análisis de las transformaciones que cerraron el periodo medieval.",
        "sub_topics": [
          {
            "key": "renacimiento_urbano_comercial",
            "name": "Renacimiento Urbano y Comercial",
            "short_description": "Comprender el resurgimiento de las ciudades.",
            "example_tasks": [
              "Describir el crecimiento de ciudades y el surgimiento de la burguesía.",
              "Analizar el desarrollo del comercio: rutas mediterráneas, Liga Hanseática, ferias.",
              "Explicar la aparición de gremios artesanales y su organización."
            ]
          },
          {
            "key": "crisis_siglo_xiv",
            "name": "Crisis del Siglo XIV",
            "short_description": "Estudiar las calamidades que afectaron a Europa.",
            "example_tasks": [
              "Describir la Peste Negra (1347-1353): causas, propagación, mortandad (un tercio de la población).",
              "Analizar la Guerra de los Cien Años entre Inglaterra y Francia.",
              "Explicar las crisis económicas, hambrunas y revueltas campesinas."
            ]
          },
          {
            "key": "universidades_escolastica",
            "name": "Universidades y Escolástica",
            "short_description": "Comprender el desarrollo intelectual medieval.",
            "example_tasks": [
              "Describir el surgimiento de las universidades: Bolonia, París, Oxford, Salamanca.",
              "Analizar la escolástica: intento de conciliar fe y razón (Santo Tomás de Aquino).",
              "Explicar la recuperación de Aristóteles a través de traducciones árabes."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "renacimiento_humanismo",
    "name": "Renacimiento y Humanismo",
    "short_description": "Estudio del movimiento cultural que marcó el inicio de la Edad Moderna, caracterizado por el redescubrimiento de la cultura clásica, el antropocentrismo, los avances artísticos y científicos, y los cambios en la visión del mundo.",
    "sub_topics": [
      {
        "key": "origen_caracteristicas_renacimiento",
        "name": "Origen y Características del Renacimiento",
        "short_description": "Comprender el contexto y rasgos del movimiento renacentista.",
        "sub_topics": [
          {
            "key": "italia_cuna_renacimiento",
            "name": "Italia como Cuna del Renacimiento",
            "short_description": "Analizar por qué el Renacimiento surgió en Italia.",
            "example_tasks": [
              "Explicar factores: riqueza comercial, mecenazgo, legado romano, ciudades-estado (Florencia, Venecia).",
              "Describir el papel de la familia Médici como mecenas.",
              "Analizar la llegada de intelectuales bizantinos tras la caída de Constantinopla."
            ]
          },
          {
            "key": "humanismo",
            "name": "El Humanismo",
            "short_description": "Comprender la nueva visión del ser humano.",
            "example_tasks": [
              "Explicar el antropocentrismo: el ser humano como centro (vs teocentrismo medieval).",
              "Describir el estudio de humanidades: retórica, gramática, historia, poesía, filosofía moral.",
              "Analizar a humanistas como Petrarca, Erasmo de Rotterdam, Tomás Moro."
            ]
          }
        ]
      },
      {
        "key": "arte_renacentista",
        "name": "Arte Renacentista",
        "short_description": "Análisis de las innovaciones y obras maestras del arte renacentista.",
        "sub_topics": [
          {
            "key": "quattrocento",
            "name": "Quattrocento (Siglo XV)",
            "short_description": "Estudiar el Renacimiento temprano en Italia.",
            "example_tasks": [
              "Describir innovaciones: perspectiva lineal (Brunelleschi), realismo, anatomía.",
              "Analizar artistas: Botticelli ('El Nacimiento de Venus'), Donatello (escultura 'David').",
              "Explicar la arquitectura renacentista: cúpula de Florencia de Brunelleschi."
            ]
          },
          {
            "key": "cinquecento",
            "name": "Cinquecento (Siglo XVI)",
            "short_description": "Comprender el apogeo del Renacimiento.",
            "example_tasks": [
              "Analizar a Leonardo da Vinci: 'La Última Cena', 'La Gioconda', estudios científicos.",
              "Describir a Miguel Ángel: Capilla Sixtina, 'David', 'La Piedad'.",
              "Explicar a Rafael: 'La Escuela de Atenas', madonas, armonía clásica."
            ]
          },
          {
            "key": "renacimiento_norte_europa",
            "name": "Renacimiento en el Norte de Europa",
            "short_description": "Estudiar la expansión del Renacimiento fuera de Italia.",
            "example_tasks": [
              "Describir las características: mayor realismo, detalle minucioso, temas religiosos.",
              "Analizar artistas: Jan van Eyck (pintura al óleo), Alberto Durero (grabados).",
              "Explicar la fusión de elementos góticos y renacentistas."
            ]
          }
        ]
      },
      {
        "key": "literatura_renacimiento",
        "name": "Literatura del Renacimiento",
        "short_description": "Análisis de las obras literarias del periodo.",
        "sub_topics": [
          {
            "key": "literatura_italiana",
            "name": "Literatura Italiana",
            "short_description": "Comprender las obras fundamentales.",
            "example_tasks": [
              "Analizar 'La Divina Comedia' de Dante como puente entre Edad Media y Renacimiento.",
              "Describir 'El Decamerón' de Boccaccio: cuentos, humanismo.",
              "Explicar 'El Príncipe' de Maquiavelo: realismo político, razón de Estado."
            ]
          },
          {
            "key": "shakespeare",
            "name": "William Shakespeare",
            "short_description": "Estudiar al máximo exponente del teatro renacentista.",
            "example_tasks": [
              "Describir tragedias: 'Hamlet', 'Macbeth', 'Romeo y Julieta', 'Otelo'.",
              "Analizar comedias: 'Sueño de una Noche de Verano', 'La Tempestad'.",
              "Explicar la profundidad psicológica de sus personajes."
            ]
          },
          {
            "key": "cervantes",
            "name": "Miguel de Cervantes",
            "short_description": "Comprender la obra cumbre de la literatura española.",
            "example_tasks": [
              "Analizar 'Don Quijote de la Mancha': parodia de libros de caballerías, realismo, locura vs cordura.",
              "Explicar la modernidad de la novela cervantina.",
              "Describir otros personajes: Sancho Panza, Dulcinea."
            ]
          }
        ]
      },
      {
        "key": "revolucion_cientifica",
        "name": "Revolución Científica",
        "short_description": "Análisis de los cambios en el método y conocimiento científico.",
        "sub_topics": [
          {
            "key": "astronomia_copernico_galileo",
            "name": "Nueva Astronomía: Copérnico y Galileo",
            "short_description": "Comprender el cambio de cosmovisión.",
            "example_tasks": [
              "Explicar la teoría heliocéntrica de Copérnico que desplazó la geocéntrica ptolemaica.",
              "Describir las observaciones telescópicas de Galileo: lunas de Júpiter, fases de Venus.",
              "Analizar el conflicto con la Iglesia: proceso a Galileo, abjuración."
            ]
          },
          {
            "key": "metodo_cientifico",
            "name": "Desarrollo del Método Científico",
            "short_description": "Estudiar la nueva forma de conocer la naturaleza.",
            "example_tasks": [
              "Describir el método experimental de Francis Bacon: observación, hipótesis, experimentación.",
              "Analizar el racionalismo de Descartes: duda metódica, 'Pienso, luego existo'.",
              "Explicar la importancia de la matematización de la naturaleza."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "reforma_contrarreforma",
    "name": "Reforma Protestante y Contrarreforma",
    "short_description": "Estudio de la crisis religiosa que dividió a la cristiandad europea en el siglo XVI, las causas de la protesta contra Roma, el surgimiento de nuevas iglesias, y la respuesta católica.",
    "sub_topics": [
      {
        "key": "causas_reforma",
        "name": "Causas de la Reforma Protestante",
        "short_description": "Comprender los factores que motivaron la ruptura.",
        "sub_topics": [
          {
            "key": "corrupcion_iglesia",
            "name": "Crisis y Corrupción en la Iglesia",
            "short_description": "Analizar los problemas internos de la Iglesia católica.",
            "example_tasks": [
              "Describir la venta de indulgencias como práctica corrupta criticada.",
              "Explicar el lujo y mundanidad del papado renacentista.",
              "Analizar el pluralismo, absentismo y simonía entre el clero."
            ]
          },
          {
            "key": "contexto_politico_economico",
            "name": "Contexto Político y Económico",
            "short_description": "Comprender los intereses seculares en la Reforma.",
            "example_tasks": [
              "Explicar el deseo de príncipes alemanes de independizarse del Papa y el Emperador.",
              "Analizar el interés económico: confiscar propiedades eclesiásticas.",
              "Describir el nacionalismo emergente contra el dominio romano."
            ]
          }
        ]
      },
      {
        "key": "lutero_reforma_alemania",
        "name": "Martín Lutero y la Reforma en Alemania",
        "short_description": "Análisis del inicio de la Reforma protestante.",
        "sub_topics": [
          {
            "key": "95_tesis",
            "name": "Las 95 Tesis (1517)",
            "short_description": "Comprender el acto que desencadenó la Reforma.",
            "example_tasks": [
              "Describir la publicación de las tesis contra las indulgencias en Wittenberg.",
              "Analizar el contenido: crítica a la venta de indulgencias, salvación por fe.",
              "Explicar la difusión rápida gracias a la imprenta."
            ]
          },
          {
            "key": "doctrina_luterana",
            "name": "Doctrina Luterana",
            "short_description": "Estudiar los principios teológicos de Lutero.",
            "example_tasks": [
              "Explicar la justificación por la fe sola (sola fide), no por obras.",
              "Describir la Biblia como única autoridad (sola scriptura), rechazo de la tradición.",
              "Analizar el sacerdocio universal de los creyentes, negación de jerarquía eclesiástica."
            ]
          },
          {
            "key": "expansion_luteranismo",
            "name": "Expansión del Luteranismo",
            "short_description": "Comprender la difusión de la Reforma.",
            "example_tasks": [
              "Describir la protección de príncipes alemanes a Lutero.",
              "Analizar la Dieta de Worms (1521) y la excomunión de Lutero.",
              "Explicar la Paz de Augsburgo (1555): cuius regio, eius religio (la religión del príncipe es la del territorio)."
            ]
          }
        ]
      },
      {
        "key": "otras_reformas",
        "name": "Otras Ramas del Protestantismo",
        "short_description": "Análisis de las diferentes corrientes reformistas.",
        "sub_topics": [
          {
            "key": "calvinismo",
            "name": "Calvinismo",
            "short_description": "Estudiar la reforma de Juan Calvino.",
            "example_tasks": [
              "Describir la doctrina de la predestinación: salvación predeterminada por Dios.",
              "Analizar la teocracia en Ginebra bajo Calvino.",
              "Explicar la expansión del calvinismo: Suiza, Francia (hugonotes), Países Bajos, Escocia (presbiterianismo)."
            ]
          },
          {
            "key": "anglicanismo",
            "name": "Anglicanismo",
            "short_description": "Comprender la Reforma en Inglaterra.",
            "example_tasks": [
              "Describir el conflicto de Enrique VIII con el Papa por su divorcio.",
              "Analizar el Acta de Supremacía (1534): el rey como cabeza de la Iglesia de Inglaterra.",
              "Explicar el anglicanismo como vía media entre catolicismo y protestantismo."
            ]
          },
          {
            "key": "anabaptistas_radicales",
            "name": "Anabaptistas y Reforma Radical",
            "short_description": "Estudiar las corrientes más radicales.",
            "example_tasks": [
              "Describir las creencias anabaptistas: bautismo adulto, separación Iglesia-Estado, pacifismo.",
              "Analizar la persecución tanto de católicos como de protestantes moderados.",
              "Explicar su influencia posterior en menonitas y baptistas."
            ]
          }
        ]
      },
      {
        "key": "contrarreforma_catolica",
        "name": "Contrarreforma Católica",
        "short_description": "Análisis de la respuesta de la Iglesia católica a la Reforma.",
        "sub_topics": [
          {
            "key": "concilio_trento",
            "name": "Concilio de Trento (1545-1563)",
            "short_description": "Comprender las reformas internas católicas.",
            "example_tasks": [
              "Describir las decisiones doctrinales: reafirmación de los siete sacramentos, importancia de las obras, autoridad de la tradición.",
              "Analizar las reformas disciplinares: formación del clero (seminarios), combate a la corrupción.",
              "Explicar la prohibición de la venta de indulgencias y otras prácticas criticadas."
            ]
          },
          {
            "key": "jesuitas",
            "name": "Compañía de Jesús (Jesuitas)",
            "short_description": "Estudiar la orden de vanguardia de la Contrarreforma.",
            "example_tasks": [
              "Describir la fundación por Ignacio de Loyola (1540) y los 'Ejercicios Espirituales'.",
              "Analizar su papel: educación, misiones, defensa del papado.",
              "Explicar la expansión jesuita: Europa, América, Asia (Francisco Javier)."
            ]
          },
          {
            "key": "inquisicion_index",
            "name": "Inquisición e Índice de Libros Prohibidos",
            "short_description": "Comprender los mecanismos represivos.",
            "example_tasks": [
              "Describir el fortalecimiento de la Inquisición para combatir herejías.",
              "Analizar el Índice de Libros Prohibidos: censura de obras protestantes y peligrosas.",
              "Explicar el uso del arte como propaganda: barroco al servicio de la fe."
            ]
          },
          {
            "key": "guerras_religion",
            "name": "Guerras de Religión",
            "short_description": "Estudiar los conflictos armados por motivos religiosos.",
            "example_tasks": [
              "Describir las Guerras de Religión en Francia entre católicos y hugonotes.",
              "Analizar la Guerra de los Treinta Años (1618-1648) en el Sacro Imperio.",
              "Explicar la Paz de Westfalia (1648) y el fin de las guerras religiosas en Europa."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "revoluciones_pensamiento_cientificas",
    "name": "Revoluciones del Pensamiento y Científicas",
    "short_description": "Estudio de la Ilustración y la Revolución Científica del siglo XVII-XVIII, analizando el desarrollo del pensamiento racional, el empirismo, los avances científicos, y cómo estas ideas transformaron la visión del mundo y sentaron las bases de la modernidad.",
    "sub_topics": [
      {
        "key": "ilustracion",
        "name": "La Ilustración",
        "short_description": "Análisis del movimiento intelectual del siglo XVIII.",
        "sub_topics": [
          {
            "key": "principios_ilustracion",
            "name": "Principios de la Ilustración",
            "short_description": "Comprender las ideas fundamentales del pensamiento ilustrado.",
            "example_tasks": [
              "Explicar la confianza en la razón como medio para comprender el mundo.",
              "Describir la crítica a la autoridad tradicional: monarquía absoluta, Iglesia, superstición.",
              "Analizar la idea de progreso: la humanidad puede mejorar mediante educación y ciencia."
            ]
          },
          {
            "key": "filosofos_ilustrados",
            "name": "Filósofos Ilustrados",
            "short_description": "Estudiar a los principales pensadores de la Ilustración.",
            "example_tasks": [
              "Analizar a Voltaire: defensa de la tolerancia religiosa, crítica al fanatismo, libertad de expresión.",
              "Describir a Montesquieu: división de poderes (ejecutivo, legislativo, judicial) en 'El Espíritu de las Leyes'.",
              "Explicar a Rousseau: contrato social, soberanía popular, 'el hombre nace libre pero en todas partes está encadenado'."
            ]
          },
          {
            "key": "enciclopedia",
            "name": "La Enciclopedia",
            "short_description": "Comprender el proyecto de difusión del conocimiento.",
            "example_tasks": [
              "Describir la Enciclopedia de Diderot y D'Alembert como compendio del saber ilustrado.",
              "Analizar su objetivo: democratizar el conocimiento, combatir la ignorancia.",
              "Explicar la censura y persecución que enfrentó la publicación."
            ]
          },
          {
            "key": "despotismo_ilustrado",
            "name": "Despotismo Ilustrado",
            "short_description": "Estudiar la aplicación de ideas ilustradas por monarcas.",
            "example_tasks": [
              "Explicar el concepto: 'todo para el pueblo, pero sin el pueblo'.",
              "Describir ejemplos: Federico II de Prusia, Catalina II de Rusia, Carlos III de España.",
              "Analizar las reformas: educación, administración, economía, limitaciones en derechos políticos."
            ]
          }
        ]
      },
      {
        "key": "revolucion_cientifica_xvii",
        "name": "Revolución Científica del Siglo XVII",
        "short_description": "Análisis de los avances científicos fundamentales.",
        "sub_topics": [
          {
            "key": "astronomia_kepler_newton",
            "name": "Astronomía: Kepler y Newton",
            "short_description": "Comprender las leyes del movimiento planetario y la gravedad.",
            "example_tasks": [
              "Describir las tres leyes de Kepler sobre el movimiento de los planetas.",
              "Analizar la síntesis newtoniana: ley de gravitación universal, leyes del movimiento.",
              "Explicar 'Principia Mathematica' de Newton como obra cumbre de la revolución científica."
            ]
          },
          {
            "key": "medicina_harvey",
            "name": "Medicina: William Harvey",
            "short_description": "Estudiar el descubrimiento de la circulación sanguínea.",
            "example_tasks": [
              "Describir cómo Harvey demostró la circulación de la sangre y el papel del corazón como bomba.",
              "Analizar el método experimental aplicado a la anatomía.",
              "Explicar cómo esto superó las teorías galenas milenarias."
            ]
          },
          {
            "key": "quimica_lavoisier",
            "name": "Química: Lavoisier",
            "short_description": "Comprender la fundación de la química moderna.",
            "example_tasks": [
              "Describir la ley de conservación de la masa.",
              "Analizar la refutación de la teoría del flogisto.",
              "Explicar la nomenclatura química moderna introducida por Lavoisier."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "revoluciones_atlanticas",
    "name": "Revoluciones Atlánticas",
    "short_description": "Estudio de las revoluciones políticas de fines del siglo XVIII e inicios del XIX que transformaron el orden político occidental: Independencia de Estados Unidos, Revolución Francesa, e independencias latinoamericanas.",
    "sub_topics": [
      {
        "key": "independencia_eeuu",
        "name": "Independencia de Estados Unidos",
        "short_description": "Análisis de la primera revolución independentista exitosa en América.",
        "sub_topics": [
          {
            "key": "causas_independencia_eeuu",
            "name": "Causas de la Independencia",
            "short_description": "Comprender los motivos del conflicto con Gran Bretaña.",
            "example_tasks": [
              "Explicar los impuestos británicos sin representación colonial: Stamp Act, Tea Act.",
              "Describir las restricciones comerciales y el control metropolitano.",
              "Analizar la influencia de ideas ilustradas sobre autogobierno y libertad."
            ]
          },
          {
            "key": "guerra_independencia_eeuu",
            "name": "Guerra de Independencia (1775-1783)",
            "short_description": "Estudiar el conflicto armado.",
            "example_tasks": [
              "Describir la Declaración de Independencia (4 de julio de 1776) redactada por Jefferson.",
              "Analizar batallas clave y el papel de George Washington.",
              "Explicar el apoyo francés, español y holandés a los rebeldes americanos."
            ]
          },
          {
            "key": "constitucion_eeuu",
            "name": "Constitución de Estados Unidos",
            "short_description": "Comprender el primer sistema republicano federal moderno.",
            "example_tasks": [
              "Describir la Constitución de 1787: división de poderes, checks and balances.",
              "Analizar el federalismo: poderes federales vs estatales.",
              "Explicar la Declaración de Derechos (Bill of Rights) de 1791."
            ]
          }
        ]
      },
      {
        "key": "revolucion_francesa",
        "name": "Revolución Francesa",
        "short_description": "Análisis del proceso revolucionario que transformó radicalmente Francia y Europa.",
        "sub_topics": [
          {
            "key": "causas_revolucion_francesa",
            "name": "Causas de la Revolución",
            "short_description": "Comprender los factores que provocaron el estallido.",
            "example_tasks": [
              "Explicar la crisis fiscal de la monarquía: deuda, guerras, gastos suntuarios.",
              "Describir la desigualdad social: privilegios de nobleza y clero, carga fiscal sobre el Tercer Estado.",
              "Analizar la influencia de ideas ilustradas: Rousseau, Voltaire, Montesquieu."
            ]
          },
          {
            "key": "estados_generales_asamblea",
            "name": "Estados Generales y Asamblea Nacional",
            "short_description": "Estudiar el inicio de la Revolución (1789).",
            "example_tasks": [
              "Describir la convocatoria de Estados Generales y el conflicto sobre votación.",
              "Analizar la formación de la Asamblea Nacional por el Tercer Estado.",
              "Explicar la Toma de la Bastilla (14 de julio de 1789) como símbolo del fin del absolutismo."
            ]
          },
          {
            "key": "declaracion_derechos_hombre",
            "name": "Declaración de Derechos del Hombre y del Ciudadano",
            "short_description": "Comprender el documento fundamental de la Revolución.",
            "example_tasks": [
              "Analizar los principios: libertad, igualdad, fraternidad, soberanía nacional.",
              "Describir los derechos proclamados: libertad de expresión, propiedad, seguridad.",
              "Explicar su influencia universal en movimientos liberales posteriores."
            ]
          },
          {
            "key": "monarquia_constitucional",
            "name": "Monarquía Constitucional (1789-1792)",
            "short_description": "Estudiar la primera fase de la Revolución.",
            "example_tasks": [
              "Describir la Constitución de 1791: monarquía limitada, sufragio censitario.",
              "Analizar reformas: abolición del feudalismo, nacionalización de bienes eclesiásticos.",
              "Explicar el intento de fuga del rey Luis XVI y el fin de la confianza en la monarquía."
            ]
          },
          {
            "key": "republica_jacobina",
            "name": "República Jacobina y Terror (1792-1794)",
            "short_description": "Comprender la fase radical de la Revolución.",
            "example_tasks": [
              "Describir la proclamación de la República y la ejecución de Luis XVI (1793).",
              "Analizar el gobierno jacobino de Robespierre y el Comité de Salvación Pública.",
              "Explicar el Reino del Terror: guillotina, persecución de enemigos de la Revolución."
            ]
          },
          {
            "key": "directorio_napoleon",
            "name": "Directorio y Ascenso de Napoleón",
            "short_description": "Estudiar el final de la Revolución.",
            "example_tasks": [
              "Describir el Directorio (1795-1799) como gobierno moderado e inestable.",
              "Analizar el golpe de Estado del 18 Brumario (1799) de Napoleón Bonaparte.",
              "Explicar cómo Napoleón se convirtió en Primer Cónsul y luego Emperador (1804)."
            ]
          }
        ]
      },
      {
        "key": "era_napoleonica",
        "name": "Era Napoleónica",
        "short_description": "Análisis del periodo de dominio de Napoleón en Europa.",
        "sub_topics": [
          {
            "key": "reformas_napoleonicas",
            "name": "Reformas de Napoleón",
            "short_description": "Comprender las transformaciones internas de Francia.",
            "example_tasks": [
              "Describir el Código Civil Napoleónico: igualdad ante la ley, propiedad privada.",
              "Analizar la centralización administrativa: prefectos, sistema educativo nacional.",
              "Explicar el Concordato de 1801 con el Papa: reconciliación con la Iglesia."
            ]
          },
          {
            "key": "expansion_imperio",
            "name": "Expansión del Imperio Napoleónico",
            "short_description": "Estudiar las conquistas napoleónicas.",
            "example_tasks": [
              "Describir las guerras napoleónicas y la dominación de casi toda Europa continental.",
              "Analizar la difusión de ideas revolucionarias: códigos legales, abolición del feudalismo.",
              "Explicar el bloqueo continental contra Inglaterra."
            ]
          },
          {
            "key": "caida_napoleon",
            "name": "Caída de Napoleón",
            "short_description": "Comprender el fin del imperio napoleónico.",
            "example_tasks": [
              "Describir el desastre de la invasión a Rusia (1812).",
              "Analizar la derrota en Leipzig (Batalla de las Naciones, 1813).",
              "Explicar la abdicación, exilio en Elba, los Cien Días, Waterloo (1815), y exilio final en Santa Elena."
            ]
          }
        ]
      },
      {
        "key": "congreso_viena",
        "name": "Congreso de Viena y Restauración",
        "short_description": "Análisis del nuevo orden europeo post-napoleónico.",
        "sub_topics": [
          {
            "key": "principios_viena",
            "name": "Principios del Congreso de Viena",
            "short_description": "Comprender la reorganización de Europa.",
            "example_tasks": [
              "Describir el Congreso de Viena (1814-1815) liderado por Metternich.",
              "Analizar los principios: legitimidad (restaurar monarquías), equilibrio de poder.",
              "Explicar la Santa Alianza: pacto entre monarcas para reprimir revoluciones."
            ]
          },
          {
            "key": "liberalismo_nacionalismo",
            "name": "Liberalismo y Nacionalismo del Siglo XIX",
            "short_description": "Estudiar las ideologías que desafiaron la Restauración.",
            "example_tasks": [
              "Describir el liberalismo: constitucionalismo, derechos individuales, economía de mercado.",
              "Analizar el nacionalismo: autodeterminación de los pueblos, unificaciones (Italia, Alemania).",
              "Explicar las revoluciones de 1830 y 1848 como manifestaciones de estas ideologías."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "revoluciones_industriales_imperialismo",
    "name": "Revoluciones Industriales e Imperialismo",
    "short_description": "Estudio de las transformaciones económicas, sociales y tecnológicas iniciadas en el siglo XVIII, la expansión capitalista, el colonialismo europeo del siglo XIX, y las consecuencias globales de estos procesos.",
    "sub_topics": [
      {
        "key": "primera_revolucion_industrial",
        "name": "Primera Revolución Industrial",
        "short_description": "Análisis de la industrialización iniciada en Inglaterra (1760-1840).",
        "sub_topics": [
          {
            "key": "factores_revolucion_industrial",
            "name": "Factores de la Revolución Industrial",
            "short_description": "Comprender por qué comenzó en Inglaterra.",
            "example_tasks": [
              "Explicar factores: capital acumulado (comercio), recursos (carbón, hierro), mercados (colonial).",
              "Describir innovaciones agrícolas previas: rotación de cultivos, cercamientos.",
              "Analizar el crecimiento demográfico que proporcionó mano de obra y consumidores."
            ]
          },
          {
            "key": "innovaciones_tecnologicas",
            "name": "Innovaciones Tecnológicas",
            "short_description": "Estudiar los inventos que transformaron la producción.",
            "example_tasks": [
              "Describir la máquina de vapor de James Watt y su aplicación en fábricas y transporte.",
              "Analizar innovaciones textiles: hiladora Jenny, telar mecánico.",
              "Explicar el ferrocarril como motor de industrialización: transporte, demanda de hierro y carbón."
            ]
          },
          {
            "key": "transformaciones_sociales",
            "name": "Transformaciones Sociales",
            "short_description": "Comprender los cambios en la sociedad.",
            "example_tasks": [
              "Describir la urbanización masiva: migración del campo a las ciudades industriales.",
              "Analizar el surgimiento de nuevas clases: burguesía industrial y proletariado obrero.",
              "Explicar las condiciones laborales: jornadas largas, salarios bajos, trabajo infantil, insalubridad."
            ]
          }
        ]
      },
      {
        "key": "segunda_revolucion_industrial",
        "name": "Segunda Revolución Industrial (1870-1914)",
        "short_description": "Análisis de la nueva fase de industrialización.",
        "sub_topics": [
          {
            "key": "nuevas_industrias_energias",
            "name": "Nuevas Industrias y Fuentes de Energía",
            "short_description": "Comprender las innovaciones de la segunda fase.",
            "example_tasks": [
              "Describir el uso de electricidad y petróleo como nuevas fuentes de energía.",
              "Analizar nuevas industrias: química (fertilizantes, explosivos), acero, automóvil.",
              "Explicar inventos: bombilla eléctrica (Edison), motor de combustión interna, teléfono."
            ]
          },
          {
            "key": "concentracion_capitalista",
            "name": "Concentración Capitalista",
            "short_description": "Estudiar la formación de grandes empresas.",
            "example_tasks": [
              "Describir el surgimiento de monopolios, trusts y cárteles.",
              "Analizar la concentración de capital: bancos, sociedades anónimas.",
              "Explicar el capitalismo financiero e industrial integrado."
            ]
          },
          {
            "key": "movimiento_obrero",
            "name": "Movimiento Obrero y Socialismo",
            "short_description": "Comprender la respuesta organizada de los trabajadores.",
            "example_tasks": [
              "Describir el surgimiento de sindicatos y su lucha por derechos laborales.",
              "Analizar las ideologías: socialismo utópico, marxismo, anarquismo.",
              "Explicar la Primera Internacional (1864) y Segunda Internacional (1889) de trabajadores."
            ]
          }
        ]
      },
      {
        "key": "imperialismo_siglo_xix",
        "name": "Imperialismo del Siglo XIX",
        "short_description": "Análisis de la expansión colonial europea sobre África y Asia.",
        "sub_topics": [
          {
            "key": "causas_imperialismo",
            "name": "Causas del Imperialismo",
            "short_description": "Comprender los motivos de la expansión colonial.",
            "example_tasks": [
              "Explicar causas económicas: materias primas, mercados, inversión de capitales.",
              "Describir causas políticas: prestigio nacional, bases militares, competencia entre potencias.",
              "Analizar justificaciones ideológicas: 'misión civilizadora', darwinismo social, racismo."
            ]
          },
          {
            "key": "reparto_africa",
            "name": "Reparto de África",
            "short_description": "Estudiar la colonización del continente africano.",
            "example_tasks": [
              "Describir la Conferencia de Berlín (1884-1885) que dividió África entre potencias europeas.",
              "Analizar ejemplos: Congo belga, colonias francesas y británicas, alemanas, italianas.",
              "Explicar la resistencia africana y su aplastamiento por superioridad tecnológica europea."
            ]
          },
          {
            "key": "imperialismo_asia",
            "name": "Imperialismo en Asia",
            "short_description": "Comprender la penetración europea en Asia.",
            "example_tasks": [
              "Describir el dominio británico en India: 'joya de la corona'.",
              "Analizar las Guerras del Opio y la imposición de 'tratados desiguales' a China.",
              "Explicar casos especiales: Japón (modernización y resistencia), Siam/Tailandia (independencia formal)."
            ]
          },
          {
            "key": "consecuencias_imperialismo",
            "name": "Consecuencias del Imperialismo",
            "short_description": "Evaluar el impacto del colonialismo.",
            "example_tasks": [
              "Analizar la explotación económica de colonias: extracción de recursos, economías dependientes.",
              "Describir la imposición cultural: lengua, religión, educación europea, racismo.",
              "Explicar la destrucción de sociedades tradicionales y fronteras artificiales que causarían conflictos futuros."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "primera_guerra_mundial_entreguerras",
    "name": "Primera Guerra Mundial y Periodo de Entreguerras",
    "short_description": "Estudio del primer conflicto global del siglo XX, sus causas, desarrollo, consecuencias, los tratados de paz, la crisis económica de 1929, y el surgimiento de regímenes totalitarios que prepararon el camino hacia la Segunda Guerra Mundial.",
    "sub_topics": [
      {
        "key": "primera_guerra_mundial",
        "name": "Primera Guerra Mundial (1914-1918)",
        "short_description": "Análisis del conflicto que cambió el orden mundial.",
        "sub_topics": [
          {
            "key": "causas_gran_guerra",
            "name": "Causas de la Gran Guerra",
            "short_description": "Comprender los factores que condujeron al conflicto.",
            "example_tasks": [
              "Explicar rivalidades imperialistas: competencia por colonias, mercados, materias primas.",
              "Describir el sistema de alianzas: Triple Entente (Francia, Rusia, Reino Unido) vs Triple Alianza (Alemania, Austria-Hungría, Italia).",
              "Analizar el nacionalismo exacerbado y las tensiones en los Balcanes, el 'polvorín de Europa'."
            ]
          },
          {
            "key": "estallido_guerra",
            "name": "Estallido de la Guerra",
            "short_description": "Estudiar el detonante inmediato del conflicto.",
            "example_tasks": [
              "Describir el asesinato del archiduque Francisco Fernando en Sarajevo (28 de junio de 1914).",
              "Analizar el efecto dominó de las alianzas que generalizó el conflicto.",
              "Explicar cómo una crisis local se convirtió en guerra mundial."
            ]
          },
          {
            "key": "desarrollo_conflicto",
            "name": "Desarrollo del Conflicto",
            "short_description": "Comprender las fases y características de la guerra.",
            "example_tasks": [
              "Describir la guerra de trincheras en el frente occidental: estancamiento, muerte masiva.",
              "Analizar nuevas armas: ametralladoras, gases tóxicos, tanques, aviones, submarinos.",
              "Explicar la entrada de Estados Unidos en 1917 como factor decisivo."
            ]
          },
          {
            "key": "tratados_paz",
            "name": "Tratados de Paz",
            "short_description": "Estudiar el nuevo orden internacional posterior a la guerra.",
            "example_tasks": [
              "Describir el Tratado de Versalles (1919): culpabilización de Alemania, reparaciones, pérdidas territoriales.",
              "Analizar la creación de la Sociedad de Naciones: primer intento de organización internacional.",
              "Explicar la reconfiguración de Europa: desaparición de imperios (austro-húngaro, otomano, ruso), nuevos Estados."
            ]
          }
        ]
      },
      {
        "key": "revolucion_rusa",
        "name": "Revolución Rusa y URSS",
        "short_description": "Análisis de la revolución que estableció el primer Estado socialista.",
        "sub_topics": [
          {
            "key": "revolucion_febrero_octubre",
            "name": "Revoluciones de 1917",
            "short_description": "Comprender las dos revoluciones rusas.",
            "example_tasks": [
              "Describir la Revolución de Febrero: caída del zar Nicolás II, gobierno provisional.",
              "Analizar la Revolución de Octubre: toma del poder por los bolcheviques de Lenin.",
              "Explicar el lema bolchevique: 'Paz, pan y tierra', y su atractivo popular."
            ]
          },
          {
            "key": "guerra_civil_consolidacion",
            "name": "Guerra Civil y Consolidación Soviética",
            "short_description": "Estudiar la lucha por el control de Rusia.",
            "example_tasks": [
              "Describir la Guerra Civil (1918-1921) entre rojos (bolcheviques) y blancos (contrarrevolucionarios).",
              "Analizar el comunismo de guerra y la posterior NEP (Nueva Política Económica).",
              "Explicar la formación de la Unión Soviética (URSS) en 1922."
            ]
          },
          {
            "key": "estalinismo",
            "name": "Estalinismo",
            "short_description": "Comprender el régimen totalitario de Stalin.",
            "example_tasks": [
              "Describir la colectivización forzosa de la agricultura y la industrialización acelerada.",
              "Analizar los planes quinquenales y la economía planificada.",
              "Explicar las purgas estalinistas: represión, gulags, culto a la personalidad."
            ]
          }
        ]
      },
      {
        "key": "crisis_1929",
        "name": "Crisis Económica de 1929",
        "short_description": "Análisis de la Gran Depresión y sus consecuencias globales.",
        "sub_topics": [
          {
            "key": "crack_1929",
            "name": "Crack de la Bolsa de 1929",
            "short_description": "Comprender el colapso financiero.",
            "example_tasks": [
              "Describir el Jueves Negro (24 de octubre de 1929) y el pánico en Wall Street.",
              "Analizar causas: sobreproducción, especulación, crédito excesivo.",
              "Explicar la propagación de la crisis desde EE.UU. al resto del mundo."
            ]
          },
          {
            "key": "gran_depresion",
            "name": "La Gran Depresión",
            "short_description": "Estudiar las consecuencias económicas y sociales.",
            "example_tasks": [
              "Describir el desempleo masivo (25% en EE.UU.), quiebra de bancos y empresas.",
              "Analizar la deflación, caída del comercio internacional, miseria.",
              "Explicar la crisis del liberalismo económico y búsqueda de alternativas."
            ]
          },
          {
            "key": "new_deal",
            "name": "New Deal de Roosevelt",
            "short_description": "Comprender la respuesta estadounidense a la crisis.",
            "example_tasks": [
              "Describir las políticas del New Deal: intervención estatal, obras públicas, regulación financiera.",
              "Analizar programas: seguro social, protección laboral, apoyo a agricultores.",
              "Explicar el debate sobre el papel del Estado en la economía."
            ]
          }
        ]
      },
      {
        "key": "totalitarismos",
        "name": "Surgimiento de Totalitarismos",
        "short_description": "Análisis de los regímenes fascistas y nazis.",
        "sub_topics": [
          {
            "key": "fascismo_italia",
            "name": "Fascismo en Italia",
            "short_description": "Comprender el primer régimen fascista.",
            "example_tasks": [
              "Describir el ascenso de Benito Mussolini y la Marcha sobre Roma (1922).",
              "Analizar características del fascismo: nacionalismo extremo, anticomunismo, corporativismo, culto al líder.",
              "Explicar la represión de oposición y el Estado totalitario."
            ]
          },
          {
            "key": "nazismo_alemania",
            "name": "Nazismo en Alemania",
            "short_description": "Estudiar el régimen más destructivo del siglo XX.",
            "example_tasks": [
              "Describir el ascenso de Adolf Hitler y el Partido Nazi aprovechando crisis económica y resentimiento por Versalles.",
              "Analizar la ideología nazi: racismo, antisemitismo, lebensraum (espacio vital), Führerprinzip.",
              "Explicar la construcción del Tercer Reich: eliminación de oposición, propaganda, militarización."
            ]
          },
          {
            "key": "expansion_agresiva",
            "name": "Expansión Agresiva y Camino a la Guerra",
            "short_description": "Comprender las políticas que llevaron a la Segunda Guerra Mundial.",
            "example_tasks": [
              "Describir la remilitarización de Alemania violando el Tratado de Versalles.",
              "Analizar la anexión de Austria (Anschluss) y los Sudetes (Acuerdos de Múnich, 1938).",
              "Explicar la política de apaciguamiento de Francia y Reino Unido y su fracaso."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "segunda_guerra_mundial_guerra_fria",
    "name": "Segunda Guerra Mundial y Guerra Fría",
    "short_description": "Estudio del conflicto más devastador de la historia humana, sus causas, desarrollo, el Holocausto, las consecuencias que transformaron el orden mundial, y la posterior división bipolar que caracterizó la segunda mitad del siglo XX.",
    "sub_topics": [
      {
        "key": "segunda_guerra_mundial",
        "name": "Segunda Guerra Mundial (1939-1945)",
        "short_description": "Análisis comprehensivo del conflicto global.",
        "sub_topics": [
          {
            "key": "inicio_guerra",
            "name": "Inicio de la Guerra",
            "short_description": "Comprender el estallido del conflicto.",
            "example_tasks": [
              "Describir la invasión alemana de Polonia (1 de septiembre de 1939) y las declaraciones de guerra.",
              "Analizar el Pacto Molotov-Ribbentrop entre Alemania y la URSS.",
              "Explicar la Blitzkrieg alemana: guerra relámpago que conquistó Europa occidental."
            ]
          },
          {
            "key": "expansion_eje",
            "name": "Expansión del Eje (1939-1942)",
            "short_description": "Estudiar la fase de victorias de Alemania, Italia y Japón.",
            "example_tasks": [
              "Describir la caída de Francia (1940), batalla de Inglaterra, invasión de la URSS (Operación Barbarroja, 1941).",
              "Analizar el ataque japonés a Pearl Harbor (7 de diciembre de 1941) y la entrada de EE.UU.",
              "Explicar la máxima expansión del Eje: desde Francia hasta Moscú, del norte de África a islas del Pacífico."
            ]
          },
          {
            "key": "holocausto",
            "name": "El Holocausto",
            "short_description": "Comprender el genocidio nazi contra los judíos y otros grupos.",
            "example_tasks": [
              "Describir la 'Solución Final': plan sistemático de exterminio de judíos europeos.",
              "Analizar los campos de concentración y exterminio: Auschwitz, Treblinka, etc.",
              "Explicar el resultado: aproximadamente 6 millones de judíos asesinados, más gitanos, homosexuales, discapacitados, opositores políticos."
            ]
          },
          {
            "key": "contraofensiva_aliados",
            "name": "Contraofensiva Aliada (1942-1945)",
            "short_description": "Estudiar el cambio de rumbo de la guerra.",
            "example_tasks": [
              "Describir batallas decisivas: Stalingrado (frente oriental), El Alamein (norte de África), Midway (Pacífico).",
              "Analizar el Día D: desembarco de Normandía (6 de junio de 1944).",
              "Explicar el avance aliado desde el oeste y soviético desde el este hacia Alemania."
            ]
          },
          {
            "key": "fin_guerra",
            "name": "Fin de la Guerra",
            "short_description": "Comprender la derrota del Eje.",
            "example_tasks": [
              "Describir el suicidio de Hitler y la rendición incondicional de Alemania (8 de mayo de 1945).",
              "Analizar el uso de bombas atómicas en Hiroshima y Nagasaki (agosto de 1945).",
              "Explicar la rendición de Japón (2 de septiembre de 1945) y el fin de la guerra."
            ]
          },
          {
            "key": "consecuencias_segunda_guerra",
            "name": "Consecuencias de la Segunda Guerra Mundial",
            "short_description": "Evaluar el impacto del conflicto.",
            "example_tasks": [
              "Analizar el costo humano: entre 50-85 millones de muertos, devastación de Europa y Asia.",
              "Describir la división de Alemania y Europa en zonas de influencia.",
              "Explicar la creación de la ONU (1945) y los Juicios de Núremberg contra criminales nazis."
            ]
          }
        ]
      },
      {
        "key": "guerra_fria",
        "name": "Guerra Fría (1947-1991)",
        "short_description": "Análisis del conflicto ideológico y geopolítico entre bloques.",
        "sub_topics": [
          {
            "key": "division_bloques",
            "name": "División del Mundo en Bloques",
            "short_description": "Comprender la bipolaridad de posguerra.",
            "example_tasks": [
              "Describir el bloque occidental capitalista liderado por EE.UU. vs bloque oriental socialista liderado por la URSS.",
              "Analizar la Doctrina Truman y el Plan Marshall para contener el comunismo.",
              "Explicar el Telón de Acero y la división de Europa."
            ]
          },
          {
            "key": "conflictos_guerra_fria",
            "name": "Principales Conflictos y Crisis",
            "short_description": "Estudiar los enfrentamientos indirectos entre superpotencias.",
            "example_tasks": [
              "Describir el Bloqueo de Berlín (1948-1949) y la construcción del Muro (1961).",
              "Analizar la Guerra de Corea (1950-1953): primer conflicto 'caliente' de la Guerra Fría.",
              "Explicar la Crisis de los Misiles en Cuba (1962) como momento más cercano a guerra nuclear."
            ]
          },
          {
            "key": "carrera_armamentista_espacial",
            "name": "Carrera Armamentista y Espacial",
            "short_description": "Comprender la competencia entre superpotencias.",
            "example_tasks": [
              "Describir la acumulación de armas nucleares: equilibrio del terror, destrucción mutua asegurada.",
              "Analizar la carrera espacial: Sputnik (1957), Gagarin (1961), llegada a la Luna (1969).",
              "Explicar los tratados de limitación de armas: SALT, START."
            ]
          },
          {
            "key": "descolonizacion",
            "name": "Descolonización y Tercer Mundo",
            "short_description": "Estudiar la independencia de colonias y el Movimiento de Países No Alineados.",
            "example_tasks": [
              "Describir la descolonización de Asia (India, 1947; Indonesia, Vietnam) y África (décadas 1950-1960).",
              "Analizar el surgimiento del Tercer Mundo y el Movimiento de Países No Alineados (Conferencia de Bandung, 1955).",
              "Explicar cómo la Guerra Fría se proyectó en conflictos del Tercer Mundo."
            ]
          },
          {
            "key": "fin_guerra_fria",
            "name": "Fin de la Guerra Fría",
            "short_description": "Comprender el colapso del bloque soviético.",
            "example_tasks": [
              "Describir la Perestroika y Glasnost de Gorbachov: reformas que liberalizaron la URSS.",
              "Analizar la caída del Muro de Berlín (1989) como símbolo del fin de la Guerra Fría.",
              "Explicar la disolución de la URSS (1991) y el fin del mundo bipolar."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "mundo_contemporaneo_globalizado",
    "name": "Mundo Contemporáneo Globalizado",
    "short_description": "Estudio de las transformaciones del orden mundial tras el fin de la Guerra Fría, la globalización económica y cultural, los retos del siglo XXI, nuevos conflictos, avances tecnológicos, y los desafíos globales contemporáneos.",
    "sub_topics": [
      {
        "key": "globalizacion",
        "name": "Globalización",
        "short_description": "Análisis de la interconexión económica, cultural y política mundial.",
        "sub_topics": [
          {
            "key": "globalizacion_economica",
            "name": "Globalización Económica",
            "short_description": "Comprender la integración de mercados mundiales.",
            "example_tasks": [
              "Describir el neoliberalismo como modelo dominante: libre mercado, privatizaciones, desregulación.",
              "Analizar organismos internacionales: FMI, Banco Mundial, OMC.",
              "Explicar las corporaciones transnacionales y las cadenas globales de producción."
            ]
          },
          {
            "key": "revolucion_digital",
            "name": "Revolución Digital y Tecnológica",
            "short_description": "Estudiar la transformación tecnológica.",
            "example_tasks": [
              "Describir el desarrollo de Internet y su impacto en comunicación, economía, sociedad.",
              "Analizar la revolución informática: computadoras personales, smartphones, redes sociales.",
              "Explicar conceptos como inteligencia artificial, big data, automatización."
            ]
          },
          {
            "key": "desigualdad_global",
            "name": "Desigualdad y Críticas a la Globalización",
            "short_description": "Comprender las consecuencias negativas de la globalización.",
            "example_tasks": [
              "Analizar la brecha entre países desarrollados y en desarrollo.",
              "Describir movimientos antiglobalización y críticas al neoliberalismo.",
              "Explicar problemas: explotación laboral, evasión fiscal, crisis financieras."
            ]
          }
        ]
      },
      {
        "key": "nuevos_conflictos",
        "name": "Nuevos Conflictos y Amenazas",
        "short_description": "Análisis de los retos a la seguridad global del siglo XXI.",
        "sub_topics": [
          {
            "key": "terrorismo_internacional",
            "name": "Terrorismo Internacional",
            "short_description": "Comprender el terrorismo como amenaza global.",
            "example_tasks": [
              "Describir el 11 de septiembre de 2001 y sus consecuencias globales.",
              "Analizar grupos terroristas: Al-Qaeda, ISIS, y sus motivaciones.",
              "Explicar la 'Guerra contra el Terror' de EE.UU. y sus efectos."
            ]
          },
          {
            "key": "conflictos_regionales",
            "name": "Conflictos Regionales Persistentes",
            "short_description": "Estudiar focos de tensión mundial.",
            "example_tasks": [
              "Describir el conflicto israelí-palestino y su importancia geopolítica.",
              "Analizar guerras en Medio Oriente: Irak, Siria, Yemen.",
              "Explicar tensiones en otras regiones: Corea del Norte, Ucrania-Rusia."
            ]
          }
        ]
      },
      {
        "key": "retos_globales",
        "name": "Retos Globales del Siglo XXI",
        "short_description": "Análisis de los desafíos que enfrenta la humanidad.",
        "sub_topics": [
          {
            "key": "cambio_climatico",
            "name": "Cambio Climático y Crisis Ambiental",
            "short_description": "Comprender el desafío ambiental más urgente.",
            "example_tasks": [
              "Describir el calentamiento global: causas (emisiones de CO2), efectos (derretimiento de hielos, fenómenos extremos).",
              "Analizar acuerdos internacionales: Protocolo de Kioto, Acuerdo de París.",
              "Explicar movimientos ambientalistas y la urgencia de acción."
            ]
          },
          {
            "key": "migracion_global",
            "name": "Migración y Crisis de Refugiados",
            "short_description": "Estudiar los movimientos poblacionales masivos.",
            "example_tasks": [
              "Describir causas de migración: guerras, pobreza, cambio climático.",
              "Analizar crisis de refugiados: Siria, Centroamérica, África.",
              "Explicar respuestas: políticas migratorias restrictivas, xenofobia, solidaridad."
            ]
          },
          {
            "key": "pandemias_salud",
            "name": "Pandemias y Salud Global",
            "short_description": "Comprender los desafíos de salud pública mundial.",
            "example_tasks": [
              "Describir la pandemia de COVID-19 (2019-2020) y su impacto global.",
              "Analizar la respuesta internacional: vacunas, cooperación, desigualdad en acceso.",
              "Explicar la importancia de sistemas de salud robustos y cooperación internacional."
            ]
          },
          {
            "key": "derechos_humanos",
            "name": "Derechos Humanos y Movimientos Sociales",
            "short_description": "Estudiar las luchas por justicia e igualdad.",
            "example_tasks": [
              "Describir movimientos feministas contemporáneos: #MeToo, lucha por igualdad de género.",
              "Analizar movimientos antirracistas: Black Lives Matter, justicia racial.",
              "Explicar la defensa de derechos LGBTQ+ y su avance global."
            ]
          }
        ]
      },
      {
        "key": "perspectivas_futuro",
        "name": "Perspectivas del Futuro",
        "short_description": "Reflexión sobre los posibles caminos de la humanidad.",
        "sub_topics": [
          {
            "key": "multipolaridad",
            "name": "Mundo Multipolar",
            "short_description": "Comprender el surgimiento de nuevas potencias.",
            "example_tasks": [
              "Describir el ascenso de China como potencia global económica y política.",
              "Analizar el papel de países emergentes: India, Brasil, Sudáfrica (BRICS).",
              "Explicar la competencia geopolítica entre EE.UU., China, Rusia, y la UE."
            ]
          },
          {
            "key": "retos_democracia",
            "name": "Retos de la Democracia",
            "short_description": "Estudiar las amenazas a los sistemas democráticos.",
            "example_tasks": [
              "Describir el surgimiento de populismos y nacionalismos.",
              "Analizar amenazas: desinformación, polarización, autoritarismos.",
              "Explicar la importancia de fortalecer instituciones democráticas."
            ]
          },
          {
            "key": "cooperacion_internacional",
            "name": "Necesidad de Cooperación Internacional",
            "short_description": "Comprender la interdependencia y necesidad de acción colectiva.",
            "example_tasks": [
              "Describir desafíos que requieren cooperación: cambio climático, pandemias, regulación tecnológica.",
              "Analizar el papel de la ONU y necesidad de reformas.",
              "Explicar la importancia de multilateralismo para enfrentar problemas globales."
            ]
          }
        ]
      }
    ]
  }
]
