[
  {
    "key": "narrativa_genero",
    "name": "Narrativa - Elementos y Técnicas del Género Narrativo",
    "short_description": "Estudio de los componentes estructurales, técnicas narrativas y recursos estilísticos propios del género narrativo, incluyendo cuento, novela y microrrelato.",
    "sub_topics": [
      {
        "key": "elementos_narrativa",
        "name": "Elementos de la Narrativa",
        "short_description": "Identificación y análisis de los componentes fundamentales que conforman un texto narrativo.",
        "sub_topics": [
          {
            "key": "narrador_perspectiva",
            "name": "Narrador y Punto de Vista",
            "short_description": "Análisis de los tipos de narrador y su impacto en la construcción del relato.",
            "example_tasks": [
              "Identificar el tipo de narrador (primera, segunda o tercera persona) en un fragmento de 'Pedro Páramo' de Juan Rulfo y explicar cómo afecta la percepción del lector",
              "Comparar el uso del narrador omnisciente en 'Cien años de soledad' con el narrador testigo en 'El llano en llamas', analizando las ventajas narrativas de cada uno",
              "Transformar un fragmento narrativo en tercera persona a primera persona, reflexionando sobre los cambios en la intimidad y credibilidad del relato",
              "Analizar cómo el cambio de narrador en 'La muerte de Artemio Cruz' de Carlos Fuentes crea diferentes niveles de comprensión de la realidad del protagonista"
            ]
          },
          {
            "key": "personajes_construccion",
            "name": "Personajes y Caracterización",
            "short_description": "Estudio de la creación, desarrollo y clasificación de personajes en la narrativa.",
            "example_tasks": [
              "Elaborar un perfil psicológico completo de Pedro Páramo identificando sus motivaciones, evolución y función en la obra",
              "Clasificar los personajes de 'Como agua para chocolate' de Laura Esquivel según su función narrativa (protagonista, antagonista, secundarios) y analizar sus relaciones",
              "Analizar la construcción del personaje de Susana San Juan en 'Pedro Páramo', identificando técnicas de caracterización directa e indirecta",
              "Comparar la evolución de dos personajes femeninos en obras de la literatura mexicana, analizando cómo reflejan cambios sociales"
            ]
          },
          {
            "key": "tiempo_narrativo",
            "name": "Tiempo Narrativo",
            "short_description": "Análisis de las estructuras temporales y su manipulación en el relato.",
            "example_tasks": [
              "Identificar y esquematizar los saltos temporales (analepsis y prolepsis) en 'Pedro Páramo', explicando su función en la construcción del sentido",
              "Comparar el tratamiento del tiempo lineal en un cuento realista con la fragmentación temporal en 'Aura' de Carlos Fuentes",
              "Analizar el uso del tiempo circular en 'Cien años de soledad' y su relación con los temas de la novela",
              "Elaborar una línea temporal de los acontecimientos de 'La región más transparente' de Carlos Fuentes, distinguiendo entre tiempo de la historia y tiempo del relato"
            ]
          },
          {
            "key": "espacio_narrativo",
            "name": "Espacio y Ambientación",
            "short_description": "Estudio del espacio físico, social y simbólico en la narrativa.",
            "example_tasks": [
              "Analizar cómo Comala funciona como espacio simbólico en 'Pedro Páramo', relacionándolo con los temas de muerte y desolación",
              "Comparar la representación del espacio urbano en 'La región más transparente' con el espacio rural en cuentos de Juan Rulfo",
              "Identificar elementos de la ambientación que crean atmósfera en 'Aura' de Carlos Fuentes y explicar su función en el género fantástico",
              "Analizar cómo el espacio de la cocina en 'Como agua para chocolate' funciona como microcosmos de la sociedad porfiriana"
            ]
          },
          {
            "key": "trama_estructura",
            "name": "Trama y Estructura Narrativa",
            "short_description": "Análisis de la organización secuencial de acontecimientos y estructuras narrativas.",
            "example_tasks": [
              "Identificar la estructura narrativa (planteamiento, nudo, desenlace) en 'No oyes ladrar los perros' de Juan Rulfo y analizar posibles variaciones",
              "Comparar la estructura lineal de un cuento tradicional con la estructura fragmentada de 'Pedro Páramo'",
              "Analizar el uso de la estructura circular en 'El llano en llamas' y su relación con la cosmovisión presentada",
              "Esquematizar las líneas narrativas paralelas en 'Cien años de soledad' y analizar cómo se entrelazan"
            ]
          }
        ]
      },
      {
        "key": "tecnicas_narrativas",
        "name": "Técnicas Narrativas Modernas",
        "short_description": "Estudio de procedimientos narrativos característicos de la literatura moderna y contemporánea.",
        "sub_topics": [
          {
            "key": "monologo_interior",
            "name": "Monólogo Interior y Flujo de Conciencia",
            "short_description": "Análisis de técnicas que representan los procesos mentales de los personajes.",
            "example_tasks": [
              "Identificar fragmentos de monólogo interior en 'La muerte de Artemio Cruz' y analizar cómo revelan la psicología del personaje",
              "Comparar el uso del flujo de conciencia en la literatura mexicana con ejemplos de James Joyce o Virginia Woolf",
              "Analizar cómo el monólogo interior en 'Aura' crea ambigüedad e incertidumbre en el lector",
              "Escribir un breve monólogo interior de un personaje en una situación límite, imitando la técnica de Carlos Fuentes"
            ]
          },
          {
            "key": "multiperspectivismo",
            "name": "Multiperspectivismo Narrativo",
            "short_description": "Estudio de narraciones que presentan múltiples puntos de vista sobre los mismos acontecimientos.",
            "example_tasks": [
              "Analizar cómo 'La muerte de Artemio Cruz' presenta tres perspectivas narrativas del mismo personaje y qué aporta cada una",
              "Comparar versiones contradictorias de un mismo hecho en 'Pedro Páramo' y reflexionar sobre la relatividad de la verdad",
              "Identificar las diferentes voces narrativas en un cuento coral y analizar cómo construyen una visión colectiva",
              "Reescribir un fragmento narrativo desde la perspectiva de un personaje secundario, analizando cómo cambia la interpretación"
            ]
          },
          {
            "key": "metaficcion",
            "name": "Metaficción y Autorreferencialidad",
            "short_description": "Análisis de textos que reflexionan sobre su propia naturaleza narrativa.",
            "example_tasks": [
              "Identificar elementos metaficcionales en 'Aura' de Carlos Fuentes, donde el narrador interpela al lector en segunda persona",
              "Analizar cómo 'Si una noche de invierno un viajero' de Italo Calvino reflexiona sobre el acto de leer y la construcción narrativa",
              "Comparar el uso de la autorreferencialidad en narrativa contemporánea con técnicas del Quijote cervantino",
              "Escribir un microrrelato que incluya elementos metaficcionales, reflexionando sobre el proceso de escritura o lectura"
            ]
          },
          {
            "key": "intertextualidad_narrativa",
            "name": "Intertextualidad en la Narrativa",
            "short_description": "Estudio de las relaciones entre textos y la presencia de referencias literarias.",
            "example_tasks": [
              "Identificar referencias intertextuales en 'Pedro Páramo' (ecos de Dante, Rulfo y la tradición oral mexicana)",
              "Analizar cómo 'Cien años de soledad' dialoga con mitos clásicos y textos bíblicos",
              "Comparar el tratamiento del mito de Medea en la literatura clásica y en reescrituras latinoamericanas contemporáneas",
              "Identificar alusiones literarias en un cuento contemporáneo mexicano y explicar su función en la construcción del sentido"
            ]
          }
        ]
      },
      {
        "key": "generos_narrativos",
        "name": "Géneros y Subgéneros Narrativos",
        "short_description": "Clasificación y características de las distintas modalidades del género narrativo.",
        "sub_topics": [
          {
            "key": "cuento_literario",
            "name": "El Cuento Literario",
            "short_description": "Análisis de las características, tipos y técnicas específicas del cuento.",
            "example_tasks": [
              "Analizar la estructura del cuento 'No oyes ladrar los perros' de Juan Rulfo, identificando economía narrativa y final sorpresivo",
              "Comparar un cuento realista de Maupassant con un cuento fantástico de Cortázar, identificando diferencias formales y temáticas",
              "Identificar los elementos que crean tensión narrativa en 'La noche boca arriba' de Julio Cortázar",
              "Escribir un microcuento de máximo 200 palabras aplicando técnicas de síntesis y final impactante"
            ]
          },
          {
            "key": "novela_genero",
            "name": "La Novela y sus Variantes",
            "short_description": "Estudio de la novela como género extenso y sus múltiples subgéneros.",
            "example_tasks": [
              "Comparar características de la novela histórica ('Noticias del Imperio' de Fernando del Paso) con la novela psicológica ('Aura' de Fuentes)",
              "Analizar elementos de la novela de formación (bildungsroman) en 'Los años con Laura Díaz' de Carlos Fuentes",
              "Identificar rasgos del realismo mágico en 'Cien años de soledad' y explicar su función narrativa",
              "Elaborar un ensayo comparativo entre la novela de la Revolución Mexicana y la nueva novela histórica latinoamericana"
            ]
          },
          {
            "key": "microrrelato",
            "name": "El Microrrelato o Minificción",
            "short_description": "Análisis de la narrativa brevísima y sus características distintivas.",
            "example_tasks": [
              "Analizar la condensación narrativa en 'El dinosaurio' de Augusto Monterroso y explicar su impacto",
              "Identificar recursos de economía verbal en microrrelatos de Ana María Shua o Luis Felipe Lomelí",
              "Comparar un microrrelato con un cuento breve, identificando diferencias estructurales y de lectura",
              "Crear una antología comentada de cinco microrrelatos mexicanos, analizando sus técnicas y temas"
            ]
          },
          {
            "key": "narrativa_fantastica",
            "name": "Narrativa Fantástica y Realismo Mágico",
            "short_description": "Estudio de la literatura que transgrede las leyes de la realidad cotidiana.",
            "example_tasks": [
              "Diferenciar entre lo fantástico puro ('Casa tomada' de Cortázar) y el realismo mágico ('Cien años de soledad')",
              "Analizar cómo 'Aura' de Carlos Fuentes crea ambigüedad entre interpretación natural y sobrenatural",
              "Identificar elementos maravillosos naturalizados en 'Pedro Páramo' y su función en la cosmovisión presentada",
              "Escribir un cuento breve incorporando un elemento fantástico en un contexto realista mexicano contemporáneo"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "poesia_genero",
    "name": "Poesía - Análisis Métrico, Lírico y Estilístico",
    "short_description": "Estudio de la estructura formal, los recursos expresivos y las corrientes líricas de la poesía en lengua española.",
    "sub_topics": [
      {
        "key": "metrica_versificacion",
        "name": "Métrica y Versificación",
        "short_description": "Análisis de la estructura formal del verso: medida, rima, estrofa y ritmo.",
        "sub_topics": [
          {
            "key": "medida_verso",
            "name": "Medida del Verso y Licencias Métricas",
            "short_description": "Análisis silábico del verso y aplicación de sinalefa, hiato, sinéresis y diéresis.",
            "example_tasks": [
              "Medir los versos de un soneto de Sor Juana Inés de la Cruz, aplicando correctamente la sinalefa y el ajuste por palabra final",
              "Identificar licencias métricas (sinéresis, diéresis, hiato) en versos de Rubén Darío y explicar su función rítmica",
              "Clasificar versos por su número de sílabas (arte menor y arte mayor) en poemas del Siglo de Oro y del Modernismo",
              "Analizar cómo la métrica irregular en poesía contemporánea (Octavio Paz) contrasta con la métrica regular clásica"
            ]
          },
          {
            "key": "rima_esquemas",
            "name": "Rima y Esquemas Rimáticos",
            "short_description": "Estudio de la rima consonante y asonante, y su organización en esquemas.",
            "example_tasks": [
              "Identificar el esquema de rima ABBA ABBA CDC DCD en un soneto de Quevedo y explicar su estructura",
              "Distinguir entre rima consonante y asonante en un romance español y analizar su efecto sonoro",
              "Analizar la ausencia de rima en verso libre de poesía vanguardista mexicana (Contemporáneos)",
              "Comparar el uso de la rima en poesía tradicional (coplas, décimas) con la poesía moderna mexicana"
            ]
          },
          {
            "key": "estrofas_formas",
            "name": "Estrofas y Formas Poéticas Fijas",
            "short_description": "Identificación y análisis de formas estróficas tradicionales y sus variantes.",
            "example_tasks": [
              "Analizar la estructura del soneto en 'Este que ves, engaño colorido' de Sor Juana Inés de la Cruz",
              "Identificar características de la décima espinela en poesía popular mexicana y su uso en la tradición oral",
              "Comparar la estructura de la lira garcilasiana con la silva y explicar sus diferencias métricas",
              "Analizar el uso del romance octosílabo en 'Suave Patria' de Ramón López Velarde y su conexión con la tradición"
            ]
          },
          {
            "key": "ritmo_musicalidad",
            "name": "Ritmo y Musicalidad del Verso",
            "short_description": "Análisis de acentos, pausas y cadencias que crean el ritmo poético.",
            "example_tasks": [
              "Identificar acentos rítmicos en versos endecasílabos de Garcilaso de la Vega y explicar su efecto melódico",
              "Analizar el uso de encabalgamientos en poesía de Octavio Paz y su función en la fluidez del poema",
              "Comparar el ritmo marcado del Modernismo (Darío) con el ritmo más libre de la poesía contemporánea",
              "Analizar la aliteración y otros recursos fónicos que crean musicalidad en 'Piedra de sol' de Octavio Paz"
            ]
          }
        ]
      },
      {
        "key": "lenguaje_poetico",
        "name": "Lenguaje Poético y Recursos Literarios",
        "short_description": "Estudio de las figuras retóricas y recursos expresivos propios de la poesía.",
        "sub_topics": [
          {
            "key": "tropos_semanticos",
            "name": "Tropos y Figuras Semánticas",
            "short_description": "Análisis de metáfora, símil, metonimia, sinestesia y otras figuras de significado.",
            "example_tasks": [
              "Identificar y explicar metáforas conceptistas en la poesía de Quevedo ('polvo serán, mas polvo enamorado')",
              "Analizar el uso de sinestesias en poesía modernista ('el perfume azul de las violetas')",
              "Comparar el uso de la metáfora tradicional con la metáfora vanguardista en poesía de los Contemporáneos mexicanos",
              "Identificar símbolos recurrentes en la poesía de Octavio Paz ('piedra', 'agua', 'luz') y explicar su significado"
            ]
          },
          {
            "key": "figuras_sintacticas",
            "name": "Figuras Sintácticas y de Construcción",
            "short_description": "Estudio de hipérbaton, anáfora, paralelismo, polisíndeton y otras figuras de orden.",
            "example_tasks": [
              "Identificar hipérbatos en sonetos de Góngora y reordenar sintácticamente para comprender el sentido",
              "Analizar el uso de anáforas en 'Suave Patria' de Ramón López Velarde y su efecto enfático",
              "Identificar estructuras paralelas en poesía de Pablo Neruda y explicar su función rítmica y semántica",
              "Analizar el uso del encabalgamiento abrupto en poesía contemporánea y su efecto de sorpresa o tensión"
            ]
          },
          {
            "key": "figuras_fonicas",
            "name": "Figuras Fónicas y Recursos Sonoros",
            "short_description": "Análisis de aliteración, onomatopeya, paronomasia y otros recursos de sonoridad.",
            "example_tasks": [
              "Identificar aliteraciones en 'El reino interior' de Rubén Darío y analizar su efecto musical",
              "Analizar el uso de onomatopeyas en 'Altazor' de Vicente Huidobro como recurso vanguardista",
              "Identificar jitanjáforas (palabras sin sentido que crean efecto sonoro) en poesía experimental",
              "Analizar cómo la repetición de fonemas crea atmósfera en poemas de Xavier Villaurrutia (Nocturnos)"
            ]
          },
          {
            "key": "simbolo_imagen",
            "name": "Símbolo e Imagen Poética",
            "short_description": "Estudio de la construcción y función de imágenes y símbolos en poesía.",
            "example_tasks": [
              "Analizar el simbolismo del agua en 'Muerte sin fin' de José Gorostiza y sus múltiples significados",
              "Identificar imágenes sensoriales en poesía de Ramón López Velarde y clasificarlas (visuales, auditivas, táctiles)",
              "Comparar el uso de símbolos universales (noche, luz, muerte) en diferentes poetas mexicanos",
              "Analizar la construcción de imágenes surrealistas en poesía de los Contemporáneos"
            ]
          }
        ]
      },
      {
        "key": "tematica_lirica",
        "name": "Temas y Motivos de la Lírica",
        "short_description": "Estudio de los grandes temas poéticos y su tratamiento a través de la historia literaria.",
        "sub_topics": [
          {
            "key": "amor_lirica",
            "name": "El Amor en la Lírica",
            "short_description": "Análisis de las diversas concepciones del amor en la tradición poética.",
            "example_tasks": [
              "Comparar el amor cortés en la lírica medieval con el amor erótico en poesía de Jaime Sabines",
              "Analizar el tratamiento petrarquista del amor imposible en sonetos de Garcilaso de la Vega",
              "Identificar elementos del amor platónico en poesía de Sor Juana Inés de la Cruz",
              "Analizar la representación del desamor y el dolor amoroso en poesía contemporánea mexicana"
            ]
          },
          {
            "key": "muerte_tiempo",
            "name": "Muerte, Tiempo y Trascendencia",
            "short_description": "Estudio de la reflexión sobre la mortalidad, el paso del tiempo y lo eterno.",
            "example_tasks": [
              "Analizar el tema del 'tempus fugit' en sonetos barrocos de Quevedo y Góngora",
              "Comparar el tratamiento de la muerte en 'Muerte sin fin' de José Gorostiza con la cosmovisión prehispánica",
              "Identificar elementos de la vanitas barroca en poesía de Sor Juana ('Este que ves, engaño colorido')",
              "Analizar la concepción cíclica del tiempo en 'Piedra de sol' de Octavio Paz"
            ]
          },
          {
            "key": "naturaleza_cosmovision",
            "name": "Naturaleza y Cosmovisión",
            "short_description": "Análisis de la representación del mundo natural y su significación filosófica.",
            "example_tasks": [
              "Analizar el paisaje como estado de ánimo en poesía romántica mexicana (Manuel Acuña)",
              "Identificar elementos de la naturaleza como símbolos en poesía de Octavio Paz",
              "Comparar la visión del paisaje mexicano en López Velarde con la de Contemporáneos",
              "Analizar la relación hombre-naturaleza en poesía náhuatl y su influencia en poesía mexicana moderna"
            ]
          },
          {
            "key": "identidad_social",
            "name": "Identidad, Patria y Compromiso Social",
            "short_description": "Estudio de la poesía que reflexiona sobre identidad colectiva y realidad social.",
            "example_tasks": [
              "Analizar la construcción de la identidad mexicana en 'Suave Patria' de Ramón López Velarde",
              "Identificar elementos de poesía comprometida en obra de Efraín Huerta o Jaime Sabines",
              "Comparar la visión de México en poesía nacionalista revolucionaria con poesía contemporánea crítica",
              "Analizar poemas de denuncia social en la obra de poetas latinoamericanos (Benedetti, Gelman)"
            ]
          }
        ]
      },
      {
        "key": "corrientes_poeticas",
        "name": "Corrientes y Movimientos Poéticos",
        "short_description": "Estudio de las principales tendencias poéticas en lengua española.",
        "sub_topics": [
          {
            "key": "lirica_medieval_renacentista",
            "name": "Lírica Medieval y Renacentista",
            "short_description": "Análisis de la poesía desde la Edad Media hasta el Renacimiento español.",
            "example_tasks": [
              "Analizar características del amor cortés en las Cantigas de Alfonso X el Sabio",
              "Identificar elementos del dolce stil nuovo en poesía de Garcilaso de la Vega",
              "Comparar la lírica popular del Romancero con la lírica culta italianizante del Renacimiento",
              "Analizar el soneto como forma importada de Italia y su adaptación al español en Garcilaso y Boscán"
            ]
          },
          {
            "key": "barroco_conceptismo_culteranismo",
            "name": "Barroco: Conceptismo y Culteranismo",
            "short_description": "Estudio de las dos corrientes del Barroco español y la obra de Sor Juana.",
            "example_tasks": [
              "Comparar un soneto conceptista de Quevedo con un poema culterano de Góngora, identificando recursos propios",
              "Analizar el ingenio conceptual y los juegos de palabras en 'Hombres necios que acusáis' de Sor Juana",
              "Identificar hipérbatos y cultismos latinos en las Soledades de Góngora",
              "Analizar la síntesis de conceptismo y culteranismo en la poesía de Sor Juana Inés de la Cruz"
            ]
          },
          {
            "key": "romanticismo_modernismo",
            "name": "Romanticismo y Modernismo",
            "short_description": "Análisis de la poesía romántica mexicana y la renovación modernista.",
            "example_tasks": [
              "Analizar elementos románticos (subjetividad, naturaleza, rebeldía) en poesía de Manuel Acuña",
              "Identificar innovaciones métricas y temáticas en 'Azul' de Rubén Darío",
              "Comparar la musicalidad modernista de Darío con la poesía modernista mexicana de Amado Nervo",
              "Analizar el exotismo, el cosmopolitismo y el preciosismo formal del Modernismo hispanoamericano"
            ]
          },
          {
            "key": "vanguardias_contemporaneos",
            "name": "Vanguardias y Grupo Contemporáneos",
            "short_description": "Estudio de los movimientos de vanguardia y su manifestación en México.",
            "example_tasks": [
              "Identificar elementos del Surrealismo en poesía de Xavier Villaurrutia (Nocturnos)",
              "Analizar la experimentación formal y temática en poesía de los Contemporáneos (Gorostiza, Villaurrutia, Novo)",
              "Comparar 'Muerte sin fin' de José Gorostiza con 'Altazor' de Vicente Huidobro como poemas vanguardistas extensos",
              "Identificar rupturas con la tradición en la poesía experimental de Gilberto Owen o Jorge Cuesta"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "teatro_genero",
    "name": "Teatro - Elementos Dramáticos y Representación Escénica",
    "short_description": "Estudio del género dramático desde su dimensión textual y escénica, incluyendo estructura, personajes, conflicto y tradiciones teatrales.",
    "sub_topics": [
      {
        "key": "elementos_drama",
        "name": "Elementos del Texto Dramático",
        "short_description": "Análisis de los componentes estructurales propios del género teatral.",
        "sub_topics": [
          {
            "key": "dialogo_teatral",
            "name": "Diálogo y Acción Dramática",
            "short_description": "Estudio del diálogo como elemento central del teatro y motor de la acción.",
            "example_tasks": [
              "Analizar cómo el diálogo en 'Corona de sombra' de Rodolfo Usigli revela el conflicto interior de Carlota",
              "Identificar diferentes funciones del diálogo en una escena teatral: caracterización, avance de la acción, creación de tensión",
              "Comparar el diálogo realista de teatro mexicano contemporáneo con el diálogo poético del teatro del Siglo de Oro",
              "Analizar el uso de apartes y monólogos en teatro clásico español y su función dramática"
            ]
          },
          {
            "key": "acotaciones_didascalias",
            "name": "Acotaciones y Didascalias",
            "short_description": "Análisis de las indicaciones escénicas y su función en la puesta en escena.",
            "example_tasks": [
              "Identificar acotaciones en 'Los empeños de una casa' de Sor Juana y analizar qué información proporcionan sobre espacio y acción",
              "Comparar el uso mínimo de acotaciones en teatro clásico con las detalladas indicaciones de teatro moderno",
              "Analizar cómo las acotaciones en obras de Emilio Carballido orientan la interpretación actoral",
              "Transformar acotaciones en imágenes visuales para un diseño escenográfico de una obra mexicana"
            ]
          },
          {
            "key": "personajes_dramaticos",
            "name": "Personajes Dramáticos",
            "short_description": "Estudio de la construcción y tipología de personajes en el teatro.",
            "example_tasks": [
              "Analizar el desarrollo del personaje de Segismundo en 'La vida es sueño' de Calderón de la Barca",
              "Identificar arquetipos en teatro del Siglo de Oro: galán, dama, gracioso, barba, y analizar su función",
              "Comparar personajes femeninos transgresores en Sor Juana ('Los empeños de una casa') y en teatro contemporáneo",
              "Analizar la evolución psicológica de personajes en 'El gesticulador' de Rodolfo Usigli"
            ]
          },
          {
            "key": "conflicto_dramatico",
            "name": "Conflicto y Tensión Dramática",
            "short_description": "Análisis del conflicto como eje central del drama y generador de tensión.",
            "example_tasks": [
              "Identificar el conflicto principal en 'Fuenteovejuna' de Lope de Vega (individuo vs. colectividad, honor)",
              "Analizar cómo se construye la tensión dramática en los tres actos de 'Corona de luz' de Usigli",
              "Comparar conflictos internos (psicológicos) en teatro moderno con conflictos externos (sociales) en teatro clásico",
              "Identificar el clímax y desenlace en una obra teatral mexicana, explicando la resolución del conflicto"
            ]
          },
          {
            "key": "estructura_dramatica",
            "name": "Estructura Dramática",
            "short_description": "Estudio de la organización formal del texto teatral en actos, cuadros y escenas.",
            "example_tasks": [
              "Analizar la estructura en tres actos de 'La vida es sueño' y su correspondencia con planteamiento, nudo y desenlace",
              "Identificar unidades aristotélicas (tiempo, lugar, acción) en teatro neoclásico y su transgresión en el Barroco",
              "Comparar la estructura tradicional en actos con estructuras experimentales del teatro contemporáneo",
              "Elaborar un esquema actancial de 'El gesticulador' identificando fuerzas dramáticas en conflicto"
            ]
          }
        ]
      },
      {
        "key": "generos_teatrales",
        "name": "Géneros y Subgéneros Teatrales",
        "short_description": "Clasificación y características de las distintas modalidades del teatro.",
        "sub_topics": [
          {
            "key": "tragedia",
            "name": "La Tragedia",
            "short_description": "Análisis del género trágico, sus características y función catártica.",
            "example_tasks": [
              "Identificar elementos de la tragedia clásica en 'Corona de sombra' de Usigli: destino, hybris, anagnórisis",
              "Analizar el concepto de catarsis aristotélica en una tragedia clásica o moderna",
              "Comparar la tragedia griega (Edipo Rey) con la tragedia moderna mexicana",
              "Identificar el error trágico (hamartia) en el protagonista de una tragedia y analizar sus consecuencias"
            ]
          },
          {
            "key": "comedia",
            "name": "La Comedia",
            "short_description": "Estudio del género cómico, sus recursos humorísticos y función social.",
            "example_tasks": [
              "Analizar recursos cómicos en 'Los empeños de una casa' de Sor Juana: equívocos, confusiones, sátira",
              "Identificar la función del personaje del gracioso en comedias del Siglo de Oro español",
              "Comparar la comedia de enredo del Siglo de Oro con la comedia de costumbres del siglo XIX mexicano",
              "Analizar la sátira social en comedias de Emilio Carballido"
            ]
          },
          {
            "key": "drama_moderno",
            "name": "El Drama Moderno",
            "short_description": "Análisis del drama como género que mezcla elementos trágicos y cómicos.",
            "example_tasks": [
              "Analizar 'El gesticulador' de Rodolfo Usigli como drama de ideas sobre la identidad mexicana",
              "Identificar elementos realistas y simbólicos en dramas de teatro mexicano del siglo XX",
              "Comparar el drama psicológico de Ibsen con el drama social mexicano",
              "Analizar cómo el drama moderno rompe con la separación rígida entre tragedia y comedia"
            ]
          },
          {
            "key": "otros_generos",
            "name": "Otros Géneros: Farsa, Auto Sacramental, Teatro Documental",
            "short_description": "Estudio de formas teatrales específicas y experimentales.",
            "example_tasks": [
              "Analizar características de la farsa en obras del teatro del absurdo (Ionesco, Beckett)",
              "Identificar elementos alegóricos en autos sacramentales de Calderón de la Barca",
              "Analizar el uso de recursos no realistas en teatro experimental mexicano",
              "Comparar el teatro documental contemporáneo con el teatro histórico tradicional"
            ]
          }
        ]
      },
      {
        "key": "tradiciones_teatrales",
        "name": "Tradiciones Teatrales",
        "short_description": "Estudio de las principales tradiciones y movimientos del teatro en lengua española.",
        "sub_topics": [
          {
            "key": "teatro_siglo_oro",
            "name": "Teatro del Siglo de Oro Español",
            "short_description": "Análisis del teatro barroco español y sus principales exponentes.",
            "example_tasks": [
              "Analizar elementos de la comedia nueva lopesca en 'Fuenteovejuna': mezcla de lo trágico y cómico, ruptura de unidades",
              "Identificar el tema del honor en el teatro de Calderón ('El alcalde de Zalamea')",
              "Comparar el teatro de Lope de Vega con el teatro de Tirso de Molina, identificando similitudes y diferencias",
              "Analizar la versificación polimétrica en una obra del Siglo de Oro y su función dramática"
            ]
          },
          {
            "key": "teatro_colonial",
            "name": "Teatro Colonial Mexicano",
            "short_description": "Estudio del teatro en la Nueva España, especialmente la obra de Sor Juana.",
            "example_tasks": [
              "Analizar 'Los empeños de una casa' de Sor Juana como comedia de capa y espada novohispana",
              "Identificar elementos de teatro evangelizador en piezas coloniales tempranas",
              "Comparar la estructura de comedias de Sor Juana con modelos del teatro español del Siglo de Oro",
              "Analizar el uso del náhuatl y español en teatro misional de la Nueva España"
            ]
          },
          {
            "key": "teatro_mexicano_xx",
            "name": "Teatro Mexicano del Siglo XX",
            "short_description": "Análisis del teatro mexicano moderno y sus temas identitarios.",
            "example_tasks": [
              "Analizar el tema de la identidad mexicana en la trilogía de Rodolfo Usigli (Corona de sombra, Corona de fuego, Corona de luz)",
              "Identificar elementos del teatro del absurdo en obras de Emilio Carballido",
              "Analizar la crítica social en teatro de Víctor Hugo Rascón Banda o Sabina Berman",
              "Comparar el realismo psicológico de Usigli con el teatro experimental de grupos independientes"
            ]
          },
          {
            "key": "teatro_contemporaneo",
            "name": "Teatro Contemporáneo y Experimental",
            "short_description": "Estudio de tendencias actuales del teatro en lengua española.",
            "example_tasks": [
              "Analizar rupturas formales en teatro contemporáneo mexicano (uso de multimedia, no linealidad)",
              "Identificar temas actuales en teatro mexicano reciente: migración, violencia, género",
              "Comparar teatro de texto con teatro físico o teatro devised contemporáneo",
              "Analizar cómo el teatro contemporáneo incorpora elementos de performance y otras artes"
            ]
          }
        ]
      },
      {
        "key": "representacion_escenica",
        "name": "Representación Escénica y Puesta en Escena",
        "short_description": "Estudio de los elementos que transforman el texto dramático en espectáculo teatral.",
        "sub_topics": [
          {
            "key": "espacio_escenico",
            "name": "Espacio Escénico y Escenografía",
            "short_description": "Análisis del uso del espacio teatral y el diseño escenográfico.",
            "example_tasks": [
              "Diseñar propuestas escenográficas para una escena de 'Corona de sombra', considerando época y simbolismo",
              "Comparar el espacio escénico del corral de comedias del Siglo de Oro con el teatro a la italiana",
              "Analizar cómo las acotaciones de una obra determinan posibilidades escenográficas",
              "Proponer un diseño de iluminación para crear atmósfera en una escena dramática específica"
            ]
          },
          {
            "key": "actuacion_direccion",
            "name": "Actuación y Dirección Escénica",
            "short_description": "Estudio de la interpretación actoral y la labor del director teatral.",
            "example_tasks": [
              "Proponer líneas de interpretación para un personaje complejo (Segismundo, Carlota), justificando decisiones",
              "Analizar cómo el director puede interpretar de diferentes maneras un mismo texto dramático",
              "Comparar diferentes montajes de una misma obra (por ejemplo, 'La vida es sueño') y analizar diferencias interpretativas",
              "Elaborar un plan de dirección para una escena, especificando movimientos, ritmo y motivaciones"
            ]
          },
          {
            "key": "elementos_tecnicos",
            "name": "Elementos Técnicos: Vestuario, Iluminación, Sonido",
            "short_description": "Análisis de los aspectos técnicos que complementan la puesta en escena.",
            "example_tasks": [
              "Diseñar propuestas de vestuario para personajes de una obra del Siglo de Oro, considerando simbolismo de colores",
              "Analizar cómo la iluminación puede crear diferentes atmósferas en una misma escena",
              "Proponer diseño sonoro (música, efectos) para una obra contemporánea mexicana",
              "Comparar el uso de recursos técnicos en teatro clásico (mínimos) y teatro contemporáneo (multimedia)"
            ]
          },
          {
            "key": "publico_recepcion",
            "name": "El Público y la Recepción Teatral",
            "short_description": "Estudio de la relación entre el espectáculo teatral y su audiencia.",
            "example_tasks": [
              "Analizar cómo 'Fuenteovejuna' interpela al público sobre temas de justicia y poder colectivo",
              "Comparar la recepción de una obra en su contexto original con interpretaciones contemporáneas",
              "Analizar el papel del público en teatro participativo o teatro foro contemporáneo",
              "Reflexionar sobre la función social del teatro en diferentes épocas y contextos"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "ensayo_genero",
    "name": "Ensayo - Características, Tipos y Análisis Argumentativo",
    "short_description": "Estudio del ensayo como género híbrido que combina reflexión personal, argumentación rigurosa y estilo literario.",
    "sub_topics": [
      {
        "key": "caracteristicas_ensayo",
        "name": "Características del Ensayo Literario",
        "short_description": "Análisis de los rasgos distintivos que definen el género ensayístico.",
        "sub_topics": [
          {
            "key": "subjetividad_personal",
            "name": "Subjetividad y Perspectiva Personal",
            "short_description": "Estudio de la voz personal del ensayista y su presencia en el texto.",
            "example_tasks": [
              "Identificar marcas de subjetividad (primera persona, opiniones, valoraciones) en 'El laberinto de la soledad' de Octavio Paz",
              "Comparar el tono personal de ensayos de Montaigne con el tono más objetivo de artículos académicos",
              "Analizar cómo Alfonso Reyes construye su voz ensayística en 'Visión de Anáhuac'",
              "Identificar momentos en que el ensayista equilibra perspectiva personal con evidencia objetiva"
            ]
          },
          {
            "key": "libertad_formal",
            "name": "Libertad Formal y Estructura Flexible",
            "short_description": "Análisis de la estructura no rígida y la libertad compositiva del ensayo.",
            "example_tasks": [
              "Analizar la estructura digresiva de 'Los ensayos' de Montaigne y cómo refleja el proceso de pensamiento",
              "Comparar la organización de un ensayo literario (flexible) con la de un artículo científico (rígida)",
              "Identificar transiciones y conexiones entre ideas en un ensayo de Octavio Paz",
              "Analizar cómo los ensayistas mexicanos organizan sus reflexiones sobre identidad nacional"
            ]
          },
          {
            "key": "estilo_literario",
            "name": "Estilo Literario y Recursos Expresivos",
            "short_description": "Estudio del uso de recursos literarios en el ensayo.",
            "example_tasks": [
              "Identificar metáforas y símbolos en 'El laberinto de la soledad' (la máscara, la soledad, la fiesta)",
              "Analizar el uso de la analogía y la comparación en ensayos de Alfonso Reyes",
              "Comparar el estilo poético de ensayos de José Martí con el estilo más analítico de ensayos filosóficos",
              "Identificar recursos retóricos (anáforas, preguntas retóricas, paralelismos) en ensayos literarios"
            ]
          },
          {
            "key": "intencion_reflexiva",
            "name": "Intención Reflexiva y Dialógica",
            "short_description": "Análisis del ensayo como forma de pensamiento y diálogo con el lector.",
            "example_tasks": [
              "Analizar cómo el ensayista plantea preguntas abiertas que invitan a la reflexión del lector",
              "Identificar momentos en que el ensayo dialoga con otras obras o autores (intertextualidad)",
              "Comparar la intención persuasiva de un ensayo argumentativo con la exploratoria de un ensayo reflexivo",
              "Analizar cómo 'Posdata' de Octavio Paz responde y actualiza 'El laberinto de la soledad'"
            ]
          }
        ]
      },
      {
        "key": "tipos_ensayo",
        "name": "Tipos de Ensayo",
        "short_description": "Clasificación de ensayos según su tema, propósito y enfoque.",
        "sub_topics": [
          {
            "key": "ensayo_literario",
            "name": "Ensayo Literario",
            "short_description": "Análisis de ensayos centrados en temas literarios, estéticos o culturales.",
            "example_tasks": [
              "Analizar 'La experiencia literaria' de Alfonso Reyes como reflexión sobre la naturaleza de la literatura",
              "Identificar elementos de crítica literaria en ensayos de Octavio Paz sobre poesía",
              "Comparar ensayos sobre literatura mexicana de diferentes épocas y perspectivas críticas",
              "Analizar cómo ensayistas mexicanos han definido y debatido el concepto de 'literatura nacional'"
            ]
          },
          {
            "key": "ensayo_filosofico",
            "name": "Ensayo Filosófico",
            "short_description": "Estudio de ensayos que abordan cuestiones filosóficas y existenciales.",
            "example_tasks": [
              "Analizar conceptos filosóficos en 'El laberinto de la soledad': soledad, identidad, historia",
              "Identificar influencias filosóficas (existencialismo, marxismo) en ensayistas mexicanos del siglo XX",
              "Comparar el tratamiento de la libertad en ensayos de José Vasconcelos y Samuel Ramos",
              "Analizar la reflexión sobre el ser mexicano en ensayos de la primera mitad del siglo XX"
            ]
          },
          {
            "key": "ensayo_historico_politico",
            "name": "Ensayo Histórico y Político",
            "short_description": "Análisis de ensayos que reflexionan sobre acontecimientos históricos y realidad política.",
            "example_tasks": [
              "Analizar la interpretación de la historia mexicana en 'Visión de Anáhuac' de Alfonso Reyes",
              "Identificar argumentos políticos en ensayos sobre la Revolución Mexicana",
              "Comparar visiones de la Conquista en ensayos de diferentes autores mexicanos",
              "Analizar 'Posdata' de Octavio Paz como respuesta ensayística al movimiento estudiantil de 1968"
            ]
          },
          {
            "key": "ensayo_cientifico_divulgacion",
            "name": "Ensayo Científico y de Divulgación",
            "short_description": "Estudio de ensayos que abordan temas científicos con enfoque accesible.",
            "example_tasks": [
              "Analizar cómo ensayistas presentan ideas científicas complejas de manera comprensible para el público general",
              "Identificar diferencias entre artículo científico técnico y ensayo de divulgación científica",
              "Comparar el uso de analogías y metáforas en ensayos de divulgación científica",
              "Analizar ensayos sobre ciencia y cultura en la obra de José de la Herrán o Luis Estrada"
            ]
          }
        ]
      },
      {
        "key": "estructura_ensayo",
        "name": "Estructura y Organización del Ensayo",
        "short_description": "Análisis de cómo se organizan las ideas en el texto ensayístico.",
        "sub_topics": [
          {
            "key": "introduccion_ensayo",
            "name": "Introducción: Presentación del Tema",
            "short_description": "Estudio de estrategias para introducir el tema y captar la atención del lector.",
            "example_tasks": [
              "Analizar diferentes estrategias de inicio en ensayos: anécdota, pregunta, cita, declaración provocativa",
              "Identificar cómo Octavio Paz introduce el tema de la soledad al inicio de 'El laberinto de la soledad'",
              "Comparar introducciones directas vs. introducciones graduales en ensayos literarios",
              "Escribir tres posibles introducciones para un ensayo sobre un tema literario, usando diferentes estrategias"
            ]
          },
          {
            "key": "desarrollo_argumentacion",
            "name": "Desarrollo: Argumentación y Análisis",
            "short_description": "Análisis de cómo se desarrollan y sustentan las ideas principales.",
            "example_tasks": [
              "Identificar la tesis principal y los argumentos de apoyo en un ensayo de Alfonso Reyes",
              "Analizar cómo se encadenan las ideas mediante conectores y transiciones en un ensayo literario",
              "Identificar tipos de evidencia utilizados: ejemplos, citas, datos, razonamientos lógicos",
              "Esquematizar la estructura argumentativa de un capítulo de 'El laberinto de la soledad'"
            ]
          },
          {
            "key": "conclusion_ensayo",
            "name": "Conclusión: Cierre y Síntesis",
            "short_description": "Estudio de estrategias para cerrar el ensayo y dejar una impresión duradera.",
            "example_tasks": [
              "Analizar diferentes tipos de conclusión: síntesis, proyección futura, pregunta abierta, llamado a la acción",
              "Identificar cómo las conclusiones retoman y amplían la introducción en ensayos circulares",
              "Comparar conclusiones cerradas (resolutivas) vs. conclusiones abiertas (exploratorias)",
              "Analizar la conclusión de 'El laberinto de la soledad' y su propuesta sobre el futuro mexicano"
            ]
          },
          {
            "key": "coherencia_cohesion",
            "name": "Coherencia y Cohesión Textual",
            "short_description": "Análisis de mecanismos que dan unidad lógica y lingüística al ensayo.",
            "example_tasks": [
              "Identificar conectores lógicos (causa, consecuencia, contraste) en un ensayo argumentativo",
              "Analizar el uso de referencias anafóricas y catafóricas para mantener la cohesión",
              "Identificar campos semánticos recurrentes que dan coherencia temática a un ensayo",
              "Analizar cómo las ideas se encadenan de un párrafo a otro en un ensayo de Octavio Paz"
            ]
          }
        ]
      },
      {
        "key": "ensayistas_mexicanos",
        "name": "Ensayistas Mexicanos Fundamentales",
        "short_description": "Estudio de autores mexicanos representativos del género ensayístico.",
        "sub_topics": [
          {
            "key": "alfonso_reyes",
            "name": "Alfonso Reyes",
            "short_description": "Análisis de la obra ensayística del 'regiomontano universal'.",
            "example_tasks": [
              "Analizar la visión del pasado prehispánico en 'Visión de Anáhuac' y su estilo evocador",
              "Identificar temas recurrentes en ensayos de Alfonso Reyes: literatura, humanismo, identidad americana",
              "Comparar el estilo literario de Reyes con el de otros ensayistas mexicanos más filosóficos",
              "Analizar 'La experiencia literaria' como reflexión sobre la esencia de lo literario"
            ]
          },
          {
            "key": "octavio_paz",
            "name": "Octavio Paz",
            "short_description": "Estudio del pensamiento ensayístico del Premio Nobel mexicano.",
            "example_tasks": [
              "Analizar los capítulos centrales de 'El laberinto de la soledad': máscaras, fiesta, pachuco",
              "Identificar la síntesis entre poesía y filosofía en los ensayos de Paz",
              "Comparar 'El laberinto de la soledad' (1950) con 'Posdata' (1970) y analizar evolución del pensamiento",
              "Analizar ensayos de Paz sobre arte moderno y vanguardias ('Los hijos del limo', 'La apariencia desnuda')"
            ]
          },
          {
            "key": "jose_vasconcelos",
            "name": "José Vasconcelos",
            "short_description": "Análisis del pensamiento del Ateneo de la Juventud y la filosofía de la raza cósmica.",
            "example_tasks": [
              "Analizar las ideas principales de 'La raza cósmica' y su contexto histórico posrevolucionario",
              "Identificar elementos de filosofía idealista en ensayos de Vasconcelos",
              "Comparar la visión de la identidad mestiza en Vasconcelos con la de otros ensayistas mexicanos",
              "Analizar el proyecto educativo de Vasconcelos tal como se expresa en sus ensayos"
            ]
          },
          {
            "key": "otros_ensayistas",
            "name": "Otros Ensayistas: Reyes, Monsivais, Poniatowska",
            "short_description": "Estudio de otras voces importantes del ensayo mexicano.",
            "example_tasks": [
              "Analizar la crónica ensayística urbana de Carlos Monsiváis ('Los rituales del caos')",
              "Identificar características del ensayo-testimonio en obra de Elena Poniatowska",
              "Comparar el ensayo académico tradicional con el ensayo periodístico de Jorge Ibargüengoitia",
              "Analizar ensayos de Roger Bartra sobre identidad y cultura mexicanas"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "cronica_periodismo_literario",
    "name": "Crónica y Textos Periodísticos Literarios",
    "short_description": "Estudio de géneros híbridos entre periodismo y literatura que combinan rigor informativo con recursos literarios.",
    "sub_topics": [
      {
        "key": "cronica_genero",
        "name": "La Crónica como Género",
        "short_description": "Análisis de las características distintivas de la crónica periodístico-literaria.",
        "sub_topics": [
          {
            "key": "caracteristicas_cronica",
            "name": "Características de la Crónica",
            "short_description": "Estudio de los rasgos que definen la crónica: testimonio, subjetividad y estilo.",
            "example_tasks": [
              "Identificar elementos testimoniales y literarios en crónicas de Carlos Monsiváis sobre la Ciudad de México",
              "Analizar cómo la crónica equilibra información factual con interpretación subjetiva",
              "Comparar una crónica periodística con un reportaje objetivo, identificando diferencias de estilo y enfoque",
              "Identificar recursos literarios (descripciones, metáforas, diálogos) en crónicas de Elena Poniatowska"
            ]
          },
          {
            "key": "historia_cronica",
            "name": "Historia de la Crónica en México",
            "short_description": "Análisis del desarrollo de la crónica desde la Colonia hasta la actualidad.",
            "example_tasks": [
              "Analizar crónicas de la Conquista (Bernal Díaz del Castillo) como antecedente del género",
              "Identificar características de la crónica modernista en textos de Manuel Gutiérrez Nájera",
              "Comparar la crónica urbana de Salvador Novo con la de cronistas contemporáneos",
              "Analizar la renovación de la crónica en la segunda mitad del siglo XX (Monsiváis, Poniatowska)"
            ]
          },
          {
            "key": "cronica_urbana",
            "name": "Crónica Urbana",
            "short_description": "Estudio de crónicas que retratan la vida de la ciudad y sus transformaciones.",
            "example_tasks": [
              "Analizar cómo Carlos Monsiváis retrata la cultura popular chilanga en sus crónicas",
              "Identificar técnicas de observación y registro de lo cotidiano en crónicas urbanas",
              "Comparar la representación de la Ciudad de México en diferentes cronistas y épocas",
              "Analizar crónicas sobre el terremoto de 1985 como testimonio histórico y literario"
            ]
          },
          {
            "key": "cronica_viaje",
            "name": "Crónica de Viaje",
            "short_description": "Análisis de textos que narran experiencias de viaje con mirada literaria.",
            "example_tasks": [
              "Analizar 'Cartas de viaje' de Alfonso Reyes y su visión de Europa desde una perspectiva mexicana",
              "Identificar elementos del relato de viaje en crónicas contemporáneas",
              "Comparar crónicas de viaje del siglo XIX con crónicas actuales de viajeros mexicanos",
              "Analizar cómo la crónica de viaje construye la mirada del otro y el autoconocimiento"
            ]
          }
        ]
      },
      {
        "key": "periodismo_literario",
        "name": "Periodismo Literario y Nuevo Periodismo",
        "short_description": "Estudio de corrientes periodísticas que incorporan técnicas narrativas literarias.",
        "sub_topics": [
          {
            "key": "nuevo_periodismo",
            "name": "El Nuevo Periodismo",
            "short_description": "Análisis del movimiento que renovó el periodismo con técnicas novelísticas.",
            "example_tasks": [
              "Identificar características del Nuevo Periodismo (escenas, diálogos, punto de vista) en textos de Tom Wolfe o Truman Capote",
              "Analizar la influencia del Nuevo Periodismo en cronistas latinoamericanos",
              "Comparar técnicas narrativas de la novela (descripciones detalladas, diálogos) con su uso en periodismo literario",
              "Analizar 'La noche de Tlatelolco' de Elena Poniatowska como ejemplo de periodismo testimonial"
            ]
          },
          {
            "key": "reportaje_literario",
            "name": "Reportaje Literario",
            "short_description": "Estudio del reportaje que incorpora recursos de ficción sin perder rigor factual.",
            "example_tasks": [
              "Analizar la estructura narrativa de reportajes de Alma Guillermoprieto sobre América Latina",
              "Identificar técnicas de investigación periodística combinadas con escritura literaria",
              "Comparar un reportaje tradicional con un reportaje literario sobre el mismo tema",
              "Analizar 'Hasta no verte Jesús mío' de Elena Poniatowska como novela-testimonio"
            ]
          },
          {
            "key": "perfil_semblanza",
            "name": "Perfil y Semblanza",
            "short_description": "Análisis de textos que retratan personas con profundidad psicológica y estilo.",
            "example_tasks": [
              "Analizar técnicas de caracterización en perfiles periodísticos de Vicente Leñero",
              "Identificar recursos literarios (descripciones, metáforas) en semblanzas periodísticas",
              "Comparar el perfil periodístico con la biografía literaria",
              "Escribir un perfil breve de un personaje cultural mexicano, combinando investigación y estilo"
            ]
          },
          {
            "key": "entrevista_literaria",
            "name": "Entrevista Literaria",
            "short_description": "Estudio de la entrevista como género que equilibra diálogo y narrativa.",
            "example_tasks": [
              "Analizar la estructura y estilo de entrevistas de Elena Poniatowska en 'Palabras cruzadas'",
              "Identificar cómo el entrevistador construye narrativa a partir del diálogo",
              "Comparar entrevistas periodísticas convencionales con entrevistas literarias",
              "Analizar cómo la entrevista revela personalidad del entrevistado y perspectiva del entrevistador"
            ]
          }
        ]
      },
      {
        "key": "cronistas_mexicanos",
        "name": "Cronistas Mexicanos Fundamentales",
        "short_description": "Estudio de autores mexicanos representativos de la crónica y el periodismo literario.",
        "sub_topics": [
          {
            "key": "carlos_monsivais",
            "name": "Carlos Monsiváis",
            "short_description": "Análisis de la obra cronística del gran retratista de la cultura mexicana.",
            "example_tasks": [
              "Analizar el retrato de la cultura popular en 'Los rituales del caos' de Monsiváis",
              "Identificar el uso del humor, la ironía y la cultura popular en crónicas de Monsiváis",
              "Analizar crónicas sobre eventos históricos mexicanos (1968, 1985) en la obra de Monsiváis",
              "Comparar el estilo de Monsiváis (barroco, alusivo) con el de otros cronistas más directos"
            ]
          },
          {
            "key": "elena_poniatowska",
            "name": "Elena Poniatowska",
            "short_description": "Estudio de la obra testimonial y cronística de una de las grandes escritoras mexicanas.",
            "example_tasks": [
              "Analizar 'La noche de Tlatelolco' como crónica polifónica del movimiento estudiantil de 1968",
              "Identificar técnicas de periodismo testimonial en 'Nada, nadie: las voces del temblor'",
              "Analizar cómo Poniatowska da voz a los marginados en su obra cronística",
              "Comparar técnicas narrativas en sus crónicas con las de sus novelas testimoniales"
            ]
          },
          {
            "key": "juan_villoro",
            "name": "Juan Villoro y la Crónica Contemporánea",
            "short_description": "Análisis de la renovación de la crónica en el siglo XXI.",
            "example_tasks": [
              "Analizar ensayos y crónicas de 'Safari accidental' de Juan Villoro",
              "Identificar el concepto de 'ornitorrinco de la prosa' que Villoro aplica a la crónica",
              "Comparar la crónica futbolística de Villoro con crónicas sobre otros temas culturales",
              "Analizar cómo cronistas contemporáneos incorporan cultura digital y nuevas realidades urbanas"
            ]
          },
          {
            "key": "otros_cronistas",
            "name": "Otros Cronistas: Gutiérrez Vivo, Krauze, Leñero",
            "short_description": "Estudio de otras voces importantes de la crónica mexicana.",
            "example_tasks": [
              "Analizar crónicas de José Joaquín Blanco sobre literatura y cultura mexicanas",
              "Identificar características del periodismo de investigación literario en Vicente Leñero",
              "Comparar estilos de diferentes cronistas contemporáneos mexicanos",
              "Analizar crónicas de Enrique Krauze sobre historia y figuras políticas mexicanas"
            ]
          }
        ]
      },
      {
        "key": "tecnicas_periodismo_literario",
        "name": "Técnicas de Escritura Periodístico-Literaria",
        "short_description": "Análisis de recursos y estrategias propias del periodismo que aspira a la literaturidad.",
        "sub_topics": [
          {
            "key": "investigacion_documentacion",
            "name": "Investigación y Documentación",
            "short_description": "Estudio del trabajo de campo y recopilación de información para la crónica.",
            "example_tasks": [
              "Analizar cómo Elena Poniatowska recopiló testimonios para 'La noche de Tlatelolco'",
              "Identificar fuentes de información (entrevistas, documentos, observación) en una crónica",
              "Comparar el proceso de investigación periodística con la investigación para ficción histórica",
              "Diseñar un plan de investigación para una crónica sobre un tema cultural mexicano actual"
            ]
          },
          {
            "key": "construccion_escenas",
            "name": "Construcción de Escenas",
            "short_description": "Análisis del uso de la escena como unidad narrativa en periodismo literario.",
            "example_tasks": [
              "Identificar escenas construidas con detalle en crónicas de Carlos Monsiváis",
              "Analizar cómo la reconstrucción de escenas crea inmersión en el lector",
              "Comparar la construcción de escenas en crónica con técnicas de narrativa de ficción",
              "Escribir una escena periodística sobre un evento observado, usando descripciones y diálogos"
            ]
          },
          {
            "key": "voz_perspectiva_cronica",
            "name": "Voz y Perspectiva del Cronista",
            "short_description": "Estudio de cómo el cronista se posiciona en relación con lo narrado.",
            "example_tasks": [
              "Analizar la presencia de la primera persona en crónicas de Juan Villoro",
              "Identificar momentos en que el cronista se hace visible vs. cuando se oculta",
              "Comparar la objetividad periodística tradicional con la subjetividad asumida de la crónica",
              "Analizar cómo la perspectiva del cronista influye en la interpretación de los hechos"
            ]
          },
          {
            "key": "ritmo_estilo_periodistico",
            "name": "Ritmo y Estilo en Periodismo Literario",
            "short_description": "Análisis de recursos estilísticos que distinguen el periodismo literario.",
            "example_tasks": [
              "Identificar recursos literarios (metáforas, símiles, imágenes) en crónicas periodísticas",
              "Analizar el uso de la sintaxis para crear ritmo en textos de Monsiváis",
              "Comparar el estilo directo del periodismo tradicional con el estilo elaborado de la crónica literaria",
              "Analizar cómo el uso de diálogos recreados da vivacidad a la crónica"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "literatura_prehispanica_colonial",
    "name": "Literatura Prehispánica y Colonial",
    "short_description": "Estudio de las expresiones literarias de los pueblos originarios de Mesoamérica y la producción literaria durante el virreinato de la Nueva España.",
    "sub_topics": [
      {
        "key": "literatura_nahuatl",
        "name": "Literatura Náhuatl",
        "short_description": "Análisis de la tradición poética y narrativa de los pueblos nahuas antes y después de la Conquista.",
        "sub_topics": [
          {
            "key": "poesia_nahuatl",
            "name": "Poesía Náhuatl: Cuícatl",
            "short_description": "Estudio de los cantos y poemas de la tradición náhuatl prehispánica.",
            "example_tasks": [
              "Analizar poemas de Nezahualcóyotl sobre la fugacidad de la vida y la búsqueda de permanencia",
              "Identificar temas recurrentes en poesía náhuatl: flores, cantos, guerra, muerte, divinidad",
              "Analizar el difrasismo (metáfora doble) como recurso poético náhuatl: 'in xóchitl in cuícatl' (flor y canto = poesía)",
              "Comparar la concepción de la poesía en la tradición náhuatl con la tradición europea"
            ]
          },
          {
            "key": "codices_literatura",
            "name": "Códices y Textos Pictográficos",
            "short_description": "Análisis de los sistemas de escritura mesoamericanos y su dimensión literaria.",
            "example_tasks": [
              "Analizar la función narrativa de códices como el Códice Borgia o el Códice Mendoza",
              "Identificar elementos visuales y simbólicos en códices prehispánicos y coloniales",
              "Comparar la escritura pictográfica náhuatl con sistemas de escritura alfabéticos",
              "Analizar cómo los códices preservan mitos, historia y conocimiento de los pueblos mesoamericanos"
            ]
          },
          {
            "key": "huehuetlatolli",
            "name": "Huehuetlatolli: Discursos de los Ancianos",
            "short_description": "Estudio de la tradición oral de consejos y enseñanzas morales.",
            "example_tasks": [
              "Analizar la estructura y función de los huehuetlatolli como textos didácticos y morales",
              "Identificar valores culturales nahuas expresados en los discursos de los ancianos",
              "Comparar los huehuetlatolli con tradiciones sapienciales de otras culturas (Proverbios bíblicos, máximas grecolatinas)",
              "Analizar el uso de metáforas y recursos retóricos en los huehuetlatolli"
            ]
          },
          {
            "key": "mitos_nahuatl",
            "name": "Mitos y Narrativa Náhuatl",
            "short_description": "Análisis de mitos cosmogónicos y relatos tradicionales nahuas.",
            "example_tasks": [
              "Analizar el mito de los Cinco Soles y la concepción cíclica del tiempo en la cosmovisión náhuatl",
              "Identificar la función de Quetzalcóatl en diferentes mitos nahuas",
              "Comparar mitos de creación nahuas con mitos de otras tradiciones culturales",
              "Analizar cómo los mitos nahuas fueron registrados y transformados en textos coloniales"
            ]
          }
        ]
      },
      {
        "key": "literatura_maya",
        "name": "Literatura Maya",
        "short_description": "Estudio de las expresiones literarias de la civilización maya, especialmente del Popol Vuh.",
        "sub_topics": [
          {
            "key": "popol_vuh",
            "name": "Popol Vuh: Libro del Consejo",
            "short_description": "Análisis del texto fundamental de la literatura maya quiché.",
            "example_tasks": [
              "Analizar la estructura del Popol Vuh: cosmogonía, mitos de héroes gemelos, orígenes del pueblo quiché",
              "Identificar la función de Hunahpú e Ixbalanqué como héroes culturales en el Popol Vuh",
              "Comparar el mito de la creación del hombre en el Popol Vuh (hombres de maíz) con otros mitos de creación",
              "Analizar elementos narrativos del descenso al Xibalbá (inframundo) como viaje iniciático"
            ]
          },
          {
            "key": "chilam_balam",
            "name": "Libros de Chilam Balam",
            "short_description": "Estudio de textos mayas coloniales que preservan tradiciones prehispánicas.",
            "example_tasks": [
              "Analizar la mezcla de elementos prehispánicos y coloniales en los libros de Chilam Balam",
              "Identificar profecías y concepciones temporales mayas en estos textos",
              "Comparar la estructura de los Chilam Balam con el Popol Vuh",
              "Analizar cómo los mayas preservaron su memoria cultural a través de la escritura alfabética colonial"
            ]
          },
          {
            "key": "poesia_maya",
            "name": "Poesía y Teatro Maya",
            "short_description": "Análisis de expresiones poéticas y dramáticas de la tradición maya.",
            "example_tasks": [
              "Analizar el Rabinal Achí como ejemplo de teatro maya prehispánico",
              "Identificar elementos rituales y ceremoniales en el teatro maya",
              "Comparar la poesía maya con la poesía náhuatl en temas y recursos",
              "Analizar la función social y religiosa de las representaciones teatrales mayas"
            ]
          }
        ]
      },
      {
        "key": "cronicas_conquista",
        "name": "Crónicas de la Conquista",
        "short_description": "Análisis de textos que narran los acontecimientos de la Conquista desde diversas perspectivas.",
        "sub_topics": [
          {
            "key": "vision_vencedores",
            "name": "Visión de los Vencedores",
            "short_description": "Estudio de crónicas españolas sobre la Conquista de México.",
            "example_tasks": [
              "Analizar pasajes de 'Cartas de relación' de Hernán Cortés y su construcción retórica del conquistador",
              "Identificar estrategias narrativas de justificación de la Conquista en crónicas españolas",
              "Comparar la representación de Moctezuma en diferentes crónicas españolas",
              "Analizar el uso de la épica y lo maravilloso en las crónicas de Indias"
            ]
          },
          {
            "key": "bernal_diaz",
            "name": "Bernal Díaz del Castillo",
            "short_description": "Análisis de 'Historia verdadera de la conquista de la Nueva España'.",
            "example_tasks": [
              "Analizar el estilo testimonial y la perspectiva del soldado común en Bernal Díaz del Castillo",
              "Comparar la 'Historia verdadera' de Bernal Díaz con las crónicas oficiales de López de Gómara",
              "Identificar recursos literarios (descripciones, diálogos, episodios) en la narrativa de Bernal Díaz",
              "Analizar la representación de la primera vista de Tenochtitlan en la crónica de Bernal Díaz"
            ]
          },
          {
            "key": "vision_vencidos",
            "name": "Visión de los Vencidos",
            "short_description": "Estudio de testimonios indígenas sobre la Conquista.",
            "example_tasks": [
              "Analizar textos nahuas sobre la Conquista recopilados por Miguel León-Portilla en 'Visión de los vencidos'",
              "Identificar diferencias de perspectiva entre crónicas españolas y testimonios indígenas",
              "Analizar el tono elegíaco y la representación de la catástrofe en textos nahuas sobre la Conquista",
              "Comparar presagios y augurios en fuentes indígenas con interpretaciones españolas de los mismos eventos"
            ]
          },
          {
            "key": "sahagún_mestizaje_cultural",
            "name": "Sahagún y el Mestizaje Cultural",
            "short_description": "Análisis de la obra de fray Bernardino de Sahagún y la preservación de la cultura náhuatl.",
            "example_tasks": [
              "Analizar la metodología de Sahagún en la 'Historia general de las cosas de la Nueva España' (Códice Florentino)",
              "Identificar la colaboración entre frailes españoles e informantes nahuas en la preservación cultural",
              "Analizar cómo Sahagún preservó textos literarios, mitos y tradiciones nahuas",
              "Comparar la actitud de Sahagún hacia la cultura indígena con la de otros cronistas y evangelizadores"
            ]
          }
        ]
      },
      {
        "key": "literatura_virreinal",
        "name": "Literatura del Virreinato",
        "short_description": "Estudio de la producción literaria en la Nueva España durante los siglos XVI al XVIII.",
        "sub_topics": [
          {
            "key": "poesia_virreinal",
            "name": "Poesía Virreinal",
            "short_description": "Análisis de la poesía novohispana desde el Renacimiento hasta el Barroco.",
            "example_tasks": [
              "Analizar sonetos de Bernardo de Balbuena en 'Grandeza mexicana' y su visión laudatoria de la ciudad",
              "Identificar influencias petrarquistas en poesía amorosa novohispana del siglo XVI",
              "Comparar la poesía religiosa novohispana con modelos peninsulares del Siglo de Oro",
              "Analizar poemas de Carlos de Sigüenza y Góngora y la recepción del culteranismo en Nueva España"
            ]
          },
          {
            "key": "sor_juana",
            "name": "Sor Juana Inés de la Cruz",
            "short_description": "Estudio de la obra de la máxima figura de las letras novohispanas.",
            "example_tasks": [
              "Analizar el 'Primero sueño' de Sor Juana como poema filosófico sobre el conocimiento",
              "Identificar la defensa del derecho de las mujeres al conocimiento en la 'Respuesta a Sor Filotea'",
              "Analizar sonetos de amor de Sor Juana y su tratamiento del amor cortés y petrarquista",
              "Comparar la poesía de Sor Juana con la de Góngora y Quevedo, identificando influencias y originalidad",
              "Analizar villancicos de Sor Juana y la incorporación de voces populares, indígenas y afromexicanas"
            ]
          },
          {
            "key": "teatro_novohispano",
            "name": "Teatro Novohispano",
            "short_description": "Análisis del teatro en la Nueva España, religioso y secular.",
            "example_tasks": [
              "Analizar 'Los empeños de una casa' de Sor Juana como comedia de enredo novohispana",
              "Identificar elementos del teatro evangelizador en piezas del siglo XVI",
              "Comparar el teatro novohispano con modelos del Siglo de Oro español",
              "Analizar autos sacramentales de Sor Juana ('El divino Narciso') y su sincretismo cultural"
            ]
          },
          {
            "key": "prosa_virreinal",
            "name": "Prosa y Crónica Virreinal",
            "short_description": "Estudio de la narrativa, historia y escritos eruditos del periodo virreinal.",
            "example_tasks": [
              "Analizar 'Los infortunios de Alonso Ramírez' de Carlos de Sigüenza y Góngora como antecedente de la novela",
              "Identificar elementos picarescos en la narrativa virreinal novohispana",
              "Analizar crónicas conventuales y hagiografías en la literatura virreinal",
              "Comparar la prosa científica de Sigüenza y Góngora con la literaria de Sor Juana"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "literatura_siglo_xix_mexicano",
    "name": "Literatura del Siglo XIX Mexicano",
    "short_description": "Estudio de las corrientes literarias del México independiente: Neoclasicismo, Romanticismo, Realismo y Modernismo.",
    "sub_topics": [
      {
        "key": "literatura_independencia",
        "name": "Literatura de la Independencia",
        "short_description": "Análisis de textos literarios y periodísticos del periodo independentista.",
        "sub_topics": [
          {
            "key": "fernandez_lizardi",
            "name": "José Joaquín Fernández de Lizardi",
            "short_description": "Estudio de 'El Pensador Mexicano' y el nacimiento de la novela mexicana.",
            "example_tasks": [
              "Analizar 'El Periquillo Sarniento' como primera novela hispanoamericana y su función didáctico-moral",
              "Identificar elementos picarescos en 'El Periquillo Sarniento' y su adaptación al contexto mexicano",
              "Analizar la crítica social y política en la obra periodística de Fernández de Lizardi",
              "Comparar 'El Periquillo Sarniento' con la novela picaresca española (Lazarillo, Guzmán de Alfarache)"
            ]
          },
          {
            "key": "poesia_neoclasica",
            "name": "Poesía Neoclásica",
            "short_description": "Análisis de la poesía del periodo de transición entre Colonia e Independencia.",
            "example_tasks": [
              "Analizar características neoclásicas (razón, equilibrio, imitación clásica) en poesía del primer México independiente",
              "Identificar temas patrióticos e independentistas en poesía de Andrés Quintana Roo o Francisco Manuel Sánchez de Tagle",
              "Comparar la poesía neoclásica mexicana con modelos españoles (Meléndez Valdés, Cienfuegos)",
              "Analizar la función social y política de la poesía en el contexto independentista"
            ]
          }
        ]
      },
      {
        "key": "romanticismo_mexicano",
        "name": "Romanticismo Mexicano",
        "short_description": "Estudio del movimiento romántico en México y sus principales exponentes.",
        "sub_topics": [
          {
            "key": "poesia_romantica",
            "name": "Poesía Romántica Mexicana",
            "short_description": "Análisis de poetas románticos mexicanos del siglo XIX.",
            "example_tasks": [
              "Analizar 'Nocturno a Rosario' de Manuel Acuña y sus elementos románticos: amor imposible, naturaleza, melancolía",
              "Identificar temas románticos (amor, muerte, soledad, rebeldía) en poesía de Ignacio Rodríguez Galván",
              "Comparar el Romanticismo mexicano con el español (Bécquer, Espronceda) y el europeo",
              "Analizar poesía de Guillermo Prieto y su combinación de romanticismo y costumbrismo"
            ]
          },
          {
            "key": "novela_historica_romantica",
            "name": "Novela Histórica Romántica",
            "short_description": "Estudio de novelas que recrean el pasado desde la sensibilidad romántica.",
            "example_tasks": [
              "Analizar 'Los bandidos de Río Frío' de Manuel Payno como novela histórico-costumbrista",
              "Identificar elementos románticos en novelas históricas sobre el México colonial",
              "Comparar la novela histórica mexicana con modelos europeos (Walter Scott, Alejandro Dumas)",
              "Analizar cómo la novela histórica romántica construye una identidad nacional mexicana"
            ]
          },
          {
            "key": "leyendas_tradiciones",
            "name": "Leyendas y Tradiciones",
            "short_description": "Análisis de la recuperación romántica de leyendas y tradiciones populares.",
            "example_tasks": [
              "Analizar leyendas románticas mexicanas que recrean el pasado colonial y prehispánico",
              "Identificar elementos del cuento tradicional en leyendas del romanticismo mexicano",
              "Comparar leyendas románticas mexicanas con las Tradiciones Peruanas de Ricardo Palma",
              "Analizar la función del cuento de tradiciones en la construcción de identidad nacional"
            ]
          },
          {
            "key": "teatro_romantico",
            "name": "Teatro Romántico",
            "short_description": "Estudio del drama romántico mexicano del siglo XIX.",
            "example_tasks": [
              "Analizar dramas históricos románticos sobre temas mexicanos (Conquista, Independencia)",
              "Identificar características del drama romántico: pasiones extremas, conflictos, rechazo de unidades",
              "Comparar el teatro romántico mexicano con el español (Duque de Rivas, Zorrilla)",
              "Analizar la representación de héroes nacionales en el teatro romántico mexicano"
            ]
          }
        ]
      },
      {
        "key": "realismo_naturalismo",
        "name": "Realismo y Naturalismo",
        "short_description": "Análisis de corrientes literarias que buscan retratar objetivamente la realidad social.",
        "sub_topics": [
          {
            "key": "novela_realista",
            "name": "Novela Realista Mexicana",
            "short_description": "Estudio de novelas que retratan la sociedad mexicana con objetividad.",
            "example_tasks": [
              "Analizar 'La Calandria' de Rafael Delgado y su retrato de la vida provinciana mexicana",
              "Identificar técnicas realistas: descripción detallada, verosimilitud, crítica social moderada",
              "Comparar la novela realista mexicana con modelos europeos (Balzac, Flaubert, Galdós)",
              "Analizar 'Los bandidos de Río Frío' como puente entre romanticismo y realismo"
            ]
          },
          {
            "key": "naturalismo_mexicano",
            "name": "Naturalismo Mexicano",
            "short_description": "Análisis de la corriente naturalista y su determinismo social.",
            "example_tasks": [
              "Analizar elementos naturalistas en 'Santa' de Federico Gamboa: determinismo, marginalidad, descripción cruda",
              "Identificar influencias de Émile Zola en la narrativa naturalista mexicana",
              "Comparar el tratamiento de temas sociales (prostitución, alcoholismo) en naturalismo vs. romanticismo",
              "Analizar la representación de la ciudad de México en la novela naturalista"
            ]
          },
          {
            "key": "costumbrismo",
            "name": "Costumbrismo",
            "short_description": "Estudio de textos que retratan costumbres y tipos sociales mexicanos.",
            "example_tasks": [
              "Analizar cuadros costumbristas de Guillermo Prieto sobre tipos y escenas mexicanas",
              "Identificar función del costumbrismo en la construcción de identidad nacional",
              "Comparar el costumbrismo mexicano con el español (Larra, Mesonero Romanos)",
              "Analizar el uso del lenguaje popular y modismos en textos costumbristas"
            ]
          }
        ]
      },
      {
        "key": "modernismo_mexicano",
        "name": "Modernismo Mexicano",
        "short_description": "Estudio del movimiento modernista en México y su renovación estética.",
        "sub_topics": [
          {
            "key": "revista_azul_moderna",
            "name": "Revista Azul y Revista Moderna",
            "short_description": "Análisis de las publicaciones que difundieron el Modernismo en México.",
            "example_tasks": [
              "Analizar el papel de la Revista Azul (1894-1896) en la introducción del Modernismo en México",
              "Identificar características modernistas en textos publicados en estas revistas",
              "Comparar la Revista Moderna (1903-1911) con publicaciones modernistas de otros países latinoamericanos",
              "Analizar la función de revistas literarias en la profesionalización del escritor"
            ]
          },
          {
            "key": "gutierrez_najera",
            "name": "Manuel Gutiérrez Nájera",
            "short_description": "Estudio del iniciador del Modernismo en México.",
            "example_tasks": [
              "Analizar crónicas de Gutiérrez Nájera y su prosa modernista refinada",
              "Identificar elementos modernistas en poesía de Gutiérrez Nájera: musicalidad, sinestesia, exotismo moderado",
              "Comparar el modernismo de Gutiérrez Nájera (más contenido) con el de Rubén Darío (más formal)",
              "Analizar 'La duquesa Job' y otros poemas que modernizan temas urbanos mexicanos"
            ]
          },
          {
            "key": "amado_nervo",
            "name": "Amado Nervo",
            "short_description": "Análisis de la poesía modernista y mística de Nervo.",
            "example_tasks": [
              "Analizar la evolución poética de Amado Nervo desde el modernismo hacia temas más espirituales",
              "Identificar elementos de poesía mística y filosófica en la obra madura de Nervo",
              "Comparar el modernismo sensorial de Darío con el modernismo espiritual de Nervo",
              "Analizar poemas de 'La amada inmóvil' y su tratamiento del amor y la muerte"
            ]
          },
          {
            "key": "otros_modernistas",
            "name": "Otros Modernistas: Tablada, Urbina, Othón",
            "short_description": "Estudio de otras figuras del Modernismo mexicano.",
            "example_tasks": [
              "Analizar la experimentación de José Juan Tablada con el haikú y la poesía visual",
              "Identificar características del modernismo en poesía de Luis G. Urbina",
              "Analizar 'Idilio salvaje' de Manuel José Othón y su visión del paisaje mexicano",
              "Comparar diferentes vertientes del modernismo mexicano: cosmopolita, místico, nacionalista"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "literatura_revolucion",
    "name": "Literatura de la Revolución Mexicana",
    "short_description": "Estudio de la narrativa que surge de la experiencia revolucionaria y que define una identidad literaria nacional.",
    "sub_topics": [
      {
        "key": "novela_revolucion",
        "name": "Novela de la Revolución Mexicana",
        "short_description": "Análisis del ciclo novelístico que narra la Revolución desde diversas perspectivas.",
        "sub_topics": [
          {
            "key": "los_de_abajo",
            "name": "Los de Abajo de Mariano Azuela",
            "short_description": "Estudio de la novela fundacional de la narrativa revolucionaria.",
            "example_tasks": [
              "Analizar la estructura episódica de 'Los de abajo' y su reflejo del caos revolucionario",
              "Identificar la desilusión y el sinsentido de la violencia en la trayectoria de Demetrio Macías",
              "Comparar la representación de la Revolución en Azuela (crítica) con visiones heroicas oficiales",
              "Analizar la función de personajes como Luis Cervantes (el oportunista) y la Pintada (la soldadera)"
            ]
          },
          {
            "key": "martin_luis_guzman",
            "name": "Martín Luis Guzmán",
            "short_description": "Análisis de las novelas y memorias sobre líderes revolucionarios.",
            "example_tasks": [
              "Analizar 'El águila y la serpiente' como memorias literarias de la Revolución",
              "Identificar técnicas narrativas en la caracterización de Villa en 'Memorias de Pancho Villa'",
              "Comparar el estilo más elaborado de Guzmán con el realismo crudo de Azuela",
              "Analizar 'La sombra del caudillo' como crítica a la violencia política posrevolucionaria"
            ]
          },
          {
            "key": "rafael_munoz",
            "name": "Rafael F. Muñoz y Otros Narradores",
            "short_description": "Estudio de autores que completan el panorama de la narrativa revolucionaria.",
            "example_tasks": [
              "Analizar cuentos de Rafael F. Muñoz ('¡Vámonos con Pancho Villa!') y su visión crítica del villismo",
              "Identificar diferentes representaciones regionales de la Revolución en diversos autores",
              "Comparar novelas sobre la Revolución escritas durante vs. después del conflicto",
              "Analizar 'Cartucho' de Nellie Campobello como testimonio desde una perspectiva infantil y femenina"
            ]
          },
          {
            "key": "temas_revolucion",
            "name": "Temas y Características de la Novela Revolucionaria",
            "short_description": "Análisis de elementos comunes en la narrativa de la Revolución.",
            "example_tasks": [
              "Identificar temas recurrentes: violencia, desilusión, caciquismo, traición, oportunismo",
              "Analizar la representación de personajes populares: campesinos, soldaderas, caudillos",
              "Comparar el idealismo inicial con el desencanto final en varias novelas revolucionarias",
              "Analizar la función de la novela revolucionaria en la construcción de memoria histórica"
            ]
          }
        ]
      },
      {
        "key": "poesia_revolucionaria",
        "name": "Poesía y Otros Géneros de la Época Revolucionaria",
        "short_description": "Estudio de expresiones líricas y dramáticas del periodo revolucionario.",
        "sub_topics": [
          {
            "key": "corridos_revolucionarios",
            "name": "Corridos Revolucionarios",
            "short_description": "Análisis del corrido como expresión popular de la Revolución.",
            "example_tasks": [
              "Analizar la estructura narrativa de corridos como 'La Adelita' o 'La cucaracha'",
              "Identificar la función del corrido como vehículo de memoria histórica popular",
              "Comparar corridos revolucionarios con romances españoles tradicionales",
              "Analizar cómo los corridos construyen figuras heroicas o antiheroicas de la Revolución"
            ]
          },
          {
            "key": "poesia_revolucion",
            "name": "Poesía sobre la Revolución",
            "short_description": "Estudio de poemas cultos inspirados en la experiencia revolucionaria.",
            "example_tasks": [
              "Analizar poemas de López Velarde sobre la Revolución y sus efectos en la vida provincial",
              "Identificar representaciones poéticas de la violencia revolucionaria",
              "Comparar el tratamiento lírico vs. narrativo de la Revolución",
              "Analizar cómo la poesía posterior reinterpreta la Revolución desde la distancia temporal"
            ]
          },
          {
            "key": "teatro_revolucion",
            "name": "Teatro de la Revolución",
            "short_description": "Análisis de obras dramáticas sobre temas revolucionarios.",
            "example_tasks": [
              "Analizar obras de teatro popular sobre la Revolución y su función propagandística o crítica",
              "Identificar la representación de conflictos revolucionarios en el teatro mexicano",
              "Comparar tratamiento dramático vs. narrativo de episodios revolucionarios",
              "Analizar la evolución del teatro sobre la Revolución desde interpretaciones heroicas a críticas"
            ]
          }
        ]
      },
      {
        "key": "nacionalismo_cultural",
        "name": "Nacionalismo Cultural Posrevolucionario",
        "short_description": "Estudio del proyecto cultural que surge tras la Revolución y su impacto literario.",
        "sub_topics": [
          {
            "key": "vasconcelos_proyecto",
            "name": "José Vasconcelos y el Proyecto Educativo",
            "short_description": "Análisis del impacto del proyecto vasconcelista en la literatura.",
            "example_tasks": [
              "Analizar 'La raza cósmica' de Vasconcelos como visión del mestizaje mexicano",
              "Identificar la influencia del proyecto educativo vasconcelista en la difusión de la literatura",
              "Comparar el nacionalismo cultural posrevolucionario con otros nacionalismos latinoamericanos",
              "Analizar la relación entre muralismo y literatura en el proyecto cultural posrevolucionario"
            ]
          },
          {
            "key": "lopez_velarde",
            "name": "Ramón López Velarde",
            "short_description": "Estudio del poeta de la 'provincia' y su visión del México posrevolucionario.",
            "example_tasks": [
              "Analizar 'Suave Patria' como poema fundacional de la identidad mexicana posrevolucionaria",
              "Identificar la tensión entre provincia y ciudad, tradición y modernidad en poesía de López Velarde",
              "Comparar el tono irónico y ambivalente de López Velarde con nacionalismos más directos",
              "Analizar el erotismo católico y las contradicciones en la poesía de López Velarde"
            ]
          },
          {
            "key": "indigenismo_literatura",
            "name": "Indigenismo Literario",
            "short_description": "Análisis de la corriente que reivindica lo indígena en la literatura posrevolucionaria.",
            "example_tasks": [
              "Analizar representaciones del indígena en novelas indigenistas mexicanas",
              "Identificar diferencias entre indigenismo literario (escrito por mestizos) y literatura indígena (escrita por indígenas)",
              "Comparar el indigenismo mexicano con el de otros países latinoamericanos (Perú, Ecuador)",
              "Analizar límites y problemas del indigenismo como representación del otro"
            ]
          },
          {
            "key": "literatura_cristera",
            "name": "Literatura de la Guerra Cristera",
            "short_description": "Estudio de narrativas sobre el conflicto religioso posrevolucionario.",
            "example_tasks": [
              "Analizar representaciones literarias de la Guerra Cristera (1926-1929)",
              "Identificar perspectivas encontradas sobre el conflicto religioso en literatura mexicana",
              "Comparar novelas cristeras con novelas de la Revolución en técnicas y perspectivas",
              "Analizar cómo la literatura procesa el trauma del conflicto religioso en México"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "literatura_mexicana_siglo_xx",
    "name": "Literatura Mexicana Contemporánea (Siglo XX)",
    "short_description": "Estudio de las corrientes, movimientos y autores que renuevan la literatura mexicana desde las vanguardias hasta finales del siglo XX.",
    "sub_topics": [
      {
        "key": "vanguardias_mexico",
        "name": "Vanguardias en México",
        "short_description": "Análisis de movimientos de vanguardia y su manifestación en la literatura mexicana.",
        "sub_topics": [
          {
            "key": "estridentismo",
            "name": "Estridentismo",
            "short_description": "Estudio del movimiento vanguardista mexicano más radical.",
            "example_tasks": [
              "Analizar el 'Manifiesto Estridentista' de Manuel Maples Arce y sus propuestas renovadoras",
              "Identificar elementos futuristas, dadaístas y ultraístas en poesía estridentista",
              "Comparar el estridentismo mexicano con vanguardias europeas y latinoamericanas",
              "Analizar poemas de 'Urbe' de Maples Arce y su celebración de la modernidad urbana"
            ]
          },
          {
            "key": "grupo_contemporaneos",
            "name": "Grupo Contemporáneos",
            "short_description": "Análisis del grupo de poetas que renovaron la lírica mexicana.",
            "example_tasks": [
              "Identificar características de la poesía de Contemporáneos: introspección, cultura universal, experimentación",
              "Comparar la actitud cosmopolita de Contemporáneos con el nacionalismo de estridentistas",
              "Analizar la revista 'Contemporáneos' y su papel en la renovación cultural mexicana",
              "Identificar influencias de vanguardias europeas (surrealismo, simbolismo) en poetas Contemporáneos"
            ]
          },
          {
            "key": "xavier_villaurrutia",
            "name": "Xavier Villaurrutia",
            "short_description": "Estudio de la poesía nocturna y teatral de Villaurrutia.",
            "example_tasks": [
              "Analizar los 'Nocturnos' de Villaurrutia: insomnio, muerte, amor, soledad",
              "Identificar recursos surrealistas y juegos de palabras en poesía de Villaurrutia",
              "Analizar el teatro experimental de Villaurrutia ('Invitación a la muerte')",
              "Comparar la poesía de Villaurrutia con la de otros Contemporáneos"
            ]
          },
          {
            "key": "jose_gorostiza",
            "name": "José Gorostiza",
            "short_description": "Análisis de 'Muerte sin fin' y la poesía reflexiva de Gorostiza.",
            "example_tasks": [
              "Analizar 'Muerte sin fin' como poema filosófico sobre forma, sustancia y muerte",
              "Identificar símbolos centrales: agua, vaso, forma, dios",
              "Comparar 'Muerte sin fin' con otros poemas extensos de la lírica hispanoamericana",
              "Analizar la búsqueda de la palabra esencial en la poesía breve de Gorostiza"
            ]
          },
          {
            "key": "otros_contemporaneos",
            "name": "Otros Contemporáneos: Novo, Pellicer, Owen",
            "short_description": "Estudio de otros miembros destacados del grupo.",
            "example_tasks": [
              "Analizar la poesía coloquial y la crónica urbana de Salvador Novo",
              "Identificar elementos de neotradicionalismo en poesía de Carlos Pellicer",
              "Analizar la poesía hermética de Gilberto Owen y Jorge Cuesta",
              "Comparar diferentes vertientes dentro del grupo Contemporáneos"
            ]
          }
        ]
      },
      {
        "key": "octavio_paz",
        "name": "Octavio Paz",
        "short_description": "Estudio de la obra poética y ensayística del Premio Nobel mexicano.",
        "sub_topics": [
          {
            "key": "poesia_paz",
            "name": "Poesía de Octavio Paz",
            "short_description": "Análisis de la evolución poética de Paz desde sus inicios hasta su madurez.",
            "example_tasks": [
              "Analizar 'Piedra de sol' y su estructura cíclica basada en el calendario azteca",
              "Identificar elementos surrealistas en poesía temprana de Paz",
              "Analizar poemas visuales y experimentales de Paz ('Topoemas', 'Discos visuales')",
              "Comparar diferentes etapas de la poesía de Paz: social, surrealista, oriental, experimental"
            ]
          },
          {
            "key": "ensayo_paz",
            "name": "Ensayo de Octavio Paz",
            "short_description": "Estudio de los ensayos sobre identidad, poesía y cultura.",
            "example_tasks": [
              "Analizar 'El laberinto de la soledad' como interpretación de la identidad mexicana (ya tratado en Chunk 1)",
              "Identificar la teoría poética de Paz en 'El arco y la lira'",
              "Analizar 'Los hijos del limo' como ensayo sobre tradición de la ruptura en modernidad",
              "Comparar ensayos sobre arte de Paz: 'Apariencia desnuda' (Duchamp), ensayos sobre Tantra"
            ]
          },
          {
            "key": "paz_internacional",
            "name": "Paz y el Diálogo Internacional",
            "short_description": "Análisis de la posición de Paz en el contexto literario mundial.",
            "example_tasks": [
              "Analizar la influencia de poesía oriental (haiku, tantra) en la obra de Paz",
              "Identificar el diálogo de Paz con surrealismo francés y poesía norteamericana",
              "Comparar la poética de Paz con la de otros poetas latinoamericanos (Neruda, Borges, Vallejo)",
              "Analizar el impacto del Nobel (1990) en la proyección internacional de la literatura mexicana"
            ]
          }
        ]
      },
      {
        "key": "narrativa_contemporanea_xx",
        "name": "Narrativa Mexicana de Mediados del Siglo XX",
        "short_description": "Estudio de la renovación narrativa mexicana y sus principales exponentes.",
        "sub_topics": [
          {
            "key": "juan_rulfo",
            "name": "Juan Rulfo",
            "short_description": "Análisis de la obra maestra de la narrativa mexicana.",
            "example_tasks": [
              "Analizar la estructura fragmentada y las voces múltiples de 'Pedro Páramo'",
              "Identificar temas rulfianos: muerte, caciquismo, desolación, culpa",
              "Analizar el tratamiento del tiempo y el espacio en Comala como espacio mítico",
              "Comparar cuentos de 'El llano en llamas' con 'Pedro Páramo' en estilo y temas",
              "Analizar la influencia de Rulfo en el Boom latinoamericano y narrativa posterior"
            ]
          },
          {
            "key": "carlos_fuentes",
            "name": "Carlos Fuentes",
            "short_description": "Estudio del novelista de la identidad y la historia mexicanas.",
            "example_tasks": [
              "Analizar 'La región más transparente' como fresco de la Ciudad de México posrevolucionaria",
              "Identificar experimentación narrativa en 'La muerte de Artemio Cruz': voces, tiempos",
              "Analizar 'Aura' como novela gótica y fantástica",
              "Comparar el tratamiento de la historia mexicana en diferentes novelas de Fuentes",
              "Analizar la 'novela total' en 'Terra Nostra' de Fuentes"
            ]
          },
          {
            "key": "elena_garro",
            "name": "Elena Garro",
            "short_description": "Análisis de la narrativa innovadora de Garro.",
            "example_tasks": [
              "Analizar 'Los recuerdos del porvenir' y su tratamiento del tiempo circular",
              "Identificar elementos mágicos y míticos en narrativa de Garro",
              "Analizar la representación de lo femenino y la Guerra Cristera en Garro",
              "Comparar el realismo mágico de Garro con el de García Márquez o Rulfo"
            ]
          },
          {
            "key": "otros_narradores_xx",
            "name": "Otros Narradores: Revueltas, Yáñez, Arreola",
            "short_description": "Estudio de otras voces importantes de la narrativa mexicana.",
            "example_tasks": [
              "Analizar la narrativa comprometida y experimental de José Revueltas",
              "Identificar técnicas de flujo de conciencia en 'Al filo del agua' de Agustín Yáñez",
              "Analizar la narrativa breve y experimental de Juan José Arreola ('Bestiario', 'Confabulario')",
              "Comparar diferentes propuestas narrativas de mediados del siglo XX mexicano"
            ]
          }
        ]
      },
      {
        "key": "narrativa_onda_escritura",
        "name": "Narrativa de la Onda y Nueva Escritura",
        "short_description": "Estudio de movimientos narrativos de los años 60-70 que renuevan el lenguaje.",
        "sub_topics": [
          {
            "key": "literatura_onda",
            "name": "Literatura de la Onda",
            "short_description": "Análisis de la narrativa contracultural juvenil de los 60.",
            "example_tasks": [
              "Analizar 'Gazapo' de Gustavo Sáinz y su lenguaje coloquial juvenil",
              "Identificar temas de la Onda: rebeldía juvenil, contracultura, sexualidad",
              "Analizar 'De perfil' de José Agustín como bildungsroman contracultural",
              "Comparar la Onda mexicana con movimientos contraculturales en otras literaturas"
            ]
          },
          {
            "key": "nueva_escritura",
            "name": "Nueva Escritura y Experimentación",
            "short_description": "Estudio de propuestas experimentales más radicales.",
            "example_tasks": [
              "Analizar narrativa experimental de Salvador Elizondo ('Farabeuf')",
              "Identificar recursos de metaficción y autorreferencialidad en narrativa experimental",
              "Analizar la propuesta de Fernando del Paso en 'José Trigo' o 'Palinuro de México'",
              "Comparar experimentalismo mexicano con el Boom latinoamericano"
            ]
          },
          {
            "key": "post_sesenta_ocho",
            "name": "Literatura Post-1968",
            "short_description": "Análisis de la literatura tras el movimiento estudiantil y la masacre de Tlatelolco.",
            "example_tasks": [
              "Analizar representaciones literarias del 68 en narrativa y poesía",
              "Identificar cambios en temas y actitudes tras 1968 en literatura mexicana",
              "Analizar 'Los días y los años' de Luis González de Alba como testimonio del 68",
              "Comparar testimonios, crónicas y ficciones sobre el 68"
            ]
          }
        ]
      },
      {
        "key": "poesia_segunda_mitad_xx",
        "name": "Poesía Mexicana de la Segunda Mitad del Siglo XX",
        "short_description": "Estudio de generaciones poéticas que suceden a Paz y Contemporáneos.",
        "sub_topics": [
          {
            "key": "jaime_sabines",
            "name": "Jaime Sabines",
            "short_description": "Análisis de la poesía coloquial y emotiva de Sabines.",
            "example_tasks": [
              "Analizar 'Algo sobre la muerte del mayor Sabines' como elegía y reflexión sobre la muerte",
              "Identificar el tono coloquial y la emotividad directa en poesía de Sabines",
              "Comparar la poesía conversacional de Sabines con poesía más hermética de otros autores",
              "Analizar poemas de amor de Sabines y su tratamiento del erotismo y la intimidad"
            ]
          },
          {
            "key": "efrain_huerta",
            "name": "Efraín Huerta y Poesía Comprometida",
            "short_description": "Estudio de la poesía social y los 'poemínimos'.",
            "example_tasks": [
              "Analizar poesía política y social de Efraín Huerta",
              "Identificar la forma del 'poemínimo' creada por Huerta: brevedad, humor, crítica",
              "Comparar poesía comprometida de Huerta con poesía conversacional de Sabines",
              "Analizar la representación de la ciudad en poesía de Huerta"
            ]
          },
          {
            "key": "generacion_medio_siglo",
            "name": "Generación del Medio Siglo",
            "short_description": "Análisis de poetas que renuevan la lírica tras Contemporáneos y Paz.",
            "example_tasks": [
              "Analizar poesía de Rubén Bonifaz Nuño y su recuperación de temas clásicos",
              "Identificar características de poesía de Rosario Castellanos: feminismo, indigenismo, introspección",
              "Analizar poesía de Jaime García Terrés, Marco Antonio Montes de Oca, etc.",
              "Comparar diferentes propuestas dentro de la generación del Medio Siglo"
            ]
          },
          {
            "key": "poesia_infrarrealista",
            "name": "Infrarrealismo y Poesía de los 70-80",
            "short_description": "Estudio de movimientos poéticos contestatarios de finales de siglo.",
            "example_tasks": [
              "Analizar el movimiento infrarrealista de Roberto Bolaño y Mario Santiago",
              "Identificar actitudes de ruptura y marginalidad en poesía de los 70-80",
              "Comparar infrarrealismo con la Onda en narrativa: rebeldía, contracultura",
              "Analizar la diversificación de voces poéticas hacia finales del siglo XX"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "literatura_mexicana_actual",
    "name": "Literatura Mexicana Actual (Finales del XX y Siglo XXI)",
    "short_description": "Estudio de tendencias, temas y autores de la literatura mexicana más reciente y contemporánea.",
    "sub_topics": [
      {
        "key": "narrativa_actual_temas",
        "name": "Temas de la Narrativa Mexicana Actual",
        "short_description": "Análisis de los temas centrales en la literatura mexicana reciente.",
        "sub_topics": [
          {
            "key": "violencia_narcotrafico",
            "name": "Violencia y Narcotráfico",
            "short_description": "Estudio de la representación literaria de la violencia contemporánea.",
            "example_tasks": [
              "Analizar '2666' de Roberto Bolaño y su representación de los feminicidios de Ciudad Juárez",
              "Identificar estrategias narrativas para representar violencia extrema sin caer en sensacionalismo",
              "Analizar 'Fiesta en la madriguera' de Juan Pablo Villalobos como sátira de la narcocultura",
              "Comparar diferentes aproximaciones literarias al tema del narcotráfico en México"
            ]
          },
          {
            "key": "migracion_frontera",
            "name": "Migración y Frontera",
            "short_description": "Análisis de literatura sobre experiencias migratorias y realidad fronteriza.",
            "example_tasks": [
              "Analizar representaciones de la frontera México-Estados Unidos en narrativa actual",
              "Identificar la literatura chicana y su relación con la literatura mexicana",
              "Analizar experiencias de migración interna en narrativa mexicana contemporánea",
              "Comparar literatura de la frontera norte con representaciones de otras fronteras (sur)"
            ]
          },
          {
            "key": "identidades_genero",
            "name": "Identidades de Género y Diversidad Sexual",
            "short_description": "Estudio de literatura LGBTQ+ y cuestionamientos de género.",
            "example_tasks": [
              "Analizar 'Las malas' de Camila Sosa Villada y su representación de identidad travesti",
              "Identificar la emergencia de voces LGBTQ+ en literatura mexicana reciente",
              "Analizar cuestionamientos de masculinidades tradicionales en narrativa actual",
              "Comparar representaciones de diversidad sexual en literatura mexicana de diferentes épocas"
            ]
          },
          {
            "key": "memoria_dictadura",
            "name": "Memoria Histórica y Pasado Reciente",
            "short_description": "Análisis de narrativas sobre guerras sucias, represión y memoria.",
            "example_tasks": [
              "Analizar novelas sobre la guerra sucia y la represión de los 60-70 en México",
              "Identificar estrategias narrativas de recuperación de memoria histórica",
              "Analizar 'El Gran Silencio' o textos sobre desapariciones forzadas",
              "Comparar literatura de memoria en México con la de otros países latinoamericanos (Argentina, Chile)"
            ]
          }
        ]
      },
      {
        "key": "autoras_contemporaneas",
        "name": "Escritoras Mexicanas Contemporáneas",
        "short_description": "Estudio del protagonismo creciente de voces femeninas en la literatura actual.",
        "sub_topics": [
          {
            "key": "elena_poniatowska_actual",
            "name": "Elena Poniatowska (continuación)",
            "short_description": "Análisis de la obra más reciente de Poniatowska.",
            "example_tasks": [
              "Analizar novelas biográficas de Poniatowska sobre figuras mexicanas (Tina Modotti, etc.)",
              "Identificar la continuidad entre periodismo testimonial y narrativa en Poniatowska",
              "Analizar 'Leonora' de Poniatowska como biografía novelada de Leonora Carrington",
              "Comparar diferentes etapas de la obra de Poniatowska a lo largo de su carrera"
            ]
          },
          {
            "key": "carmen_boullosa",
            "name": "Carmen Boullosa",
            "short_description": "Estudio de la narrativa histórica y experimental de Boullosa.",
            "example_tasks": [
              "Analizar 'Llanto: novelas imposibles' de Carmen Boullosa y su experimentación narrativa",
              "Identificar la reescritura de historia en novelas históricas de Boullosa",
              "Analizar 'Texas' de Boullosa como novela sobre la frontera y la identidad",
              "Comparar la propuesta de Boullosa con otras escritoras mexicanas contemporáneas"
            ]
          },
          {
            "key": "cristina_rivera_garza",
            "name": "Cristina Rivera Garza",
            "short_description": "Análisis de narrativa experimental y autoficción de Rivera Garza.",
            "example_tasks": [
              "Analizar 'La muerte me da' de Cristina Rivera Garza y su tratamiento de feminicidios",
              "Identificar elementos de autoficción en 'El invencible verano de Liliana'",
              "Analizar propuestas experimentales y conceptuales en obra de Rivera Garza",
              "Comparar escritura de Rivera Garza con tendencias de autoficción latinoamericana"
            ]
          },
          {
            "key": "otras_escritoras",
            "name": "Otras Voces: Nettel, Enrigue, Luiselli",
            "short_description": "Estudio de otras escritoras destacadas de la literatura actual.",
            "example_tasks": [
              "Analizar 'El cuerpo en que nací' de Guadalupe Nettel y su exploración de identidad e infancia",
              "Identificar temas de desplazamiento y extranjería en Valeria Luiselli ('Los ingrávidos', 'Desierto sonoro')",
              "Analizar narrativa experimental de Álvaro Enrigue ('Muerte súbita')",
              "Comparar diferentes propuestas estéticas entre escritoras mexicanas actuales"
            ]
          }
        ]
      },
      {
        "key": "crack_generacion_narrativa",
        "name": "Generación del Crack y Nuevas Narrativas",
        "short_description": "Análisis de movimientos y propuestas narrativas de finales del siglo XX.",
        "sub_topics": [
          {
            "key": "generacion_crack",
            "name": "Generación del Crack",
            "short_description": "Estudio del movimiento que propuso una renovación de la novela mexicana.",
            "example_tasks": [
              "Analizar el 'Manifiesto Crack' (1996) y sus propuestas estéticas",
              "Identificar características de novelas Crack: complejidad, ambición, rechazo del facilismo",
              "Analizar 'El temperamento melancólico' de Jorge Volpi o novelas de Ignacio Padilla",
              "Comparar la generación del Crack con movimientos literarios anteriores en México"
            ]
          },
          {
            "key": "jorge_volpi",
            "name": "Jorge Volpi",
            "short_description": "Análisis de la narrativa de Volpi sobre ciencia, historia y ideas.",
            "example_tasks": [
              "Analizar 'En busca de Klingsor' de Jorge Volpi como novela histórica y de ideas",
              "Identificar el tratamiento de temas científicos y filosóficos en narrativa de Volpi",
              "Analizar la 'Trilogía del siglo XX' de Volpi y su ambición totalizadora",
              "Comparar propuestas de Volpi con narrativa histórica tradicional"
            ]
          },
          {
            "key": "nuevas_voces_narrativa",
            "name": "Nuevas Voces de la Narrativa Mexicana",
            "short_description": "Estudio de autores que emergen en el siglo XXI.",
            "example_tasks": [
              "Analizar propuestas de narradores jóvenes mexicanos del siglo XXI",
              "Identificar diversificación temática y estilística en narrativa actual",
              "Analizar cómo nuevas generaciones procesan la realidad mexicana contemporánea",
              "Comparar literatura de México con la de otros países latinoamericanos en siglo XXI"
            ]
          }
        ]
      },
      {
        "key": "poesia_siglo_xxi",
        "name": "Poesía Mexicana del Siglo XXI",
        "short_description": "Estudio de tendencias y voces de la poesía mexicana más reciente.",
        "sub_topics": [
          {
            "key": "coral_bracho",
            "name": "Coral Bracho y Poesía Neobarroca",
            "short_description": "Análisis de la poesía sensorial y experimental de Bracho.",
            "example_tasks": [
              "Analizar la poesía neobarroca de Coral Bracho y su lenguaje sensorial",
              "Identificar influencias de neobarroco latinoamericano (Lezama Lima, Perlongher) en Bracho",
              "Analizar el tratamiento del cuerpo y la sensorialidad en poesía de Bracho",
              "Comparar neobarroco con otras tendencias en poesía mexicana actual"
            ]
          },
          {
            "key": "david_huerta",
            "name": "David Huerta y la Tradición Renovada",
            "short_description": "Estudio de la poesía que dialoga con tradición desde perspectiva contemporánea.",
            "example_tasks": [
              "Analizar 'Incurable' de David Huerta como poema extenso contemporáneo",
              "Identificar diálogos con tradición poética mexicana (Paz, Gorostiza) en Huerta",
              "Analizar experimentación formal y temática en poesía de Huerta",
              "Comparar propuestas de David Huerta con las de su padre Efraín Huerta"
            ]
          },
          {
            "key": "poesia_mujeres_actual",
            "name": "Poetas Mujeres Contemporáneas",
            "short_description": "Análisis de la rica producción poética femenina actual.",
            "example_tasks": [
              "Analizar poesía de Mónica Nepote, Valeria Luiselli o Paula Abramo",
              "Identificar temas y perspectivas feministas en poesía mexicana actual",
              "Analizar diversidad de voces y propuestas entre poetas mujeres",
              "Comparar generaciones de poetas mexicanas a lo largo del siglo XX y XXI"
            ]
          },
          {
            "key": "diversidad_poetica_actual",
            "name": "Diversidad y Fragmentación Poética",
            "short_description": "Estudio de la multiplicidad de propuestas en poesía actual.",
            "example_tasks": [
              "Identificar diferentes tendencias en poesía mexicana del siglo XXI",
              "Analizar la coexistencia de poesía experimental, coloquial, neobarroca, visual",
              "Analizar el impacto de redes sociales y nuevas plataformas en difusión poética",
              "Comparar la diversidad actual con momentos anteriores de mayor cohesión (Contemporáneos, etc.)"
            ]
          }
        ]
      },
      {
        "key": "literatura_digital_actual",
        "name": "Literatura Digital y Nuevos Formatos",
        "short_description": "Análisis de literatura que utiliza medios digitales y explora nuevos formatos.",
        "sub_topics": [
          {
            "key": "narrativa_hipertextual",
            "name": "Narrativa Hipertextual y Digital",
            "short_description": "Estudio de narrativas que aprovechan posibilidades de medios digitales.",
            "example_tasks": [
              "Analizar proyectos de narrativa hipertextual o hipermedia mexicanos",
              "Identificar características de literatura digital vs. literatura tradicional",
              "Analizar cómo la interactividad cambia la relación lector-texto",
              "Comparar literatura digital mexicana con experiencias internacionales"
            ]
          },
          {
            "key": "twitter_redes",
            "name": "Twitter-literatura y Microtextos",
            "short_description": "Análisis de literatura que surge en redes sociales y formatos breves.",
            "example_tasks": [
              "Analizar proyectos literarios en Twitter y otras redes sociales",
              "Identificar renovación del microrrelato en era digital",
              "Analizar debates sobre legitimidad de literatura en redes sociales",
              "Comparar microtextos digitales con tradición del microrrelato impreso (Monterroso, Arreola)"
            ]
          },
          {
            "key": "blogs_autopublicacion",
            "name": "Blogs, Autopublicación y Nuevos Circuitos",
            "short_description": "Estudio de transformaciones en producción y circulación literaria.",
            "example_tasks": [
              "Analizar el impacto de blogs y plataformas digitales en literatura mexicana",
              "Identificar cambios en el campo literario con autopublicación y editoriales independientes",
              "Analizar casos de éxito de literatura que surge fuera de circuitos tradicionales",
              "Comparar circuitos tradicionales (grandes editoriales) con alternativos (independientes, digitales)"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "literatura_grecolatina",
    "name": "Literatura Grecolatina",
    "short_description": "Estudio de los fundamentos de la tradición literaria occidental en las obras clásicas de Grecia y Roma.",
    "sub_topics": [
      {
        "key": "epopeya_griega",
        "name": "Epopeya Griega: Homero",
        "short_description": "Análisis de los poemas épicos fundacionales de la literatura occidental.",
        "sub_topics": [
          {
            "key": "iliada",
            "name": "La Ilíada",
            "short_description": "Estudio del poema épico sobre la guerra de Troya.",
            "example_tasks": [
              "Analizar la cólera de Aquiles como motor de la acción en la Ilíada y sus consecuencias",
              "Identificar el concepto de héroe épico en personajes como Aquiles, Héctor y Agamenón",
              "Analizar la intervención de los dioses en asuntos humanos y el concepto de destino (moira)",
              "Comparar el código de honor heroico griego con valores de otras tradiciones épicas"
            ]
          },
          {
            "key": "odisea",
            "name": "La Odisea",
            "short_description": "Análisis del poema del viaje y el retorno de Odiseo.",
            "example_tasks": [
              "Analizar la estructura de la Odisea: viajes de Telémaco, relatos de Odiseo, venganza en Ítaca",
              "Identificar el arquetipo del viaje del héroe en las aventuras de Odiseo",
              "Analizar la astucia (metis) como característica definitoria de Odiseo frente a la fuerza de Aquiles",
              "Comparar el tratamiento de Penélope con otras figuras femeninas de la épica griega"
            ]
          },
          {
            "key": "epopeya_caracteristicas",
            "name": "Características de la Epopeya",
            "short_description": "Estudio de los rasgos formales y temáticos del género épico.",
            "example_tasks": [
              "Identificar epítetos épicos homéricos ('Aquiles el de los pies ligeros', 'Odiseo el astuto')",
              "Analizar el uso de comparaciones épicas (símiles) en Homero",
              "Identificar la invocación a la Musa y el in medias res como recursos épicos",
              "Analizar el hexámetro dactílico como verso épico griego"
            ]
          }
        ]
      },
      {
        "key": "teatro_griego",
        "name": "Teatro Griego",
        "short_description": "Análisis del nacimiento del teatro occidental y sus principales dramaturgos.",
        "sub_topics": [
          {
            "key": "tragedia_griega",
            "name": "La Tragedia Griega",
            "short_description": "Estudio de la tragedia como género dramático y su función catártica.",
            "example_tasks": [
              "Analizar la estructura de la tragedia griega: prólogo, párodos, episodios, estásimos, éxodo",
              "Identificar los conceptos aristotélicos de catarsis, hamartia, anagnórisis y peripecia",
              "Analizar la función del coro en la tragedia griega como voz colectiva y comentarista",
              "Comparar la tragedia griega con conceptos modernos de lo trágico"
            ]
          },
          {
            "key": "sofocles",
            "name": "Sófocles: Edipo Rey y Antígona",
            "short_description": "Análisis de las tragedias paradigmáticas de Sófocles.",
            "example_tasks": [
              "Analizar 'Edipo Rey' como tragedia perfecta según Aristóteles: anagnórisis, peripecia, catarsis",
              "Identificar el tema del destino vs. libre albedrío en Edipo Rey",
              "Analizar el conflicto entre ley divina y ley humana en 'Antígona'",
              "Comparar la caracterización de Edipo (en busca de verdad) con la de Antígona (defensa de principios)"
            ]
          },
          {
            "key": "esquilo_euripides",
            "name": "Esquilo y Eurípides",
            "short_description": "Estudio de los otros grandes trágicos griegos.",
            "example_tasks": [
              "Analizar la trilogía de la 'Orestíada' de Esquilo y la evolución de la justicia",
              "Identificar el tratamiento del matricidio y la culpa en 'Las Coéforos' y 'Las Euménides'",
              "Analizar 'Medea' de Eurípides como tragedia de la venganza y la pasión",
              "Comparar el psicologismo de Eurípides con el énfasis en lo religioso de Esquilo"
            ]
          },
          {
            "key": "comedia_aristofanes",
            "name": "Comedia: Aristófanes",
            "short_description": "Análisis de la comedia antigua y su sátira política.",
            "example_tasks": [
              "Analizar 'Las nubes' de Aristófanes como sátira de Sócrates y los sofistas",
              "Identificar recursos cómicos: parodia, exageración, obscenidad, fantasía",
              "Analizar 'Lisístrata' y su tratamiento cómico de temas serios (guerra, género)",
              "Comparar la comedia antigua (Aristófanes) con la comedia nueva (Menandro)"
            ]
          }
        ]
      },
      {
        "key": "lirica_filosofia_griega",
        "name": "Lírica y Filosofía Griegas",
        "short_description": "Estudio de otros géneros literarios y filosóficos de Grecia clásica.",
        "sub_topics": [
          {
            "key": "lirica_griega",
            "name": "Poesía Lírica Griega",
            "short_description": "Análisis de la poesía lírica arcaica y clásica.",
            "example_tasks": [
              "Analizar fragmentos de Safo y el tema del amor y el deseo en su poesía",
              "Identificar características de poesía lírica coral (Píndaro) vs. monódica (Safo, Anacreonte)",
              "Analizar odas triunfales de Píndaro para atletas vencedores",
              "Comparar la lírica griega con tradiciones líricas posteriores"
            ]
          },
          {
            "key": "dialogos_platonicos",
            "name": "Diálogos Platónicos",
            "short_description": "Estudio de los diálogos de Platón como género filosófico-literario.",
            "example_tasks": [
              "Analizar 'La República' de Platón: el mito de la caverna y la alegoría del conocimiento",
              "Identificar el método socrático (mayéutica) en los diálogos platónicos",
              "Analizar 'El banquete' y el discurso de Diotima sobre el amor (Eros)",
              "Comparar la forma dialogada platónica con tratados filosóficos sistemáticos"
            ]
          },
          {
            "key": "poetica_aristoteles",
            "name": "Poética de Aristóteles",
            "short_description": "Análisis del primer tratado sistemático sobre literatura.",
            "example_tasks": [
              "Analizar los conceptos centrales de la 'Poética': mimesis, catarsis, verosimilitud",
              "Identificar la definición aristotélica de tragedia y sus elementos constitutivos",
              "Analizar la clasificación de la trama según Aristóteles: simple vs. compleja",
              "Comparar la Poética de Aristóteles con teorías literarias posteriores"
            ]
          }
        ]
      },
      {
        "key": "literatura_latina",
        "name": "Literatura Latina",
        "short_description": "Estudio de las obras fundamentales de la literatura romana.",
        "sub_topics": [
          {
            "key": "virgilio_eneida",
            "name": "Virgilio: La Eneida",
            "short_description": "Análisis de la epopeya nacional romana.",
            "example_tasks": [
              "Analizar la 'Eneida' como epopeya que legitima el imperio romano y la dinastía Julio-Claudia",
              "Identificar la pietas de Eneas como valor romano central frente al individualismo heroico griego",
              "Analizar episodios clave: huida de Troya, amores con Dido, descenso al inframundo, guerra en Italia",
              "Comparar la Eneida virgiliana con modelos homéricos (Ilíada, Odisea)"
            ]
          },
          {
            "key": "poesia_lirica_latina",
            "name": "Poesía Lírica Latina: Horacio, Catulo, Ovidio",
            "short_description": "Estudio de los grandes poetas líricos romanos.",
            "example_tasks": [
              "Analizar odas de Horacio y el tema del carpe diem ('aprovecha el día')",
              "Identificar la poesía amorosa de Catulo y su intensidad emocional",
              "Analizar 'Metamorfosis' de Ovidio como compendio de mitos grecolatinos",
              "Comparar 'El arte de amar' de Ovidio con tratados sobre el amor en otras tradiciones"
            ]
          },
          {
            "key": "teatro_latino",
            "name": "Teatro Latino: Plauto y Séneca",
            "short_description": "Análisis de la comedia y la tragedia romanas.",
            "example_tasks": [
              "Analizar comedias de Plauto y sus tipos cómicos (esclavo astuto, joven enamorado, viejo avaro)",
              "Identificar influencia de la comedia nueva griega (Menandro) en Plauto y Terencio",
              "Analizar tragedias de Séneca y su influencia en el teatro renacentista",
              "Comparar el tratamiento de mitos en tragedia griega vs. tragedia senecana"
            ]
          },
          {
            "key": "prosa_latina",
            "name": "Prosa Latina: Cicerón, César, Historia",
            "short_description": "Estudio de la oratoria e historiografía latinas.",
            "example_tasks": [
              "Analizar las 'Catilinarias' de Cicerón como ejemplo de oratoria política romana",
              "Identificar recursos retóricos en discursos ciceronianos",
              "Analizar 'Comentarios a la guerra de las Galias' de César como narrativa histórica",
              "Comparar historiografía latina (Tito Livio, Tácito) con historiografía griega (Herodoto, Tucídides)"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "literatura_medieval_renacentista",
    "name": "Literatura Medieval y Renacentista",
    "short_description": "Estudio de la literatura europea desde la Edad Media hasta el Renacimiento, con énfasis en la tradición española.",
    "sub_topics": [
      {
        "key": "literatura_medieval",
        "name": "Literatura Medieval Española",
        "short_description": "Análisis de las primeras manifestaciones literarias en lengua romance.",
        "sub_topics": [
          {
            "key": "mester_juglaria",
            "name": "Mester de Juglaría: Poema del Mio Cid",
            "short_description": "Estudio del primer gran poema épico español.",
            "example_tasks": [
              "Analizar la estructura del 'Cantar de Mio Cid': destierro, bodas, afrenta de Corpes",
              "Identificar la caracterización del Cid como héroe épico medieval español",
              "Analizar el tema del honor y su recuperación en el Cantar",
              "Comparar el realismo del Cid con el carácter más fantástico de la épica francesa (Cantar de Roldán)"
            ]
          },
          {
            "key": "mester_clerecia",
            "name": "Mester de Clerecía: Berceo y Arcipreste",
            "short_description": "Análisis de la poesía culta medieval en cuaderna vía.",
            "example_tasks": [
              "Analizar 'Milagros de Nuestra Señora' de Gonzalo de Berceo y su función didáctico-religiosa",
              "Identificar características del mester de clerecía: cuaderna vía, temas religiosos, intención didáctica",
              "Analizar 'Libro de Buen Amor' del Arcipreste de Hita y su ambigüedad entre lo religioso y lo profano",
              "Comparar mester de juglaría (popular, irregular) con mester de clerecía (culto, regular)"
            ]
          },
          {
            "key": "prosa_medieval",
            "name": "Prosa Medieval: Alfonso X y Don Juan Manuel",
            "short_description": "Estudio del desarrollo de la prosa castellana medieval.",
            "example_tasks": [
              "Analizar la labor cultural de Alfonso X el Sabio y su importancia para el castellano",
              "Identificar características de 'El conde Lucanor' de Don Juan Manuel: estructura, función didáctica",
              "Analizar exempla medievales y su función moral en 'El conde Lucanor'",
              "Comparar la prosa medieval castellana con la de otras lenguas romances"
            ]
          },
          {
            "key": "lirica_medieval",
            "name": "Lírica Medieval: Jarchas, Cantigas, Romancero",
            "short_description": "Análisis de las tradiciones líricas medievales peninsulares.",
            "example_tasks": [
              "Analizar jarchas mozárabes como primeras manifestaciones líricas en romance",
              "Identificar características de las Cantigas de amigo gallegoportuguesas",
              "Analizar el Romancero viejo como poesía popular narrativa",
              "Comparar tradiciones líricas medievales: cortés (trovadores) vs. popular (villancicos, romances)"
            ]
          }
        ]
      },
      {
        "key": "literatura_prerrenacimiento",
        "name": "Prerrenacimiento y Siglo XV",
        "short_description": "Estudio del periodo de transición entre la Edad Media y el Renacimiento.",
        "sub_topics": [
          {
            "key": "jorge_manrique",
            "name": "Jorge Manrique: Coplas a la Muerte de su Padre",
            "short_description": "Análisis de la obra cumbre de la lírica del siglo XV español.",
            "example_tasks": [
              "Analizar las 'Coplas' de Jorge Manrique: estructura, tema de la muerte, elegía",
              "Identificar los tres niveles de fama en las Coplas: terrenal, histórica, eterna",
              "Analizar el tópico del ubi sunt ('¿dónde están?') en las Coplas",
              "Comparar el tratamiento de la muerte en Manrique con otras elegías medievales"
            ]
          },
          {
            "key": "celestina",
            "name": "La Celestina de Fernando de Rojas",
            "short_description": "Estudio de la tragicomedia que cierra la Edad Media y anuncia el Renacimiento.",
            "example_tasks": [
              "Analizar 'La Celestina' como tragicomedia: mezcla de elementos trágicos y cómicos",
              "Identificar la caracterización de Celestina como figura compleja y verosímil",
              "Analizar el amor cortés y su degradación en 'La Celestina'",
              "Comparar 'La Celestina' con comedia humanística italiana y tradiciones medievales"
            ]
          },
          {
            "key": "romances_cancioneros",
            "name": "Romancero y Poesía de Cancionero",
            "short_description": "Análisis de la lírica popular y culta del siglo XV.",
            "example_tasks": [
              "Analizar romances fronterizos y moriscos del siglo XV",
              "Identificar características de la poesía cancioneril: amor cortés, conceptismo incipiente",
              "Analizar el Marqués de Santillana y sus 'Sonetos fechos al itálico modo'",
              "Comparar romances viejos medievales con romances nuevos del siglo XVI"
            ]
          }
        ]
      },
      {
        "key": "renacimiento_espanol",
        "name": "Renacimiento Español: Siglo XVI",
        "short_description": "Estudio de la literatura del Renacimiento en España y su asimilación de modelos italianos.",
        "sub_topics": [
          {
            "key": "garcilaso_vega",
            "name": "Garcilaso de la Vega",
            "short_description": "Análisis del poeta que introduce el Renacimiento italiano en España.",
            "example_tasks": [
              "Analizar la introducción del endecasílabo y formas italianas (soneto, lira) por Garcilaso",
              "Identificar temas garcilasistas: amor platónico, naturaleza idealizada, mitología",
              "Analizar églogas de Garcilaso y el género pastoral renacentista",
              "Comparar la poesía de Garcilaso con modelos italianos (Petrarca, Sannazaro)"
            ]
          },
          {
            "key": "fray_luis_leon",
            "name": "Fray Luis de León",
            "short_description": "Estudio de la poesía ascética y renacentista de Fray Luis.",
            "example_tasks": [
              "Analizar odas de Fray Luis de León: 'Vida retirada', 'Noche serena', 'A Francisco Salinas'",
              "Identificar temas: beatus ille, anhelo de trascendencia, armonía pitagórica",
              "Analizar la lira como forma predilecta de Fray Luis",
              "Comparar el humanismo cristiano de Fray Luis con el neoplatonismo garcilasista"
            ]
          },
          {
            "key": "san_juan_cruz",
            "name": "San Juan de la Cruz",
            "short_description": "Análisis de la poesía mística del Doctor Místico.",
            "example_tasks": [
              "Analizar 'Noche oscura del alma' y 'Cántico espiritual' como poesía mística",
              "Identificar las tres vías místicas: purgativa, iluminativa, unitiva",
              "Analizar el uso de símbolos y alegorías en la poesía de San Juan (noche, llama, esposa)",
              "Comparar poesía mística (San Juan) con poesía ascética (Fray Luis)"
            ]
          },
          {
            "key": "lazarillo_tormes",
            "name": "El Lazarillo de Tormes",
            "short_description": "Estudio de la novela picaresca fundacional.",
            "example_tasks": [
              "Analizar 'El Lazarillo de Tormes' como origen de la novela picaresca española",
              "Identificar características picarescas: autobiografía, servicio a varios amos, ascenso social, crítica",
              "Analizar la estructura de tratados y la evolución del protagonista",
              "Comparar 'El Lazarillo' con novelas idealistas del Renacimiento (caballeresca, pastoril)"
            ]
          },
          {
            "key": "otros_generos_renacentistas",
            "name": "Otros Géneros Renacentistas",
            "short_description": "Análisis de novela pastoril, caballeresca y otros géneros del XVI.",
            "example_tasks": [
              "Analizar 'Los siete libros de la Diana' de Jorge de Montemayor como novela pastoril",
              "Identificar características de novelas de caballerías: 'Amadís de Gaula', 'Tirant lo Blanch'",
              "Analizar la novela morisca y su idealización del moro",
              "Comparar géneros idealistas (pastoril, caballeresca) con realistas (picaresca)"
            ]
          }
        ]
      },
      {
        "key": "literatura_europea_renacimiento",
        "name": "Literatura Europea del Renacimiento",
        "short_description": "Estudio de grandes autores renacentistas de Italia, Francia e Inglaterra.",
        "sub_topics": [
          {
            "key": "dante_divina_comedia",
            "name": "Dante: La Divina Comedia",
            "short_description": "Análisis del poema que cierra la Edad Media y anuncia el Renacimiento.",
            "example_tasks": [
              "Analizar la estructura tripartita de la 'Divina Comedia': Infierno, Purgatorio, Paraíso",
              "Identificar el viaje de Dante como alegoría del camino hacia Dios",
              "Analizar el amor por Beatriz como guía espiritual en la Comedia",
              "Comparar la Comedia de Dante con otras visiones del más allá medievales"
            ]
          },
          {
            "key": "shakespeare",
            "name": "William Shakespeare",
            "short_description": "Estudio del gran dramaturgo inglés del Renacimiento.",
            "example_tasks": [
              "Analizar 'Hamlet' como tragedia de la duda y la venganza",
              "Identificar elementos de tragedias shakespearianas: 'Macbeth', 'Otelo', 'El rey Lear'",
              "Analizar comedias de Shakespeare: 'Sueño de una noche de verano', 'Mucho ruido y pocas nueces'",
              "Comparar el teatro de Shakespeare con el teatro español del Siglo de Oro"
            ]
          },
          {
            "key": "otros_renacentistas",
            "name": "Otros Autores: Petrarca, Boccaccio, Montaigne",
            "short_description": "Análisis de otras figuras clave del Renacimiento europeo.",
            "example_tasks": [
              "Analizar el 'Cancionero' de Petrarca y el modelo del amor petrarquista",
              "Identificar la estructura del 'Decamerón' de Boccaccio y su narrativa de cuentos",
              "Analizar 'Los ensayos' de Montaigne como género literario innovador",
              "Comparar humanismo italiano (Petrarca, Boccaccio) con humanismo español"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "siglo_oro_espanol",
    "name": "Literatura del Siglo de Oro Español",
    "short_description": "Estudio de la producción literaria española del Barroco (siglo XVII), considerada la edad dorada de las letras hispanas.",
    "sub_topics": [
      {
        "key": "cervantes_quijote",
        "name": "Miguel de Cervantes y el Quijote",
        "short_description": "Análisis de la obra cumbre de la narrativa española y universal.",
        "sub_topics": [
          {
            "key": "don_quijote_analisis",
            "name": "Don Quijote de la Mancha",
            "short_description": "Estudio de la novela moderna fundacional.",
            "example_tasks": [
              "Analizar la estructura del 'Quijote': Primera parte (1605) vs. Segunda parte (1615)",
              "Identificar la parodia de libros de caballerías como punto de partida del Quijote",
              "Analizar la relación entre Don Quijote (idealista) y Sancho Panza (realista)",
              "Comparar locura vs. cordura, idealismo vs. realismo como ejes temáticos del Quijote",
              "Analizar episodios clave: molinos de viento, Dulcinea, episodio de los galeotes"
            ]
          },
          {
            "key": "innovaciones_cervantes",
            "name": "Innovaciones Narrativas Cervantinas",
            "short_description": "Análisis de las técnicas que hacen del Quijote la primera novela moderna.",
            "example_tasks": [
              "Identificar el perspectivismo cervantino: múltiples narradores, versiones contradictorias",
              "Analizar la metaficción en el Quijote: historia de Cide Hamete, Quijote apócrifo de Avellaneda",
              "Identificar el realismo psicológico y la evolución de personajes (quijotización de Sancho)",
              "Comparar innovaciones del Quijote con la novela posterior europea"
            ]
          },
          {
            "key": "otras_obras_cervantes",
            "name": "Otras Obras de Cervantes",
            "short_description": "Estudio de Novelas Ejemplares, teatro y poesía cervantinos.",
            "example_tasks": [
              "Analizar novelas ejemplares de Cervantes: 'Rinconete y Cortadillo', 'El coloquio de los perros'",
              "Identificar el carácter 'ejemplar' (moralizante) y las innovaciones narrativas en estas novelas",
              "Analizar 'Los trabajos de Persiles y Sigismunda' como novela bizantina",
              "Comparar teatro de Cervantes ('El cerco de Numancia') con el de Lope de Vega"
            ]
          }
        ]
      },
      {
        "key": "teatro_siglo_oro",
        "name": "Teatro del Siglo de Oro",
        "short_description": "Análisis del teatro barroco español y su esplendor dramático.",
        "sub_topics": [
          {
            "key": "lope_vega",
            "name": "Lope de Vega y la Comedia Nueva",
            "short_description": "Estudio del creador de la fórmula teatral española.",
            "example_tasks": [
              "Analizar el 'Arte nuevo de hacer comedias' de Lope y su ruptura con preceptos clásicos",
              "Identificar características de la comedia nueva lopesca: tres jornadas, mezcla de trágico y cómico, polimetría",
              "Analizar 'Fuenteovejuna' como drama de honor colectivo y resistencia popular",
              "Comparar comedias de capa y espada ('El perro del hortelano') con dramas históricos de Lope"
            ]
          },
          {
            "key": "calderon_barca",
            "name": "Calderón de la Barca",
            "short_description": "Análisis del gran dramaturgo del Barroco tardío.",
            "example_tasks": [
              "Analizar 'La vida es sueño' y sus temas filosóficos: realidad vs. sueño, libre albedrío vs. destino",
              "Identificar el desarrollo de Segismundo desde la animalidad hasta la humanidad ilustrada",
              "Analizar dramas de honor calderonianos: 'El alcalde de Zalamea', 'El médico de su honra'",
              "Comparar el teatro reflexivo de Calderón con el teatro más espontáneo de Lope"
            ]
          },
          {
            "key": "tirso_molina",
            "name": "Tirso de Molina y Otros Dramaturgos",
            "short_description": "Estudio de otras figuras del teatro áureo.",
            "example_tasks": [
              "Analizar 'El burlador de Sevilla' de Tirso y la creación del mito de Don Juan",
              "Identificar características del Don Juan: seductor, burlador, transgressor, condenado",
              "Analizar autos sacramentales de Calderón: alegoría, tema eucarístico",
              "Comparar dramaturgos del Siglo de Oro: Lope (naturalidad), Tirso (intriga), Calderón (conceptismo)"
            ]
          }
        ]
      },
      {
        "key": "poesia_barroca",
        "name": "Poesía Barroca Española",
        "short_description": "Estudio de las dos grandes corrientes del Barroco: conceptismo y culteranismo.",
        "sub_topics": [
          {
            "key": "gongora_culteranismo",
            "name": "Góngora y el Culteranismo",
            "short_description": "Análisis de la corriente que busca la belleza formal mediante el artificio.",
            "example_tasks": [
              "Analizar las 'Soledades' de Góngora y su lenguaje hipercultista",
              "Identificar recursos culteranos: hipérbaton, cultismos latinos, metáforas complejas",
              "Analizar el 'Polifemo' de Góngora como recreación barroca del mito clásico",
              "Comparar sonetos culteranos de Góngora con su poesía popular (romances, letrillas)"
            ]
          },
          {
            "key": "quevedo_conceptismo",
            "name": "Quevedo y el Conceptismo",
            "short_description": "Estudio de la corriente que privilegia el ingenio y el juego de ideas.",
            "example_tasks": [
              "Analizar sonetos metafísicos de Quevedo: 'Amor constante más allá de la muerte'",
              "Identificar recursos conceptistas: paradoja, antítesis, dilogía, juegos de palabras",
              "Analizar la sátira quevedesca en sonetos burlescos y 'Los sueños'",
              "Comparar conceptismo (agudeza de pensamiento) con culteranismo (belleza de forma)"
            ]
          },
          {
            "key": "sor_juana_barroco",
            "name": "Sor Juana Inés de la Cruz (repaso)",
            "short_description": "Análisis del Barroco novohispano en la cumbre de Sor Juana.",
            "example_tasks": [
              "Analizar el 'Primero sueño' como síntesis de culteranismo y conceptismo",
              "Identificar la síntesis de corrientes barrocas españolas en poesía de Sor Juana",
              "Analizar sonetos de Sor Juana que combinan ingenio conceptista y ornato culterano",
              "Comparar el Barroco de Sor Juana con el de Góngora y Quevedo"
            ]
          }
        ]
      },
      {
        "key": "prosa_siglo_oro",
        "name": "Prosa del Siglo de Oro",
        "short_description": "Análisis de la narrativa y otros géneros en prosa del Barroco español.",
        "sub_topics": [
          {
            "key": "picaresca_barroca",
            "name": "Novela Picaresca Barroca",
            "short_description": "Estudio de la evolución de la picaresca en el siglo XVII.",
            "example_tasks": [
              "Analizar 'Guzmán de Alfarache' de Mateo Alemán como picaresca moralizante",
              "Identificar la estructura de 'El Buscón' de Quevedo: episodios, degradación progresiva",
              "Analizar el pesimismo y la visión satírica en 'El Buscón'",
              "Comparar 'El Lazarillo' (realismo) con 'El Buscón' (esperpento, caricatura)"
            ]
          },
          {
            "key": "prosa_satirica",
            "name": "Prosa Satírica y Moral",
            "short_description": "Análisis de sátiras y escritos morales del Barroco.",
            "example_tasks": [
              "Analizar 'Los sueños' de Quevedo como sátira de tipos sociales",
              "Identificar el conceptismo en prosa de Quevedo y Gracián",
              "Analizar 'El Criticón' de Baltasar Gracián como alegoría barroca",
              "Comparar sátira quevedesca (ácida, demoledora) con sátira cervantina (más amable)"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "romanticismo_realismo_europeo",
    "name": "Literatura del Romanticismo y Realismo Europeo",
    "short_description": "Estudio de los movimientos literarios del siglo XIX europeo: Romanticismo y Realismo-Naturalismo.",
    "sub_topics": [
      {
        "key": "romanticismo_europeo",
        "name": "Romanticismo Europeo",
        "short_description": "Análisis del movimiento que privilegia emoción, individualismo y rechazo del neoclasicismo.",
        "sub_topics": [
          {
            "key": "romanticismo_aleman",
            "name": "Romanticismo Alemán",
            "short_description": "Estudio del primer romanticismo europeo y sus figuras clave.",
            "example_tasks": [
              "Analizar 'Las penas del joven Werther' de Goethe como paradigma del héroe romántico",
              "Identificar temas románticos: amor imposible, suicidio, genio atormentado, naturaleza",
              "Analizar 'Fausto' de Goethe como drama romántico filosófico",
              "Comparar el romanticismo alemán (Sturm und Drang) con el romanticismo de otros países"
            ]
          },
          {
            "key": "romanticismo_ingles",
            "name": "Romanticismo Inglés",
            "short_description": "Análisis de los poetas románticos ingleses y la novela gótica.",
            "example_tasks": [
              "Analizar poesía de Wordsworth y Coleridge ('Baladas líricas') y la naturaleza romántica",
              "Identificar elementos románticos en Byron, Shelley y Keats: rebeldía, belleza, muerte prematura",
              "Analizar 'Frankenstein' de Mary Shelley como novela gótica y reflexión sobre ciencia",
              "Comparar la novela gótica ('Frankenstein', 'Drácula') con romanticismo poético"
            ]
          },
          {
            "key": "romanticismo_frances",
            "name": "Romanticismo Francés",
            "short_description": "Estudio del romanticismo francés en poesía, novela y teatro.",
            "example_tasks": [
              "Analizar 'Los miserables' de Victor Hugo como novela romántica social",
              "Identificar elementos románticos en poesía de Lamartine, Hugo, Musset",
              "Analizar 'Hernani' de Victor Hugo y la batalla romántica contra neoclasicismo",
              "Comparar romanticismo francés con romanticismo alemán e inglés"
            ]
          },
          {
            "key": "romanticismo_espanol",
            "name": "Romanticismo Español",
            "short_description": "Análisis del movimiento romántico en España.",
            "example_tasks": [
              "Analizar 'Don Juan Tenorio' de Zorrilla como drama romántico español",
              "Identificar el Romanticismo tardío en España vs. países centroeuropeos",
              "Analizar 'Rimas' de Bécquer como expresión del romanticismo intimista",
              "Comparar romanticismo liberal (Espronceda) con romanticismo tradicional (Duque de Rivas)"
            ]
          }
        ]
      },
      {
        "key": "realismo_europeo",
        "name": "Realismo Europeo",
        "short_description": "Estudio del movimiento que busca retratar objetivamente la realidad social.",
        "sub_topics": [
          {
            "key": "realismo_frances",
            "name": "Realismo Francés",
            "short_description": "Análisis de la gran novela realista francesa del XIX.",
            "example_tasks": [
              "Analizar 'La comedia humana' de Balzac como proyecto de retratar la sociedad francesa",
              "Identificar el realismo objetivo en 'Madame Bovary' de Flaubert",
              "Analizar 'Rojo y negro' de Stendhal como novela de ascenso social y crítica",
              "Comparar idealismo romántico con descripción minuciosa realista"
            ]
          },
          {
            "key": "realismo_ruso",
            "name": "Realismo Ruso",
            "short_description": "Estudio de los grandes novelistas rusos del siglo XIX.",
            "example_tasks": [
              "Analizar 'Crimen y castigo' de Dostoievski como novela psicológica y filosófica",
              "Identificar temas dostoievskianos: culpa, redención, sufrimiento, nihilismo",
              "Analizar 'Ana Karenina' o 'Guerra y paz' de Tolstói como frescos sociales",
              "Comparar realismo psicológico ruso con realismo social francés"
            ]
          },
          {
            "key": "realismo_ingles",
            "name": "Realismo Inglés: Dickens y Victorianismo",
            "short_description": "Análisis de la novela victoriana inglesa.",
            "example_tasks": [
              "Analizar 'Oliver Twist' o 'Grandes esperanzas' de Dickens como crítica social",
              "Identificar la denuncia de injusticias sociales en novela dickensiana",
              "Analizar novelas de las hermanas Brontë: 'Jane Eyre', 'Cumbres borrascosas'",
              "Comparar la novela victoriana con el realismo continental"
            ]
          },
          {
            "key": "naturalismo",
            "name": "Naturalismo: Zola",
            "short_description": "Estudio del naturalismo como radicalización del realismo.",
            "example_tasks": [
              "Analizar 'Germinal' de Zola como novela naturalista sobre clase obrera",
              "Identificar el determinismo biológico y social en el naturalismo",
              "Analizar el ciclo de 'Los Rougon-Macquart' como experimento literario-científico",
              "Comparar realismo (observación objetiva) con naturalismo (determinismo, lo sórdido)"
            ]
          }
        ]
      },
      {
        "key": "poesia_siglo_xix",
        "name": "Poesía del Siglo XIX",
        "short_description": "Estudio de corrientes poéticas desde el Romanticismo hasta el Simbolismo.",
        "sub_topics": [
          {
            "key": "baudelaire_simbolismo",
            "name": "Baudelaire y los Inicios del Simbolismo",
            "short_description": "Análisis de 'Las flores del mal' y la poesía moderna.",
            "example_tasks": [
              "Analizar 'Las flores del mal' de Baudelaire: spleen, ideal, correspondencias",
              "Identificar a Baudelaire como puente entre romanticismo y simbolismo",
              "Analizar el concepto de 'correspondencias' y sinestesia en Baudelaire",
              "Comparar romanticismo (emoción directa) con simbolismo (sugerencia, símbolo)"
            ]
          },
          {
            "key": "simbolismo_frances",
            "name": "Simbolismo Francés",
            "short_description": "Estudio de Verlaine, Rimbaud, Mallarmé.",
            "example_tasks": [
              "Analizar poesía de Verlaine: musicalidad, impresionismo, 'Art poétique'",
              "Identificar la poética visionaria y el verso libre en Rimbaud ('Una temporada en el infierno')",
              "Analizar el hermetismo de Mallarmé y 'Un golpe de dados'",
              "Comparar simbolistas franceses con su influencia en modernismo hispanoamericano"
            ]
          },
          {
            "key": "whitman_poe",
            "name": "Poesía Norteamericana: Whitman y Poe",
            "short_description": "Análisis de voces fundacionales de la poesía estadounidense.",
            "example_tasks": [
              "Analizar 'Hojas de hierba' de Walt Whitman y su verso libre democrático",
              "Identificar la poética del terror y lo fantástico en Edgar Allan Poe ('El cuervo')",
              "Comparar el optimismo whitmaneano con el pesimismo de Poe",
              "Analizar la influencia de Poe en simbolismo francés y literatura universal"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "literatura_siglo_xx_universal",
    "name": "Literatura del Siglo XX Universal",
    "short_description": "Estudio de las vanguardias, modernidad y principales corrientes literarias del siglo XX en Europa y el mundo.",
    "sub_topics": [
      {
        "key": "vanguardias_europeas",
        "name": "Vanguardias Europeas",
        "short_description": "Análisis de movimientos de ruptura de inicios del siglo XX.",
        "sub_topics": [
          {
            "key": "surrealismo",
            "name": "Surrealismo",
            "short_description": "Estudio del movimiento que explora el inconsciente y lo onírico.",
            "example_tasks": [
              "Analizar el 'Manifiesto surrealista' de André Breton y sus principios",
              "Identificar técnicas surrealistas: escritura automática, imágenes oníricas, libre asociación",
              "Analizar poesía surrealista: Breton, Éluard, Aragon",
              "Comparar surrealismo francés con su influencia en poesía hispanoamericana"
            ]
          },
          {
            "key": "expresionismo_futurismo",
            "name": "Expresionismo y Futurismo",
            "short_description": "Análisis de vanguardias que expresan violencia y modernidad.",
            "example_tasks": [
              "Analizar 'La metamorfosis' de Kafka como expresión del expresionismo literario",
              "Identificar el 'Manifiesto futurista' de Marinetti: velocidad, máquina, guerra",
              "Analizar diferencias entre expresionismo (subjetividad angustiada) y futurismo (exaltación moderna)",
              "Comparar vanguardias destructivas (Dadá, Futurismo) con constructivas (Surrealismo)"
            ]
          },
          {
            "key": "joyce_vanguardia",
            "name": "James Joyce y la Narrativa Experimental",
            "short_description": "Estudio de la renovación narrativa modernista.",
            "example_tasks": [
              "Analizar 'Ulises' de Joyce: monólogo interior, flujo de conciencia, mitología",
              "Identificar técnicas narrativas experimentales: multiperspectivismo, ruptura sintáctica",
              "Analizar 'Finnegans Wake' como experimentación extrema con el lenguaje",
              "Comparar Joyce con Proust, Woolf y la narrativa modernista europea"
            ]
          }
        ]
      },
      {
        "key": "kafka_existencialismo",
        "name": "Kafka y Literatura Existencialista",
        "short_description": "Análisis de literatura que explora absurdo, alienación y condición humana.",
        "sub_topics": [
          {
            "key": "franz_kafka",
            "name": "Franz Kafka",
            "short_description": "Estudio del autor de la alienación y el absurdo burocrático.",
            "example_tasks": [
              "Analizar 'La metamorfosis' como alegoría de la alienación moderna",
              "Identificar lo kafkiano: absurdo, burocracia opresiva, culpa sin causa",
              "Analizar 'El proceso' como parábola de la culpabilidad y el sistema",
              "Comparar Kafka con existencialismo francés (Camus, Sartre)"
            ]
          },
          {
            "key": "camus_sartre",
            "name": "Camus y Sartre: Existencialismo",
            "short_description": "Análisis de la literatura existencialista francesa.",
            "example_tasks": [
              "Analizar 'El extranjero' de Camus y el absurdo de la existencia",
              "Identificar temas existencialistas: libertad, responsabilidad, angustia, compromiso",
              "Analizar 'La náusea' de Sartre como novela filosófica existencialista",
              "Comparar existencialismo ateo (Sartre) con absurdismo (Camus)"
            ]
          },
          {
            "key": "teatro_absurdo",
            "name": "Teatro del Absurdo",
            "short_description": "Estudio del teatro que representa la falta de sentido de la existencia.",
            "example_tasks": [
              "Analizar 'Esperando a Godot' de Beckett como paradigma del teatro del absurdo",
              "Identificar recursos: falta de trama, diálogos sin sentido, situaciones ilógicas",
              "Analizar 'La cantante calva' de Ionesco y la incomunicación humana",
              "Comparar teatro del absurdo con teatro existencialista de Sartre y Camus"
            ]
          }
        ]
      },
      {
        "key": "narrativa_siglo_xx",
        "name": "Gran Narrativa del Siglo XX",
        "short_description": "Estudio de novelistas fundamentales de la literatura mundial.",
        "sub_topics": [
          {
            "key": "proust",
            "name": "Marcel Proust",
            "short_description": "Análisis de 'En busca del tiempo perdido' y la memoria involuntaria.",
            "example_tasks": [
              "Analizar 'En busca del tiempo perdido' de Proust: memoria, tiempo, sensibilidad",
              "Identificar el episodio de la magdalena y la memoria involuntaria",
              "Analizar el estilo proustiano: frases largas, introspección, análisis psicológico",
              "Comparar Proust con Joyce en renovación de la novela moderna"
            ]
          },
          {
            "key": "thomas_mann",
            "name": "Thomas Mann",
            "short_description": "Estudio del gran novelista alemán del siglo XX.",
            "example_tasks": [
              "Analizar 'La montaña mágica' de Thomas Mann como novela de ideas",
              "Identificar temas mannianos: decadencia, enfermedad, muerte, cultura europea",
              "Analizar 'Muerte en Venecia' como relato sobre belleza, deseo y decadencia",
              "Comparar la novela de ideas (Mann) con novela experimental (Joyce)"
            ]
          },
          {
            "key": "otros_narradores_europeos",
            "name": "Otros Narradores: Musil, Svevo, Hesse",
            "short_description": "Análisis de otras voces de la narrativa europea moderna.",
            "example_tasks": [
              "Analizar 'El hombre sin atributos' de Robert Musil como retrato del Imperio austro-húngaro",
              "Identificar la novela psicológica italiana en Italo Svevo ('La conciencia de Zeno')",
              "Analizar 'El lobo estepario' o 'Siddhartha' de Hermann Hesse",
              "Comparar diferentes propuestas de la narrativa europea de entreguerras"
            ]
          }
        ]
      },
      {
        "key": "literatura_posguerra",
        "name": "Literatura de Posguerra",
        "short_description": "Análisis de corrientes literarias tras la Segunda Guerra Mundial.",
        "sub_topics": [
          {
            "key": "nouveau_roman",
            "name": "Nouveau Roman Francés",
            "short_description": "Estudio de la nueva novela francesa experimental.",
            "example_tasks": [
              "Analizar obras de Alain Robbe-Grillet: descripción objetiva, rechazo de psicologismo",
              "Identificar características del Nouveau Roman: antihumanismo, antinarrativa",
              "Analizar 'La modificación' de Michel Butor y la experimentación con narración",
              "Comparar Nouveau Roman con novela tradicional realista"
            ]
          },
          {
            "key": "literatura_concentracionaria",
            "name": "Literatura del Holocausto",
            "short_description": "Análisis de testimonios y ficciones sobre el horror nazi.",
            "example_tasks": [
              "Analizar 'Si esto es un hombre' de Primo Levi como testimonio del Holocausto",
              "Identificar dilemas éticos de representar lo irrepresentable",
              "Analizar 'La noche' de Elie Wiesel como testimonio de Auschwitz",
              "Comparar testimonio directo (Levi, Wiesel) con ficción sobre Holocausto"
            ]
          },
          {
            "key": "realismo_magico_internacional",
            "name": "Realismo Mágico y Boom (contexto internacional)",
            "short_description": "Análisis de la proyección internacional del realismo mágico.",
            "example_tasks": [
              "Analizar la recepción internacional del realismo mágico latinoamericano",
              "Identificar características que hicieron del Boom un fenómeno mundial",
              "Comparar realismo mágico con realismo fantástico de Kafka o surrealismo",
              "Analizar influencias del realismo mágico en literaturas de otros continentes"
            ]
          }
        ]
      },
      {
        "key": "poesia_segunda_mitad_xx",
        "name": "Poesía de la Segunda Mitad del Siglo XX",
        "short_description": "Estudio de corrientes poéticas posteriores a la Segunda Guerra Mundial.",
        "sub_topics": [
          {
            "key": "generacion_beat",
            "name": "Generación Beat",
            "short_description": "Análisis de la poesía contracultural estadounidense.",
            "example_tasks": [
              "Analizar 'Aullido' de Allen Ginsberg como manifiesto de la Generación Beat",
              "Identificar temas beat: rechazo del consumismo, búsqueda espiritual, drogas, sexualidad",
              "Analizar la prosa espontánea de Jack Kerouac ('En el camino')",
              "Comparar la Generación Beat con movimientos contraculturales en otras literaturas"
            ]
          },
          {
            "key": "poesia_confesional",
            "name": "Poesía Confesional",
            "short_description": "Estudio de poesía que explora experiencias íntimas y trauma.",
            "example_tasks": [
              "Analizar poesía de Sylvia Plath: depresión, identidad femenina, muerte",
              "Identificar características de poesía confesional: autobiografía, trauma, sinceridad extrema",
              "Analizar 'Ariel' de Plath o poesía de Anne Sexton",
              "Comparar poesía confesional con poesía más impersonal de otras corrientes"
            ]
          },
          {
            "key": "experimentacion_poetica",
            "name": "Experimentación y Poesía Visual",
            "short_description": "Análisis de poesía experimental de finales del siglo XX.",
            "example_tasks": [
              "Analizar poesía concreta brasileña y su dimensión visual",
              "Identificar la poesía sonora y performance poética",
              "Analizar caligramas contemporáneos y poesía experimental",
              "Comparar experimentación formal de vanguardias históricas con neo-vanguardias"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "literatura_colonial_independencia_latinoamericana",
    "name": "Literatura Colonial y de la Independencia Latinoamericana",
    "short_description": "Estudio de las expresiones literarias durante la Colonia y los movimientos independentistas en América Latina.",
    "sub_topics": [
      {
        "key": "cronicas_america",
        "name": "Crónicas de Indias",
        "short_description": "Análisis de textos que narran el descubrimiento y conquista de América.",
        "sub_topics": [
          {
            "key": "colon_cartas",
            "name": "Cristóbal Colón y las Cartas de Relación",
            "short_description": "Estudio de los primeros textos sobre el Nuevo Mundo.",
            "example_tasks": [
              "Analizar las 'Cartas de relación' de Colón y su descripción maravillada de América",
              "Identificar la visión europea del 'otro' y la construcción del imaginario sobre América",
              "Analizar el uso de comparaciones y referentes europeos para describir lo americano",
              "Comparar la visión de Colón con la de otros cronistas tempranos"
            ]
          },
          {
            "key": "bernal_diaz_repaso",
            "name": "Bernal Díaz del Castillo (repaso)",
            "short_description": "Análisis adicional de la crónica desde perspectiva latinoamericana.",
            "example_tasks": [
              "Analizar 'Historia verdadera de la conquista de la Nueva España' como testimonio fundacional",
              "Identificar la perspectiva del soldado común en la construcción de la historia",
              "Comparar crónicas de conquistadores con testimonios indígenas",
              "Analizar la función de las crónicas en la legitimación de la Conquista"
            ]
          },
          {
            "key": "inca_garcilaso",
            "name": "Inca Garcilaso de la Vega",
            "short_description": "Estudio del primer gran escritor mestizo americano.",
            "example_tasks": [
              "Analizar 'Comentarios reales' del Inca Garcilaso como historia del Perú prehispánico",
              "Identificar la doble perspectiva del mestizo: cultura inca y española",
              "Analizar la idealización del Tahuantinsuyo en los Comentarios Reales",
              "Comparar la visión del Inca Garcilaso con crónicas españolas del Perú"
            ]
          },
          {
            "key": "guaman_poma",
            "name": "Guamán Poma de Ayala",
            "short_description": "Análisis de la crónica indígena ilustrada.",
            "example_tasks": [
              "Analizar 'Nueva corónica y buen gobierno' como texto híbrido (imágenes y texto)",
              "Identificar la denuncia de abusos coloniales en Guamán Poma",
              "Analizar los dibujos como sistema de comunicación paralelo al texto",
              "Comparar la perspectiva indígena de Guamán Poma con crónicas españolas"
            ]
          }
        ]
      },
      {
        "key": "barroco_americano",
        "name": "Barroco de Indias",
        "short_description": "Estudio del Barroco en América Latina y su expresión particular.",
        "sub_topics": [
          {
            "key": "sor_juana_contexto",
            "name": "Sor Juana Inés de la Cruz (contexto latinoamericano)",
            "short_description": "Análisis de Sor Juana como cumbre del Barroco americano.",
            "example_tasks": [
              "Analizar cómo Sor Juana representa la síntesis del Barroco novohispano",
              "Identificar elementos del sincretismo cultural en villancicos de Sor Juana",
              "Analizar la defensa del conocimiento femenino en contexto colonial",
              "Comparar el Barroco de Sor Juana con el Barroco español y con otros barrocos americanos"
            ]
          },
          {
            "key": "barroco_peruano",
            "name": "Barroco Peruano: Juan del Valle y Caviedes",
            "short_description": "Estudio de la poesía satírica colonial peruana.",
            "example_tasks": [
              "Analizar la sátira contra médicos en poesía de Juan del Valle y Caviedes",
              "Identificar el humor criollo y la crítica social en el Barroco peruano",
              "Comparar la sátira de Caviedes con la de Quevedo",
              "Analizar la representación de la sociedad limeña colonial en esta poesía"
            ]
          },
          {
            "key": "barroco_otros",
            "name": "Barroco en Otras Regiones: Domínguez Camargo, Espinosa Medrano",
            "short_description": "Análisis del Barroco en Colombia y Perú.",
            "example_tasks": [
              "Analizar poesía de Hernando Domínguez Camargo (Nueva Granada) y su culteranismo",
              "Identificar la defensa de Góngora en 'Apologético' de Espinosa Medrano (el Lunarejo)",
              "Comparar diferentes manifestaciones del Barroco americano",
              "Analizar cómo el Barroco se adapta a realidades americanas"
            ]
          }
        ]
      },
      {
        "key": "neoclasicismo_ilustracion",
        "name": "Neoclasicismo e Ilustración en América",
        "short_description": "Estudio del periodo de transición hacia la Independencia.",
        "sub_topics": [
          {
            "key": "fabulas_neoclasicas",
            "name": "Fábulas y Poesía Neoclásica",
            "short_description": "Análisis de la poesía didáctico-moral neoclásica.",
            "example_tasks": [
              "Analizar fábulas de Rafael García Goyena o Félix María Samaniego en contexto americano",
              "Identificar la función didáctica y moralizante de literatura neoclásica",
              "Comparar neoclasicismo americano con modelos europeos",
              "Analizar cómo el neoclasicismo prepara ideológicamente la Independencia"
            ]
          },
          {
            "key": "periodismo_ilustrado",
            "name": "Periodismo y Ensayo Ilustrado",
            "short_description": "Estudio del ensayo y periodismo previo a la Independencia.",
            "example_tasks": [
              "Analizar periódicos ilustrados americanos y su función en difusión de ideas",
              "Identificar ideas ilustradas en ensayos de intelectuales criollos",
              "Analizar el 'Mercurio Peruano' o la 'Gaceta de Literatura' como medios de difusión cultural",
              "Comparar Ilustración europea con Ilustración criolla americana"
            ]
          }
        ]
      },
      {
        "key": "literatura_independencia",
        "name": "Literatura de la Independencia",
        "short_description": "Análisis de textos literarios del periodo independentista.",
        "sub_topics": [
          {
            "key": "poesia_independentista",
            "name": "Poesía Patriótica",
            "short_description": "Estudio de poesía al servicio de causas independentistas.",
            "example_tasks": [
              "Analizar odas patrióticas de Andrés Bello ('Alocución a la poesía', 'Silva a la agricultura de la zona tórrida')",
              "Identificar temas independentistas: libertad, patria, héroes, naturaleza americana",
              "Analizar 'Al Libertador' de José Joaquín de Olmedo y la épica bolivariana",
              "Comparar poesía neoclásica patriótica con romanticismo independentista posterior"
            ]
          },
          {
            "key": "ensayo_fundacional",
            "name": "Ensayo Fundacional: Bolívar, Bello",
            "short_description": "Análisis de ensayos que proyectan la América independiente.",
            "example_tasks": [
              "Analizar la 'Carta de Jamaica' de Simón Bolívar como visión de América Latina",
              "Identificar el proyecto cultural de Andrés Bello en 'Autonomía cultural de América'",
              "Analizar el debate entre civilización y barbarie que se inicia en este periodo",
              "Comparar visiones de América en diferentes próceres intelectuales"
            ]
          },
          {
            "key": "teatro_independencia",
            "name": "Teatro Independentista",
            "short_description": "Estudio del teatro al servicio de la causa emancipadora.",
            "example_tasks": [
              "Analizar obras de teatro que exaltan héroes independentistas",
              "Identificar la función propagandística del teatro en la Independencia",
              "Comparar teatro independentista con teatro colonial",
              "Analizar cómo el teatro construye identidades nacionales emergentes"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "modernismo_latinoamericano",
    "name": "Modernismo Latinoamericano",
    "short_description": "Estudio del primer movimiento literario genuinamente hispanoamericano que influyó en España.",
    "sub_topics": [
      {
        "key": "ruben_dario",
        "name": "Rubén Darío",
        "short_description": "Análisis del padre del Modernismo y su revolución poética.",
        "sub_topics": [
          {
            "key": "azul_prosas_profanas",
            "name": "Azul y Prosas Profanas",
            "short_description": "Estudio de las obras que inauguran el Modernismo.",
            "example_tasks": [
              "Analizar 'Azul' (1888) como inicio del Modernismo: renovación métrica, exotismo, preciosismo",
              "Identificar innovaciones formales en 'Prosas profanas': nuevas métricas, sensorialidad, mitología",
              "Analizar poemas representativos: 'Sonatina', 'Era un aire suave', 'Sinfonía en gris mayor'",
              "Comparar primera etapa dariana (esteticismo) con etapas posteriores"
            ]
          },
          {
            "key": "cantos_vida_esperanza",
            "name": "Cantos de Vida y Esperanza",
            "short_description": "Análisis de la madurez poética de Darío.",
            "example_tasks": [
              "Analizar 'Cantos de vida y esperanza' (1905) como profundización temática del Modernismo",
              "Identificar temas de madurez: preocupación metafísica, angustia, hispanoamericanismo",
              "Analizar poemas clave: 'Yo soy aquel', 'Canción de otoño en primavera', 'Lo fatal'",
              "Comparar el Darío esteticista con el Darío más filosófico y comprometido"
            ]
          },
          {
            "key": "dario_influencia",
            "name": "Influencia de Darío",
            "short_description": "Estudio del impacto de Darío en la poesía en español.",
            "example_tasks": [
              "Analizar cómo Darío influye en poetas españoles (Juan Ramón Jiménez, hermanos Machado)",
              "Identificar la renovación métrica y temática que Darío aporta al español",
              "Comparar Darío con simbolistas franceses (Verlaine) y su originalidad",
              "Analizar cómo Darío inaugura la autonomía de la literatura hispanoamericana"
            ]
          }
        ]
      },
      {
        "key": "modernismo_hispanoamerica",
        "name": "Modernismo en Hispanoamérica",
        "short_description": "Estudio de otros exponentes del Modernismo en diversos países.",
        "sub_topics": [
          {
            "key": "marti_modernismo",
            "name": "José Martí",
            "short_description": "Análisis del precursor del Modernismo y héroe cubano.",
            "example_tasks": [
              "Analizar 'Versos sencillos' de Martí: sencillez formal, profundidad temática",
              "Identificar a Martí como precursor del Modernismo antes que Darío",
              "Analizar el ensayo martiano: 'Nuestra América', compromiso político y estético",
              "Comparar la sencillez de Martí con el preciosismo de Darío"
            ]
          },
          {
            "key": "silva_asuncion",
            "name": "José Asunción Silva",
            "short_description": "Estudio del modernista colombiano y su 'Nocturno'.",
            "example_tasks": [
              "Analizar 'Nocturno III' de Silva: ritmo innovador, melancolía, muerte",
              "Identificar la musicalidad y experimentación métrica en Silva",
              "Analizar 'El libro de versos' y su visión pesimista",
              "Comparar el modernismo angustiado de Silva con el esteticismo dariano"
            ]
          },
          {
            "key": "herrera_reissig_lugones",
            "name": "Herrera y Reissig, Lugones",
            "short_description": "Análisis de modernistas del Río de la Plata.",
            "example_tasks": [
              "Analizar la poesía simbolista y decadente de Julio Herrera y Reissig (Uruguay)",
              "Identificar el barroquismo y hermetismo en Herrera y Reissig",
              "Analizar 'Lunario sentimental' de Leopoldo Lugones y su originalidad",
              "Comparar modernismo rioplatense con modernismo centroamericano"
            ]
          },
          {
            "key": "modernismo_prosa",
            "name": "Prosa Modernista",
            "short_description": "Estudio de la renovación de la prosa en el Modernismo.",
            "example_tasks": [
              "Analizar crónicas modernistas: Darío, Gutiérrez Nájera, Martí",
              "Identificar características de la prosa modernista: ritmo, imágenes, preciosismo",
              "Analizar 'Ariel' de José Enrique Rodó como ensayo modernista americanista",
              "Comparar prosa modernista con prosa realista decimonónica"
            ]
          }
        ]
      },
      {
        "key": "posmodernismo",
        "name": "Posmodernismo",
        "short_description": "Análisis de la reacción contra los excesos del Modernismo.",
        "sub_topics": [
          {
            "key": "caracteristicas_posmodernismo",
            "name": "Características del Posmodernismo",
            "short_description": "Estudio de la transición del Modernismo a las vanguardias.",
            "example_tasks": [
              "Identificar características posmodernistas: sencillez, cotidianidad, ironía",
              "Analizar el rechazo del preciosismo y exotismo modernistas",
              "Comparar Modernismo (aristocrático, cosmopolita) con Posmodernismo (democrático, local)",
              "Analizar cómo el Posmodernismo prepara las vanguardias"
            ]
          },
          {
            "key": "poetisas_posmodernismo",
            "name": "Poetas Posmodernistas",
            "short_description": "Análisis de voces principales del Posmodernismo.",
            "example_tasks": [
              "Analizar poesía de Enrique González Martínez: 'Tuércele el cuello al cisne' como manifiesto posmodernista",
              "Identificar poesía intimista y filosófica en Ramón López Velarde (México)",
              "Analizar 'Desolación' de Gabriela Mistral como puente entre Modernismo y postvanguardia",
              "Comparar diferentes vertientes posmodernistas en América Latina"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "boom_latinoamericano",
    "name": "Narrativa del Boom Latinoamericano",
    "short_description": "Estudio del fenómeno literario que proyectó la narrativa latinoamericana al mundo en los años 60-70.",
    "sub_topics": [
      {
        "key": "realismo_magico",
        "name": "Realismo Mágico",
        "short_description": "Análisis de la corriente que incorpora lo maravilloso en la narrativa realista.",
        "sub_topics": [
          {
            "key": "garcia_marquez",
            "name": "Gabriel García Márquez",
            "short_description": "Estudio del autor de 'Cien años de soledad'.",
            "example_tasks": [
              "Analizar 'Cien años de soledad' como paradigma del realismo mágico: Macondo, circularidad, mitos",
              "Identificar elementos mágicos naturalizados en García Márquez (levitación, premoniciones, fantasmas)",
              "Analizar la saga de los Buendía como alegoría de la historia latinoamericana",
              "Comparar 'Cien años de soledad' con 'El coronel no tiene quien le escriba' o 'Crónica de una muerte anunciada'",
              "Analizar la influencia de García Márquez en la narrativa mundial"
            ]
          },
          {
            "key": "carpentier",
            "name": "Alejo Carpentier",
            "short_description": "Análisis del teórico de lo real maravilloso americano.",
            "example_tasks": [
              "Analizar 'El reino de este mundo' y el concepto de 'lo real maravilloso americano'",
              "Identificar diferencias entre realismo mágico y lo real maravilloso",
              "Analizar 'Los pasos perdidos' como novela de búsqueda de identidad americana",
              "Comparar el barroquismo de Carpentier con la sencillez narrativa de García Márquez"
            ]
          },
          {
            "key": "otros_realismo_magico",
            "name": "Otros Autores del Realismo Mágico",
            "short_description": "Estudio de precursores y contemporáneos.",
            "example_tasks": [
              "Analizar 'Pedro Páramo' de Rulfo como precursor del realismo mágico",
              "Identificar elementos de realismo mágico en 'Hombres de maíz' de Miguel Ángel Asturias",
              "Analizar cuentos fantásticos de Jorge Luis Borges como antecedente del Boom",
              "Comparar realismo mágico latinoamericano con realismo fantástico europeo"
            ]
          }
        ]
      },
      {
        "key": "autores_boom",
        "name": "Principales Autores del Boom",
        "short_description": "Análisis de las figuras centrales del fenómeno literario.",
        "sub_topics": [
          {
            "key": "julio_cortazar",
            "name": "Julio Cortázar",
            "short_description": "Estudio del maestro del cuento fantástico y la novela experimental.",
            "example_tasks": [
              "Analizar 'Rayuela' de Cortázar como novela experimental: tablero de dirección, capítulos prescindibles",
              "Identificar elementos fantásticos en cuentos de Cortázar: 'Casa tomada', 'Axolotl', 'La noche boca arriba'",
              "Analizar el concepto de 'figuras' en Cortázar: momentos de revelación o extrañeza",
              "Comparar experimentación formal de Cortázar con realismo mágico de García Márquez"
            ]
          },
          {
            "key": "mario_vargas_llosa",
            "name": "Mario Vargas Llosa",
            "short_description": "Análisis del gran novelista peruano.",
            "example_tasks": [
              "Analizar 'La ciudad y los perros' como novela de formación en contexto militar",
              "Identificar técnicas narrativas vargasllosianas: vasos comunicantes, mudas verbales, cajón chino",
              "Analizar 'Conversación en la Catedral' y su retrato de dictadura peruana",
              "Comparar el realismo total de Vargas Llosa con el realismo mágico de García Márquez"
            ]
          },
          {
            "key": "carlos_fuentes_boom",
            "name": "Carlos Fuentes (en contexto del Boom)",
            "short_description": "Análisis de Fuentes como figura del Boom.",
            "example_tasks": [
              "Analizar 'La muerte de Artemio Cruz' como novela del Boom sobre Revolución Mexicana",
              "Identificar experimentación formal en Fuentes: multiperspectivismo, temporalidad compleja",
              "Comparar Fuentes con otros autores del Boom: temas, técnicas, proyección",
              "Analizar el papel de Fuentes como promotor y teórico del Boom"
            ]
          },
          {
            "key": "jose_donoso",
            "name": "José Donoso",
            "short_description": "Estudio del novelista chileno del Boom.",
            "example_tasks": [
              "Analizar 'El obsceno pájaro de la noche' de Donoso como novela experimental chilena",
              "Identificar elementos grotescos y barrocos en Donoso",
              "Analizar 'Historia personal del Boom' como testimonio del movimiento",
              "Comparar narrativa de Donoso con la de otros autores del Boom"
            ]
          }
        ]
      },
      {
        "key": "Jorge_luis_borges",
        "name": "Jorge Luis Borges",
        "short_description": "Análisis del autor fundamental para el Boom, aunque no parte de él.",
        "sub_topics": [
          {
            "key": "ficciones_borges",
            "name": "Ficciones y Cuentos Filosóficos",
            "short_description": "Estudio de los relatos metafísicos de Borges.",
            "example_tasks": [
              "Analizar 'Tlön, Uqbar, Orbis Tertius' como cuento sobre realidad, ficción y construcción del mundo",
              "Identificar temas borgeanos: laberintos, espejos, infinito, tiempo, identidad",
              "Analizar 'El jardín de senderos que se bifurcan' y el tiempo múltiple",
              "Comparar 'Pierre Menard, autor del Quijote' y la teoría de la lectura"
            ]
          },
          {
            "key": "aleph_borges",
            "name": "El Aleph y Otros Cuentos",
            "short_description": "Análisis de cuentos clave de Borges.",
            "example_tasks": [
              "Analizar 'El Aleph' como símbolo del infinito contenido en un punto",
              "Identificar el cuento policial metafísico en 'La muerte y la brújula'",
              "Analizar 'El Sur' y la ambigüedad entre realidad y sueño",
              "Comparar realismo fantástico de Borges con realismo mágico del Boom"
            ]
          },
          {
            "key": "borges_influencia",
            "name": "Influencia de Borges",
            "short_description": "Estudio del impacto de Borges en literatura universal.",
            "example_tasks": [
              "Analizar cómo Borges influye en autores del Boom y posteriores",
              "Identificar el concepto de literatura como juego intelectual en Borges",
              "Comparar brevedad y precisión de Borges con expansión narrativa del Boom",
              "Analizar la proyección internacional de Borges y su papel en literatura mundial"
            ]
          }
        ]
      },
      {
        "key": "contexto_boom",
        "name": "Contexto y Características del Boom",
        "short_description": "Análisis del fenómeno editorial y cultural del Boom.",
        "sub_topics": [
          {
            "key": "fenomeno_editorial",
            "name": "El Boom como Fenómeno Editorial",
            "short_description": "Estudio de factores que permitieron la proyección internacional.",
            "example_tasks": [
              "Analizar el papel de editoriales (Seix Barral, Sudamericana) en la difusión del Boom",
              "Identificar factores que convergieron en el Boom: calidad literaria, momento histórico, mercado",
              "Analizar el papel de la Revolución Cubana y el contexto político en el Boom",
              "Comparar la literatura latinoamericana antes y después del Boom"
            ]
          },
          {
            "key": "tecnicas_boom",
            "name": "Técnicas Narrativas del Boom",
            "short_description": "Análisis de innovaciones formales compartidas.",
            "example_tasks": [
              "Identificar técnicas comunes: multiperspectivismo, experimentación temporal, complejidad estructural",
              "Analizar la incorporación de lo mítico y lo histórico en novelas del Boom",
              "Comparar realismo mágico, realismo fantástico y experimentación formal en el Boom",
              "Analizar cómo el Boom renovó la narrativa en español"
            ]
          },
          {
            "key": "post_boom",
            "name": "Post-Boom y Nuevas Voces",
            "short_description": "Estudio de reacciones y continuaciones del Boom.",
            "example_tasks": [
              "Identificar características del Post-Boom: simplicidad, humor, cotidianidad, minimalismo",
              "Analizar autores Post-Boom: Isabel Allende, Luis Sepúlveda, Antonio Skármeta",
              "Comparar experimentación del Boom con narrativas más accesibles del Post-Boom",
              "Analizar la herencia del Boom en narrativa latinoamericana actual"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "poesia_latinoamericana_contemporanea",
    "name": "Poesía Latinoamericana Contemporánea",
    "short_description": "Estudio de las grandes voces poéticas latinoamericanas del siglo XX.",
    "sub_topics": [
      {
        "key": "pablo_neruda",
        "name": "Pablo Neruda",
        "short_description": "Análisis del poeta chileno Premio Nobel.",
        "sub_topics": [
          {
            "key": "veinte_poemas",
            "name": "Veinte Poemas de Amor y una Canción Desesperada",
            "short_description": "Estudio de la poesía amorosa temprana de Neruda.",
            "example_tasks": [
              "Analizar 'Veinte poemas' como poesía amorosa modernista-posmodernista",
              "Identificar imágenes sensoriales y naturaleza en poesía amorosa de Neruda",
              "Analizar 'Poema 20' ('Puedo escribir los versos más tristes esta noche') y su melancolía",
              "Comparar primera etapa de Neruda con su poesía posterior más comprometida"
            ]
          },
          {
            "key": "residencia_tierra",
            "name": "Residencia en la Tierra",
            "short_description": "Análisis de la poesía hermética y existencial de Neruda.",
            "example_tasks": [
              "Analizar 'Residencia en la tierra' como poesía surrealista y existencial",
              "Identificar angustia, desintegración y caos en esta etapa nerudiana",
              "Analizar poemas como 'Walking around' y su visión de la modernidad alienante",
              "Comparar hermetismo de Residencia con claridad de poesía posterior"
            ]
          },
          {
            "key": "canto_general",
            "name": "Canto General",
            "short_description": "Estudio de la épica americana de Neruda.",
            "example_tasks": [
              "Analizar 'Canto general' como épica de América Latina: historia, geografía, denuncia",
              "Identificar 'Alturas de Macchu Picchu' como cumbre lírica del Canto general",
              "Analizar el compromiso político de Neruda en su poesía madura",
              "Comparar 'Canto general' con 'Cantos' de Ezra Pound o épicas modernas"
            ]
          },
          {
            "key": "odas_elementales",
            "name": "Odas Elementales",
            "short_description": "Análisis de la poesía de lo cotidiano.",
            "example_tasks": [
              "Analizar 'Odas elementales' como celebración de lo simple y cotidiano",
              "Identificar el cambio hacia poesía clara y accesible en odas",
              "Analizar 'Oda a la cebolla', 'Oda al tomate' como exaltación de lo humble",
              "Comparar diferentes etapas de la poesía nerudiana"
            ]
          }
        ]
      },
      {
        "key": "cesar_vallejo",
        "name": "César Vallejo",
        "short_description": "Estudio del gran poeta peruano de dolor y compromiso.",
        "sub_topics": [
          {
            "key": "heraldos_negros",
            "name": "Los Heraldos Negros",
            "short_description": "Análisis de la primera obra de Vallejo.",
            "example_tasks": [
              "Analizar 'Los heraldos negros' como poesía del dolor existencial",
              "Identificar el poema inicial 'Hay golpes en la vida tan fuertes...' como definición de poética vallejiana",
              "Analizar elementos modernistas y posmodernistas en Los heraldos negros",
              "Comparar primera etapa de Vallejo con su vanguardismo posterior"
            ]
          },
          {
            "key": "trilce",
            "name": "Trilce",
            "short_description": "Estudio de la experimentación vanguardista extrema.",
            "example_tasks": [
              "Analizar 'Trilce' (1922) como uno de los libros más experimentales en español",
              "Identificar rupturas sintácticas, neologismos y hermetismo en Trilce",
              "Analizar poemas de Trilce y su dificultad interpretativa",
              "Comparar Trilce con otras obras vanguardistas (Altazor de Huidobro, Poeta en Nueva York de Lorca)"
            ]
          },
          {
            "key": "poemas_humanos",
            "name": "Poemas Humanos",
            "short_description": "Análisis de la poesía del compromiso solidario.",
            "example_tasks": [
              "Analizar 'Poemas humanos' como poesía del sufrimiento humano universal",
              "Identificar solidaridad y compromiso social en poesía madura de Vallejo",
              "Analizar 'Masa' como poema de fraternidad humana",
              "Comparar 'España, aparta de mí este cáliz' con otros poemas de Guerra Civil española"
            ]
          }
        ]
      },
      {
        "key": "vicente_huidobro",
        "name": "Vicente Huidobro",
        "short_description": "Análisis del poeta chileno creador del Creacionismo.",
        "sub_topics": [
          {
            "key": "creacionismo",
            "name": "Creacionismo y Manifiestos",
            "short_description": "Estudio de la teoría poética de Huidobro.",
            "example_tasks": [
              "Analizar el manifiesto creacionista: 'El poeta es un pequeño dios'",
              "Identificar principios creacionistas: autonomía del poema, creación de realidades nuevas",
              "Comparar creacionismo con ultraísmo español y otras vanguardias",
              "Analizar la polémica con Vicente Borges sobre la autoría del ultraísmo"
            ]
          },
          {
            "key": "altazor",
            "name": "Altazor",
            "short_description": "Análisis del poema cumbre de Huidobro.",
            "example_tasks": [
              "Analizar 'Altazor' como poema extenso vanguardista: caída, destrucción del lenguaje",
              "Identificar la progresiva desintegración del lenguaje en los 7 cantos de Altazor",
              "Analizar el Canto VII como lenguaje puro, sin significado convencional",
              "Comparar Altazor con Trilce de Vallejo en experimentación lingüística"
            ]
          }
        ]
      },
      {
        "key": "gabriela_mistral",
        "name": "Gabriela Mistral",
        "short_description": "Estudio de la primera latinoamericana Premio Nobel de Literatura.",
        "sub_topics": [
          {
            "key": "desolacion_ternura",
            "name": "Desolación y Ternura",
            "short_description": "Análisis de la poesía del dolor y la maternidad.",
            "example_tasks": [
              "Analizar 'Desolación' como poemario del dolor y el amor frustrado",
              "Identificar temas mistralianos: maternidad, infancia, educación, naturaleza americana",
              "Analizar 'Ternura' y poemas dedicados a niños ('Meciendo', 'Piececitos')",
              "Comparar sensibilidad maternal de Mistral con otras poéticas femeninas"
            ]
          },
          {
            "key": "mistral_america",
            "name": "Poesía Americanista y Social",
            "short_description": "Estudio del compromiso social y americanismo de Mistral.",
            "example_tasks": [
              "Analizar poemas americanistas: 'Cordillera', 'Sol del trópico'",
              "Identificar el compromiso educativo y social en poesía de Mistral",
              "Analizar 'Lagar' como poemario de madurez sobre vejez y muerte",
              "Comparar poesía de Mistral con la de otras poetas latinoamericanas (Storni, Ibarbourou)"
            ]
          }
        ]
      },
      {
        "key": "otras_voces_poeticas",
        "name": "Otras Voces Poéticas Latinoamericanas",
        "short_description": "Estudio de otros poetas fundamentales del siglo XX.",
        "sub_topics": [
          {
            "key": "nicolas_guillen",
            "name": "Nicolás Guillén",
            "short_description": "Análisis de la poesía afroantillana y social.",
            "example_tasks": [
              "Analizar 'Motivos de son' de Guillén como poesía afrocubana",
              "Identificar el uso de ritmos afrocaribeños en poesía de Guillén",
              "Analizar el compromiso social y antiimperialista en Guillén",
              "Comparar poesía negrista de Guillén con la de Luis Palés Matos"
            ]
          },
          {
            "key": "nicanor_parra",
            "name": "Nicanor Parra",
            "short_description": "Estudio de la antipoesía.",
            "example_tasks": [
              "Analizar 'Poemas y antipoemas' de Parra como ruptura con lírica tradicional",
              "Identificar características de la antipoesía: coloquialismo, humor, ironía, prosaísmo",
              "Analizar artefactos visuales de Parra",
              "Comparar antipoesía de Parra con poesía conversacional latinoamericana"
            ]
          },
          {
            "key": "poetas_mujeres_xx",
            "name": "Poetas Mujeres: Storni, Ibarbourou, Pizarnik",
            "short_description": "Análisis de voces femeninas fundamentales.",
            "example_tasks": [
              "Analizar poesía feminista de Alfonsina Storni: 'Tú me quieres blanca', 'Hombre pequeñito'",
              "Identificar erotismo y celebración del cuerpo en Juana de Ibarbourou",
              "Analizar poesía hermética y angustiada de Alejandra Pizarnik",
              "Comparar diferentes voces poéticas femeninas latinoamericanas"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "literatura_latinoamericana_actual",
    "name": "Literatura Latinoamericana Actual (Finales XX - XXI)",
    "short_description": "Estudio de tendencias, temas y autores de la literatura latinoamericana más reciente.",
    "sub_topics": [
      {
        "key": "narrativa_reciente_latinoamerica",
        "name": "Narrativa Latinoamericana Reciente",
        "short_description": "Análisis de nuevas voces y tendencias narrativas.",
        "sub_topics": [
          {
            "key": "roberto_bolano",
            "name": "Roberto Bolaño",
            "short_description": "Estudio del autor de '2666' y 'Los detectives salvajes'.",
            "example_tasks": [
              "Analizar 'Los detectives salvajes' como novela sobre poesía, juventud y búsqueda",
              "Identificar la estructura compleja y multiperspectivista en Bolaño",
              "Analizar '2666' como novela total sobre violencia contemporánea",
              "Comparar Bolaño con autores del Boom: influencias y rupturas"
            ]
          },
          {
            "key": "nuevas_voces_narrativas",
            "name": "Nuevas Voces: Nettel, Schweblin, Zambra",
            "short_description": "Análisis de narradores emergentes latinoamericanos.",
            "example_tasks": [
              "Analizar narrativa de Samanta Schweblin: 'Distancia de rescate', 'Kentukis'",
              "Identificar minimalismo y precisión en nueva narrativa latinoamericana",
              "Analizar 'Formas de volver a casa' de Alejandro Zambra (Chile)",
              "Comparar nueva narrativa latinoamericana con el Boom y Post-Boom"
            ]
          },
          {
            "key": "temas_actuales_latinoamerica",
            "name": "Temas de la Narrativa Actual",
            "short_description": "Estudio de preocupaciones temáticas contemporáneas.",
            "example_tasks": [
              "Analizar representaciones de violencia y narcotráfico en narrativa actual",
              "Identificar literatura sobre dictaduras y memoria en el Cono Sur",
              "Analizar narrativa sobre migración y frontera en contexto actual",
              "Comparar tratamiento de temas políticos en Boom vs. literatura actual"
            ]
          }
        ]
      },
      {
        "key": "poesia_actual_latinoamerica",
        "name": "Poesía Latinoamericana Actual",
        "short_description": "Análisis de tendencias poéticas recientes.",
        "sub_topics": [
          {
            "key": "diversidad_poetica_latinoamerica",
            "name": "Diversidad de Voces Poéticas",
            "short_description": "Estudio de la fragmentación y multiplicidad actual.",
            "example_tasks": [
              "Identificar diferentes tendencias: neobarroco, coloquialismo, poesía visual",
              "Analizar poetas actuales de diferentes países latinoamericanos",
              "Comparar poesía actual con grandes voces del siglo XX",
              "Analizar el impacto de medios digitales en poesía latinoamericana"
            ]
          },
          {
            "key": "poesia_compromiso_actual",
            "name": "Poesía y Compromiso Social Actual",
            "short_description": "Análisis de poesía que aborda realidades sociales contemporáneas.",
            "example_tasks": [
              "Analizar poesía sobre violencia de género y feminicidios",
              "Identificar poesía testimonial sobre conflictos armados actuales",
              "Analizar poesía de denuncia social en contextos dictatoriales o posconflicto",
              "Comparar compromiso poético actual con poesía social del siglo XX"
            ]
          }
        ]
      },
      {
        "key": "cronicas_testimonios_actuales",
        "name": "Crónica y Testimonio Actuales",
        "short_description": "Estudio de géneros híbridos en literatura latinoamericana reciente.",
        "sub_topics": [
          {
            "key": "cronica_latinoamericana_actual",
            "name": "Nueva Crónica Latinoamericana",
            "short_description": "Análisis de cronistas contemporáneos.",
            "example_tasks": [
              "Analizar crónicas de Martín Caparrós, Leila Guerriero, Alberto Salcedo Ramos",
              "Identificar revistas y plataformas de crónica latinoamericana (Etiqueta Negra, El Malpensante)",
              "Comparar crónica actual con crónica modernista y del siglo XX",
              "Analizar temas de crónica actual: migración, violencia, identidades"
            ]
          },
          {
            "key": "literatura_testimonial",
            "name": "Literatura Testimonial",
            "short_description": "Estudio de testimonios sobre conflictos y violencia.",
            "example_tasks": [
              "Analizar testimonios sobre guerras civiles centroamericanas",
              "Identificar características del testimonio como género literario",
              "Analizar 'Me llamo Rigoberta Menchú' como testimonio indígena",
              "Comparar testimonio con ficción en representación de violencia"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "corrientes_movimientos_literarios",
    "name": "Corrientes y Movimientos Literarios",
    "short_description": "Estudio sistemático de los principales movimientos, escuelas y tendencias que han marcado la historia de la literatura.",
    "sub_topics": [
      {
        "key": "clasicismo",
        "name": "Clasicismo",
        "short_description": "Análisis de los principios estéticos de armonía, equilibrio y razón.",
        "sub_topics": [
          {
            "key": "principios_clasicos",
            "name": "Principios del Clasicismo",
            "short_description": "Estudio de los fundamentos estéticos clásicos grecolatinos.",
            "example_tasks": [
              "Identificar principios clásicos: imitación de la naturaleza, verosimilitud, decoro, unidades dramáticas",
              "Analizar el concepto de mimesis (imitación) en la teoría clásica",
              "Comparar ideales clásicos (armonía, proporción) con rupturas posteriores (Barroco, Romanticismo)",
              "Analizar cómo el Renacimiento recupera principios clásicos grecolatinos"
            ]
          },
          {
            "key": "neoclasicismo",
            "name": "Neoclasicismo del Siglo XVIII",
            "short_description": "Análisis del retorno a principios clásicos en la Ilustración.",
            "example_tasks": [
              "Identificar características neoclásicas: razón, didactismo, imitación de antiguos",
              "Analizar obras neoclásicas: tragedias de Racine, fábulas de La Fontaine",
              "Comparar neoclasicismo francés con neoclasicismo español (Moratín, Iriarte)",
              "Analizar la tensión entre neoclasicismo y prerromanticismo en el siglo XVIII"
            ]
          }
        ]
      },
      {
        "key": "barroco_movimiento",
        "name": "Barroco como Movimiento",
        "short_description": "Estudio del Barroco europeo e hispanoamericano como fenómeno cultural.",
        "sub_topics": [
          {
            "key": "estetica_barroca",
            "name": "Estética Barroca",
            "short_description": "Análisis de principios estéticos del Barroco.",
            "example_tasks": [
              "Identificar características barrocas: artificio, ornamentación, contraste, tensión",
              "Analizar el concepto de 'desengaño' barroco y su expresión literaria",
              "Comparar Barroco (complejidad, ornato) con Renacimiento (claridad, armonía)",
              "Analizar el Barroco como expresión de crisis y contradicción"
            ]
          },
          {
            "key": "barroco_america",
            "name": "Barroco de Indias",
            "short_description": "Estudio del Barroco americano y sus particularidades.",
            "example_tasks": [
              "Analizar el concepto de 'Barroco de Indias' según autores como Lezama Lima",
              "Identificar sincretismo cultural en Barroco americano",
              "Comparar Barroco español con Barroco novohispano o peruano",
              "Analizar cómo el Barroco se adapta a realidades americanas"
            ]
          },
          {
            "key": "neobarroco",
            "name": "Neobarroco Contemporáneo",
            "short_description": "Análisis del retorno al Barroco en literatura del siglo XX.",
            "example_tasks": [
              "Identificar características neobarrocas en Lezama Lima, Sarduy, Coral Bracho",
              "Analizar el neobarroco como resistencia a simplificación y racionalismo",
              "Comparar Barroco histórico con neobarroco latinoamericano",
              "Analizar la función política del neobarroco según Severo Sarduy"
            ]
          }
        ]
      },
      {
        "key": "romanticismo_movimiento",
        "name": "Romanticismo",
        "short_description": "Estudio del movimiento que privilegia emoción, individualismo y libertad creadora.",
        "sub_topics": [
          {
            "key": "principios_romanticos",
            "name": "Principios del Romanticismo",
            "short_description": "Análisis de los fundamentos estéticos románticos.",
            "example_tasks": [
              "Identificar principios románticos: subjetividad, genio creador, rechazo de reglas, naturaleza",
              "Analizar el concepto de 'genio romántico' vs. imitación neoclásica",
              "Comparar Romanticismo (emoción, libertad) con Clasicismo (razón, reglas)",
              "Analizar manifestaciones del Romanticismo en diferentes países y épocas"
            ]
          },
          {
            "key": "temas_romanticos",
            "name": "Temas Románticos",
            "short_description": "Estudio de tópicos característicos del Romanticismo.",
            "example_tasks": [
              "Identificar temas románticos: amor imposible, rebeldía, naturaleza, muerte, ruinas",
              "Analizar el héroe romántico: Byron, Werther, Don Juan",
              "Comparar tratamiento romántico de naturaleza (sublime, espejo del alma) con tratamiento clásico",
              "Analizar nacionalismo y recuperación de tradiciones populares en Romanticismo"
            ]
          }
        ]
      },
      {
        "key": "realismo_naturalismo_movimientos",
        "name": "Realismo y Naturalismo",
        "short_description": "Análisis de movimientos que buscan representación objetiva de la realidad.",
        "sub_topics": [
          {
            "key": "principios_realistas",
            "name": "Principios del Realismo",
            "short_description": "Estudio de los fundamentos del Realismo literario.",
            "example_tasks": [
              "Identificar principios realistas: observación objetiva, verosimilitud, descripción detallada, crítica social",
              "Analizar rechazo del idealismo romántico en Realismo",
              "Comparar Realismo (observación social) con Romanticismo (subjetividad, idealización)",
              "Analizar función de la descripción en narrativa realista"
            ]
          },
          {
            "key": "naturalismo_determinismo",
            "name": "Naturalismo y Determinismo",
            "short_description": "Análisis del Naturalismo como radicalización del Realismo.",
            "example_tasks": [
              "Identificar principios naturalistas: determinismo biológico y social, método científico",
              "Analizar influencia de positivismo y darwinismo en Naturalismo",
              "Comparar Realismo (crítica social moderada) con Naturalismo (determinismo, lo sórdido)",
              "Analizar la 'novela experimental' según Zola"
            ]
          }
        ]
      },
      {
        "key": "simbolismo_modernismo",
        "name": "Simbolismo y Modernismo",
        "short_description": "Estudio de movimientos que privilegian sugerencia, símbolo y renovación formal.",
        "sub_topics": [
          {
            "key": "simbolismo_frances",
            "name": "Simbolismo Francés",
            "short_description": "Análisis del Simbolismo como reacción contra positivismo.",
            "example_tasks": [
              "Identificar principios simbolistas: sugerencia sobre descripción, símbolo, correspondencias, musicalidad",
              "Analizar el concepto de 'correspondencias' de Baudelaire",
              "Comparar Simbolismo (sugerencia, hermetismo) con Realismo (descripción, claridad)",
              "Analizar influencia del Simbolismo en Modernismo hispanoamericano"
            ]
          },
          {
            "key": "modernismo_hispanoamericano",
            "name": "Modernismo Hispanoamericano",
            "short_description": "Estudio del primer movimiento literario hispanoamericano autónomo.",
            "example_tasks": [
              "Identificar características modernistas: renovación métrica, preciosismo, cosmopolitismo, sinestesia",
              "Analizar síntesis de influencias en Modernismo: Simbolismo, Parnasianismo, Romanticismo",
              "Comparar Modernismo (arte por el arte) con Realismo (función social)",
              "Analizar evolución del Modernismo: primera etapa esteticista, segunda etapa más americana"
            ]
          }
        ]
      },
      {
        "key": "vanguardias_historicas",
        "name": "Vanguardias Históricas",
        "short_description": "Análisis de movimientos de ruptura de inicios del siglo XX.",
        "sub_topics": [
          {
            "key": "caracteristicas_vanguardias",
            "name": "Características de las Vanguardias",
            "short_description": "Estudio de principios comunes a movimientos de vanguardia.",
            "example_tasks": [
              "Identificar características vanguardistas: ruptura, experimentación, manifiestos, provocación",
              "Analizar concepto de vanguardia como metáfora militar aplicada al arte",
              "Comparar vanguardias históricas (destrucción) con posmodernidad (convivencia)",
              "Analizar relación entre vanguardias artísticas y contexto histórico (guerras, revoluciones)"
            ]
          },
          {
            "key": "principales_ismos",
            "name": "Principales Ismos",
            "short_description": "Análisis de movimientos vanguardistas específicos.",
            "example_tasks": [
              "Comparar Futurismo (máquina, velocidad), Dadaísmo (absurdo, destrucción), Surrealismo (inconsciente)",
              "Analizar Expresionismo alemán y su visión distorsionada de la realidad",
              "Identificar Cubismo literario y su multiperspectivismo",
              "Comparar vanguardias europeas con hispanoamericanas (Ultraísmo, Creacionismo, Estridentismo)"
            ]
          },
          {
            "key": "vanguardias_hispanoamerica",
            "name": "Vanguardias en Hispanoamérica",
            "short_description": "Estudio de la recepción y recreación de vanguardias en América Latina.",
            "example_tasks": [
              "Analizar Ultraísmo, Creacionismo, Estridentismo como vanguardias hispanoamericanas",
              "Identificar asimilación y transformación de vanguardias europeas en América",
              "Comparar vanguardias cosmopolitas (Borges joven) con nacionalistas (Estridentismo)",
              "Analizar legado de vanguardias en poesía y narrativa latinoamericanas"
            ]
          }
        ]
      },
      {
        "key": "posmodernismo_literatura",
        "name": "Posmodernismo",
        "short_description": "Análisis de características de la literatura posmoderna.",
        "sub_topics": [
          {
            "key": "caracteristicas_posmodernas",
            "name": "Características Posmodernas",
            "short_description": "Estudio de rasgos de la literatura posmoderna.",
            "example_tasks": [
              "Identificar características posmodernas: metaficción, intertextualidad, fragmentación, parodia",
              "Analizar el escepticismo posmoderno hacia grandes narrativas",
              "Comparar experimentación moderna (búsqueda de sentido) con juego posmoderno (escepticismo)",
              "Analizar obras posmodernas: Calvino, Pynchon, Eco"
            ]
          },
          {
            "key": "posmodernidad_latinoamerica",
            "name": "Posmodernidad en América Latina",
            "short_description": "Análisis del debate sobre posmodernidad en contexto latinoamericano.",
            "example_tasks": [
              "Analizar debate sobre aplicabilidad de posmodernidad a América Latina",
              "Identificar elementos posmodernos en literatura latinoamericana reciente",
              "Comparar realismo mágico (moderno) con narrativa posmoderna latinoamericana",
              "Analizar autores posmodernos latinoamericanos: Ricardo Piglia, César Aira"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "teoria_critica_literaria",
    "name": "Teoría y Crítica Literaria",
    "short_description": "Estudio de los principales enfoques teóricos y metodológicos para el análisis de textos literarios.",
    "sub_topics": [
      {
        "key": "formalismo_estructuralismo",
        "name": "Formalismo y Estructuralismo",
        "short_description": "Análisis de teorías que estudian la literatura como sistema de signos.",
        "sub_topics": [
          {
            "key": "formalismo_ruso",
            "name": "Formalismo Ruso",
            "short_description": "Estudio del análisis formal de la obra literaria.",
            "example_tasks": [
              "Identificar conceptos formalistas: extrañamiento (ostranenie), dominante, función poética",
              "Analizar la distinción entre fábula (historia) y sjužet (trama)",
              "Aplicar conceptos formalistas al análisis de un cuento o poema",
              "Comparar formalismo (texto autónomo) con enfoques contextuales (históricos, sociológicos)"
            ]
          },
          {
            "key": "estructuralismo",
            "name": "Estructuralismo",
            "short_description": "Análisis de la literatura como sistema de signos y estructuras.",
            "example_tasks": [
              "Identificar conceptos estructuralistas: signo, sistema, oposiciones binarias, estructura profunda",
              "Analizar narraciones según modelo actancial de Greimas",
              "Aplicar análisis estructural a un cuento o mito",
              "Comparar estructuralismo literario con estructuralismo lingüístico (Saussure)"
            ]
          },
          {
            "key": "narratologia",
            "name": "Narratología",
            "short_description": "Estudio de las estructuras y técnicas narrativas.",
            "example_tasks": [
              "Identificar conceptos narratológicos: narrador, focalización, tiempo narrativo, niveles diegéticos",
              "Analizar tipos de narrador según Genette: homodiegético, heterodiegético, autodiegético",
              "Aplicar análisis narratológico a un fragmento de novela",
              "Comparar narratología estructuralista con narratología cognitiva"
            ]
          }
        ]
      },
      {
        "key": "hermeneutica_recepcion",
        "name": "Hermenéutica y Estética de la Recepción",
        "short_description": "Análisis de teorías centradas en interpretación y papel del lector.",
        "sub_topics": [
          {
            "key": "hermeneutica_literaria",
            "name": "Hermenéutica Literaria",
            "short_description": "Estudio de la interpretación de textos literarios.",
            "example_tasks": [
              "Identificar conceptos hermenéuticos: círculo hermenéutico, horizonte de comprensión, fusión de horizontes",
              "Analizar cómo el contexto histórico del lector afecta la interpretación",
              "Aplicar hermenéutica a la interpretación de un texto clásico en contexto actual",
              "Comparar hermenéutica (comprensión) con análisis formal (estructura)"
            ]
          },
          {
            "key": "estetica_recepcion",
            "name": "Estética de la Recepción",
            "short_description": "Análisis del papel activo del lector en construcción del sentido.",
            "example_tasks": [
              "Identificar conceptos de estética de recepción: horizonte de expectativas, lector implícito, concretización",
              "Analizar cómo las expectativas del lector determinan la recepción de una obra",
              "Aplicar conceptos de Jauss o Iser al análisis de la recepción de una obra",
              "Comparar enfoque en el autor (romanticismo) con enfoque en el lector (estética de recepción)"
            ]
          }
        ]
      },
      {
        "key": "marxismo_sociocritica",
        "name": "Crítica Marxista y Sociocrítica",
        "short_description": "Análisis de enfoques que estudian literatura en relación con sociedad e ideología.",
        "sub_topics": [
          {
            "key": "critica_marxista",
            "name": "Crítica Marxista",
            "short_description": "Estudio de la literatura como reflejo de relaciones sociales y lucha de clases.",
            "example_tasks": [
              "Identificar conceptos marxistas: infraestructura/superestructura, ideología, lucha de clases, realismo",
              "Analizar una obra literaria desde perspectiva de clase social",
              "Aplicar conceptos de Lukács sobre realismo y tipos sociales",
              "Comparar crítica marxista ortodoxa con marxismo occidental (Escuela de Frankfurt)"
            ]
          },
          {
            "key": "sociocritica",
            "name": "Sociocrítica",
            "short_description": "Análisis de la relación entre texto literario y contexto social.",
            "example_tasks": [
              "Identificar conceptos sociocríticos: mediación, visión del mundo, sujeto transindividual",
              "Analizar cómo una obra refleja y refracta su contexto social",
              "Aplicar sociocrítica de Goldmann a una novela realista o naturalista",
              "Comparar sociocrítica (dialéctica texto-contexto) con sociología de la literatura (contexto determina texto)"
            ]
          }
        ]
      },
      {
        "key": "psicoanalisis_literatura",
        "name": "Psicoanálisis y Literatura",
        "short_description": "Análisis de enfoques que aplican psicoanálisis a la interpretación literaria.",
        "sub_topics": [
          {
            "key": "freud_literatura",
            "name": "Psicoanálisis Freudiano",
            "short_description": "Estudio de conceptos freudianos aplicados a literatura.",
            "example_tasks": [
              "Identificar conceptos freudianos: inconsciente, represión, Edipo, pulsiones, sueños",
              "Analizar símbolos y mecanismos de defensa en un texto literario",
              "Aplicar interpretación psicoanalítica a personajes literarios",
              "Comparar psicoanálisis del autor con psicoanálisis del texto"
            ]
          },
          {
            "key": "lacan_literatura",
            "name": "Psicoanálisis Lacaniano",
            "short_description": "Análisis de conceptos lacanianos aplicados a literatura.",
            "example_tasks": [
              "Identificar conceptos lacanianos: lo Real, lo Imaginario, lo Simbólico, el Otro, falta",
              "Analizar el lenguaje como estructura del inconsciente en textos literarios",
              "Aplicar conceptos de Lacan al análisis de la subjetividad en personajes",
              "Comparar psicoanálisis freudiano (contenidos) con lacaniano (estructuras lingüísticas)"
            ]
          }
        ]
      },
      {
        "key": "feminismo_genero",
        "name": "Crítica Feminista y Estudios de Género",
        "short_description": "Análisis de enfoques que estudian representaciones de género y sexualidad.",
        "sub_topics": [
          {
            "key": "critica_feminista",
            "name": "Crítica Feminista",
            "short_description": "Estudio de la representación de mujeres y perspectivas feministas.",
            "example_tasks": [
              "Identificar representaciones de mujeres en textos del canon literario",
              "Analizar estereotipos de género en literatura clásica y contemporánea",
              "Aplicar conceptos de Simone de Beauvoir o Virginia Woolf al análisis literario",
              "Comparar crítica feminista anglosajona con feminismo francés (Cixous, Irigaray)"
            ]
          },
          {
            "key": "estudios_genero",
            "name": "Estudios de Género y Queer",
            "short_description": "Análisis de construcciones de género y sexualidad en literatura.",
            "example_tasks": [
              "Identificar conceptos de estudios de género: performatividad, heteronormatividad, identidad de género",
              "Analizar representaciones de diversidad sexual en textos literarios",
              "Aplicar teoría queer (Butler, Sedgwick) al análisis de textos",
              "Comparar estudios de género (construcción social) con esencialismo (naturalización)"
            ]
          },
          {
            "key": "escritura_femenina",
            "name": "Escritura Femenina y Ginocrítica",
            "short_description": "Estudio de tradiciones literarias escritas por mujeres.",
            "example_tasks": [
              "Identificar características de una posible 'escritura femenina'",
              "Analizar obras de autoras silenciadas o marginadas del canon",
              "Aplicar ginocrítica de Elaine Showalter al estudio de escritoras",
              "Comparar esencialismo (escritura femenina innata) con construccionismo (género como performance)"
            ]
          }
        ]
      },
      {
        "key": "poscolonialismo_subalternidad",
        "name": "Estudios Poscoloniales y Subalternos",
        "short_description": "Análisis de literatura desde perspectivas de colonialismo, imperio y subalternidad.",
        "sub_topics": [
          {
            "key": "teoria_poscolonial",
            "name": "Teoría Poscolonial",
            "short_description": "Estudio de literatura en contextos coloniales y poscoloniales.",
            "example_tasks": [
              "Identificar conceptos poscoloniales: orientalismo, hibridez, mímica, tercer espacio",
              "Analizar representaciones del 'otro' colonial en textos literarios",
              "Aplicar conceptos de Said, Bhabha o Spivak al análisis literario",
              "Comparar perspectivas coloniales con perspectivas poscoloniales sobre mismos textos"
            ]
          },
          {
            "key": "estudios_subalternos",
            "name": "Estudios Subalternos",
            "short_description": "Análisis de voces marginadas y subalternas.",
            "example_tasks": [
              "Identificar conceptos de subalternidad: voz, representación, agencia",
              "Analizar cómo textos literarios representan o silencian voces subalternas",
              "Aplicar pregunta de Spivak '¿Puede hablar el subalterno?' a textos literarios",
              "Comparar estudios subalternos del sur de Asia con latinoamericanos"
            ]
          },
          {
            "key": "decolonialidad",
            "name": "Pensamiento Decolonial",
            "short_description": "Análisis de literatura desde perspectivas decoloniales latinoamericanas.",
            "example_tasks": [
              "Identificar conceptos decoloniales: colonialidad del poder, del saber, del ser",
              "Analizar epistemologías alternativas en textos literarios latinoamericanos",
              "Aplicar pensamiento decolonial (Quijano, Mignolo) al análisis de literatura",
              "Comparar poscolonialismo (anglosajón) con decolonialidad (latinoamericana)"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "analisis_discurso_literario",
    "name": "Análisis del Discurso Literario",
    "short_description": "Estudio de herramientas y metodologías para el análisis profundo de textos literarios.",
    "sub_topics": [
      {
        "key": "niveles_analisis",
        "name": "Niveles de Análisis Textual",
        "short_description": "Estudio de diferentes estratos del texto literario.",
        "sub_topics": [
          {
            "key": "nivel_fonico",
            "name": "Nivel Fónico-Fonológico",
            "short_description": "Análisis de sonoridad, ritmo y musicalidad del texto.",
            "example_tasks": [
              "Analizar aliteraciones, asonancias y consonancias en un poema",
              "Identificar ritmo y acentos en versos de diferentes métricas",
              "Analizar función expresiva de recursos fónicos en un texto literario",
              "Comparar musicalidad de poesía modernista con poesía vanguardista"
            ]
          },
          {
            "key": "nivel_morfosintactico",
            "name": "Nivel Morfosintáctico",
            "short_description": "Análisis de estructuras gramaticales y su función expresiva.",
            "example_tasks": [
              "Analizar hipérbatos, paralelismos y otras estructuras sintácticas en un texto",
              "Identificar función expresiva de elecciones morfológicas (tiempos verbales, adjetivación)",
              "Analizar el uso de sintaxis en construcción de estilo de un autor",
              "Comparar sintaxis barroca (compleja) con sintaxis realista (simple)"
            ]
          },
          {
            "key": "nivel_semantico",
            "name": "Nivel Semántico",
            "short_description": "Análisis de significados, campos semánticos y figuras de sentido.",
            "example_tasks": [
              "Identificar campos semánticos y su función en un texto literario",
              "Analizar metáforas, metonimias y otras figuras semánticas",
              "Identificar isotopías (recurrencias semánticas) en un texto",
              "Comparar niveles de significación: literal, simbólico, alegórico"
            ]
          },
          {
            "key": "nivel_pragmatico",
            "name": "Nivel Pragmático",
            "short_description": "Análisis de la relación entre texto, autor y lector.",
            "example_tasks": [
              "Analizar marcas de enunciación y deixis en un texto literario",
              "Identificar estrategias de interpelación al lector",
              "Analizar actos de habla y su función en diálogos literarios",
              "Comparar diferentes pactos de lectura (realista, fantástico, autobiográfico)"
            ]
          }
        ]
      },
      {
        "key": "intertextualidad",
        "name": "Intertextualidad",
        "short_description": "Estudio de las relaciones entre textos literarios.",
        "sub_topics": [
          {
            "key": "tipos_intertextualidad",
            "name": "Tipos de Intertextualidad",
            "short_description": "Análisis de diferentes formas de relación entre textos.",
            "example_tasks": [
              "Identificar citas, alusiones y referencias explícitas en un texto",
              "Analizar parodias, pastiches y reescrituras de textos previos",
              "Identificar hipertextualidad: transformaciones y adaptaciones de textos",
              "Comparar intertextualidad marcada (citas) con intertextualidad difusa (ecos, influencias)"
            ]
          },
          {
            "key": "dialogismo_bajtín",
            "name": "Dialogismo y Polifonía",
            "short_description": "Análisis de conceptos de Bajtín sobre multiplicidad de voces.",
            "example_tasks": [
              "Identificar dialogismo: presencia de múltiples voces y discursos sociales en un texto",
              "Analizar polifonía en novelas de Dostoievski o textos narrativos complejos",
              "Identificar carnavalización: inversión y subversión de jerarquías",
              "Comparar novela monológica (una voz dominante) con novela polifónica (voces equivalentes)"
            ]
          },
          {
            "key": "palimpsesto",
            "name": "Palimpsesto y Transtextualidad",
            "short_description": "Estudio de capas de significación y relaciones transtextuales.",
            "example_tasks": [
              "Analizar un texto como palimpsesto: capas de textos previos",
              "Identificar los cinco tipos de transtextualidad según Genette",
              "Analizar architextualidad: relación del texto con su género",
              "Comparar metatextualidad (comentario) con hipertextualidad (transformación)"
            ]
          }
        ]
      },
      {
        "key": "analisis_tematico",
        "name": "Análisis Temático",
        "short_description": "Estudio de temas, motivos y tópicos literarios.",
        "sub_topics": [
          {
            "key": "temas_motivos",
            "name": "Temas y Motivos",
            "short_description": "Identificación de ideas centrales y elementos recurrentes.",
            "example_tasks": [
              "Identificar el tema principal y temas secundarios de una obra literaria",
              "Analizar motivos recurrentes y su función en la estructura de un texto",
              "Comparar el tratamiento de un mismo tema en diferentes autores y épocas",
              "Analizar la evolución de un tema a lo largo de la obra de un autor"
            ]
          },
          {
            "key": "topicos_literarios",
            "name": "Tópicos Literarios",
            "short_description": "Estudio de lugares comunes de la tradición literaria.",
            "example_tasks": [
              "Identificar tópicos clásicos: carpe diem, tempus fugit, locus amoenus, ubi sunt",
              "Analizar cómo un texto reutiliza, subvierte o renueva un tópico tradicional",
              "Comparar tratamiento de tópicos en diferentes épocas literarias",
              "Analizar nuevos tópicos de la literatura contemporánea"
            ]
          },
          {
            "key": "arquetipos_mitos",
            "name": "Arquetipos y Mitos",
            "short_description": "Análisis de estructuras míticas y arquetipos en literatura.",
            "example_tasks": [
              "Identificar arquetipos junguianos en personajes y situaciones literarias",
              "Analizar reescrituras de mitos clásicos en literatura moderna",
              "Aplicar mitocrítica al análisis de textos literarios",
              "Comparar estructuras míticas universales en literaturas de diferentes culturas"
            ]
          }
        ]
      },
      {
        "key": "analisis_estilo",
        "name": "Análisis Estilístico",
        "short_description": "Estudio del estilo individual de autores y textos.",
        "sub_topics": [
          {
            "key": "estilistica_autor",
            "name": "Estilo de Autor",
            "short_description": "Identificación de rasgos estilísticos distintivos.",
            "example_tasks": [
              "Identificar características del estilo de un autor: léxico, sintaxis, recursos",
              "Analizar la evolución del estilo a lo largo de la obra de un escritor",
              "Comparar estilos de diferentes autores de una misma época o movimiento",
              "Analizar cómo el estilo contribuye al sentido de la obra"
            ]
          },
          {
            "key": "registros_lengua",
            "name": "Registros de Lengua",
            "short_description": "Análisis de variedades lingüísticas en textos literarios.",
            "example_tasks": [
              "Identificar registros cultos, coloquiales, populares en un texto literario",
              "Analizar función expresiva de dialectos y sociolectos",
              "Comparar uso de registros en literatura realista vs. literatura idealista",
              "Analizar representación de oralidad en textos escritos"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "intertextualidad_literatura_comparada",
    "name": "Intertextualidad y Literatura Comparada",
    "short_description": "Estudio de relaciones entre textos, autores, literaturas nacionales y tradiciones culturales.",
    "sub_topics": [
      {
        "key": "literatura_comparada",
        "name": "Literatura Comparada",
        "short_description": "Análisis de relaciones entre literaturas de diferentes lenguas y culturas.",
        "sub_topics": [
          {
            "key": "metodos_comparativos",
            "name": "Métodos Comparativos",
            "short_description": "Estudio de metodologías para comparación literaria.",
            "example_tasks": [
              "Comparar tratamiento de un tema (amor, muerte, poder) en literaturas de diferentes lenguas",
              "Analizar influencias y recepciones entre literaturas nacionales",
              "Identificar paralelismos y diferencias entre movimientos literarios de diferentes países",
              "Comparar traducciones de una misma obra y su impacto en la recepción"
            ]
          },
          {
            "key": "literatura_universal",
            "name": "Literatura Mundial",
            "short_description": "Análisis del concepto de Weltliteratur y circulación de textos.",
            "example_tasks": [
              "Analizar el concepto de literatura mundial desde Goethe hasta debates actuales",
              "Identificar obras de circulación y reconocimiento universales",
              "Analizar sistemas literarios centrales y periféricos",
              "Comparar perspectivas eurocéntricas con perspectivas globales de literatura mundial"
            ]
          }
        ]
      },
      {
        "key": "dialogo_culturas",
        "name": "Diálogo entre Culturas",
        "short_description": "Estudio de contactos, influencias y tensiones entre tradiciones culturales.",
        "sub_topics": [
          {
            "key": "literatura_traduccion",
            "name": "Literatura y Traducción",
            "short_description": "Análisis del papel de la traducción en circulación literaria.",
            "example_tasks": [
              "Analizar cómo la traducción transforma y recrea textos literarios",
              "Identificar problemas de intraducibilidad en textos literarios",
              "Comparar diferentes traducciones de una misma obra",
              "Analizar el papel histórico de traductores en difusión de movimientos literarios"
            ]
          },
          {
            "key": "hibridacion_transcultural",
            "name": "Hibridación y Transculturación",
            "short_description": "Estudio de mezclas y transformaciones culturales en literatura.",
            "example_tasks": [
              "Analizar procesos de transculturación en literaturas latinoamericanas",
              "Identificar elementos híbridos en textos de contacto cultural",
              "Comparar conceptos de hibridez (Bhabha), transculturación (Ortiz), heterogeneidad (Cornejo Polar)",
              "Analizar literaturas de frontera y su carácter intercultural"
            ]
          }
        ]
      },
      {
        "key": "reescrituras_adaptaciones",
        "name": "Reescrituras y Adaptaciones",
        "short_description": "Análisis de transformaciones de textos literarios.",
        "sub_topics": [
          {
            "key": "reescrituras_literarias",
            "name": "Reescrituras Literarias",
            "short_description": "Estudio de versiones y reinterpretaciones de textos previos.",
            "example_tasks": [
              "Analizar reescrituras de mitos clásicos en literatura contemporánea",
              "Identificar estrategias de reescritura: inversión, ampliación, cambio de perspectiva",
              "Comparar texto original con reescrituras y analizar transformaciones de sentido",
              "Analizar reescrituras poscoloniales que subvierten textos canónicos"
            ]
          },
          {
            "key": "adaptaciones_intermediales",
            "name": "Adaptaciones Intermediales",
            "short_description": "Análisis de transposiciones de literatura a otros medios.",
            "example_tasks": [
              "Analizar adaptaciones cinematográficas de obras literarias",
              "Identificar diferencias entre especificidad literaria y cinematográfica",
              "Comparar novela gráfica con texto literario original",
              "Analizar adaptaciones teatrales o musicales de textos narrativos"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "produccion_creacion_literaria",
    "name": "Producción y Creación Literaria",
    "short_description": "Desarrollo de habilidades de escritura creativa y análisis del proceso de creación literaria.",
    "sub_topics": [
      {
        "key": "taller_narrativa",
        "name": "Taller de Narrativa",
        "short_description": "Práctica de escritura de textos narrativos breves.",
        "sub_topics": [
          {
            "key": "cuento_creacion",
            "name": "Escritura de Cuento",
            "short_description": "Técnicas y práctica para crear cuentos literarios.",
            "example_tasks": [
              "Escribir un cuento breve aplicando técnicas de construcción de personajes, conflicto y desenlace",
              "Experimentar con diferentes tipos de narradores y perspectivas narrativas",
              "Crear un cuento a partir de una situación límite o momento de crisis",
              "Revisar y editar el propio cuento considerando economía narrativa y tensión"
            ]
          },
          {
            "key": "microrrelato_creacion",
            "name": "Escritura de Microrrelato",
            "short_description": "Práctica de narrativa ultrabrevísima.",
            "example_tasks": [
              "Escribir microrrelatos de máximo 200 palabras con estructura completa",
              "Experimentar con finales sorpresivos e intertextualidad en microrrelatos",
              "Crear microrrelatos inspirados en diferentes temas o consignas",
              "Analizar y discutir microrrelatos propios y de compañeros"
            ]
          },
          {
            "key": "tecnicas_narrativas",
            "name": "Técnicas Narrativas",
            "short_description": "Estudio y aplicación de recursos narrativos.",
            "example_tasks": [
              "Experimentar con el tiempo narrativo: orden cronológico, analepsis, prolepsis",
              "Practicar diferentes técnicas de caracterización de personajes",
              "Escribir una escena usando diálogo como motor de la acción",
              "Experimentar con descripciones que creen atmósfera y revelen carácter"
            ]
          }
        ]
      },
      {
        "key": "taller_poesia",
        "name": "Taller de Poesía",
        "short_description": "Práctica de escritura poética y exploración de formas líricas.",
        "sub_topics": [
          {
            "key": "verso_libre",
            "name": "Poesía en Verso Libre",
            "short_description": "Experimentación con formas poéticas no métricas.",
            "example_tasks": [
              "Escribir poemas en verso libre explorando ritmo, imagen y tono",
              "Experimentar con diferentes registros: coloquial, elevado, conversacional",
              "Crear poemas a partir de imágenes sensoriales específicas",
              "Revisar poemas propios identificando metáforas, símbolos y recursos sonoros"
            ]
          },
          {
            "key": "formas_fijas",
            "name": "Formas Poéticas Fijas",
            "short_description": "Práctica de formas tradicionales: soneto, décima, haiku.",
            "example_tasks": [
              "Escribir un soneto respetando métrica y esquema de rima tradicional",
              "Crear décimas espinelas sobre temas personales o sociales",
              "Experimentar con haikus capturando momentos de percepción",
              "Analizar propias creaciones en formas fijas y su relación con la tradición"
            ]
          },
          {
            "key": "poesia_experimental",
            "name": "Poesía Experimental",
            "short_description": "Exploración de formas poéticas innovadoras.",
            "example_tasks": [
              "Crear caligramas o poemas visuales donde forma y contenido se integren",
              "Experimentar con poesía concreta o poesía sonora",
              "Escribir poemas que incorporen elementos de otras artes o medios",
              "Crear poemas multimedia o transmedia"
            ]
          }
        ]
      },
      {
        "key": "taller_dramaturgia",
        "name": "Taller de Dramaturgia",
        "short_description": "Práctica de escritura de textos teatrales.",
        "sub_topics": [
          {
            "key": "escritura_escenas",
            "name": "Escritura de Escenas Dramáticas",
            "short_description": "Creación de diálogos y situaciones teatrales.",
            "example_tasks": [
              "Escribir una escena teatral breve con conflicto y resolución",
              "Experimentar con diálogo dramático: subtexto, tensión, revelación",
              "Crear escenas que desarrollen conflictos interpersonales",
              "Escribir acotaciones que orienten la puesta en escena sin ser excesivas"
            ]
          },
          {
            "key": "monologos",
            "name": "Monólogos Dramáticos",
            "short_description": "Práctica de escritura de monólogos teatrales.",
            "example_tasks": [
              "Escribir un monólogo dramático que revele psicología de un personaje",
              "Experimentar con monólogo interior y soliloquio",
              "Crear monólogos desde perspectivas de personajes diversos",
              "Analizar y representar monólogos propios y de compañeros"
            ]
          }
        ]
      },
      {
        "key": "escritura_ensayo",
        "name": "Escritura de Ensayo Literario",
        "short_description": "Práctica de ensayo con perspectiva personal y estilo.",
        "sub_topics": [
          {
            "key": "ensayo_personal",
            "name": "Ensayo Personal",
            "short_description": "Escritura de ensayos con voz y perspectiva propias.",
            "example_tasks": [
              "Escribir un ensayo personal sobre una experiencia de lectura significativa",
              "Experimentar con diferentes estrategias de inicio y cierre del ensayo",
              "Integrar referencias literarias de manera natural en el ensayo",
              "Desarrollar una voz ensayística propia equilibrando subjetividad y argumentación"
            ]
          },
          {
            "key": "ensayo_critico",
            "name": "Ensayo Crítico Literario",
            "short_description": "Escritura de análisis e interpretación de obras literarias.",
            "example_tasks": [
              "Escribir un ensayo crítico sobre un tema u obra literaria",
              "Estructurar argumentación crítica con tesis, evidencia textual y conclusión",
              "Integrar citas y referencias bibliográficas adecuadamente",
              "Desarrollar interpretación original fundamentada en análisis textual"
            ]
          }
        ]
      },
      {
        "key": "proceso_creativo",
        "name": "Reflexión sobre el Proceso Creativo",
        "short_description": "Análisis metacognitivo de la práctica de escritura literaria.",
        "sub_topics": [
          {
            "key": "lectura_escritor",
            "name": "Lectura como Escritor",
            "short_description": "Análisis de textos literarios desde perspectiva de creador.",
            "example_tasks": [
              "Leer textos literarios identificando técnicas y decisiones del autor",
              "Analizar cómo autores resuelven problemas narrativos o poéticos específicos",
              "Comparar diferentes versiones o borradores de una obra publicada",
              "Aplicar técnicas observadas en lecturas a la propia escritura"
            ]
          },
          {
            "key": "revision_edicion",
            "name": "Revisión y Edición",
            "short_description": "Práctica de mejoramiento de textos propios.",
            "example_tasks": [
              "Revisar textos propios con distancia crítica tras un periodo de reposo",
              "Participar en talleres de retroalimentación de textos entre pares",
              "Identificar y eliminar redundancias, clichés y debilidades en textos propios",
              "Reescribir textos incorporando sugerencias y reflexión crítica"
            ]
          },
          {
            "key": "voz_estilo_propios",
            "name": "Desarrollo de Voz y Estilo Propios",
            "short_description": "Exploración y consolidación de identidad literaria.",
            "example_tasks": [
              "Experimentar con diferentes registros y tonos para encontrar voz propia",
              "Analizar la propia escritura identificando rasgos estilísticos recurrentes",
              "Equilibrar influencias literarias con búsqueda de originalidad",
              "Reflexionar sobre temas, preocupaciones y obsesiones propias como escritor"
            ]
          }
        ]
      }
    ]
  }
]
