[
  {
    "key": "caracteristicas_seres_vivos",
    "name": "Características de los Seres Vivos",
    "short_description": "Identificación de las características que distinguen a los seres vivos de la materia inerte, incluyendo nutrición, reproducción, crecimiento y respuesta a estímulos.",
    "sub_topics": [
      {
        "key": "funciones_vitales",
        "name": "Funciones Vitales",
        "short_description": "Estudio de las funciones básicas que todos los seres vivos realizan para mantenerse con vida.",
        "sub_topics": [
          {
            "key": "nutricion_basica",
            "name": "Nutrición",
            "short_description": "Comprensión de cómo los seres vivos obtienen y utilizan los nutrientes para obtener energía.",
            "example_tasks": [
              "Compara cómo obtienen su alimento una planta, un conejo y un hongo, e identifica las diferencias",
              "Observa una planta durante una semana y registra los cambios que observas relacionados con su nutrición",
              "Clasifica diferentes organismos en autótrofos y heterótrofos según su forma de obtener alimento"
            ]
          },
          {
            "key": "reproduccion_basica",
            "name": "Reproducción",
            "short_description": "Reconocimiento de la capacidad de los seres vivos para generar descendencia.",
            "example_tasks": [
              "Investiga y dibuja tres formas diferentes en que los animales tienen crías",
              "Observa semillas y explica cómo las plantas se reproducen a través de ellas",
              "Compara la reproducción de un mamífero con la de un insecto mediante un diagrama"
            ]
          },
          {
            "key": "crecimiento_desarrollo",
            "name": "Crecimiento y Desarrollo",
            "short_description": "Identificación de los cambios que experimentan los seres vivos a lo largo de su vida.",
            "example_tasks": [
              "Crea una línea del tiempo mostrando las etapas de crecimiento de un ser humano desde bebé hasta adulto",
              "Compara el crecimiento de una planta de frijol con el de un pollito durante el mismo período",
              "Registra el crecimiento de una planta midiendo su altura cada semana durante un mes"
            ]
          },
          {
            "key": "respuesta_estimulos",
            "name": "Respuesta a Estímulos",
            "short_description": "Comprensión de cómo los seres vivos reaccionan a los cambios en su ambiente.",
            "example_tasks": [
              "Diseña un experimento para observar cómo una planta responde a la luz solar",
              "Observa y describe cómo reacciona tu mascota o un animal ante diferentes estímulos (sonido, comida, peligro)",
              "Explica qué pasa cuando tocas una planta sensitiva (mimosa púdica) y por qué esto demuestra que está viva"
            ]
          }
        ]
      },
      {
        "key": "organizacion_seres_vivos",
        "name": "Organización de los Seres Vivos",
        "short_description": "Estudio de los niveles de organización desde las células hasta los organismos completos.",
        "sub_topics": [
          {
            "key": "celula_unidad_vida",
            "name": "La Célula como Unidad de Vida",
            "short_description": "Reconocimiento de la célula como la unidad básica de todos los seres vivos.",
            "example_tasks": [
              "Observa células de cebolla bajo el microscopio y dibuja lo que ves, señalando sus partes principales",
              "Compara una célula animal con una célula vegetal identificando sus diferencias",
              "Explica por qué todos los seres vivos están formados por células usando ejemplos"
            ]
          },
          {
            "key": "organismos_unicelulares_pluricelulares",
            "name": "Organismos Unicelulares y Pluricelulares",
            "short_description": "Diferenciación entre organismos formados por una célula y aquellos formados por muchas células.",
            "example_tasks": [
              "Clasifica una lista de organismos (bacteria, árbol, amiba, perro, levadura) en unicelulares y pluricelulares",
              "Investiga tres ejemplos de organismos unicelulares y describe dónde viven",
              "Explica las ventajas de ser un organismo pluricelular comparado con uno unicelular"
            ]
          },
          {
            "key": "tejidos_organos_sistemas",
            "name": "Tejidos, Órganos y Sistemas",
            "short_description": "Comprensión de cómo las células se organizan en estructuras más complejas.",
            "example_tasks": [
              "Identifica en tu propio cuerpo ejemplos de tejidos (piel), órganos (corazón) y sistemas (digestivo)",
              "Crea un diagrama mostrando cómo las células se organizan en tejidos, luego en órganos y finalmente en sistemas",
              "Explica cómo trabajan juntos diferentes órganos en el sistema digestivo"
            ]
          }
        ]
      },
      {
        "key": "necesidades_basicas",
        "name": "Necesidades Básicas de los Seres Vivos",
        "short_description": "Identificación de los requerimientos fundamentales que todos los seres vivos necesitan para sobrevivir.",
        "sub_topics": [
          {
            "key": "agua_vida",
            "name": "Agua",
            "short_description": "Comprensión de la importancia del agua para todos los seres vivos.",
            "example_tasks": [
              "Diseña un experimento con dos plantas donde una recibe agua y otra no, prediciendo los resultados",
              "Explica tres formas en que los animales del desierto obtienen y conservan el agua",
              "Investiga qué porcentaje de agua contiene el cuerpo humano y por qué es tan importante"
            ]
          },
          {
            "key": "alimento_energia",
            "name": "Alimento y Energía",
            "short_description": "Reconocimiento de que los seres vivos necesitan energía que obtienen del alimento.",
            "example_tasks": [
              "Compara qué comen tres animales diferentes y cómo obtienen su energía",
              "Explica por qué las plantas necesitan luz solar y cómo la usan para producir alimento",
              "Describe qué pasaría con un animal si no pudiera obtener alimento durante varios días"
            ]
          },
          {
            "key": "aire_gases",
            "name": "Aire y Gases",
            "short_description": "Comprensión de la importancia del aire y los gases para la vida.",
            "example_tasks": [
              "Investiga qué gas del aire necesitan los animales para respirar y cuál producen las plantas",
              "Diseña un experimento simple para demostrar que las plantas producen oxígeno",
              "Explica por qué los peces necesitan agua con oxígeno disuelto para vivir"
            ]
          },
          {
            "key": "espacio_refugio",
            "name": "Espacio y Refugio",
            "short_description": "Reconocimiento de que los seres vivos necesitan un lugar donde vivir y protegerse.",
            "example_tasks": [
              "Describe tres tipos diferentes de refugios que usan los animales (madriguera, nido, cueva)",
              "Investiga cómo las plantas compiten por espacio y luz solar en un bosque",
              "Explica por qué es importante que cada especie tenga su propio hábitat"
            ]
          }
        ]
      },
      {
        "key": "adaptaciones_supervivencia",
        "name": "Adaptaciones para la Supervivencia",
        "short_description": "Estudio de las características especiales que ayudan a los seres vivos a sobrevivir en su ambiente.",
        "sub_topics": [
          {
            "key": "adaptaciones_fisicas",
            "name": "Adaptaciones Físicas",
            "short_description": "Identificación de características corporales que ayudan a los organismos a sobrevivir.",
            "example_tasks": [
              "Compara las patas de un pato, un águila y un venado, y explica cómo cada una está adaptada a su ambiente",
              "Investiga tres adaptaciones físicas del cactus que le permiten vivir en el desierto",
              "Describe cómo el pelaje grueso del oso polar es una adaptación al clima frío"
            ]
          },
          {
            "key": "adaptaciones_comportamiento",
            "name": "Adaptaciones de Comportamiento",
            "short_description": "Reconocimiento de conductas que ayudan a los organismos a sobrevivir.",
            "example_tasks": [
              "Explica por qué algunos animales migran durante ciertas épocas del año",
              "Investiga cómo los murciélagos usan la ecolocación para cazar en la oscuridad",
              "Describe el comportamiento de hibernación y por qué ayuda a algunos animales a sobrevivir el invierno"
            ]
          },
          {
            "key": "camuflaje_mimetismo",
            "name": "Camuflaje y Mimetismo",
            "short_description": "Comprensión de cómo algunos organismos se ocultan o imitan a otros para sobrevivir.",
            "example_tasks": [
              "Encuentra ejemplos de tres animales mexicanos que usan camuflaje y explica cómo les ayuda",
              "Compara el camuflaje del camaleón con el de un insecto hoja",
              "Investiga qué es el mimetismo batesiano usando el ejemplo de una serpiente falso coral"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "clasificacion_seres_vivos",
    "name": "Clasificación de los Seres Vivos",
    "short_description": "Organización de los seres vivos en grupos según sus características compartidas, introduciendo los cinco reinos y criterios de clasificación.",
    "sub_topics": [
      {
        "key": "criterios_clasificacion",
        "name": "Criterios de Clasificación",
        "short_description": "Comprensión de las características que se usan para agrupar a los seres vivos.",
        "sub_topics": [
          {
            "key": "caracteristicas_observables",
            "name": "Características Observables",
            "short_description": "Uso de características visibles para clasificar organismos.",
            "example_tasks": [
              "Agrupa una colección de 10 hojas diferentes según su forma, borde y venación",
              "Clasifica animales observados en tu comunidad según tengan plumas, pelo, escamas o piel desnuda",
              "Crea una clave dicotómica simple para identificar 5 frutas diferentes usando características observables"
            ]
          },
          {
            "key": "similitudes_diferencias",
            "name": "Similitudes y Diferencias",
            "short_description": "Identificación de características compartidas y únicas entre organismos.",
            "example_tasks": [
              "Compara un perro y un gato listando 5 similitudes y 5 diferencias",
              "Explica qué características comparten todos los insectos que permiten clasificarlos juntos",
              "Identifica las diferencias principales entre un pez y un delfín aunque ambos vivan en el agua"
            ]
          },
          {
            "key": "importancia_clasificacion",
            "name": "Importancia de la Clasificación",
            "short_description": "Comprensión de por qué los científicos clasifican a los seres vivos.",
            "example_tasks": [
              "Explica cómo la clasificación ayuda a los científicos a estudiar millones de especies diferentes",
              "Investiga cómo se usan los nombres científicos para evitar confusión entre idiomas",
              "Describe una situación donde conocer la clasificación de un organismo sería útil (medicina, agricultura)"
            ]
          }
        ]
      },
      {
        "key": "cinco_reinos",
        "name": "Los Cinco Reinos",
        "short_description": "Introducción a la clasificación de todos los seres vivos en cinco grandes reinos.",
        "sub_topics": [
          {
            "key": "reino_animal",
            "name": "Reino Animal",
            "short_description": "Características generales de los animales como organismos heterótrofos pluricelulares.",
            "example_tasks": [
              "Lista 10 animales diferentes de México y explica qué características comparten todos ellos",
              "Compara un animal invertebrado con uno vertebrado identificando sus diferencias principales",
              "Investiga tres animales del reino animal que viven en diferentes hábitats de México"
            ]
          },
          {
            "key": "reino_vegetal",
            "name": "Reino Vegetal (Plantae)",
            "short_description": "Características de las plantas como organismos autótrofos que realizan fotosíntesis.",
            "example_tasks": [
              "Identifica 5 plantas de tu comunidad y describe sus características comunes (raíz, tallo, hojas)",
              "Explica por qué las plantas son tan importantes para otros seres vivos en la Tierra",
              "Compara un helecho con una planta con flores señalando similitudes y diferencias"
            ]
          },
          {
            "key": "reino_fungi",
            "name": "Reino Fungi (Hongos)",
            "short_description": "Identificación de los hongos como organismos diferentes de plantas y animales.",
            "example_tasks": [
              "Observa hongos en tu comunidad (moho, champiñones, levadura) y describe dónde crecen",
              "Explica cómo los hongos se alimentan de manera diferente a las plantas",
              "Investiga tres usos importantes de los hongos para los seres humanos (alimentación, medicina)"
            ]
          },
          {
            "key": "reino_protista",
            "name": "Reino Protista",
            "short_description": "Introducción a organismos microscópicos unicelulares como amibas y algas.",
            "example_tasks": [
              "Investiga qué son los protozoarios y menciona dos ejemplos",
              "Observa agua de un estanque bajo el microscopio y dibuja los protistas que encuentres",
              "Compara un protista autótrofo (alga) con uno heterótrofo (amiba)"
            ]
          },
          {
            "key": "reino_monera",
            "name": "Reino Monera (Bacterias)",
            "short_description": "Conocimiento de las bacterias como organismos unicelulares sin núcleo.",
            "example_tasks": [
              "Explica dónde se pueden encontrar bacterias en nuestra vida diaria",
              "Investiga dos bacterias benéficas (yogurt, descomposición) y dos dañinas (enfermedades)",
              "Describe cómo las bacterias son importantes para reciclar nutrientes en la naturaleza"
            ]
          }
        ]
      },
      {
        "key": "vertebrados_invertebrados",
        "name": "Vertebrados e Invertebrados",
        "short_description": "Clasificación de animales según la presencia o ausencia de columna vertebral.",
        "sub_topics": [
          {
            "key": "caracteristicas_vertebrados",
            "name": "Características de los Vertebrados",
            "short_description": "Identificación de animales con columna vertebral y esqueleto interno.",
            "example_tasks": [
              "Clasifica estos animales en vertebrados: mariposa, perro, tiburón, caracol, águila, serpiente",
              "Explica qué ventajas proporciona tener una columna vertebral",
              "Investiga los cinco grupos de vertebrados (peces, anfibios, reptiles, aves, mamíferos)"
            ]
          },
          {
            "key": "grupos_vertebrados",
            "name": "Grupos de Vertebrados",
            "short_description": "Diferenciación entre peces, anfibios, reptiles, aves y mamíferos.",
            "example_tasks": [
              "Crea una tabla comparando las características de los cinco grupos de vertebrados",
              "Identifica a qué grupo pertenecen estos animales mexicanos: ajolote, jaguar, colibrí, iguana, pez vela",
              "Describe las adaptaciones únicas de las aves que les permiten volar"
            ]
          },
          {
            "key": "invertebrados_diversos",
            "name": "Diversidad de Invertebrados",
            "short_description": "Reconocimiento de la gran variedad de animales sin columna vertebral.",
            "example_tasks": [
              "Investiga tres grupos diferentes de invertebrados (insectos, moluscos, arácnidos) y da ejemplos",
              "Observa invertebrados en tu jardín o parque y clasifícalos según sus características",
              "Explica por qué los insectos son el grupo de animales más numeroso del planeta"
            ]
          },
          {
            "key": "importancia_invertebrados",
            "name": "Importancia de los Invertebrados",
            "short_description": "Comprensión del papel de los invertebrados en los ecosistemas.",
            "example_tasks": [
              "Investiga cómo las abejas ayudan a las plantas mediante la polinización",
              "Describe el papel de las lombrices en mantener el suelo saludable",
              "Explica por qué los insectos son importantes en las cadenas alimentarias"
            ]
          }
        ]
      },
      {
        "key": "nombres_cientificos",
        "name": "Nombres Científicos y Comunes",
        "short_description": "Introducción al sistema de nomenclatura binomial y su importancia.",
        "sub_topics": [
          {
            "key": "nombres_comunes",
            "name": "Nombres Comunes",
            "short_description": "Reconocimiento de que los organismos tienen diferentes nombres en cada región.",
            "example_tasks": [
              "Investiga tres nombres comunes diferentes para el mismo animal en distintas regiones de México",
              "Explica por qué un nombre común puede crear confusión entre personas de diferentes lugares",
              "Compara el nombre común y científico del maíz (Zea mays) y el frijol (Phaseolus vulgaris)"
            ]
          },
          {
            "key": "sistema_binomial",
            "name": "Sistema de Nomenclatura Binomial",
            "short_description": "Introducción básica a cómo se forman los nombres científicos.",
            "example_tasks": [
              "Aprende el nombre científico de tres animales mexicanos famosos (jaguar: Panthera onca)",
              "Explica por qué los científicos de todo el mundo usan el mismo nombre científico",
              "Identifica el género y la especie en nombres científicos como Homo sapiens y Canis lupus"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "biodiversidad_ecosistemas_mexico",
    "name": "Biodiversidad y Ecosistemas de México",
    "short_description": "Exploración de la gran diversidad de seres vivos en México y sus diferentes ecosistemas, reconociendo especies endémicas y la importancia de la conservación.",
    "sub_topics": [
      {
        "key": "concepto_biodiversidad",
        "name": "Concepto de Biodiversidad",
        "short_description": "Comprensión de la variedad de seres vivos que existe en nuestro planeta y país.",
        "sub_topics": [
          {
            "key": "diversidad_especies",
            "name": "Diversidad de Especies",
            "short_description": "Reconocimiento de la gran cantidad de especies diferentes que existen.",
            "example_tasks": [
              "Investiga cuántas especies de animales y plantas aproximadamente existen en México",
              "Crea un cartel mostrando 10 especies diferentes que viven en tu región",
              "Explica por qué México es considerado un país megadiverso"
            ]
          },
          {
            "key": "diversidad_ecosistemas",
            "name": "Diversidad de Ecosistemas",
            "short_description": "Identificación de los diferentes tipos de ecosistemas en México.",
            "example_tasks": [
              "Nombra cinco ecosistemas diferentes que existen en México (selva, desierto, bosque, manglar, arrecife)",
              "Compara dos ecosistemas mexicanos según su clima, plantas y animales",
              "Investiga qué ecosistema existe en tu estado y qué especies lo habitan"
            ]
          },
          {
            "key": "importancia_biodiversidad",
            "name": "Importancia de la Biodiversidad",
            "short_description": "Comprensión de por qué es importante mantener la variedad de seres vivos.",
            "example_tasks": [
              "Explica tres razones por las que la biodiversidad es importante para los seres humanos",
              "Investiga cómo la pérdida de una especie puede afectar a todo un ecosistema",
              "Describe cómo los pueblos indígenas de México han usado la biodiversidad para alimentación y medicina"
            ]
          }
        ]
      },
      {
        "key": "ecosistemas_terrestres_mexico",
        "name": "Ecosistemas Terrestres de México",
        "short_description": "Exploración de los principales ecosistemas terrestres del país.",
        "sub_topics": [
          {
            "key": "selvas_humedas",
            "name": "Selvas Húmedas y Tropicales",
            "short_description": "Características de las selvas del sureste de México.",
            "example_tasks": [
              "Investiga qué estados de México tienen selvas tropicales y qué clima tienen",
              "Nombra cinco animales que viven en las selvas mexicanas (jaguar, guacamaya, mono araña, tucán, tapir)",
              "Describe las adaptaciones de las plantas de la selva para obtener luz solar"
            ]
          },
          {
            "key": "bosques_templados",
            "name": "Bosques Templados y de Coníferas",
            "short_description": "Estudio de los bosques de zonas montañosas y templadas.",
            "example_tasks": [
              "Identifica tres tipos de árboles comunes en los bosques templados de México (pino, encino, oyamel)",
              "Investiga qué animales habitan en los bosques donde hibernan las mariposas monarca",
              "Explica cómo los bosques ayudan a capturar agua de lluvia y mantener ríos"
            ]
          },
          {
            "key": "desiertos",
            "name": "Desiertos y Matorrales",
            "short_description": "Características de las zonas áridas del norte de México.",
            "example_tasks": [
              "Describe tres adaptaciones de los cactus para sobrevivir en el desierto",
              "Investiga animales del desierto mexicano (camaleón, serpiente de cascabel, correcaminos)",
              "Explica cómo los animales del desierto conservan agua y soportan el calor"
            ]
          },
          {
            "key": "pastizales",
            "name": "Pastizales y Matorrales",
            "short_description": "Ecosistemas de hierbas y arbustos en diferentes regiones.",
            "example_tasks": [
              "Compara un pastizal con un bosque identificando sus diferencias principales",
              "Investiga qué animales herbívoros viven en los pastizales de México",
              "Describe cómo los pastizales son importantes para la ganadería"
            ]
          }
        ]
      },
      {
        "key": "ecosistemas_acuaticos_mexico",
        "name": "Ecosistemas Acuáticos de México",
        "short_description": "Exploración de ecosistemas de agua dulce y salada.",
        "sub_topics": [
          {
            "key": "rios_lagos",
            "name": "Ríos y Lagos",
            "short_description": "Ecosistemas de agua dulce y su biodiversidad.",
            "example_tasks": [
              "Investiga tres lagos importantes de México y qué especies viven en ellos",
              "Describe el hábitat del ajolote en los canales de Xochimilco",
              "Explica por qué los ríos son importantes para los seres vivos y las comunidades humanas"
            ]
          },
          {
            "key": "costas_oceanos",
            "name": "Costas y Océanos",
            "short_description": "Ecosistemas marinos y costeros de México.",
            "example_tasks": [
              "Nombra cinco animales marinos que habitan en los océanos que rodean México (ballena, tiburón, tortuga, delfín)",
              "Investiga qué es una zona intermareal y qué organismos viven ahí",
              "Describe la migración de las ballenas grises a las costas de Baja California"
            ]
          },
          {
            "key": "arrecifes_coral",
            "name": "Arrecifes de Coral",
            "short_description": "El Sistema Arrecifal Mesoamericano y su importancia.",
            "example_tasks": [
              "Investiga qué es un arrecife de coral y por qué es considerado un ecosistema muy diverso",
              "Nombra cinco organismos que viven en los arrecifes de coral del Caribe mexicano",
              "Explica por qué los arrecifes de coral son importantes y qué amenazas enfrentan"
            ]
          },
          {
            "key": "manglares",
            "name": "Manglares",
            "short_description": "Ecosistemas costeros donde el agua dulce se mezcla con el mar.",
            "example_tasks": [
              "Describe las adaptaciones especiales de los árboles de mangle para vivir en agua salada",
              "Investiga qué animales usan los manglares como refugio (cocodrilos, garzas, cangrejos)",
              "Explica por qué los manglares protegen las costas de huracanes y tormentas"
            ]
          }
        ]
      },
      {
        "key": "especies_endemicas_mexico",
        "name": "Especies Endémicas de México",
        "short_description": "Especies únicas que solo existen en México.",
        "sub_topics": [
          {
            "key": "concepto_endemismo",
            "name": "Concepto de Endemismo",
            "short_description": "Comprensión de qué significa que una especie sea endémica.",
            "example_tasks": [
              "Explica con tus propias palabras qué significa que una especie sea endémica",
              "Investiga por qué México tiene tantas especies endémicas comparado con otros países",
              "Describe la responsabilidad que tiene México de proteger sus especies endémicas"
            ]
          },
          {
            "key": "animales_endemicos",
            "name": "Animales Endémicos",
            "short_description": "Identificación de animales únicos de México.",
            "example_tasks": [
              "Investiga cinco animales endémicos de México (ajolote, vaquita marina, conejo de los volcanes, perrito llanero mexicano)",
              "Crea una ficha informativa sobre el ajolote incluyendo su hábitat, características y estado de conservación",
              "Explica por qué la vaquita marina está en peligro crítico de extinción"
            ]
          },
          {
            "key": "plantas_endemicas",
            "name": "Plantas Endémicas",
            "short_description": "Conocimiento de plantas únicas de México.",
            "example_tasks": [
              "Investiga plantas endémicas importantes para México (cacao, vainilla, dalia, agave)",
              "Describe cómo el maíz es una planta originaria de México que ahora se cultiva en todo el mundo",
              "Explica la importancia cultural y económica del agave en México"
            ]
          }
        ]
      },
      {
        "key": "amenazas_biodiversidad",
        "name": "Amenazas a la Biodiversidad",
        "short_description": "Identificación de factores que ponen en riesgo la biodiversidad mexicana.",
        "sub_topics": [
          {
            "key": "destruccion_habitat",
            "name": "Destrucción del Hábitat",
            "short_description": "Comprensión de cómo la pérdida de ecosistemas afecta a las especies.",
            "example_tasks": [
              "Investiga cómo la deforestación afecta a los animales que viven en los bosques",
              "Describe tres actividades humanas que destruyen hábitats naturales",
              "Explica qué le pasa a las especies cuando su hábitat es destruido"
            ]
          },
          {
            "key": "sobreexplotacion",
            "name": "Sobreexplotación de Especies",
            "short_description": "Reconocimiento del uso excesivo de recursos naturales.",
            "example_tasks": [
              "Investiga ejemplos de animales que han sido cazados en exceso en México",
              "Describe qué es la pesca excesiva y cómo afecta a las poblaciones de peces",
              "Explica por qué es importante tener leyes que protejan a las especies en peligro"
            ]
          },
          {
            "key": "contaminacion_efectos",
            "name": "Contaminación y sus Efectos",
            "short_description": "Identificación de cómo la contaminación daña los ecosistemas.",
            "example_tasks": [
              "Describe cómo la contaminación del agua afecta a los peces y otros organismos acuáticos",
              "Investiga cómo los plásticos en el océano dañan a las tortugas marinas",
              "Explica qué puedes hacer para reducir la contaminación en tu comunidad"
            ]
          },
          {
            "key": "especies_invasoras",
            "name": "Especies Invasoras",
            "short_description": "Comprensión de cómo especies introducidas afectan ecosistemas locales.",
            "example_tasks": [
              "Investiga qué es una especie invasora y da un ejemplo en México (pez diablo, lirio acuático)",
              "Explica cómo una especie invasora puede competir con las especies nativas",
              "Describe los problemas que causa el lirio acuático en lagos y presas de México"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "plantas_estructura_funcion",
    "name": "Plantas: Estructura y Función",
    "short_description": "Estudio detallado de las partes de las plantas, sus funciones y procesos vitales como fotosíntesis y reproducción.",
    "sub_topics": [
      {
        "key": "partes_planta",
        "name": "Partes de las Plantas",
        "short_description": "Identificación de las estructuras principales de las plantas y sus funciones.",
        "sub_topics": [
          {
            "key": "raiz_funcion",
            "name": "Raíz y sus Funciones",
            "short_description": "Comprensión del papel de la raíz en absorción y anclaje.",
            "example_tasks": [
              "Observa diferentes tipos de raíces (pivotante, fibrosa, aérea) y dibuja sus diferencias",
              "Diseña un experimento para demostrar cómo las raíces absorben agua del suelo",
              "Explica tres funciones importantes de las raíces para la planta"
            ]
          },
          {
            "key": "tallo_transporte",
            "name": "Tallo y Transporte",
            "short_description": "Estudio del tallo como estructura de soporte y transporte.",
            "example_tasks": [
              "Coloca una planta de apio en agua con colorante y observa cómo el agua sube por el tallo",
              "Compara tallos de diferentes plantas (herbáceo, leñoso, trepador) y sus adaptaciones",
              "Explica cómo el tallo transporta agua y nutrientes desde las raíces hasta las hojas"
            ]
          },
          {
            "key": "hojas_fotosintesis",
            "name": "Hojas y Fotosíntesis",
            "short_description": "Reconocimiento de las hojas como órganos de producción de alimento.",
            "example_tasks": [
              "Identifica las partes de una hoja (limbo, nervaduras, pecíolo) en diferentes plantas",
              "Compara hojas de plantas de sol con hojas de plantas de sombra",
              "Explica por qué las hojas son verdes y su relación con la fotosíntesis"
            ]
          },
          {
            "key": "flores_reproduccion",
            "name": "Flores y Reproducción",
            "short_description": "Identificación de las partes de la flor y su función reproductiva.",
            "example_tasks": [
              "Disecciona una flor y identifica sus partes (pétalos, estambres, pistilo, sépalos)",
              "Investiga cómo las flores atraen a los polinizadores mediante colores y olores",
              "Describe el proceso desde la flor hasta la formación del fruto y las semillas"
            ]
          },
          {
            "key": "frutos_semillas",
            "name": "Frutos y Semillas",
            "short_description": "Comprensión del papel de frutos y semillas en la reproducción.",
            "example_tasks": [
              "Colecciona diferentes semillas y clasifícalas según su método de dispersión",
              "Germina semillas de frijol y documenta el proceso día a día",
              "Explica cómo los frutos ayudan a dispersar las semillas a nuevos lugares"
            ]
          }
        ]
      },
      {
        "key": "fotosintesis",
        "name": "Fotosíntesis",
        "short_description": "Comprensión del proceso mediante el cual las plantas producen su propio alimento.",
        "sub_topics": [
          {
            "key": "concepto_fotosintesis",
            "name": "Concepto de Fotosíntesis",
            "short_description": "Entendimiento básico de cómo las plantas fabrican azúcares usando luz solar.",
            "example_tasks": [
              "Explica con tus propias palabras qué es la fotosíntesis y por qué es importante",
              "Identifica qué necesita una planta para realizar fotosíntesis (luz, agua, dióxido de carbono)",
              "Describe qué produce la planta durante la fotosíntesis (azúcar y oxígeno)"
            ]
          },
          {
            "key": "clorofila_pigmentos",
            "name": "Clorofila y Pigmentos",
            "short_description": "Reconocimiento del papel de la clorofila en capturar luz solar.",
            "example_tasks": [
              "Explica por qué la mayoría de las plantas son verdes",
              "Investiga qué pasa con las hojas en otoño cuando pierden clorofila",
              "Diseña un experimento para demostrar que las plantas necesitan luz para producir clorofila"
            ]
          },
          {
            "key": "factores_fotosintesis",
            "name": "Factores que Afectan la Fotosíntesis",
            "short_description": "Identificación de condiciones que influyen en la fotosíntesis.",
            "example_tasks": [
              "Compara el crecimiento de plantas con diferentes cantidades de luz solar",
              "Investiga cómo la cantidad de agua disponible afecta la fotosíntesis",
              "Explica por qué las plantas crecen más rápido en primavera y verano"
            ]
          },
          {
            "key": "importancia_oxigeno",
            "name": "Importancia para Otros Seres Vivos",
            "short_description": "Comprensión de cómo la fotosíntesis beneficia a todo el planeta.",
            "example_tasks": [
              "Explica cómo las plantas producen el oxígeno que respiramos",
              "Investiga por qué los bosques son llamados 'pulmones del planeta'",
              "Describe la relación entre plantas y animales en el intercambio de gases"
            ]
          }
        ]
      },
      {
        "key": "reproduccion_plantas",
        "name": "Reproducción de las Plantas",
        "short_description": "Estudio de los diferentes métodos de reproducción en plantas.",
        "sub_topics": [
          {
            "key": "reproduccion_sexual_plantas",
            "name": "Reproducción Sexual",
            "short_description": "Proceso de reproducción mediante flores, polen y semillas.",
            "example_tasks": [
              "Describe el proceso de polinización usando el ejemplo de una abeja visitando flores",
              "Investiga diferentes agentes de polinización (viento, insectos, aves, murciélagos)",
              "Explica qué es la fecundación en las plantas y cómo se forman las semillas"
            ]
          },
          {
            "key": "reproduccion_asexual_plantas",
            "name": "Reproducción Asexual",
            "short_description": "Métodos de reproducción sin semillas.",
            "example_tasks": [
              "Reproduce una planta usando un esqueje o una hoja (suculenta, geranio)",
              "Investiga cómo se reproducen las fresas mediante estolones",
              "Compara las ventajas y desventajas de la reproducción sexual y asexual en plantas"
            ]
          },
          {
            "key": "germinacion",
            "name": "Germinación de Semillas",
            "short_description": "Proceso mediante el cual una semilla se convierte en una nueva planta.",
            "example_tasks": [
              "Germina semillas de frijol y registra cada etapa del proceso",
              "Investiga qué condiciones necesita una semilla para germinar (agua, temperatura, oxígeno)",
              "Compara la germinación de diferentes semillas (rápidas vs lentas)"
            ]
          },
          {
            "key": "dispersion_semillas",
            "name": "Dispersión de Semillas",
            "short_description": "Mecanismos que usan las plantas para esparcir sus semillas.",
            "example_tasks": [
              "Colecciona semillas y clasifícalas según su método de dispersión (viento, agua, animales)",
              "Explica cómo las estructuras de las semillas ayudan en su dispersión (alas, ganchos, frutos carnosos)",
              "Investiga por qué es importante para las plantas dispersar sus semillas lejos de la planta madre"
            ]
          }
        ]
      },
      {
        "key": "tipos_plantas",
        "name": "Tipos de Plantas",
        "short_description": "Clasificación de plantas según diferentes características.",
        "sub_topics": [
          {
            "key": "plantas_con_sin_flores",
            "name": "Plantas con Flores y sin Flores",
            "short_description": "Diferenciación entre angiospermas y plantas no florecientes.",
            "example_tasks": [
              "Clasifica 10 plantas de tu entorno en plantas con flores y sin flores",
              "Investiga ejemplos de plantas sin flores (helechos, musgos, coníferas)",
              "Compara cómo se reproducen las plantas con flores versus los helechos"
            ]
          },
          {
            "key": "plantas_vasculares_no_vasculares",
            "name": "Plantas Vasculares y No Vasculares",
            "short_description": "Diferencia entre plantas con y sin sistema de transporte.",
            "example_tasks": [
              "Explica qué es el sistema vascular en las plantas y para qué sirve",
              "Observa musgo (planta no vascular) y compáralo con una planta con flores",
              "Investiga por qué las plantas no vasculares son generalmente pequeñas"
            ]
          },
          {
            "key": "arboles_arbustos_hierbas",
            "name": "Árboles, Arbustos y Hierbas",
            "short_description": "Clasificación según el tamaño y tipo de tallo.",
            "example_tasks": [
              "Identifica 3 árboles, 3 arbustos y 3 hierbas en tu comunidad",
              "Compara las características del tallo de un árbol, un arbusto y una hierba",
              "Explica las diferencias entre plantas leñosas y herbáceas"
            ]
          },
          {
            "key": "plantas_anuales_perennes",
            "name": "Plantas Anuales y Perennes",
            "short_description": "Diferenciación según su ciclo de vida.",
            "example_tasks": [
              "Investiga qué significa que una planta sea anual, bienal o perenne",
              "Da ejemplos de plantas anuales comunes en la agricultura (maíz, frijol, calabaza)",
              "Explica por qué algunos árboles viven cientos de años"
            ]
          }
        ]
      },
      {
        "key": "adaptaciones_plantas",
        "name": "Adaptaciones de las Plantas",
        "short_description": "Características especiales que permiten a las plantas sobrevivir en diferentes ambientes.",
        "sub_topics": [
          {
            "key": "plantas_desierto",
            "name": "Plantas del Desierto",
            "short_description": "Adaptaciones para sobrevivir con poca agua.",
            "example_tasks": [
              "Describe tres adaptaciones de los cactus para conservar agua",
              "Investiga cómo las espinas protegen a las plantas del desierto",
              "Explica qué son las plantas suculentas y cómo almacenan agua"
            ]
          },
          {
            "key": "plantas_acuaticas",
            "name": "Plantas Acuáticas",
            "short_description": "Adaptaciones para vivir en agua o ambientes muy húmedos.",
            "example_tasks": [
              "Observa plantas acuáticas como lirios o elodea y describe sus adaptaciones",
              "Investiga cómo las plantas acuáticas flotantes obtienen oxígeno",
              "Compara las raíces de una planta terrestre con las de una planta acuática"
            ]
          },
          {
            "key": "plantas_trepadoras",
            "name": "Plantas Trepadoras y Epífitas",
            "short_description": "Estrategias para alcanzar la luz en bosques densos.",
            "example_tasks": [
              "Observa plantas trepadoras y describe cómo se sujetan a otras estructuras",
              "Investiga qué son las plantas epífitas (orquídeas, bromelias) y cómo viven sobre los árboles",
              "Explica por qué las plantas trepadoras necesitan crecer sobre otras plantas"
            ]
          },
          {
            "key": "plantas_carnivoras",
            "name": "Plantas Carnívoras",
            "short_description": "Plantas que obtienen nutrientes capturando insectos.",
            "example_tasks": [
              "Investiga cómo funciona una planta carnívora como la venus atrapamoscas",
              "Explica por qué algunas plantas necesitan capturar insectos para obtener nutrientes",
              "Describe diferentes mecanismos de captura en plantas carnívoras"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "animales_diversidad_adaptacion",
    "name": "Animales: Diversidad y Adaptación",
    "short_description": "Exploración de la gran diversidad del reino animal, sus características, clasificación, ciclos de vida y adaptaciones a diferentes ambientes.",
    "sub_topics": [
      {
        "key": "grupos_animales_vertebrados",
        "name": "Grupos de Animales Vertebrados",
        "short_description": "Estudio detallado de los cinco grupos de vertebrados.",
        "sub_topics": [
          {
            "key": "peces_caracteristicas",
            "name": "Peces",
            "short_description": "Características, hábitat y adaptaciones de los peces.",
            "example_tasks": [
              "Identifica las características principales de los peces (aletas, escamas, branquias, sangre fría)",
              "Compara un pez de agua dulce con uno de agua salada",
              "Explica cómo las branquias permiten a los peces respirar bajo el agua"
            ]
          },
          {
            "key": "anfibios_caracteristicas",
            "name": "Anfibios",
            "short_description": "Animales que viven en agua y tierra durante su vida.",
            "example_tasks": [
              "Describe el ciclo de vida de una rana desde el huevo hasta el adulto",
              "Investiga anfibios mexicanos importantes como el ajolote y la salamandra",
              "Explica por qué los anfibios necesitan vivir cerca del agua"
            ]
          },
          {
            "key": "reptiles_caracteristicas",
            "name": "Reptiles",
            "short_description": "Características de serpientes, lagartijas, tortugas y cocodrilos.",
            "example_tasks": [
              "Identifica las características comunes de los reptiles (escamas, piel seca, huevos con cáscara)",
              "Compara una tortuga, una serpiente y un cocodrilo señalando similitudes y diferencias",
              "Investiga reptiles venenosos de México y sus adaptaciones para cazar"
            ]
          },
          {
            "key": "aves_caracteristicas",
            "name": "Aves",
            "short_description": "Características únicas de las aves y su diversidad.",
            "example_tasks": [
              "Describe las adaptaciones de las aves para volar (plumas, huesos huecos, alas)",
              "Investiga aves que no vuelan como el pingüino y el avestruz",
              "Compara diferentes tipos de picos de aves según su alimentación"
            ]
          },
          {
            "key": "mamiferos_caracteristicas",
            "name": "Mamíferos",
            "short_description": "Características de los mamíferos incluyendo al ser humano.",
            "example_tasks": [
              "Lista las características que comparten todos los mamíferos (pelo, glándulas mamarias, sangre caliente)",
              "Compara mamíferos de diferentes hábitats (ballena, murciélago, jaguar, delfín)",
              "Investiga mamíferos únicos de México como el ocelote y el tlacuache"
            ]
          }
        ]
      },
      {
        "key": "grupos_invertebrados",
        "name": "Grupos de Animales Invertebrados",
        "short_description": "Exploración de la diversidad de animales sin columna vertebral.",
        "sub_topics": [
          {
            "key": "insectos",
            "name": "Insectos",
            "short_description": "El grupo de animales más numeroso del planeta.",
            "example_tasks": [
              "Identifica las partes del cuerpo de un insecto (cabeza, tórax, abdomen, 6 patas, antenas)",
              "Investiga la metamorfosis completa de una mariposa",
              "Observa insectos en tu jardín y clasifícalos por sus características"
            ]
          },
          {
            "key": "aracnidos",
            "name": "Arácnidos",
            "short_description": "Arañas, escorpiones, ácaros y garrapatas.",
            "example_tasks": [
              "Compara un insecto con un arácnido identificando las diferencias (número de patas, segmentos)",
              "Investiga cómo las arañas producen seda y construyen telarañas",
              "Describe el papel de los arácnidos en controlar poblaciones de insectos"
            ]
          },
          {
            "key": "moluscos",
            "name": "Moluscos",
            "short_description": "Caracoles, almejas, pulpos y calamares.",
            "example_tasks": [
              "Observa caracoles terrestres y acuáticos comparando sus adaptaciones",
              "Investiga cómo los moluscos producen conchas y para qué les sirven",
              "Describe las adaptaciones del pulpo (tentáculos, cambio de color, tinta)"
            ]
          },
          {
            "key": "otros_invertebrados",
            "name": "Otros Invertebrados",
            "short_description": "Gusanos, medusas, estrellas de mar y esponjas.",
            "example_tasks": [
              "Investiga las características de diferentes grupos (anélidos, cnidarios, equinodermos)",
              "Describe cómo se mueven las estrellas de mar y cómo se alimentan",
              "Explica el papel de las lombrices en el suelo y la descomposición"
            ]
          }
        ]
      },
      {
        "key": "ciclos_vida_animales",
        "name": "Ciclos de Vida de los Animales",
        "short_description": "Estudio de las etapas de desarrollo desde el nacimiento hasta la edad adulta.",
        "sub_topics": [
          {
            "key": "metamorfosis_completa",
            "name": "Metamorfosis Completa",
            "short_description": "Transformación con etapas muy diferentes (huevo, larva, pupa, adulto).",
            "example_tasks": [
              "Describe el ciclo de vida de una mariposa monarca",
              "Compara la metamorfosis de una mariposa con la de un escarabajo",
              "Explica por qué la oruga se ve tan diferente de la mariposa adulta"
            ]
          },
          {
            "key": "metamorfosis_incompleta",
            "name": "Metamorfosis Incompleta",
            "short_description": "Desarrollo gradual sin etapa de pupa.",
            "example_tasks": [
              "Describe el ciclo de vida de un saltamontes o una libélula",
              "Compara la metamorfosis incompleta con la metamorfosis completa",
              "Investiga otros insectos que tienen metamorfosis incompleta"
            ]
          },
          {
            "key": "desarrollo_directo",
            "name": "Desarrollo Directo",
            "short_description": "Animales que nacen parecidos a los adultos.",
            "example_tasks": [
              "Describe el desarrollo de un mamífero desde el nacimiento hasta la edad adulta",
              "Compara el desarrollo de un pollito con el de un cachorro",
              "Explica las etapas de crecimiento en el ser humano"
            ]
          },
          {
            "key": "cuidado_crias",
            "name": "Cuidado Parental",
            "short_description": "Diferentes estrategias de cuidado de las crías.",
            "example_tasks": [
              "Compara animales que cuidan mucho a sus crías (mamíferos, aves) con los que no lo hacen (tortugas, peces)",
              "Investiga cómo diferentes especies protegen a sus crías",
              "Describe el periodo de cuidado parental en diferentes animales"
            ]
          }
        ]
      },
      {
        "key": "adaptaciones_animales",
        "name": "Adaptaciones de los Animales",
        "short_description": "Características especiales que ayudan a los animales a sobrevivir.",
        "sub_topics": [
          {
            "key": "adaptaciones_alimentacion",
            "name": "Adaptaciones para la Alimentación",
            "short_description": "Estructuras especializadas según el tipo de alimento.",
            "example_tasks": [
              "Compara los dientes de un carnívoro (jaguar) con los de un herbívoro (venado)",
              "Investiga cómo los picos de las aves están adaptados a su dieta",
              "Describe las adaptaciones de los animales que se alimentan de néctar (colibrí, mariposa, murciélago)"
            ]
          },
          {
            "key": "adaptaciones_locomocion",
            "name": "Adaptaciones para la Locomoción",
            "short_description": "Estructuras para moverse en diferentes ambientes.",
            "example_tasks": [
              "Compara las extremidades de animales que nadan, vuelan, corren y trepan",
              "Investiga cómo las aletas de diferentes peces están adaptadas a su forma de nadar",
              "Describe las adaptaciones de los animales que viven en los árboles"
            ]
          },
          {
            "key": "adaptaciones_proteccion",
            "name": "Adaptaciones para la Protección",
            "short_description": "Mecanismos de defensa contra depredadores.",
            "example_tasks": [
              "Investiga diferentes tipos de protección (conchas, espinas, veneno, armadura)",
              "Describe cómo el zorrillo usa su olor como defensa",
              "Explica qué es el mimetismo y da ejemplos de animales que lo usan"
            ]
          },
          {
            "key": "adaptaciones_climaticas",
            "name": "Adaptaciones Climáticas",
            "short_description": "Adaptaciones para vivir en diferentes climas.",
            "example_tasks": [
              "Compara adaptaciones de animales de clima frío (pelo grueso, grasa) con los de clima caliente (orejas grandes)",
              "Investiga cómo los animales del desierto conservan agua",
              "Describe estrategias para sobrevivir el invierno (hibernación, migración)"
            ]
          }
        ]
      },
      {
        "key": "comportamiento_animal",
        "name": "Comportamiento Animal",
        "short_description": "Estudio de los comportamientos instintivos y aprendidos.",
        "sub_topics": [
          {
            "key": "comportamientos_instintivos",
            "name": "Comportamientos Instintivos",
            "short_description": "Comportamientos heredados que no necesitan ser aprendidos.",
            "example_tasks": [
              "Describe comportamientos instintivos como la construcción de nidos en las aves",
              "Investiga cómo las tortugas marinas recién nacidas encuentran el mar",
              "Explica qué es un reflejo usando ejemplos"
            ]
          },
          {
            "key": "comportamientos_aprendidos",
            "name": "Comportamientos Aprendidos",
            "short_description": "Comportamientos adquiridos a través de la experiencia.",
            "example_tasks": [
              "Describe cómo los mamíferos aprenden de sus madres (cazar, buscar alimento)",
              "Investiga ejemplos de animales que usan herramientas",
              "Explica la diferencia entre comportamiento instintivo y aprendido"
            ]
          },
          {
            "key": "comunicacion_animal",
            "name": "Comunicación Animal",
            "short_description": "Formas en que los animales se comunican entre sí.",
            "example_tasks": [
              "Investiga diferentes formas de comunicación (sonidos, olores, gestos, colores)",
              "Describe cómo las abejas comunican la ubicación de las flores mediante su danza",
              "Explica cómo los perros se comunican mediante lenguaje corporal"
            ]
          },
          {
            "key": "comportamiento_social",
            "name": "Comportamiento Social",
            "short_description": "Animales que viven en grupos y su organización.",
            "example_tasks": [
              "Describe la organización social de las hormigas o abejas",
              "Investiga las ventajas de vivir en manada (protección, caza cooperativa)",
              "Compara animales solitarios con animales sociales"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "aparato_digestivo_nutricion",
    "name": "Aparato Digestivo y Nutrición",
    "short_description": "Estudio de los órganos y procesos involucrados en la digestión de alimentos y la importancia de una alimentación balanceada para la salud.",
    "sub_topics": [
      {
        "key": "organos_digestivos",
        "name": "Órganos del Aparato Digestivo",
        "short_description": "Identificación de las partes del sistema digestivo y sus funciones.",
        "sub_topics": [
          {
            "key": "boca_dientes",
            "name": "Boca y Dientes",
            "short_description": "Inicio de la digestión mediante masticación y saliva.",
            "example_tasks": [
              "Identifica los diferentes tipos de dientes (incisivos, caninos, molares) y explica la función de cada uno",
              "Describe el proceso de masticación y por qué es importante masticar bien los alimentos",
              "Explica el papel de la saliva en comenzar la digestión de los alimentos"
            ]
          },
          {
            "key": "esofago_estomago",
            "name": "Esófago y Estómago",
            "short_description": "Transporte del alimento y digestión química.",
            "example_tasks": [
              "Describe el recorrido del alimento desde la boca hasta el estómago",
              "Explica cómo el estómago mezcla y descompone los alimentos usando jugos gástricos",
              "Investiga por qué es importante comer despacio y masticar bien antes de tragar"
            ]
          },
          {
            "key": "intestinos",
            "name": "Intestino Delgado e Intestino Grueso",
            "short_description": "Absorción de nutrientes y formación de desechos.",
            "example_tasks": [
              "Describe cómo el intestino delgado absorbe los nutrientes de los alimentos",
              "Explica la función del intestino grueso en absorber agua y formar las heces",
              "Calcula aproximadamente cuántos metros mide todo el sistema digestivo humano"
            ]
          },
          {
            "key": "organos_accesorios",
            "name": "Órganos Accesorios",
            "short_description": "Hígado, páncreas y vesícula biliar en la digestión.",
            "example_tasks": [
              "Investiga cómo el hígado produce bilis que ayuda a digerir las grasas",
              "Describe el papel del páncreas en producir enzimas digestivas",
              "Explica por qué estos órganos son importantes aunque el alimento no pase por ellos"
            ]
          }
        ]
      },
      {
        "key": "proceso_digestivo",
        "name": "Proceso de Digestión",
        "short_description": "Comprensión de cómo los alimentos se transforman en nutrientes.",
        "sub_topics": [
          {
            "key": "digestion_mecanica",
            "name": "Digestión Mecánica",
            "short_description": "Descomposición física de los alimentos.",
            "example_tasks": [
              "Describe cómo los dientes trituran los alimentos en pedazos más pequeños",
              "Explica cómo el estómago mezcla el alimento mediante movimientos musculares",
              "Diseña un modelo simple que demuestre la digestión mecánica usando una bolsa y agua"
            ]
          },
          {
            "key": "digestion_quimica",
            "name": "Digestión Química",
            "short_description": "Descomposición de nutrientes mediante enzimas.",
            "example_tasks": [
              "Explica qué son las enzimas y cómo ayudan a descomponer los alimentos",
              "Investiga cómo diferentes enzimas descomponen proteínas, carbohidratos y grasas",
              "Describe el papel de los jugos digestivos en el estómago e intestinos"
            ]
          },
          {
            "key": "absorcion_nutrientes",
            "name": "Absorción de Nutrientes",
            "short_description": "Paso de nutrientes del intestino a la sangre.",
            "example_tasks": [
              "Describe cómo los nutrientes pasan del intestino delgado a la sangre",
              "Investiga qué son las vellosidades intestinales y por qué aumentan la absorción",
              "Explica qué pasa con los nutrientes después de ser absorbidos"
            ]
          },
          {
            "key": "eliminacion_desechos",
            "name": "Eliminación de Desechos",
            "short_description": "Expulsión de materiales no digeridos.",
            "example_tasks": [
              "Describe el proceso de formación y eliminación de las heces",
              "Explica por qué la fibra es importante para la salud digestiva",
              "Investiga qué problemas puede causar el estreñimiento y cómo prevenirlo"
            ]
          }
        ]
      },
      {
        "key": "grupos_alimentos",
        "name": "Grupos de Alimentos",
        "short_description": "Clasificación de alimentos según sus nutrientes principales.",
        "sub_topics": [
          {
            "key": "frutas_verduras",
            "name": "Frutas y Verduras",
            "short_description": "Fuentes de vitaminas, minerales y fibra.",
            "example_tasks": [
              "Crea un cartel mostrando 10 frutas y 10 verduras comunes en México",
              "Explica por qué se recomienda comer 5 porciones de frutas y verduras al día",
              "Investiga qué vitaminas y minerales aportan diferentes frutas y verduras"
            ]
          },
          {
            "key": "cereales_tuberculos",
            "name": "Cereales y Tubérculos",
            "short_description": "Fuentes principales de energía (carbohidratos).",
            "example_tasks": [
              "Identifica cereales importantes en la dieta mexicana (maíz, trigo, arroz, avena)",
              "Explica por qué los carbohidratos son importantes como fuente de energía",
              "Compara cereales integrales con cereales refinados"
            ]
          },
          {
            "key": "leguminosas_alimentos_origen_animal",
            "name": "Leguminosas y Alimentos de Origen Animal",
            "short_description": "Fuentes de proteínas para crecimiento y reparación.",
            "example_tasks": [
              "Lista leguminosas comunes en México (frijol, lenteja, garbanzo, haba)",
              "Explica la importancia de las proteínas para el crecimiento y desarrollo",
              "Compara fuentes de proteína vegetal (frijol) con proteína animal (pollo, pescado)"
            ]
          },
          {
            "key": "grasas_azucares",
            "name": "Grasas y Azúcares",
            "short_description": "Nutrientes energéticos que deben consumirse con moderación.",
            "example_tasks": [
              "Diferencia entre grasas saludables (aguacate, nueces) y grasas menos saludables",
              "Explica por qué es importante limitar el consumo de azúcar y alimentos procesados",
              "Investiga los efectos del consumo excesivo de azúcar en la salud"
            ]
          }
        ]
      },
      {
        "key": "nutricion_saludable",
        "name": "Nutrición Saludable",
        "short_description": "Principios de alimentación balanceada y hábitos saludables.",
        "sub_topics": [
          {
            "key": "plato_buen_comer",
            "name": "El Plato del Bien Comer",
            "short_description": "Guía mexicana para una alimentación correcta.",
            "example_tasks": [
              "Dibuja el Plato del Bien Comer e identifica los tres grupos de alimentos",
              "Planea un menú de un día usando alimentos de los tres grupos",
              "Explica por qué es importante combinar alimentos de diferentes grupos"
            ]
          },
          {
            "key": "jarra_buen_beber",
            "name": "La Jarra del Buen Beber",
            "short_description": "Guía para una hidratación saludable.",
            "example_tasks": [
              "Identifica los diferentes niveles de la Jarra del Buen Beber",
              "Explica por qué el agua es la mejor opción de bebida",
              "Calcula cuántos vasos de agua debes tomar diariamente"
            ]
          },
          {
            "key": "porciones_adecuadas",
            "name": "Porciones Adecuadas",
            "short_description": "Importancia de comer cantidades apropiadas.",
            "example_tasks": [
              "Compara el tamaño de porciones saludables con porciones excesivas",
              "Explica por qué comer en exceso puede causar problemas de salud",
              "Practica servir porciones adecuadas de diferentes alimentos"
            ]
          },
          {
            "key": "habitos_alimenticios",
            "name": "Hábitos Alimenticios Saludables",
            "short_description": "Prácticas que promueven buena nutrición.",
            "example_tasks": [
              "Lista cinco hábitos alimenticios saludables (comer despacio, horarios regulares, desayunar)",
              "Explica por qué es importante desayunar antes de ir a la escuela",
              "Diseña un plan de refrigerios saludables para la semana escolar"
            ]
          }
        ]
      },
      {
        "key": "problemas_nutricionales",
        "name": "Problemas Nutricionales",
        "short_description": "Identificación de problemas relacionados con la alimentación.",
        "sub_topics": [
          {
            "key": "desnutricion",
            "name": "Desnutrición",
            "short_description": "Problemas causados por alimentación insuficiente.",
            "example_tasks": [
              "Explica qué es la desnutrición y qué la causa",
              "Investiga las consecuencias de la desnutrición en el crecimiento y desarrollo",
              "Describe cómo una alimentación balanceada previene la desnutrición"
            ]
          },
          {
            "key": "sobrepeso_obesidad",
            "name": "Sobrepeso y Obesidad",
            "short_description": "Problemas causados por exceso de peso.",
            "example_tasks": [
              "Explica la diferencia entre sobrepeso y obesidad",
              "Investiga las causas del sobrepeso (alimentación excesiva, falta de ejercicio)",
              "Describe problemas de salud relacionados con la obesidad (diabetes, problemas cardíacos)"
            ]
          },
          {
            "key": "deficiencias_nutricionales",
            "name": "Deficiencias Nutricionales",
            "short_description": "Problemas por falta de vitaminas y minerales.",
            "example_tasks": [
              "Investiga la importancia del hierro y los problemas que causa su deficiencia (anemia)",
              "Explica por qué es importante consumir alimentos con vitamina C",
              "Describe la importancia del calcio para huesos y dientes"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "aparato_respiratorio_circulatorio",
    "name": "Aparato Respiratorio y Circulatorio",
    "short_description": "Estudio de los sistemas que llevan oxígeno a todas las células del cuerpo y eliminan dióxido de carbono.",
    "sub_topics": [
      {
        "key": "sistema_respiratorio",
        "name": "Sistema Respiratorio",
        "short_description": "Órganos involucrados en la respiración y el intercambio de gases.",
        "sub_topics": [
          {
            "key": "vias_respiratorias",
            "name": "Vías Respiratorias",
            "short_description": "Recorrido del aire desde la nariz hasta los pulmones.",
            "example_tasks": [
              "Identifica las partes del sistema respiratorio (nariz, faringe, laringe, tráquea, bronquios, pulmones)",
              "Describe el recorrido del aire cuando inhalas y exhalas",
              "Explica cómo la nariz filtra, calienta y humedece el aire que respiramos"
            ]
          },
          {
            "key": "pulmones_alveolos",
            "name": "Pulmones y Alvéolos",
            "short_description": "Estructura donde ocurre el intercambio de gases.",
            "example_tasks": [
              "Describe la estructura de los pulmones y su ubicación en el tórax",
              "Explica qué son los alvéolos y cómo permiten el intercambio de oxígeno y dióxido de carbono",
              "Investiga por qué los pulmones tienen tantos alvéolos pequeños"
            ]
          },
          {
            "key": "proceso_respiracion",
            "name": "Proceso de Respiración",
            "short_description": "Mecánica de la inhalación y exhalación.",
            "example_tasks": [
              "Describe cómo el diafragma ayuda en la respiración",
              "Mide tu frecuencia respiratoria en reposo y después de hacer ejercicio",
              "Explica qué pasa con tus pulmones cuando inhalas y cuando exhalas"
            ]
          },
          {
            "key": "intercambio_gaseoso",
            "name": "Intercambio Gaseoso",
            "short_description": "Entrada de oxígeno y salida de dióxido de carbono.",
            "example_tasks": [
              "Explica cómo el oxígeno pasa de los pulmones a la sangre",
              "Describe por qué exhalamos dióxido de carbono",
              "Investiga por qué necesitamos oxígeno para obtener energía de los alimentos"
            ]
          }
        ]
      },
      {
        "key": "sistema_circulatorio",
        "name": "Sistema Circulatorio",
        "short_description": "El corazón y los vasos sanguíneos que transportan sangre por todo el cuerpo.",
        "sub_topics": [
          {
            "key": "corazon_estructura",
            "name": "El Corazón y su Estructura",
            "short_description": "Órgano muscular que bombea la sangre.",
            "example_tasks": [
              "Identifica las cuatro cavidades del corazón (aurículas y ventrículos)",
              "Describe cómo funciona el corazón como una bomba muscular",
              "Localiza tu pulso y cuenta tus latidos por minuto en reposo"
            ]
          },
          {
            "key": "vasos_sanguineos",
            "name": "Vasos Sanguíneos",
            "short_description": "Arterias, venas y capilares.",
            "example_tasks": [
              "Explica la diferencia entre arterias (llevan sangre del corazón) y venas (llevan sangre al corazón)",
              "Describe qué son los capilares y por qué son tan pequeños",
              "Investiga por qué las arterias tienen paredes más gruesas que las venas"
            ]
          },
          {
            "key": "circulacion_sangre",
            "name": "Circulación de la Sangre",
            "short_description": "Recorrido de la sangre por el cuerpo.",
            "example_tasks": [
              "Describe el recorrido de la sangre desde el corazón a los pulmones y de regreso (circulación pulmonar)",
              "Explica cómo la sangre lleva oxígeno y nutrientes a todas las células del cuerpo",
              "Dibuja un diagrama simple mostrando cómo circula la sangre"
            ]
          },
          {
            "key": "frecuencia_cardiaca",
            "name": "Frecuencia Cardíaca",
            "short_description": "Número de latidos del corazón por minuto.",
            "example_tasks": [
              "Mide tu frecuencia cardíaca en diferentes situaciones (sentado, de pie, después de ejercicio)",
              "Explica por qué el corazón late más rápido cuando haces ejercicio",
              "Compara la frecuencia cardíaca en reposo con la frecuencia después de correr"
            ]
          }
        ]
      },
      {
        "key": "sangre_componentes",
        "name": "La Sangre y sus Componentes",
        "short_description": "Composición y funciones de la sangre.",
        "sub_topics": [
          {
            "key": "plasma_sanguineo",
            "name": "Plasma Sanguíneo",
            "short_description": "Parte líquida de la sangre.",
            "example_tasks": [
              "Describe qué es el plasma y qué transporta",
              "Explica qué porcentaje de la sangre es plasma",
              "Investiga qué nutrientes y desechos viajan disueltos en el plasma"
            ]
          },
          {
            "key": "globulos_rojos",
            "name": "Glóbulos Rojos",
            "short_description": "Células que transportan oxígeno.",
            "example_tasks": [
              "Explica la función principal de los glóbulos rojos (transportar oxígeno)",
              "Investiga qué es la hemoglobina y por qué hace que la sangre sea roja",
              "Describe qué pasa cuando hay pocos glóbulos rojos (anemia)"
            ]
          },
          {
            "key": "globulos_blancos",
            "name": "Glóbulos Blancos",
            "short_description": "Células que defienden el cuerpo de infecciones.",
            "example_tasks": [
              "Describe cómo los glóbulos blancos protegen al cuerpo de enfermedades",
              "Explica qué pasa cuando tienes una infección y aumentan los glóbulos blancos",
              "Investiga diferentes tipos de glóbulos blancos y sus funciones"
            ]
          },
          {
            "key": "plaquetas",
            "name": "Plaquetas",
            "short_description": "Fragmentos celulares que ayudan a coagular la sangre.",
            "example_tasks": [
              "Explica cómo las plaquetas detienen el sangrado cuando te cortas",
              "Describe el proceso de coagulación de la sangre",
              "Investiga qué pasaría si no tuvieras plaquetas"
            ]
          }
        ]
      },
      {
        "key": "relacion_respiratorio_circulatorio",
        "name": "Relación entre Sistemas Respiratorio y Circulatorio",
        "short_description": "Cómo trabajan juntos para llevar oxígeno a las células.",
        "sub_topics": [
          {
            "key": "transporte_oxigeno",
            "name": "Transporte de Oxígeno",
            "short_description": "Del aire a las células del cuerpo.",
            "example_tasks": [
              "Describe el viaje del oxígeno desde que lo inhalas hasta que llega a una célula muscular",
              "Explica cómo los glóbulos rojos recogen oxígeno en los pulmones",
              "Investiga por qué las células necesitan oxígeno constantemente"
            ]
          },
          {
            "key": "eliminacion_co2",
            "name": "Eliminación de Dióxido de Carbono",
            "short_description": "De las células a los pulmones.",
            "example_tasks": [
              "Describe cómo se elimina el dióxido de carbono producido por las células",
              "Explica el recorrido del CO2 desde una célula hasta que lo exhalas",
              "Investiga por qué es importante eliminar el dióxido de carbono del cuerpo"
            ]
          },
          {
            "key": "ejercicio_sistemas",
            "name": "Efecto del Ejercicio",
            "short_description": "Cambios durante la actividad física.",
            "example_tasks": [
              "Observa cómo cambian tu respiración y frecuencia cardíaca durante el ejercicio",
              "Explica por qué respiras más rápido y tu corazón late más rápido al hacer ejercicio",
              "Investiga cómo el ejercicio regular fortalece el corazón y los pulmones"
            ]
          }
        ]
      },
      {
        "key": "cuidado_sistemas_respiratorio_circulatorio",
        "name": "Cuidado de los Sistemas Respiratorio y Circulatorio",
        "short_description": "Hábitos saludables para mantener estos sistemas funcionando bien.",
        "sub_topics": [
          {
            "key": "ejercicio_regular",
            "name": "Ejercicio Regular",
            "short_description": "Importancia de la actividad física.",
            "example_tasks": [
              "Lista cinco actividades físicas que fortalecen el corazón y los pulmones",
              "Explica por qué se recomienda hacer ejercicio al menos 60 minutos al día",
              "Diseña un plan de actividades físicas para una semana"
            ]
          },
          {
            "key": "evitar_tabaco",
            "name": "Evitar el Tabaco",
            "short_description": "Efectos dañinos del humo del cigarro.",
            "example_tasks": [
              "Investiga cómo el humo del tabaco daña los pulmones",
              "Explica qué es el tabaquismo pasivo y por qué es peligroso",
              "Describe enfermedades causadas por fumar (cáncer de pulmón, enfisema)"
            ]
          },
          {
            "key": "aire_limpio",
            "name": "Respirar Aire Limpio",
            "short_description": "Importancia de evitar la contaminación del aire.",
            "example_tasks": [
              "Describe cómo la contaminación del aire afecta la salud respiratoria",
              "Investiga qué puedes hacer para reducir la contaminación del aire",
              "Explica por qué es importante ventilar bien los espacios cerrados"
            ]
          },
          {
            "key": "alimentacion_saludable_corazon",
            "name": "Alimentación Saludable para el Corazón",
            "short_description": "Dieta que protege el sistema circulatorio.",
            "example_tasks": [
              "Identifica alimentos que son buenos para el corazón (frutas, verduras, pescado)",
              "Explica por qué es importante limitar la sal y las grasas saturadas",
              "Investiga cómo la obesidad afecta el funcionamiento del corazón"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "aparato_locomotor",
    "name": "Aparato Locomotor",
    "short_description": "Estudio del sistema de huesos, músculos y articulaciones que permite el movimiento y sostén del cuerpo.",
    "sub_topics": [
      {
        "key": "sistema_oseo",
        "name": "Sistema Óseo (Esqueleto)",
        "short_description": "Los huesos que forman la estructura del cuerpo.",
        "sub_topics": [
          {
            "key": "funciones_esqueleto",
            "name": "Funciones del Esqueleto",
            "short_description": "Soporte, protección, movimiento y producción de células sanguíneas.",
            "example_tasks": [
              "Lista las cuatro funciones principales del esqueleto",
              "Explica cómo los huesos protegen órganos importantes (cráneo, costillas)",
              "Investiga cómo los huesos trabajan con los músculos para producir movimiento"
            ]
          },
          {
            "key": "partes_esqueleto",
            "name": "Partes del Esqueleto",
            "short_description": "Huesos principales del cuerpo humano.",
            "example_tasks": [
              "Identifica los huesos principales: cráneo, columna vertebral, costillas, fémur, húmero",
              "Cuenta cuántos huesos tienes aproximadamente en tu cuerpo (206 en adultos)",
              "Dibuja un esqueleto básico señalando al menos 10 huesos importantes"
            ]
          },
          {
            "key": "tipos_huesos",
            "name": "Tipos de Huesos",
            "short_description": "Clasificación según su forma.",
            "example_tasks": [
              "Identifica huesos largos (fémur), cortos (carpo), planos (cráneo) e irregulares (vértebras)",
              "Explica por qué los huesos tienen diferentes formas según su función",
              "Compara el hueso más largo (fémur) con el más pequeño (estribo en el oído)"
            ]
          },
          {
            "key": "estructura_hueso",
            "name": "Estructura del Hueso",
            "short_description": "Composición interna y externa de los huesos.",
            "example_tasks": [
              "Describe las capas de un hueso (periostio, hueso compacto, hueso esponjoso, médula)",
              "Explica qué hace que los huesos sean duros y resistentes (calcio y fósforo)",
              "Investiga qué es la médula ósea y qué produce"
            ]
          }
        ]
      },
      {
        "key": "articulaciones",
        "name": "Articulaciones",
        "short_description": "Uniones entre huesos que permiten el movimiento.",
        "sub_topics": [
          {
            "key": "tipos_articulaciones",
            "name": "Tipos de Articulaciones",
            "short_description": "Móviles, semimóviles e inmóviles.",
            "example_tasks": [
              "Identifica articulaciones móviles (rodilla, codo, hombro)",
              "Describe articulaciones inmóviles como las del cráneo",
              "Compara la movilidad de diferentes articulaciones en tu cuerpo"
            ]
          },
          {
            "key": "movimientos_articulaciones",
            "name": "Movimientos de las Articulaciones",
            "short_description": "Diferentes tipos de movimiento que permiten.",
            "example_tasks": [
              "Demuestra movimientos de bisagra (codo), rotación (cuello) y pivote (hombro)",
              "Explica cómo las articulaciones permiten que hagas diferentes movimientos",
              "Investiga qué son los ligamentos y cómo mantienen unidos los huesos"
            ]
          },
          {
            "key": "cuidado_articulaciones",
            "name": "Cuidado de las Articulaciones",
            "short_description": "Prevención de lesiones articulares.",
            "example_tasks": [
              "Describe la importancia de calentar antes de hacer ejercicio",
              "Explica qué es un esguince y cómo ocurre",
              "Investiga cómo el ejercicio moderado mantiene las articulaciones saludables"
            ]
          }
        ]
      },
      {
        "key": "sistema_muscular",
        "name": "Sistema Muscular",
        "short_description": "Los músculos que permiten el movimiento del cuerpo.",
        "sub_topics": [
          {
            "key": "tipos_musculos",
            "name": "Tipos de Músculos",
            "short_description": "Esqueléticos, lisos y cardíaco.",
            "example_tasks": [
              "Diferencia entre músculos voluntarios (esqueléticos) e involuntarios (lisos, cardíaco)",
              "Identifica músculos esqueléticos que puedes controlar (bíceps, cuádriceps)",
              "Explica por qué el corazón es un músculo especial que nunca se cansa"
            ]
          },
          {
            "key": "musculos_principales",
            "name": "Músculos Principales",
            "short_description": "Grupos musculares importantes del cuerpo.",
            "example_tasks": [
              "Identifica músculos importantes: bíceps, tríceps, cuádriceps, abdominales, gemelos",
              "Localiza estos músculos en tu propio cuerpo mientras te mueves",
              "Explica qué músculos usas para realizar diferentes actividades (correr, escribir, masticar)"
            ]
          },
          {
            "key": "como_trabajan_musculos",
            "name": "Cómo Trabajan los Músculos",
            "short_description": "Contracción y relajación muscular.",
            "example_tasks": [
              "Describe cómo los músculos se contraen para producir movimiento",
              "Explica cómo trabajan en pares (bíceps y tríceps) para mover el brazo",
              "Investiga por qué los músculos necesitan oxígeno y nutrientes para funcionar"
            ]
          },
          {
            "key": "fortalecimiento_muscular",
            "name": "Fortalecimiento Muscular",
            "short_description": "Ejercicio y desarrollo de músculos fuertes.",
            "example_tasks": [
              "Describe cómo el ejercicio regular fortalece los músculos",
              "Explica por qué los músculos duelen después de ejercicio intenso",
              "Investiga la importancia de las proteínas en la dieta para la salud muscular"
            ]
          }
        ]
      },
      {
        "key": "postura_movimiento",
        "name": "Postura y Movimiento",
        "short_description": "Importancia de mantener una postura correcta.",
        "sub_topics": [
          {
            "key": "postura_correcta",
            "name": "Postura Correcta",
            "short_description": "Posiciones adecuadas al estar sentado, parado y acostado.",
            "example_tasks": [
              "Demuestra la postura correcta al sentarte en tu escritorio",
              "Explica por qué es importante mantener la espalda recta al cargar una mochila",
              "Identifica posturas incorrectas que pueden causar problemas de espalda"
            ]
          },
          {
            "key": "columna_vertebral",
            "name": "Cuidado de la Columna Vertebral",
            "short_description": "Importancia de proteger la columna.",
            "example_tasks": [
              "Describe la estructura de la columna vertebral y sus funciones",
              "Explica cómo levantar objetos pesados correctamente para no dañar la espalda",
              "Investiga problemas comunes de la columna por mala postura (escoliosis, lordosis)"
            ]
          },
          {
            "key": "ergonomia_escolar",
            "name": "Ergonomía Escolar",
            "short_description": "Adaptación del mobiliario y hábitos para prevenir lesiones.",
            "example_tasks": [
              "Evalúa si tu escritorio y silla están a la altura adecuada",
              "Describe la importancia de tomar descansos al estar sentado mucho tiempo",
              "Investiga el peso recomendado que debe tener tu mochila escolar"
            ]
          }
        ]
      },
      {
        "key": "cuidado_sistema_locomotor",
        "name": "Cuidado del Sistema Locomotor",
        "short_description": "Prevención de lesiones y mantenimiento de huesos y músculos sanos.",
        "sub_topics": [
          {
            "key": "alimentacion_huesos",
            "name": "Alimentación para Huesos Fuertes",
            "short_description": "Importancia del calcio y vitamina D.",
            "example_tasks": [
              "Identifica alimentos ricos en calcio (leche, queso, tortillas de maíz nixtamalizado)",
              "Explica cómo la vitamina D ayuda al cuerpo a absorber calcio",
              "Investiga por qué es importante el calcio durante el crecimiento"
            ]
          },
          {
            "key": "ejercicio_sistema_locomotor",
            "name": "Ejercicio para Huesos y Músculos",
            "short_description": "Actividad física que fortalece el sistema locomotor.",
            "example_tasks": [
              "Describe ejercicios que fortalecen los huesos (correr, saltar, bailar)",
              "Explica cómo el ejercicio de resistencia fortalece los músculos",
              "Investiga por qué la inactividad debilita huesos y músculos"
            ]
          },
          {
            "key": "prevencion_lesiones",
            "name": "Prevención de Lesiones",
            "short_description": "Medidas de seguridad al hacer ejercicio y jugar.",
            "example_tasks": [
              "Lista medidas de seguridad al practicar deportes (equipo protector, calentamiento)",
              "Explica qué hacer si te fracturas un hueso o te tuerces un tobillo",
              "Investiga la importancia del descanso y recuperación después del ejercicio"
            ]
          },
          {
            "key": "primeros_auxilios_basicos",
            "name": "Primeros Auxilios Básicos",
            "short_description": "Qué hacer en caso de lesiones comunes.",
            "example_tasks": [
              "Describe cómo tratar un golpe leve aplicando hielo",
              "Explica cuándo es necesario buscar ayuda médica (fracturas, dolor intenso)",
              "Investiga qué es la inmovilización y cuándo se usa"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "organos_sentidos",
    "name": "Órganos de los Sentidos",
    "short_description": "Estudio de los cinco sentidos y cómo el sistema nervioso procesa la información del entorno.",
    "sub_topics": [
      {
        "key": "sentido_vista",
        "name": "Sentido de la Vista",
        "short_description": "El ojo y la percepción visual.",
        "sub_topics": [
          {
            "key": "estructura_ojo",
            "name": "Estructura del Ojo",
            "short_description": "Partes del ojo y sus funciones.",
            "example_tasks": [
              "Identifica las partes del ojo: córnea, iris, pupila, cristalino, retina",
              "Explica cómo la pupila se hace más grande o pequeña según la luz",
              "Investiga qué es el nervio óptico y cómo envía información al cerebro"
            ]
          },
          {
            "key": "como_vemos",
            "name": "Cómo Vemos",
            "short_description": "Proceso de formación de imágenes.",
            "example_tasks": [
              "Describe cómo la luz entra al ojo y forma una imagen en la retina",
              "Explica por qué vemos objetos de diferentes colores",
              "Investiga cómo el cerebro interpreta las señales que envía el ojo"
            ]
          },
          {
            "key": "cuidado_vista",
            "name": "Cuidado de la Vista",
            "short_description": "Prevención de problemas visuales.",
            "example_tasks": [
              "Lista hábitos para cuidar tus ojos (luz adecuada, descansos, protección solar)",
              "Explica por qué no debes ver la televisión muy cerca",
              "Investiga problemas comunes de la vista (miopía, hipermetropía, astigmatismo)"
            ]
          }
        ]
      },
      {
        "key": "sentido_oido",
        "name": "Sentido del Oído",
        "short_description": "El oído y la percepción de sonidos.",
        "sub_topics": [
          {
            "key": "estructura_oido",
            "name": "Estructura del Oído",
            "short_description": "Partes del oído externo, medio e interno.",
            "example_tasks": [
              "Identifica las tres partes del oído: externo, medio e interno",
              "Describe las estructuras importantes: tímpano, huesecillos, cóclea",
              "Explica cómo el oído interno también ayuda con el equilibrio"
            ]
          },
          {
            "key": "como_escuchamos",
            "name": "Cómo Escuchamos",
            "short_description": "Proceso de captación y transmisión del sonido.",
            "example_tasks": [
              "Describe cómo las ondas sonoras viajan desde tu oreja hasta tu cerebro",
              "Explica cómo el tímpano vibra cuando escuchamos sonidos",
              "Investiga cómo distinguimos sonidos fuertes de sonidos suaves"
            ]
          },
          {
            "key": "cuidado_oido",
            "name": "Cuidado del Oído",
            "short_description": "Prevención de daños auditivos.",
            "example_tasks": [
              "Explica por qué no debes introducir objetos en tus oídos",
              "Investiga cómo los sonidos muy fuertes pueden dañar la audición",
              "Describe medidas para proteger tus oídos de ruidos intensos"
            ]
          }
        ]
      },
      {
        "key": "sentido_olfato",
        "name": "Sentido del Olfato",
        "short_description": "La nariz y la percepción de olores.",
        "sub_topics": [
          {
            "key": "estructura_nariz",
            "name": "Estructura de la Nariz",
            "short_description": "Receptores olfativos y conexión con el cerebro.",
            "example_tasks": [
              "Describe dónde se encuentran los receptores del olfato en la nariz",
              "Explica cómo las moléculas de olor llegan a los receptores",
              "Investiga la conexión entre el olfato y el nervio olfativo"
            ]
          },
          {
            "key": "como_olemos",
            "name": "Cómo Olemos",
            "short_description": "Proceso de detección de olores.",
            "example_tasks": [
              "Explica cómo distinguimos diferentes olores",
              "Describe la relación entre el olfato y el sentido del gusto",
              "Investiga por qué cuando estás resfriado no puedes oler bien"
            ]
          },
          {
            "key": "importancia_olfato",
            "name": "Importancia del Olfato",
            "short_description": "Funciones de protección y disfrute.",
            "example_tasks": [
              "Explica cómo el olfato te advierte de peligros (humo, comida descompuesta, gas)",
              "Describe cómo el olfato aumenta el placer de comer",
              "Investiga la relación entre olores y memoria"
            ]
          }
        ]
      },
      {
        "key": "sentido_gusto",
        "name": "Sentido del Gusto",
        "short_description": "La lengua y la percepción de sabores.",
        "sub_topics": [
          {
            "key": "papilas_gustativas",
            "name": "Papilas Gustativas",
            "short_description": "Receptores del gusto en la lengua.",
            "example_tasks": [
              "Observa tu lengua en un espejo e identifica las papilas gustativas",
              "Describe los cinco sabores básicos: dulce, salado, ácido, amargo, umami",
              "Investiga qué zonas de la lengua detectan mejor cada sabor"
            ]
          },
          {
            "key": "como_saboreamos",
            "name": "Cómo Saboreamos",
            "short_description": "Proceso de detección de sabores.",
            "example_tasks": [
              "Explica cómo las papilas gustativas detectan sabores en los alimentos",
              "Describe la relación entre olfato y gusto al comer",
              "Investiga por qué la comida sabe diferente cuando tienes gripe"
            ]
          },
          {
            "key": "proteccion_gusto",
            "name": "Protección del Gusto",
            "short_description": "Cuidado de la lengua y sentido del gusto.",
            "example_tasks": [
              "Explica por qué no debes comer o beber cosas muy calientes",
              "Investiga cómo la higiene bucal protege las papilas gustativas",
              "Describe el papel del gusto en detectar alimentos en mal estado"
            ]
          }
        ]
      },
      {
        "key": "sentido_tacto",
        "name": "Sentido del Tacto",
        "short_description": "La piel y la percepción de sensaciones.",
        "sub_topics": [
          {
            "key": "estructura_piel",
            "name": "Estructura de la Piel",
            "short_description": "Capas y funciones de la piel.",
            "example_tasks": [
              "Identifica las capas de la piel: epidermis y dermis",
              "Describe las funciones de la piel (protección, regulación de temperatura, sensación)",
              "Investiga qué son los poros y qué función tienen"
            ]
          },
          {
            "key": "receptores_tacto",
            "name": "Receptores del Tacto",
            "short_description": "Detección de presión, temperatura y dolor.",
            "example_tasks": [
              "Experimenta tocando diferentes texturas y describe lo que sientes",
              "Explica cómo percibes si algo está caliente, frío, suave o áspero",
              "Investiga por qué algunas partes del cuerpo son más sensibles que otras"
            ]
          },
          {
            "key": "cuidado_piel",
            "name": "Cuidado de la Piel",
            "short_description": "Protección e higiene de la piel.",
            "example_tasks": [
              "Describe medidas para proteger tu piel del sol (bloqueador solar, sombrero)",
              "Explica la importancia de lavar tu piel regularmente",
              "Investiga cómo las heridas sanan y la importancia de mantenerlas limpias"
            ]
          }
        ]
      },
      {
        "key": "sistema_nervioso_basico",
        "name": "Sistema Nervioso Básico",
        "short_description": "Introducción al cerebro y sistema nervioso.",
        "sub_topics": [
          {
            "key": "cerebro_funciones",
            "name": "El Cerebro y sus Funciones",
            "short_description": "Centro de control del cuerpo.",
            "example_tasks": [
              "Describe las funciones principales del cerebro (pensar, sentir, controlar movimientos)",
              "Explica cómo el cerebro procesa información de los cinco sentidos",
              "Investiga qué hace cada hemisferio del cerebro"
            ]
          },
          {
            "key": "nervios_medula",
            "name": "Nervios y Médula Espinal",
            "short_description": "Transmisión de mensajes en el cuerpo.",
            "example_tasks": [
              "Describe cómo los nervios llevan mensajes del cerebro a todo el cuerpo",
              "Explica qué es un reflejo y da ejemplos (retirar la mano del fuego)",
              "Investiga la función de la médula espinal en proteger el sistema nervioso"
            ]
          },
          {
            "key": "cuidado_sistema_nervioso",
            "name": "Cuidado del Sistema Nervioso",
            "short_description": "Protección del cerebro y nervios.",
            "example_tasks": [
              "Explica por qué es importante usar casco al andar en bicicleta",
              "Describe la importancia del sueño para el cerebro",
              "Investiga cómo el ejercicio y buena alimentación benefician al cerebro"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "aparato_reproductor_desarrollo",
    "name": "Aparato Reproductor y Desarrollo Humano",
    "short_description": "Estudio de los cambios corporales durante el crecimiento, las etapas de desarrollo humano y conceptos básicos de reproducción apropiados para la edad.",
    "sub_topics": [
      {
        "key": "etapas_vida_humana",
        "name": "Etapas de la Vida Humana",
        "short_description": "Ciclo de vida desde el nacimiento hasta la vejez.",
        "sub_topics": [
          {
            "key": "infancia",
            "name": "Infancia",
            "short_description": "Período de crecimiento y desarrollo rápido.",
            "example_tasks": [
              "Describe los cambios principales que ocurren durante la infancia",
              "Compara cómo eras cuando eras bebé con cómo eres ahora",
              "Explica la importancia de la nutrición y el cuidado durante la infancia"
            ]
          },
          {
            "key": "adolescencia",
            "name": "Adolescencia",
            "short_description": "Etapa de cambios físicos y emocionales.",
            "example_tasks": [
              "Describe los cambios que ocurren durante la pubertad",
              "Explica que la adolescencia es una etapa normal del desarrollo",
              "Investiga por qué ocurren cambios físicos y emocionales en esta etapa"
            ]
          },
          {
            "key": "adultez_vejez",
            "name": "Adultez y Vejez",
            "short_description": "Madurez y envejecimiento.",
            "example_tasks": [
              "Describe características de la vida adulta",
              "Explica los cambios que ocurren durante el envejecimiento",
              "Investiga cómo mantener una vida saludable en todas las etapas"
            ]
          }
        ]
      },
      {
        "key": "crecimiento_desarrollo",
        "name": "Crecimiento y Desarrollo",
        "short_description": "Cambios físicos y mentales a lo largo de la vida.",
        "sub_topics": [
          {
            "key": "cambios_fisicos",
            "name": "Cambios Físicos",
            "short_description": "Aumento de estatura, peso y desarrollo corporal.",
            "example_tasks": [
              "Registra tu estatura y compárala con mediciones anteriores",
              "Explica por qué los niños crecen a diferentes ritmos",
              "Investiga factores que influyen en el crecimiento (alimentación, genética, sueño)"
            ]
          },
          {
            "key": "desarrollo_habilidades",
            "name": "Desarrollo de Habilidades",
            "short_description": "Adquisición de capacidades físicas y mentales.",
            "example_tasks": [
              "Describe habilidades que has desarrollado a medida que creces",
              "Compara lo que podías hacer cuando eras pequeño con lo que puedes hacer ahora",
              "Explica la importancia del aprendizaje continuo"
            ]
          },
          {
            "key": "factores_desarrollo",
            "name": "Factores que Influyen en el Desarrollo",
            "short_description": "Nutrición, ejercicio, sueño y ambiente.",
            "example_tasks": [
              "Explica cómo una buena alimentación favorece el crecimiento",
              "Describe la importancia del ejercicio para el desarrollo físico",
              "Investiga cuántas horas de sueño necesitan los niños de tu edad"
            ]
          }
        ]
      },
      {
        "key": "pubertad_cambios",
        "name": "Pubertad y Cambios",
        "short_description": "Transformaciones físicas que marcan el inicio de la adolescencia.",
        "sub_topics": [
          {
            "key": "que_es_pubertad",
            "name": "Qué es la Pubertad",
            "short_description": "Comprensión de esta etapa natural del desarrollo.",
            "example_tasks": [
              "Explica qué es la pubertad y a qué edad generalmente comienza",
              "Describe que la pubertad es un proceso normal y saludable",
              "Investiga por qué la pubertad ocurre a diferentes edades en diferentes personas"
            ]
          },
          {
            "key": "cambios_ninas",
            "name": "Cambios en las Niñas",
            "short_description": "Transformaciones físicas durante la pubertad femenina.",
            "example_tasks": [
              "Describe cambios físicos que ocurren en las niñas durante la pubertad",
              "Explica que estos cambios son naturales y preparan el cuerpo para la adultez",
              "Investiga la importancia de la higiene personal durante esta etapa"
            ]
          },
          {
            "key": "cambios_ninos",
            "name": "Cambios en los Niños",
            "short_description": "Transformaciones físicas durante la pubertad masculina.",
            "example_tasks": [
              "Describe cambios físicos que ocurren en los niños durante la pubertad",
              "Explica que estos cambios son normales y parte del desarrollo",
              "Investiga cómo cuidar la salud e higiene durante esta etapa"
            ]
          },
          {
            "key": "cambios_emocionales",
            "name": "Cambios Emocionales",
            "short_description": "Transformaciones en sentimientos y emociones.",
            "example_tasks": [
              "Describe cambios emocionales que pueden ocurrir durante la pubertad",
              "Explica la importancia de hablar con adultos de confianza sobre tus emociones",
              "Investiga formas saludables de manejar emociones intensas"
            ]
          }
        ]
      },
      {
        "key": "reproduccion_basica",
        "name": "Reproducción Humana Básica",
        "short_description": "Conceptos apropiados para la edad sobre cómo se forma una nueva vida.",
        "sub_topics": [
          {
            "key": "celulas_reproductoras",
            "name": "Células Reproductoras",
            "short_description": "Introducción básica a células especializadas.",
            "example_tasks": [
              "Explica que los seres humanos se reproducen de manera sexual",
              "Describe de manera general que se necesitan células especiales de ambos padres",
              "Investiga que todos los seres humanos comenzaron como una célula"
            ]
          },
          {
            "key": "desarrollo_prenatal",
            "name": "Desarrollo Prenatal",
            "short_description": "Crecimiento del bebé antes de nacer.",
            "example_tasks": [
              "Describe las etapas básicas del desarrollo antes del nacimiento",
              "Explica cuánto tiempo dura el embarazo (aproximadamente 9 meses)",
              "Investiga cómo el bebé recibe nutrientes y oxígeno de la madre"
            ]
          },
          {
            "key": "nacimiento_cuidado",
            "name": "Nacimiento y Cuidado del Bebé",
            "short_description": "El proceso del nacimiento y cuidados iniciales.",
            "example_tasks": [
              "Describe de manera general cómo nace un bebé",
              "Explica los cuidados que necesita un recién nacido",
              "Investiga cómo los bebés crecen y se desarrollan durante el primer año"
            ]
          }
        ]
      },
      {
        "key": "respeto_diversidad",
        "name": "Respeto y Diversidad",
        "short_description": "Valoración de las diferencias individuales y respeto mutuo.",
        "sub_topics": [
          {
            "key": "diferencias_individuales",
            "name": "Diferencias Individuales",
            "short_description": "Reconocimiento de que cada persona es única.",
            "example_tasks": [
              "Describe cómo cada persona se desarrolla a su propio ritmo",
              "Explica que las diferencias entre las personas son normales y valiosas",
              "Investiga cómo la genética y el ambiente influyen en nuestras características"
            ]
          },
          {
            "key": "respeto_cuerpo",
            "name": "Respeto al Cuerpo Propio y Ajeno",
            "short_description": "Importancia de la privacidad y el respeto.",
            "example_tasks": [
              "Explica que tu cuerpo te pertenece y merece respeto",
              "Describe la importancia de respetar el espacio personal de los demás",
              "Investiga a quién acudir si alguien te hace sentir incómodo"
            ]
          },
          {
            "key": "igualdad_genero",
            "name": "Igualdad y Respeto de Género",
            "short_description": "Valoración equitativa de todas las personas.",
            "example_tasks": [
              "Explica que niños y niñas merecen las mismas oportunidades y respeto",
              "Describe cómo los estereotipos limitan el potencial de las personas",
              "Investiga ejemplos de personas que han roto estereotipos de género"
            ]
          }
        ]
      },
      {
        "key": "autocuidado_bienestar",
        "name": "Autocuidado y Bienestar",
        "short_description": "Desarrollo de hábitos saludables para el bienestar integral.",
        "sub_topics": [
          {
            "key": "higiene_personal",
            "name": "Higiene Personal",
            "short_description": "Hábitos de limpieza y cuidado del cuerpo.",
            "example_tasks": [
              "Describe una rutina diaria de higiene personal completa",
              "Explica por qué la higiene es especialmente importante durante la pubertad",
              "Investiga productos de higiene apropiados para tu edad"
            ]
          },
          {
            "key": "autoestima_saludable",
            "name": "Autoestima Saludable",
            "short_description": "Valoración positiva de uno mismo.",
            "example_tasks": [
              "Describe tus cualidades y fortalezas personales",
              "Explica la importancia de aceptar y valorar tu cuerpo",
              "Investiga cómo desarrollar una imagen corporal positiva"
            ]
          },
          {
            "key": "toma_decisiones",
            "name": "Toma de Decisiones Saludables",
            "short_description": "Capacidad para elegir lo mejor para tu bienestar.",
            "example_tasks": [
              "Describe situaciones donde debes tomar decisiones sobre tu salud",
              "Explica la importancia de pensar en las consecuencias de tus acciones",
              "Investiga a quién puedes pedir consejo cuando tienes dudas"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "cadenas_redes_alimentarias",
    "name": "Cadenas y Redes Alimentarias",
    "short_description": "Estudio de las relaciones de alimentación entre organismos y el flujo de energía en los ecosistemas.",
    "sub_topics": [
      {
        "key": "productores_primarios",
        "name": "Productores",
        "short_description": "Organismos que fabrican su propio alimento mediante fotosíntesis.",
        "sub_topics": [
          {
            "key": "plantas_productoras",
            "name": "Plantas como Productores",
            "short_description": "Base de las cadenas alimentarias.",
            "example_tasks": [
              "Explica por qué las plantas son llamadas productores en el ecosistema",
              "Identifica plantas productoras en diferentes ecosistemas mexicanos",
              "Describe cómo las plantas convierten la energía solar en energía química"
            ]
          },
          {
            "key": "fitoplancton",
            "name": "Fitoplancton",
            "short_description": "Productores microscópicos en ecosistemas acuáticos.",
            "example_tasks": [
              "Investiga qué es el fitoplancton y dónde vive",
              "Explica por qué el fitoplancton es importante para los océanos",
              "Describe cómo el fitoplancton produce oxígeno como las plantas terrestres"
            ]
          },
          {
            "key": "importancia_productores",
            "name": "Importancia de los Productores",
            "short_description": "Base de toda la vida en los ecosistemas.",
            "example_tasks": [
              "Explica qué pasaría con un ecosistema si desaparecieran todos los productores",
              "Describe cómo los productores capturan energía del sol",
              "Investiga por qué casi todas las cadenas alimentarias comienzan con plantas"
            ]
          }
        ]
      },
      {
        "key": "consumidores",
        "name": "Consumidores",
        "short_description": "Organismos que obtienen energía alimentándose de otros seres vivos.",
        "sub_topics": [
          {
            "key": "herbivoros_consumidores_primarios",
            "name": "Herbívoros (Consumidores Primarios)",
            "short_description": "Animales que se alimentan de plantas.",
            "example_tasks": [
              "Identifica cinco herbívoros mexicanos (venado, conejo, iguana, mariposa, chapulín)",
              "Explica por qué los herbívoros son llamados consumidores primarios",
              "Describe adaptaciones de los herbívoros para comer plantas (dientes planos, estómagos especiales)"
            ]
          },
          {
            "key": "carnivoros_consumidores_secundarios",
            "name": "Carnívoros (Consumidores Secundarios)",
            "short_description": "Animales que se alimentan de otros animales.",
            "example_tasks": [
              "Identifica carnívoros de diferentes ecosistemas mexicanos (jaguar, águila, serpiente, araña)",
              "Compara las adaptaciones de carnívoros para cazar (garras, dientes afilados, velocidad)",
              "Explica la diferencia entre consumidores secundarios y terciarios"
            ]
          },
          {
            "key": "omnivoros",
            "name": "Omnívoros",
            "short_description": "Animales que comen plantas y animales.",
            "example_tasks": [
              "Identifica omnívoros comunes (oso, mapache, humano, cerdo)",
              "Describe las ventajas de ser omnívoro en un ecosistema",
              "Compara la dieta de un omnívoro con la de un herbívoro y un carnívoro"
            ]
          },
          {
            "key": "carroneros",
            "name": "Carroñeros",
            "short_description": "Animales que se alimentan de organismos muertos.",
            "example_tasks": [
              "Identifica carroñeros mexicanos (zopilote, buitre, hiena)",
              "Explica el papel importante de los carroñeros en limpiar el ecosistema",
              "Describe cómo los carroñeros ayudan a reciclar nutrientes"
            ]
          }
        ]
      },
      {
        "key": "descomponedores",
        "name": "Descomponedores",
        "short_description": "Organismos que descomponen materia orgánica muerta.",
        "sub_topics": [
          {
            "key": "bacterias_descomponedoras",
            "name": "Bacterias Descomponedoras",
            "short_description": "Microorganismos que descomponen materia orgánica.",
            "example_tasks": [
              "Explica cómo las bacterias descomponen hojas muertas y otros materiales",
              "Investiga dónde encuentras bacterias descomponedoras (suelo, agua, compost)",
              "Describe el papel de las bacterias en el reciclaje de nutrientes"
            ]
          },
          {
            "key": "hongos_descomponedores",
            "name": "Hongos Descomponedores",
            "short_description": "Hongos que degradan materia orgánica.",
            "example_tasks": [
              "Observa hongos creciendo en troncos caídos y explica qué están haciendo",
              "Describe cómo los hongos ayudan a descomponer madera muerta",
              "Investiga qué pasaría si no hubiera descomponedores en un bosque"
            ]
          },
          {
            "key": "importancia_descomponedores",
            "name": "Importancia de los Descomponedores",
            "short_description": "Reciclaje de nutrientes en el ecosistema.",
            "example_tasks": [
              "Explica por qué los descomponedores son esenciales para los ecosistemas",
              "Describe cómo los descomponedores devuelven nutrientes al suelo",
              "Investiga qué pasaría con los nutrientes sin descomponedores"
            ]
          }
        ]
      },
      {
        "key": "cadenas_alimentarias",
        "name": "Cadenas Alimentarias",
        "short_description": "Secuencia lineal de quién come a quién en un ecosistema.",
        "sub_topics": [
          {
            "key": "estructura_cadena",
            "name": "Estructura de una Cadena Alimentaria",
            "short_description": "Niveles tróficos en secuencia.",
            "example_tasks": [
              "Dibuja una cadena alimentaria simple: pasto → saltamontes → ratón → serpiente → águila",
              "Identifica el productor, consumidor primario, secundario y terciario en una cadena",
              "Crea una cadena alimentaria de un ecosistema mexicano que conozcas"
            ]
          },
          {
            "key": "flujo_energia",
            "name": "Flujo de Energía",
            "short_description": "Transferencia de energía a través de la cadena.",
            "example_tasks": [
              "Explica cómo fluye la energía desde el sol hasta los consumidores superiores",
              "Describe por qué se pierde energía en cada nivel de la cadena alimentaria",
              "Investiga por qué hay menos carnívoros que herbívoros en un ecosistema"
            ]
          },
          {
            "key": "cadenas_diferentes_ecosistemas",
            "name": "Cadenas en Diferentes Ecosistemas",
            "short_description": "Variación según el ambiente.",
            "example_tasks": [
              "Compara una cadena alimentaria del desierto con una de la selva tropical",
              "Crea una cadena alimentaria de un ecosistema acuático mexicano",
              "Identifica similitudes y diferencias entre cadenas de distintos ecosistemas"
            ]
          }
        ]
      },
      {
        "key": "redes_alimentarias",
        "name": "Redes Alimentarias",
        "short_description": "Interconexión compleja de múltiples cadenas alimentarias.",
        "sub_topics": [
          {
            "key": "cadenas_interconectadas",
            "name": "Cadenas Interconectadas",
            "short_description": "Múltiples relaciones de alimentación.",
            "example_tasks": [
              "Explica por qué una red alimentaria es más realista que una cadena simple",
              "Dibuja una red alimentaria mostrando al menos 8 organismos con múltiples conexiones",
              "Identifica organismos que participan en varias cadenas dentro de una red"
            ]
          },
          {
            "key": "complejidad_ecosistema",
            "name": "Complejidad del Ecosistema",
            "short_description": "Interrelaciones que dan estabilidad.",
            "example_tasks": [
              "Explica cómo las redes alimentarias hacen que los ecosistemas sean más estables",
              "Describe qué pasa si se elimina un organismo de una red compleja",
              "Investiga por qué los ecosistemas con más especies son más resistentes"
            ]
          },
          {
            "key": "equilibrio_red",
            "name": "Equilibrio en la Red",
            "short_description": "Balance entre poblaciones.",
            "example_tasks": [
              "Explica qué pasaría si aumentara mucho la población de un depredador",
              "Describe cómo se regula naturalmente el tamaño de las poblaciones",
              "Investiga ejemplos de desequilibrio en redes alimentarias causado por humanos"
            ]
          }
        ]
      },
      {
        "key": "piramides_ecologicas",
        "name": "Pirámides Ecológicas",
        "short_description": "Representación de energía, número y biomasa en ecosistemas.",
        "sub_topics": [
          {
            "key": "piramide_energia",
            "name": "Pirámide de Energía",
            "short_description": "Disminución de energía en cada nivel.",
            "example_tasks": [
              "Dibuja una pirámide de energía mostrando cómo disminuye en cada nivel trófico",
              "Explica por qué solo el 10% de la energía pasa al siguiente nivel",
              "Investiga adónde va la energía que se pierde (calor, movimiento, metabolismo)"
            ]
          },
          {
            "key": "piramide_numeros",
            "name": "Pirámide de Números",
            "short_description": "Cantidad de organismos en cada nivel.",
            "example_tasks": [
              "Crea una pirámide de números para un ecosistema específico",
              "Explica por qué generalmente hay más productores que consumidores",
              "Describe excepciones donde la pirámide puede ser invertida"
            ]
          },
          {
            "key": "piramide_biomasa",
            "name": "Pirámide de Biomasa",
            "short_description": "Masa total de organismos en cada nivel.",
            "example_tasks": [
              "Explica qué es la biomasa y cómo se mide",
              "Compara la biomasa de productores con la de consumidores superiores",
              "Investiga por qué la biomasa disminuye en niveles superiores"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "relaciones_organismos",
    "name": "Relaciones entre Organismos",
    "short_description": "Estudio de las diferentes formas en que los seres vivos interactúan entre sí, incluyendo simbiosis, competencia y depredación.",
    "sub_topics": [
      {
        "key": "simbiosis",
        "name": "Simbiosis",
        "short_description": "Relaciones cercanas y prolongadas entre diferentes especies.",
        "sub_topics": [
          {
            "key": "mutualismo",
            "name": "Mutualismo",
            "short_description": "Relación donde ambos organismos se benefician.",
            "example_tasks": [
              "Describe la relación mutualista entre abejas y flores (polinización y néctar)",
              "Investiga la simbiosis entre peces payaso y anémonas marinas",
              "Explica cómo las bacterias en nuestros intestinos nos ayudan a digerir alimentos"
            ]
          },
          {
            "key": "comensalismo",
            "name": "Comensalismo",
            "short_description": "Relación donde un organismo se beneficia y el otro no se afecta.",
            "example_tasks": [
              "Describe cómo las rémoras viajan adheridas a tiburones sin dañarlos",
              "Investiga ejemplos de plantas epífitas que crecen sobre árboles sin perjudicarlos",
              "Explica la relación entre aves que anidan en árboles sin afectarlos"
            ]
          },
          {
            "key": "parasitismo",
            "name": "Parasitismo",
            "short_description": "Relación donde un organismo se beneficia dañando al otro.",
            "example_tasks": [
              "Describe cómo las garrapatas y pulgas viven como parásitos de animales",
              "Investiga parásitos internos como las lombrices intestinales",
              "Explica cómo los parásitos obtienen nutrientes de sus hospederos"
            ]
          }
        ]
      },
      {
        "key": "competencia",
        "name": "Competencia",
        "short_description": "Lucha por recursos limitados entre organismos.",
        "sub_topics": [
          {
            "key": "competencia_intraespecifica",
            "name": "Competencia Intraespecífica",
            "short_description": "Competencia entre individuos de la misma especie.",
            "example_tasks": [
              "Describe cómo los árboles de la misma especie compiten por luz solar",
              "Explica la competencia entre animales de la misma especie por territorio",
              "Investiga cómo la competencia intraespecífica regula el tamaño de poblaciones"
            ]
          },
          {
            "key": "competencia_interespecifica",
            "name": "Competencia Interespecífica",
            "short_description": "Competencia entre individuos de diferentes especies.",
            "example_tasks": [
              "Describe cómo diferentes especies de aves compiten por los mismos insectos",
              "Explica la competencia entre plantas por agua, luz y nutrientes del suelo",
              "Investiga cómo especies introducidas compiten con especies nativas"
            ]
          },
          {
            "key": "nicho_ecologico",
            "name": "Nicho Ecológico",
            "short_description": "Papel y recursos específicos de cada especie.",
            "example_tasks": [
              "Explica qué es un nicho ecológico y por qué reduce la competencia",
              "Describe cómo diferentes especies de pájaros carpinteros usan diferentes partes del árbol",
              "Investiga el principio de exclusión competitiva"
            ]
          }
        ]
      },
      {
        "key": "depredacion",
        "name": "Depredación",
        "short_description": "Relación donde un organismo caza y consume a otro.",
        "sub_topics": [
          {
            "key": "adaptaciones_depredadores",
            "name": "Adaptaciones de Depredadores",
            "short_description": "Características que ayudan a cazar.",
            "example_tasks": [
              "Identifica adaptaciones de depredadores mexicanos (garras del jaguar, vista del águila, veneno de serpientes)",
              "Describe estrategias de caza (emboscada, persecución, trabajo en grupo)",
              "Investiga cómo los depredadores detectan y capturan a sus presas"
            ]
          },
          {
            "key": "adaptaciones_presas",
            "name": "Adaptaciones de Presas",
            "short_description": "Características que ayudan a evitar ser comido.",
            "example_tasks": [
              "Describe adaptaciones defensivas (velocidad, camuflaje, espinas, veneno)",
              "Investiga comportamientos de defensa (vivir en grupos, vigilancia)",
              "Explica cómo el mimetismo protege a algunas especies"
            ]
          },
          {
            "key": "equilibrio_depredador_presa",
            "name": "Equilibrio Depredador-Presa",
            "short_description": "Regulación mutua de poblaciones.",
            "example_tasks": [
              "Explica cómo las poblaciones de depredadores y presas se regulan mutuamente",
              "Describe qué pasa si aumenta mucho la población de presas",
              "Investiga ejemplos de desequilibrio cuando se eliminan depredadores"
            ]
          }
        ]
      },
      {
        "key": "cooperacion",
        "name": "Cooperación",
        "short_description": "Trabajo conjunto que beneficia a los organismos.",
        "sub_topics": [
          {
            "key": "sociedades_animales",
            "name": "Sociedades de Animales",
            "short_description": "Organización en grupos con división de tareas.",
            "example_tasks": [
              "Describe la organización social de las hormigas (reina, obreras, soldados)",
              "Investiga cómo las abejas trabajan juntas en la colmena",
              "Explica las ventajas de vivir en sociedades organizadas"
            ]
          },
          {
            "key": "caza_cooperativa",
            "name": "Caza Cooperativa",
            "short_description": "Depredadores que cazan en grupo.",
            "example_tasks": [
              "Describe cómo los lobos cazan en manada de manera coordinada",
              "Investiga estrategias de caza en grupo de otros animales",
              "Explica las ventajas de cazar cooperativamente"
            ]
          },
          {
            "key": "cuidado_grupal",
            "name": "Cuidado Grupal",
            "short_description": "Protección y cuidado colectivo.",
            "example_tasks": [
              "Describe cómo los elefantes cuidan a las crías del grupo",
              "Investiga comportamientos de alarma en grupos de animales",
              "Explica cómo la cooperación aumenta la supervivencia"
            ]
          }
        ]
      },
      {
        "key": "territorio_migracion",
        "name": "Territorio y Migración",
        "short_description": "Uso y movimiento en el espacio.",
        "sub_topics": [
          {
            "key": "territorialidad",
            "name": "Territorialidad",
            "short_description": "Defensa de un área específica.",
            "example_tasks": [
              "Describe cómo los animales marcan y defienden su territorio",
              "Investiga por qué los animales establecen territorios",
              "Explica comportamientos de defensa territorial"
            ]
          },
          {
            "key": "migracion_estacional",
            "name": "Migración Estacional",
            "short_description": "Movimiento periódico según las estaciones.",
            "example_tasks": [
              "Describe la migración de la mariposa monarca a México",
              "Investiga la migración de ballenas grises a Baja California",
              "Explica por qué algunos animales migran (clima, alimento, reproducción)"
            ]
          },
          {
            "key": "dispersion",
            "name": "Dispersión",
            "short_description": "Movimiento para colonizar nuevas áreas.",
            "example_tasks": [
              "Describe cómo los jóvenes se dispersan de su lugar de nacimiento",
              "Investiga la importancia de la dispersión para la diversidad genética",
              "Explica métodos de dispersión en diferentes especies"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "ciclos_naturales",
    "name": "Ciclos Naturales",
    "short_description": "Estudio de los ciclos biogeoquímicos que reciclan elementos esenciales en los ecosistemas.",
    "sub_topics": [
      {
        "key": "ciclo_agua",
        "name": "Ciclo del Agua",
        "short_description": "Circulación continua del agua en la naturaleza.",
        "sub_topics": [
          {
            "key": "evaporacion_transpiracion",
            "name": "Evaporación y Transpiración",
            "short_description": "Paso del agua de líquido a vapor.",
            "example_tasks": [
              "Describe cómo el sol evapora agua de océanos, ríos y lagos",
              "Explica qué es la transpiración y cómo las plantas liberan vapor de agua",
              "Investiga qué factores aumentan la evaporación (temperatura, viento)"
            ]
          },
          {
            "key": "condensacion_precipitacion",
            "name": "Condensación y Precipitación",
            "short_description": "Formación de nubes y lluvia.",
            "example_tasks": [
              "Explica cómo el vapor de agua se condensa formando nubes",
              "Describe diferentes tipos de precipitación (lluvia, nieve, granizo)",
              "Investiga cómo se forman las nubes y por qué llueve"
            ]
          },
          {
            "key": "escorrentia_infiltracion",
            "name": "Escorrentía e Infiltración",
            "short_description": "Movimiento del agua sobre y bajo la superficie.",
            "example_tasks": [
              "Describe cómo el agua de lluvia fluye sobre la superficie formando arroyos y ríos",
              "Explica el proceso de infiltración del agua en el suelo",
              "Investiga cómo se forman las aguas subterráneas y acuíferos"
            ]
          },
          {
            "key": "importancia_ciclo_agua",
            "name": "Importancia del Ciclo del Agua",
            "short_description": "Distribución y disponibilidad del agua.",
            "example_tasks": [
              "Explica por qué el ciclo del agua es esencial para todos los seres vivos",
              "Describe cómo el ciclo distribuye agua dulce en el planeta",
              "Investiga cómo las actividades humanas afectan el ciclo del agua"
            ]
          }
        ]
      },
      {
        "key": "ciclo_carbono",
        "name": "Ciclo del Carbono",
        "short_description": "Movimiento del carbono entre seres vivos y el ambiente.",
        "sub_topics": [
          {
            "key": "fotosintesis_carbono",
            "name": "Fotosíntesis y Captura de Carbono",
            "short_description": "Las plantas absorben CO₂ del aire.",
            "example_tasks": [
              "Explica cómo las plantas toman dióxido de carbono durante la fotosíntesis",
              "Describe cómo el carbono se incorpora en los tejidos de las plantas",
              "Investiga el papel de los océanos en absorber CO₂"
            ]
          },
          {
            "key": "respiracion_carbono",
            "name": "Respiración y Liberación de Carbono",
            "short_description": "Todos los seres vivos liberan CO₂.",
            "example_tasks": [
              "Describe cómo la respiración libera dióxido de carbono",
              "Explica el intercambio de carbono entre plantas y animales",
              "Investiga cómo la descomposición devuelve carbono al ambiente"
            ]
          },
          {
            "key": "combustibles_fosiles",
            "name": "Combustibles Fósiles",
            "short_description": "Carbono almacenado durante millones de años.",
            "example_tasks": [
              "Explica cómo se formaron los combustibles fósiles (petróleo, carbón, gas)",
              "Describe qué pasa cuando quemamos combustibles fósiles",
              "Investiga cómo la quema de combustibles afecta el ciclo del carbono"
            ]
          },
          {
            "key": "equilibrio_carbono",
            "name": "Equilibrio del Carbono",
            "short_description": "Balance natural y alteraciones humanas.",
            "example_tasks": [
              "Explica cómo el ciclo del carbono estaba balanceado antes de la industrialización",
              "Describe el efecto del aumento de CO₂ en la atmósfera",
              "Investiga la relación entre el ciclo del carbono y el cambio climático"
            ]
          }
        ]
      },
      {
        "key": "ciclo_oxigeno",
        "name": "Ciclo del Oxígeno",
        "short_description": "Producción y consumo de oxígeno en la naturaleza.",
        "sub_topics": [
          {
            "key": "produccion_oxigeno",
            "name": "Producción de Oxígeno",
            "short_description": "Fotosíntesis libera oxígeno.",
            "example_tasks": [
              "Explica cómo las plantas producen oxígeno durante la fotosíntesis",
              "Describe el papel del fitoplancton en producir oxígeno oceánico",
              "Investiga qué porcentaje del oxígeno proviene de plantas terrestres vs oceánicas"
            ]
          },
          {
            "key": "consumo_oxigeno",
            "name": "Consumo de Oxígeno",
            "short_description": "Respiración consume oxígeno.",
            "example_tasks": [
              "Describe cómo todos los seres vivos consumen oxígeno al respirar",
              "Explica el balance entre producción y consumo de oxígeno",
              "Investiga cómo la combustión también consume oxígeno"
            ]
          },
          {
            "key": "relacion_carbono_oxigeno",
            "name": "Relación con el Ciclo del Carbono",
            "short_description": "Intercambio complementario de gases.",
            "example_tasks": [
              "Explica cómo los ciclos de carbono y oxígeno están conectados",
              "Describe el intercambio de CO₂ y O₂ entre plantas y animales",
              "Investiga por qué estos ciclos son complementarios"
            ]
          }
        ]
      },
      {
        "key": "ciclo_nitrogeno",
        "name": "Ciclo del Nitrógeno",
        "short_description": "Transformación del nitrógeno para uso de los seres vivos.",
        "sub_topics": [
          {
            "key": "fijacion_nitrogeno",
            "name": "Fijación del Nitrógeno",
            "short_description": "Conversión del N₂ atmosférico a formas utilizables.",
            "example_tasks": [
              "Explica qué es la fijación de nitrógeno",
              "Describe el papel de bacterias en las raíces de leguminosas (frijol, haba)",
              "Investiga cómo los rayos también fijan nitrógeno"
            ]
          },
          {
            "key": "asimilacion_nitrogeno",
            "name": "Asimilación del Nitrógeno",
            "short_description": "Absorción de nitrógeno por las plantas.",
            "example_tasks": [
              "Describe cómo las plantas absorben nitratos del suelo",
              "Explica cómo el nitrógeno pasa de plantas a animales",
              "Investiga por qué el nitrógeno es importante para proteínas"
            ]
          },
          {
            "key": "descomposicion_nitrogeno",
            "name": "Descomposición y Reciclaje",
            "short_description": "Retorno del nitrógeno al suelo y aire.",
            "example_tasks": [
              "Explica cómo los descomponedores liberan nitrógeno de organismos muertos",
              "Describe el proceso de nitrificación y desnitrificación",
              "Investiga cómo se recicla el nitrógeno en los ecosistemas"
            ]
          }
        ]
      },
      {
        "key": "interconexion_ciclos",
        "name": "Interconexión de Ciclos",
        "short_description": "Cómo los ciclos trabajan juntos en los ecosistemas.",
        "sub_topics": [
          {
            "key": "dependencia_mutua",
            "name": "Dependencia Mutua",
            "short_description": "Los ciclos se afectan unos a otros.",
            "example_tasks": [
              "Explica cómo el ciclo del agua afecta a los otros ciclos",
              "Describe la relación entre fotosíntesis y múltiples ciclos",
              "Investiga cómo la alteración de un ciclo afecta a los demás"
            ]
          },
          {
            "key": "papel_seres_vivos",
            "name": "Papel de los Seres Vivos",
            "short_description": "Los organismos como participantes activos.",
            "example_tasks": [
              "Describe cómo diferentes organismos participan en los ciclos biogeoquímicos",
              "Explica el papel especial de las plantas en varios ciclos",
              "Investiga cómo los descomponedores son cruciales en todos los ciclos"
            ]
          },
          {
            "key": "impacto_humano_ciclos",
            "name": "Impacto Humano en los Ciclos",
            "short_description": "Alteraciones causadas por actividades humanas.",
            "example_tasks": [
              "Describe cómo la deforestación afecta el ciclo del agua y carbono",
              "Explica el impacto de fertilizantes en el ciclo del nitrógeno",
              "Investiga acciones para reducir impactos negativos en los ciclos naturales"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "adaptaciones_seres_vivos",
    "name": "Adaptaciones de los Seres Vivos",
    "short_description": "Características estructurales y comportamentales que permiten a los organismos sobrevivir y reproducirse en su ambiente específico.",
    "sub_topics": [
      {
        "key": "tipos_adaptaciones",
        "name": "Tipos de Adaptaciones",
        "short_description": "Clasificación de adaptaciones según su naturaleza.",
        "sub_topics": [
          {
            "key": "adaptaciones_estructurales",
            "name": "Adaptaciones Estructurales",
            "short_description": "Características físicas del cuerpo.",
            "example_tasks": [
              "Identifica adaptaciones estructurales en animales mexicanos (joroba del camello, pico del colibrí)",
              "Explica cómo la forma del cuerpo ayuda a la supervivencia",
              "Compara estructuras similares en animales de diferentes ambientes"
            ]
          },
          {
            "key": "adaptaciones_fisiologicas",
            "name": "Adaptaciones Fisiológicas",
            "short_description": "Procesos internos del cuerpo.",
            "example_tasks": [
              "Describe cómo algunos animales regulan su temperatura corporal",
              "Explica adaptaciones para conservar agua en el desierto",
              "Investiga cómo algunos animales producen veneno como adaptación"
            ]
          },
          {
            "key": "adaptaciones_comportamentales",
            "name": "Adaptaciones Comportamentales",
            "short_description": "Conductas que aumentan la supervivencia.",
            "example_tasks": [
              "Describe comportamientos adaptativos como la migración y hibernación",
              "Explica adaptaciones de comportamiento social (vivir en grupos)",
              "Investiga comportamientos de cortejo y reproducción"
            ]
          }
        ]
      },
      {
        "key": "adaptaciones_climaticas",
        "name": "Adaptaciones Climáticas",
        "short_description": "Características para sobrevivir en diferentes climas.",
        "sub_topics": [
          {
            "key": "adaptaciones_calor",
            "name": "Adaptaciones al Calor",
            "short_description": "Sobrevivir en ambientes muy cálidos.",
            "example_tasks": [
              "Describe adaptaciones de animales del desierto mexicano (orejas grandes, hábitos nocturnos)",
              "Explica cómo los cactus reducen la pérdida de agua",
              "Investiga estrategias de enfriamiento en diferentes organismos"
            ]
          },
          {
            "key": "adaptaciones_frio",
            "name": "Adaptaciones al Frío",
            "short_description": "Sobrevivir en ambientes fríos.",
            "example_tasks": [
              "Describe adaptaciones como pelaje grueso y grasa corporal",
              "Explica la hibernación como estrategia para sobrevivir el invierno",
              "Investiga adaptaciones de plantas en zonas montañosas frías"
            ]
          },
          {
            "key": "adaptaciones_humedad",
            "name": "Adaptaciones a la Humedad",
            "short_description": "Vida en ambientes húmedos o secos.",
            "example_tasks": [
              "Compara adaptaciones de organismos de la selva tropical con los del desierto",
              "Describe cómo anfibios están adaptados a ambientes húmedos",
              "Investiga adaptaciones de plantas para exceso o escasez de agua"
            ]
          }
        ]
      },
      {
        "key": "adaptaciones_alimentacion",
        "name": "Adaptaciones para la Alimentación",
        "short_description": "Estructuras y comportamientos para obtener alimento.",
        "sub_topics": [
          {
            "key": "especializacion_boca",
            "name": "Especialización de Boca y Dientes",
            "short_description": "Estructuras según el tipo de alimento.",
            "example_tasks": [
              "Compara dientes de herbívoros, carnívoros y omnívoros",
              "Describe la especialización del pico de diferentes aves",
              "Investiga adaptaciones bucales de insectos para diferentes dietas"
            ]
          },
          {
            "key": "sistema_digestivo_adaptado",
            "name": "Sistema Digestivo Adaptado",
            "short_description": "Órganos especializados según la dieta.",
            "example_tasks": [
              "Describe el estómago de múltiples cámaras de los rumiantes",
              "Explica adaptaciones digestivas de carnívoros vs herbívoros",
              "Investiga el largo intestino de herbívoros para digerir celulosa"
            ]
          },
          {
            "key": "estrategias_caza",
            "name": "Estrategias de Caza y Recolección",
            "short_description": "Comportamientos para obtener alimento.",
            "example_tasks": [
              "Describe diferentes técnicas de caza (emboscada, persecución, trampas)",
              "Explica cómo algunos animales usan herramientas para obtener alimento",
              "Investiga estrategias cooperativas de obtención de alimento"
            ]
          }
        ]
      },
      {
        "key": "adaptaciones_proteccion",
        "name": "Adaptaciones para la Protección",
        "short_description": "Defensas contra depredadores y peligros.",
        "sub_topics": [
          {
            "key": "camuflaje_cripsis",
            "name": "Camuflaje y Cripsis",
            "short_description": "Adaptaciones para no ser visto.",
            "example_tasks": [
              "Identifica ejemplos de camuflaje en animales mexicanos",
              "Explica cómo el color y patrón ayudan a esconderse",
              "Investiga el camuflaje estacional (cambio de color según la época)"
            ]
          },
          {
            "key": "mimetismo_aposematismo",
            "name": "Mimetismo y Aposematismo",
            "short_description": "Imitar o advertir con colores llamativos.",
            "example_tasks": [
              "Describe el mimetismo batesiano (imitar especies peligrosas)",
              "Explica colores de advertencia en animales venenosos",
              "Investiga ejemplos mexicanos de mimetismo (serpientes coral)"
            ]
          },
          {
            "key": "defensas_fisicas_quimicas",
            "name": "Defensas Físicas y Químicas",
            "short_description": "Espinas, venenos y otras protecciones.",
            "example_tasks": [
              "Identifica defensas físicas (espinas, caparazones, cuernos)",
              "Describe defensas químicas (veneno, toxinas, mal olor)",
              "Investiga la relación entre defensa y coloración de advertencia"
            ]
          }
        ]
      },
      {
        "key": "adaptaciones_reproduccion",
        "name": "Adaptaciones para la Reproducción",
        "short_description": "Estrategias para asegurar descendencia.",
        "sub_topics": [
          {
            "key": "cortejo_apareamiento",
            "name": "Cortejo y Apareamiento",
            "short_description": "Comportamientos para atraer pareja.",
            "example_tasks": [
              "Describe rituales de cortejo en aves (danzas, cantos, plumaje vistoso)",
              "Explica adaptaciones para atraer pareja (colores, olores, sonidos)",
              "Investiga competencia entre machos por hembras"
            ]
          },
          {
            "key": "cuidado_parental",
            "name": "Cuidado Parental",
            "short_description": "Estrategias para proteger y alimentar crías.",
            "example_tasks": [
              "Compara especies con mucho cuidado parental vs poco cuidado",
              "Describe diferentes estrategias de nidificación y protección de huevos",
              "Investiga la relación entre número de crías y nivel de cuidado"
            ]
          },
          {
            "key": "estrategias_reproductivas",
            "name": "Estrategias Reproductivas",
            "short_description": "Cantidad vs calidad de descendencia.",
            "example_tasks": [
              "Compara especies con muchas crías pequeñas vs pocas crías grandes",
              "Explica ventajas y desventajas de diferentes estrategias reproductivas",
              "Investiga relación entre ambiente y estrategia reproductiva"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "cambios_ecosistemas",
    "name": "Cambios en los Ecosistemas",
    "short_description": "Estudio de las transformaciones naturales y causadas por humanos en los ecosistemas, y sus efectos en los seres vivos.",
    "sub_topics": [
      {
        "key": "cambios_naturales",
        "name": "Cambios Naturales",
        "short_description": "Transformaciones que ocurren sin intervención humana.",
        "sub_topics": [
          {
            "key": "sucesion_ecologica",
            "name": "Sucesión Ecológica",
            "short_description": "Cambios graduales en las comunidades de organismos.",
            "example_tasks": [
              "Describe la sucesión primaria en roca desnuda (líquenes, musgos, hierbas, arbustos, árboles)",
              "Explica la sucesión secundaria después de un incendio forestal",
              "Investiga cuánto tiempo toma cada etapa de la sucesión"
            ]
          },
          {
            "key": "eventos_naturales",
            "name": "Eventos Naturales",
            "short_description": "Cambios súbitos por fenómenos naturales.",
            "example_tasks": [
              "Describe cómo un incendio natural afecta un ecosistema",
              "Explica el impacto de inundaciones en ecosistemas ribereños",
              "Investiga cómo los ecosistemas se recuperan de eventos naturales"
            ]
          },
          {
            "key": "cambios_estacionales",
            "name": "Cambios Estacionales",
            "short_description": "Variaciones cíclicas durante el año.",
            "example_tasks": [
              "Describe cómo cambia un bosque entre verano e invierno",
              "Explica adaptaciones de organismos a cambios estacionales",
              "Investiga el ciclo de lluvias en ecosistemas mexicanos"
            ]
          }
        ]
      },
      {
        "key": "perturbaciones_naturales",
        "name": "Perturbaciones Naturales",
        "short_description": "Eventos que alteran temporalmente el ecosistema.",
        "sub_topics": [
          {
            "key": "incendios_forestales",
            "name": "Incendios Forestales",
            "short_description": "Fuego como agente de cambio natural.",
            "example_tasks": [
              "Explica cómo algunos ecosistemas dependen de incendios periódicos",
              "Describe adaptaciones de plantas para sobrevivir incendios (corteza gruesa, semillas resistentes)",
              "Investiga el papel del fuego en renovar nutrientes del suelo"
            ]
          },
          {
            "key": "tormentas_huracanes",
            "name": "Tormentas y Huracanes",
            "short_description": "Impacto de eventos climáticos extremos.",
            "example_tasks": [
              "Describe cómo los huracanes afectan ecosistemas costeros mexicanos",
              "Explica la recuperación de ecosistemas después de tormentas severas",
              "Investiga cómo los manglares protegen las costas de tormentas"
            ]
          },
          {
            "key": "sequias_inundaciones",
            "name": "Sequías e Inundaciones",
            "short_description": "Extremos en disponibilidad de agua.",
            "example_tasks": [
              "Describe el impacto de sequías prolongadas en ecosistemas",
              "Explica cómo las inundaciones transforman paisajes",
              "Investiga adaptaciones de organismos a condiciones extremas de agua"
            ]
          }
        ]
      },
      {
        "key": "cambios_causados_humanos",
        "name": "Cambios Causados por Humanos",
        "short_description": "Transformaciones debido a actividades humanas.",
        "sub_topics": [
          {
            "key": "deforestacion",
            "name": "Deforestación",
            "short_description": "Eliminación de bosques y selvas.",
            "example_tasks": [
              "Describe las causas de la deforestación en México (agricultura, ganadería, urbanización)",
              "Explica consecuencias de la deforestación (pérdida de hábitat, erosión, cambio climático)",
              "Investiga esfuerzos de reforestación en diferentes regiones"
            ]
          },
          {
            "key": "contaminacion_ecosistemas",
            "name": "Contaminación",
            "short_description": "Introducción de sustancias dañinas.",
            "example_tasks": [
              "Describe diferentes tipos de contaminación (agua, aire, suelo)",
              "Explica cómo la contaminación afecta a los organismos en ecosistemas",
              "Investiga ejemplos de contaminación en ecosistemas mexicanos"
            ]
          },
          {
            "key": "urbanizacion_cambio_uso_suelo",
            "name": "Urbanización y Cambio de Uso de Suelo",
            "short_description": "Transformación de hábitats naturales.",
            "example_tasks": [
              "Describe cómo el crecimiento de ciudades afecta ecosistemas",
              "Explica la pérdida de biodiversidad por cambio de uso de suelo",
              "Investiga la fragmentación de hábitats y sus consecuencias"
            ]
          },
          {
            "key": "sobreexplotacion_recursos",
            "name": "Sobreexplotación de Recursos",
            "short_description": "Uso excesivo de recursos naturales.",
            "example_tasks": [
              "Describe ejemplos de sobreexplotación (pesca excesiva, caza, tala)",
              "Explica consecuencias de extraer recursos más rápido de lo que se renuevan",
              "Investiga especies mexicanas afectadas por sobreexplotación"
            ]
          }
        ]
      },
      {
        "key": "resiliencia_ecosistemas",
        "name": "Resiliencia de los Ecosistemas",
        "short_description": "Capacidad de recuperación después de perturbaciones.",
        "sub_topics": [
          {
            "key": "recuperacion_natural",
            "name": "Recuperación Natural",
            "short_description": "Regeneración sin intervención humana.",
            "example_tasks": [
              "Describe cómo un bosque se regenera después de un incendio",
              "Explica factores que influyen en la velocidad de recuperación",
              "Investiga ecosistemas mexicanos con alta resiliencia"
            ]
          },
          {
            "key": "puntos_inflexion",
            "name": "Puntos de Inflexión",
            "short_description": "Cambios irreversibles en ecosistemas.",
            "example_tasks": [
              "Explica qué es un punto de inflexión ecológico",
              "Describe ejemplos de ecosistemas que no pueden recuperarse",
              "Investiga señales de advertencia de degradación irreversible"
            ]
          },
          {
            "key": "restauracion_ecologica",
            "name": "Restauración Ecológica",
            "short_description": "Esfuerzos humanos para ayudar a la recuperación.",
            "example_tasks": [
              "Describe proyectos de restauración ecológica en México",
              "Explica técnicas de restauración (reforestación, reintroducción de especies)",
              "Investiga éxitos y desafíos en restauración de ecosistemas"
            ]
          }
        ]
      },
      {
        "key": "cambio_climatico_ecosistemas",
        "name": "Cambio Climático y Ecosistemas",
        "short_description": "Efectos del calentamiento global en los ecosistemas.",
        "sub_topics": [
          {
            "key": "efectos_temperatura",
            "name": "Efectos del Aumento de Temperatura",
            "short_description": "Impacto del calentamiento en organismos.",
            "example_tasks": [
              "Describe cómo el aumento de temperatura afecta ecosistemas mexicanos",
              "Explica el blanqueamiento de corales por temperaturas elevadas",
              "Investiga cambios en distribución de especies por cambio climático"
            ]
          },
          {
            "key": "cambios_precipitacion",
            "name": "Cambios en Patrones de Precipitación",
            "short_description": "Alteración de lluvias y sequías.",
            "example_tasks": [
              "Describe cómo cambios en lluvia afectan ecosistemas",
              "Explica el impacto de sequías más frecuentes e intensas",
              "Investiga efectos en agricultura y ecosistemas naturales"
            ]
          },
          {
            "key": "adaptacion_mitigacion",
            "name": "Adaptación y Mitigación",
            "short_description": "Respuestas al cambio climático.",
            "example_tasks": [
              "Describe estrategias de organismos para adaptarse al cambio climático",
              "Explica acciones humanas para mitigar el cambio climático",
              "Investiga el papel de ecosistemas en capturar carbono"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "nutricion_seres_vivos",
    "name": "Nutrición en los Seres Vivos",
    "short_description": "Estudio de cómo los diferentes organismos obtienen y procesan nutrientes para obtener energía y materiales para vivir.",
    "sub_topics": [
      {
        "key": "nutricion_autotrofa",
        "name": "Nutrición Autótrofa",
        "short_description": "Organismos que producen su propio alimento.",
        "sub_topics": [
          {
            "key": "fotosintesis_proceso",
            "name": "Fotosíntesis",
            "short_description": "Producción de alimento usando luz solar.",
            "example_tasks": [
              "Describe la ecuación básica de la fotosíntesis (luz + CO₂ + H₂O → glucosa + O₂)",
              "Explica el papel de la clorofila en capturar energía luminosa",
              "Investiga dónde ocurre la fotosíntesis en las células vegetales (cloroplastos)"
            ]
          },
          {
            "key": "quimiosintesis",
            "name": "Quimiosíntesis",
            "short_description": "Producción de alimento usando energía química.",
            "example_tasks": [
              "Explica qué es la quimiosíntesis y en qué se diferencia de la fotosíntesis",
              "Describe organismos que realizan quimiosíntesis (bacterias en fuentes hidrotermales)",
              "Investiga ambientes extremos donde ocurre quimiosíntesis"
            ]
          },
          {
            "key": "importancia_autotrofos",
            "name": "Importancia de los Autótrofos",
            "short_description": "Base de las cadenas alimentarias.",
            "example_tasks": [
              "Explica por qué los autótrofos son llamados productores primarios",
              "Describe cómo los autótrofos sostienen toda la vida en la Tierra",
              "Investiga la relación entre autótrofos y el oxígeno atmosférico"
            ]
          }
        ]
      },
      {
        "key": "nutricion_heterotrofa",
        "name": "Nutrición Heterótrofa",
        "short_description": "Organismos que obtienen alimento de otros seres vivos.",
        "sub_topics": [
          {
            "key": "herbivoros_nutricion",
            "name": "Herbívoros",
            "short_description": "Animales que se alimentan de plantas.",
            "example_tasks": [
              "Describe adaptaciones digestivas de herbívoros (dientes, estómagos especializados)",
              "Explica cómo los herbívoros descomponen la celulosa de las plantas",
              "Investiga la relación entre herbívoros y microorganismos en su sistema digestivo"
            ]
          },
          {
            "key": "carnivoros_nutricion",
            "name": "Carnívoros",
            "short_description": "Animales que se alimentan de otros animales.",
            "example_tasks": [
              "Describe adaptaciones de carnívoros para cazar y digerir carne",
              "Compara el sistema digestivo de carnívoros con el de herbívoros",
              "Investiga diferentes estrategias de obtención de presas"
            ]
          },
          {
            "key": "descomponedores_nutricion",
            "name": "Descomponedores",
            "short_description": "Organismos que se alimentan de materia muerta.",
            "example_tasks": [
              "Explica cómo hongos y bacterias obtienen nutrientes de materia orgánica muerta",
              "Describe el proceso de descomposición paso a paso",
              "Investiga enzimas que los descomponedores secretan para degradar materia orgánica"
            ]
          },
          {
            "key": "parasitos_nutricion",
            "name": "Parásitos",
            "short_description": "Organismos que obtienen nutrientes de un hospedero vivo.",
            "example_tasks": [
              "Describe cómo los parásitos obtienen nutrientes sin matar inmediatamente al hospedero",
              "Compara parásitos externos (garrapatas) con parásitos internos (lombrices)",
              "Investiga adaptaciones de parásitos para vivir en o sobre sus hospederos"
            ]
          }
        ]
      },
      {
        "key": "digestion_absorcion",
        "name": "Digestión y Absorción",
        "short_description": "Procesamiento de alimentos en diferentes organismos.",
        "sub_topics": [
          {
            "key": "digestion_intracelular",
            "name": "Digestión Intracelular",
            "short_description": "Digestión dentro de las células.",
            "example_tasks": [
              "Describe cómo organismos unicelulares digieren alimento dentro de sus células",
              "Explica el papel de vacuolas digestivas en protozoarios",
              "Investiga la fagocitosis como mecanismo de alimentación"
            ]
          },
          {
            "key": "digestion_extracelular",
            "name": "Digestión Extracelular",
            "short_description": "Digestión fuera de las células.",
            "example_tasks": [
              "Describe la digestión en el sistema digestivo de animales complejos",
              "Explica cómo los hongos digieren alimento externamente",
              "Investiga el papel de enzimas digestivas en descomponer macromoléculas"
            ]
          },
          {
            "key": "absorcion_nutrientes",
            "name": "Absorción de Nutrientes",
            "short_description": "Paso de nutrientes a células y tejidos.",
            "example_tasks": [
              "Describe cómo los nutrientes pasan del intestino a la sangre",
              "Explica la absorción de nutrientes en plantas (raíces)",
              "Investiga estructuras especializadas para aumentar la absorción (vellosidades, pelos radicales)"
            ]
          }
        ]
      },
      {
        "key": "metabolismo_basico",
        "name": "Metabolismo Básico",
        "short_description": "Uso de nutrientes para energía y crecimiento.",
        "sub_topics": [
          {
            "key": "catabolismo",
            "name": "Catabolismo",
            "short_description": "Descomposición de moléculas para obtener energía.",
            "example_tasks": [
              "Explica qué es el catabolismo y por qué es necesario",
              "Describe cómo se descomponen los azúcares para liberar energía",
              "Investiga la relación entre catabolismo y respiración celular"
            ]
          },
          {
            "key": "anabolismo",
            "name": "Anabolismo",
            "short_description": "Construcción de moléculas complejas.",
            "example_tasks": [
              "Explica qué es el anabolismo y da ejemplos (síntesis de proteínas)",
              "Describe cómo los organismos usan nutrientes para crecer",
              "Investiga la relación entre anabolismo y crecimiento"
            ]
          },
          {
            "key": "energia_atp",
            "name": "Energía y ATP",
            "short_description": "Moneda energética de las células.",
            "example_tasks": [
              "Explica qué es el ATP y por qué es importante",
              "Describe cómo las células usan ATP para realizar trabajo",
              "Investiga cómo se produce ATP en las células"
            ]
          }
        ]
      },
      {
        "key": "necesidades_nutricionales",
        "name": "Necesidades Nutricionales",
        "short_description": "Nutrientes esenciales para diferentes organismos.",
        "sub_topics": [
          {
            "key": "macronutrientes",
            "name": "Macronutrientes",
            "short_description": "Nutrientes necesarios en grandes cantidades.",
            "example_tasks": [
              "Identifica macronutrientes: carbohidratos, proteínas, lípidos",
              "Explica la función de cada tipo de macronutriente",
              "Investiga fuentes de macronutrientes en diferentes dietas"
            ]
          },
          {
            "key": "micronutrientes",
            "name": "Micronutrientes",
            "short_description": "Vitaminas y minerales necesarios en pequeñas cantidades.",
            "example_tasks": [
              "Describe la importancia de vitaminas y minerales",
              "Explica problemas causados por deficiencia de micronutrientes",
              "Investiga fuentes naturales de vitaminas y minerales"
            ]
          },
          {
            "key": "agua_nutriente",
            "name": "Agua como Nutriente Esencial",
            "short_description": "Importancia del agua para todos los procesos vitales.",
            "example_tasks": [
              "Explica por qué el agua es el nutriente más importante",
              "Describe funciones del agua en los organismos (transporte, reacciones químicas)",
              "Investiga cómo diferentes organismos obtienen y conservan agua"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "respiracion_seres_vivos",
    "name": "Respiración en Seres Vivos",
    "short_description": "Estudio de los procesos mediante los cuales los organismos obtienen oxígeno y liberan dióxido de carbono, y cómo obtienen energía de los nutrientes.",
    "sub_topics": [
      {
        "key": "respiracion_celular",
        "name": "Respiración Celular",
        "short_description": "Proceso de obtención de energía en las células.",
        "sub_topics": [
          {
            "key": "concepto_respiracion_celular",
            "name": "Concepto de Respiración Celular",
            "short_description": "Liberación de energía de los nutrientes.",
            "example_tasks": [
              "Explica la ecuación básica de la respiración celular (glucosa + O₂ → CO₂ + H₂O + energía)",
              "Describe dónde ocurre la respiración celular en las células (mitocondrias)",
              "Investiga por qué todos los seres vivos necesitan realizar respiración celular"
            ]
          },
          {
            "key": "respiracion_aerobica",
            "name": "Respiración Aeróbica",
            "short_description": "Respiración que requiere oxígeno.",
            "example_tasks": [
              "Describe el proceso de respiración aeróbica paso a paso",
              "Explica por qué la respiración aeróbica produce más energía",
              "Investiga organismos que dependen completamente del oxígeno"
            ]
          },
          {
            "key": "respiracion_anaerobica",
            "name": "Respiración Anaeróbica y Fermentación",
            "short_description": "Obtención de energía sin oxígeno.",
            "example_tasks": [
              "Explica qué es la fermentación y cuándo ocurre",
              "Describe la fermentación láctica en músculos durante ejercicio intenso",
              "Investiga la fermentación alcohólica en levaduras y su uso en alimentos"
            ]
          }
        ]
      },
      {
        "key": "intercambio_gaseoso",
        "name": "Intercambio Gaseoso",
        "short_description": "Cómo los organismos obtienen oxígeno del ambiente.",
        "sub_topics": [
          {
            "key": "difusion_gases",
            "name": "Difusión de Gases",
            "short_description": "Movimiento de oxígeno y dióxido de carbono.",
            "example_tasks": [
              "Explica cómo los gases se mueven de áreas de alta a baja concentración",
              "Describe el intercambio de gases en los alvéolos pulmonares",
              "Investiga factores que afectan la velocidad de difusión"
            ]
          },
          {
            "key": "superficie_intercambio",
            "name": "Superficies de Intercambio",
            "short_description": "Estructuras especializadas para el intercambio.",
            "example_tasks": [
              "Compara diferentes superficies de intercambio (pulmones, branquias, piel, tráqueas)",
              "Explica características comunes de superficies de intercambio (grande, húmeda, delgada)",
              "Investiga adaptaciones para aumentar el área de intercambio"
            ]
          }
        ]
      },
      {
        "key": "sistemas_respiratorios",
        "name": "Sistemas Respiratorios",
        "short_description": "Diferentes estructuras para la respiración en animales.",
        "sub_topics": [
          {
            "key": "respiracion_cutanea",
            "name": "Respiración Cutánea",
            "short_description": "Intercambio de gases a través de la piel.",
            "example_tasks": [
              "Describe cómo anfibios y lombrices respiran a través de su piel",
              "Explica por qué la piel debe estar húmeda para este tipo de respiración",
              "Investiga limitaciones de la respiración cutánea"
            ]
          },
          {
            "key": "branquias",
            "name": "Branquias",
            "short_description": "Órganos respiratorios de animales acuáticos.",
            "example_tasks": [
              "Describe la estructura y función de las branquias en peces",
              "Explica cómo las branquias extraen oxígeno disuelto en el agua",
              "Investiga adaptaciones de branquias en diferentes animales acuáticos"
            ]
          },
          {
            "key": "traqueas_insectos",
            "name": "Tráqueas en Insectos",
            "short_description": "Sistema de tubos para llevar aire directamente a células.",
            "example_tasks": [
              "Describe el sistema traqueal de los insectos",
              "Explica cómo el aire entra por espiráculos y llega a las células",
              "Investiga por qué este sistema limita el tamaño de los insectos"
            ]
          },
          {
            "key": "pulmones",
            "name": "Pulmones",
            "short_description": "Órganos respiratorios de vertebrados terrestres.",
            "example_tasks": [
              "Compara pulmones simples de anfibios con pulmones complejos de mamíferos",
              "Describe la estructura interna de los pulmones humanos",
              "Investiga adaptaciones de pulmones en aves para el vuelo"
            ]
          }
        ]
      },
      {
        "key": "respiracion_plantas",
        "name": "Respiración en Plantas",
        "short_description": "Intercambio de gases en organismos fotosintéticos.",
        "sub_topics": [
          {
            "key": "estomas",
            "name": "Estomas",
            "short_description": "Poros en las hojas para intercambio de gases.",
            "example_tasks": [
              "Describe la estructura de los estomas y células guarda",
              "Explica cómo se abren y cierran los estomas",
              "Investiga la regulación de estomas para equilibrar fotosíntesis y pérdida de agua"
            ]
          },
          {
            "key": "lenticelas",
            "name": "Lenticelas",
            "short_description": "Poros en tallos leñosos.",
            "example_tasks": [
              "Describe qué son las lenticelas y dónde se encuentran",
              "Explica cómo las lenticelas permiten respiración en tallos y raíces",
              "Investiga la importancia de lenticelas en árboles"
            ]
          },
          {
            "key": "dia_noche_plantas",
            "name": "Respiración Día y Noche",
            "short_description": "Balance entre fotosíntesis y respiración.",
            "example_tasks": [
              "Explica qué gases intercambian las plantas durante el día vs la noche",
              "Describe por qué las plantas realizan respiración celular constantemente",
              "Investiga el balance neto de oxígeno producido por plantas"
            ]
          }
        ]
      },
      {
        "key": "adaptaciones_respiratorias",
        "name": "Adaptaciones Respiratorias",
        "short_description": "Características especiales según el ambiente.",
        "sub_topics": [
          {
            "key": "altitud",
            "name": "Adaptaciones a la Altitud",
            "short_description": "Respiración en lugares con poco oxígeno.",
            "example_tasks": [
              "Describe adaptaciones de personas que viven en montañas altas",
              "Explica cómo algunos animales tienen más glóbulos rojos en altitud",
              "Investiga la capacidad pulmonar aumentada en poblaciones de altura"
            ]
          },
          {
            "key": "buceo",
            "name": "Adaptaciones para Buceo",
            "short_description": "Organismos que pasan tiempo bajo el agua.",
            "example_tasks": [
              "Describe cómo mamíferos marinos (ballenas, focas) almacenan oxígeno",
              "Explica adaptaciones para buceos prolongados (bradicardia, redistribución de sangre)",
              "Investiga el récord de apnea en diferentes animales"
            ]
          },
          {
            "key": "ambientes_extremos",
            "name": "Ambientes con Oxígeno Limitado",
            "short_description": "Respiración en condiciones difíciles.",
            "example_tasks": [
              "Describe cómo algunos peces viven en aguas con poco oxígeno",
              "Explica adaptaciones de organismos en ambientes anaeróbicos",
              "Investiga la respiración en animales que hibernan"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "reproduccion_sexual_asexual",
    "name": "Reproducción Sexual y Asexual",
    "short_description": "Estudio de los diferentes métodos de reproducción en los seres vivos y sus ventajas evolutivas.",
    "sub_topics": [
      {
        "key": "reproduccion_asexual",
        "name": "Reproducción Asexual",
        "short_description": "Producción de descendencia sin fusión de gametos.",
        "sub_topics": [
          {
            "key": "division_binaria",
            "name": "División Binaria",
            "short_description": "División de un organismo en dos idénticos.",
            "example_tasks": [
              "Describe cómo las bacterias se reproducen por división binaria",
              "Explica por qué la descendencia es genéticamente idéntica al progenitor",
              "Investiga la velocidad de reproducción de bacterias bajo condiciones ideales"
            ]
          },
          {
            "key": "gemacion",
            "name": "Gemación",
            "short_description": "Formación de un nuevo organismo a partir de una yema.",
            "example_tasks": [
              "Describe la reproducción por gemación en levaduras",
              "Explica cómo las hidras producen descendencia por gemación",
              "Investiga ejemplos de gemación en plantas y animales"
            ]
          },
          {
            "key": "fragmentacion_regeneracion",
            "name": "Fragmentación y Regeneración",
            "short_description": "Formación de nuevos organismos a partir de fragmentos.",
            "example_tasks": [
              "Describe cómo las estrellas de mar se regeneran a partir de fragmentos",
              "Explica la reproducción vegetativa en plantas (estolones, rizomas, tubérculos)",
              "Investiga la capacidad regenerativa de diferentes organismos"
            ]
          },
          {
            "key": "esporulacion",
            "name": "Esporulación",
            "short_description": "Producción de esporas resistentes.",
            "example_tasks": [
              "Describe cómo los hongos producen esporas",
              "Explica las ventajas de las esporas para dispersión",
              "Investiga la esporulación en helechos y musgos"
            ]
          }
        ]
      },
      {
        "key": "reproduccion_sexual",
        "name": "Reproducción Sexual",
        "short_description": "Producción de descendencia mediante fusión de gametos.",
        "sub_topics": [
          {
            "key": "gametos",
            "name": "Gametos",
            "short_description": "Células reproductoras especializadas.",
            "example_tasks": [
              "Describe las diferencias entre gametos masculinos y femeninos",
              "Explica cómo se forman los gametos mediante meiosis",
              "Investiga por qué los gametos tienen la mitad de cromosomas que las células normales"
            ]
          },
          {
            "key": "fecundacion",
            "name": "Fecundación",
            "short_description": "Unión de gametos para formar un cigoto.",
            "example_tasks": [
              "Describe el proceso de fecundación paso a paso",
              "Compara fecundación externa (peces, anfibios) con fecundación interna (mamíferos, aves)",
              "Investiga adaptaciones para asegurar la fecundación exitosa"
            ]
          },
          {
            "key": "variabilidad_genetica",
            "name": "Variabilidad Genética",
            "short_description": "Ventaja principal de la reproducción sexual.",
            "example_tasks": [
              "Explica por qué la descendencia sexual es diferente a sus padres",
              "Describe cómo la variabilidad genética ayuda a las especies a adaptarse",
              "Investiga el papel de la reproducción sexual en la evolución"
            ]
          }
        ]
      },
      {
        "key": "reproduccion_plantas_flores",
        "name": "Reproducción en Plantas con Flores",
        "short_description": "Proceso sexual en angiospermas.",
        "sub_topics": [
          {
            "key": "partes_flor_reproduccion",
            "name": "Partes de la Flor",
            "short_description": "Estructuras reproductivas.",
            "example_tasks": [
              "Identifica partes masculinas (estambres, anteras, polen) y femeninas (pistilo, ovario, óvulos)",
              "Describe la función de cada parte en la reproducción",
              "Investiga flores con diferentes arreglos de partes reproductivas"
            ]
          },
          {
            "key": "polinizacion_tipos",
            "name": "Polinización",
            "short_description": "Transferencia de polen.",
            "example_tasks": [
              "Compara polinización por insectos, aves, viento y agua",
              "Describe adaptaciones de flores para atraer polinizadores específicos",
              "Investiga la importancia de los polinizadores para la agricultura"
            ]
          },
          {
            "key": "formacion_semilla_fruto",
            "name": "Formación de Semillas y Frutos",
            "short_description": "Desarrollo después de la fecundación.",
            "example_tasks": [
              "Describe cómo se desarrolla una semilla a partir del óvulo fecundado",
              "Explica cómo el ovario se transforma en fruto",
              "Investiga diferentes tipos de frutos y su relación con la dispersión de semillas"
            ]
          }
        ]
      },
      {
        "key": "reproduccion_animales",
        "name": "Reproducción en Animales",
        "short_description": "Diversidad de estrategias reproductivas.",
        "sub_topics": [
          {
            "key": "oviparos",
            "name": "Animales Ovíparos",
            "short_description": "Desarrollo en huevos fuera del cuerpo materno.",
            "example_tasks": [
              "Identifica animales ovíparos (aves, reptiles, peces, insectos)",
              "Describe ventajas y desventajas de poner huevos",
              "Investiga diferentes tipos de huevos y cuidado parental"
            ]
          },
          {
            "key": "viviparos",
            "name": "Animales Vivíparos",
            "short_description": "Desarrollo dentro del cuerpo materno.",
            "example_tasks": [
              "Describe el desarrollo embrionario en mamíferos",
              "Explica cómo el embrión recibe nutrientes de la madre",
              "Investiga la duración de la gestación en diferentes mamíferos"
            ]
          },
          {
            "key": "ovoviviparos",
            "name": "Animales Ovovivíparos",
            "short_description": "Huevos que se desarrollan dentro del cuerpo materno.",
            "example_tasks": [
              "Describe qué es la ovoviviparidad y da ejemplos (algunos tiburones, serpientes)",
              "Compara ovoviviparidad con oviparidad y viviparidad",
              "Investiga ventajas de este tipo de reproducción"
            ]
          }
        ]
      },
      {
        "key": "comparacion_estrategias",
        "name": "Comparación de Estrategias Reproductivas",
        "short_description": "Ventajas y desventajas de cada tipo.",
        "sub_topics": [
          {
            "key": "ventajas_asexual",
            "name": "Ventajas de la Reproducción Asexual",
            "short_description": "Rapidez y eficiencia.",
            "example_tasks": [
              "Explica por qué la reproducción asexual es más rápida",
              "Describe situaciones donde la reproducción asexual es ventajosa",
              "Investiga organismos que solo se reproducen asexualmente"
            ]
          },
          {
            "key": "ventajas_sexual",
            "name": "Ventajas de la Reproducción Sexual",
            "short_description": "Variabilidad y adaptación.",
            "example_tasks": [
              "Explica cómo la variabilidad genética ayuda en la supervivencia",
              "Describe por qué la reproducción sexual favorece la evolución",
              "Investiga el costo energético de la reproducción sexual"
            ]
          },
          {
            "key": "organismos_ambas",
            "name": "Organismos con Ambos Tipos",
            "short_description": "Flexibilidad reproductiva.",
            "example_tasks": [
              "Identifica organismos que pueden reproducirse sexual y asexualmente",
              "Explica cuándo usan cada tipo de reproducción",
              "Investiga ventajas de tener ambas opciones reproductivas"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "crecimiento_desarrollo_organismos",
    "name": "Crecimiento y Desarrollo",
    "short_description": "Estudio de los cambios que experimentan los organismos desde su formación hasta la madurez, incluyendo metamorfosis y ciclos de vida.",
    "sub_topics": [
      {
        "key": "crecimiento_organismos",
        "name": "Crecimiento",
        "short_description": "Aumento de tamaño y masa de los organismos.",
        "sub_topics": [
          {
            "key": "crecimiento_celular",
            "name": "Crecimiento por División Celular",
            "short_description": "Multiplicación de células.",
            "example_tasks": [
              "Explica cómo el crecimiento requiere división celular (mitosis)",
              "Describe la relación entre división celular y crecimiento de tejidos",
              "Investiga por qué las células no crecen indefinidamente"
            ]
          },
          {
            "key": "factores_crecimiento",
            "name": "Factores que Afectan el Crecimiento",
            "short_description": "Nutrición, ambiente y genética.",
            "example_tasks": [
              "Describe cómo la nutrición afecta el crecimiento",
              "Explica el papel de hormonas en el crecimiento (hormona de crecimiento)",
              "Investiga cómo factores ambientales (luz, temperatura) afectan el crecimiento de plantas"
            ]
          },
          {
            "key": "patrones_crecimiento",
            "name": "Patrones de Crecimiento",
            "short_description": "Crecimiento continuo vs intermitente.",
            "example_tasks": [
              "Compara el crecimiento continuo de mamíferos con el crecimiento por mudas de artrópodos",
              "Describe curvas de crecimiento en diferentes organismos",
              "Investiga períodos de crecimiento rápido en humanos (infancia, adolescencia)"
            ]
          }
        ]
      },
      {
        "key": "desarrollo_embrionario",
        "name": "Desarrollo Embrionario",
        "short_description": "Formación del organismo desde el cigoto.",
        "sub_topics": [
          {
            "key": "segmentacion",
            "name": "Segmentación",
            "short_description": "Primeras divisiones celulares.",
            "example_tasks": [
              "Describe las primeras divisiones del cigoto",
              "Explica cómo una célula se convierte en muchas células",
              "Investiga la formación de la mórula y blástula"
            ]
          },
          {
            "key": "diferenciacion_celular",
            "name": "Diferenciación Celular",
            "short_description": "Especialización de células.",
            "example_tasks": [
              "Explica cómo células idénticas se convierten en diferentes tipos (músculo, nervio, piel)",
              "Describe qué es la diferenciación celular",
              "Investiga cómo se forman diferentes órganos y tejidos"
            ]
          },
          {
            "key": "desarrollo_organos",
            "name": "Desarrollo de Órganos",
            "short_description": "Formación de estructuras complejas.",
            "example_tasks": [
              "Describe etapas básicas del desarrollo embrionario",
              "Explica cómo se forman los principales sistemas del cuerpo",
              "Investiga la importancia del desarrollo prenatal en humanos"
            ]
          }
        ]
      },
      {
        "key": "metamorfosis",
        "name": "Metamorfosis",
        "short_description": "Transformación dramática durante el desarrollo.",
        "sub_topics": [
          {
            "key": "metamorfosis_completa_insectos",
            "name": "Metamorfosis Completa",
            "short_description": "Transformación con cuatro etapas distintas.",
            "example_tasks": [
              "Describe las cuatro etapas: huevo, larva, pupa, adulto",
              "Compara la metamorfosis de mariposas, escarabajos y moscas",
              "Investiga adaptaciones de cada etapa a diferentes nichos ecológicos"
            ]
          },
          {
            "key": "metamorfosis_incompleta_insectos",
            "name": "Metamorfosis Incompleta",
            "short_description": "Transformación gradual sin etapa de pupa.",
            "example_tasks": [
              "Describe las tres etapas: huevo, ninfa, adulto",
              "Compara metamorfosis incompleta de saltamontes y libélulas",
              "Investiga diferencias entre ninfas y adultos"
            ]
          },
          {
            "key": "metamorfosis_anfibios",
            "name": "Metamorfosis en Anfibios",
            "short_description": "Transformación de vida acuática a terrestre.",
            "example_tasks": [
              "Describe la metamorfosis de renacuajo a rana",
              "Explica cambios anatómicos (pérdida de cola, desarrollo de patas, cambio de branquias a pulmones)",
              "Investiga adaptaciones en cada etapa del desarrollo"
            ]
          }
        ]
      },
      {
        "key": "ciclos_vida",
        "name": "Ciclos de Vida",
        "short_description": "Secuencia completa desde el nacimiento hasta la reproducción.",
        "sub_topics": [
          {
            "key": "ciclo_vida_plantas",
            "name": "Ciclos de Vida en Plantas",
            "short_description": "Alternancia de generaciones.",
            "example_tasks": [
              "Describe el ciclo de vida de una planta con flores (germinación, crecimiento, floración, producción de semillas)",
              "Explica el concepto de alternancia de generaciones en helechos",
              "Investiga ciclos de vida anuales, bianuales y perennes"
            ]
          },
          {
            "key": "ciclo_vida_animales",
            "name": "Ciclos de Vida en Animales",
            "short_description": "Etapas de desarrollo animal.",
            "example_tasks": [
              "Compara ciclos de vida simples (mamíferos) con complejos (mariposas)",
              "Describe etapas de vida: juvenil, adolescente, adulto, senescencia",
              "Investiga animales con ciclos de vida únicos (salmón, anguila)"
            ]
          },
          {
            "key": "longevidad",
            "name": "Longevidad y Esperanza de Vida",
            "short_description": "Duración de vida en diferentes especies.",
            "example_tasks": [
              "Compara la esperanza de vida de diferentes organismos (insecto: semanas, elefante: 70 años, tortuga: 100+ años)",
              "Explica factores que determinan la longevidad",
              "Investiga el organismo con la vida más larga conocida"
            ]
          }
        ]
      },
      {
        "key": "maduracion_reproduccion",
        "name": "Maduración y Reproducción",
        "short_description": "Alcanzar la capacidad reproductiva.",
        "sub_topics": [
          {
            "key": "maduracion_sexual",
            "name": "Maduración Sexual",
            "short_description": "Desarrollo de capacidad reproductiva.",
            "example_tasks": [
              "Describe qué significa alcanzar la madurez sexual",
              "Compara la edad de madurez sexual en diferentes animales",
              "Investiga señales de madurez sexual en diferentes especies"
            ]
          },
          {
            "key": "periodo_reproductivo",
            "name": "Período Reproductivo",
            "short_description": "Etapa de vida dedicada a la reproducción.",
            "example_tasks": [
              "Describe estrategias reproductivas (reproducción única vs múltiple)",
              "Explica animales que se reproducen solo una vez en su vida (salmón)",
              "Investiga la duración del período reproductivo en diferentes especies"
            ]
          },
          {
            "key": "senescencia",
            "name": "Senescencia",
            "short_description": "Envejecimiento y final de la vida.",
            "example_tasks": [
              "Describe cambios que ocurren durante el envejecimiento",
              "Explica por qué los organismos envejecen",
              "Investiga especies con envejecimiento despreciable"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "herencia_variacion",
    "name": "Herencia y Variación",
    "short_description": "Introducción básica a cómo las características se transmiten de padres a hijos y por qué los individuos son diferentes.",
    "sub_topics": [
      {
        "key": "caracteristicas_heredadas",
        "name": "Características Heredadas",
        "short_description": "Rasgos que se transmiten de generación en generación.",
        "sub_topics": [
          {
            "key": "rasgos_observables",
            "name": "Rasgos Observables",
            "short_description": "Características que podemos ver.",
            "example_tasks": [
              "Identifica características heredadas en tu familia (color de ojos, tipo de cabello, forma de nariz)",
              "Compara características entre padres e hijos (humanos, mascotas, plantas)",
              "Investiga rasgos que se transmiten de generación en generación"
            ]
          },
          {
            "key": "semejanza_padres_hijos",
            "name": "Semejanza entre Padres e Hijos",
            "short_description": "Por qué nos parecemos a nuestros padres.",
            "example_tasks": [
              "Describe por qué los hijos se parecen a sus padres",
              "Explica que heredamos características de ambos padres",
              "Investiga por qué hermanos pueden ser diferentes entre sí"
            ]
          },
          {
            "key": "herencia_plantas_animales",
            "name": "Herencia en Plantas y Animales",
            "short_description": "Transmisión de características en diferentes organismos.",
            "example_tasks": [
              "Observa cómo plantas hijas se parecen a la planta madre",
              "Describe la herencia de color de pelaje en animales domésticos",
              "Investiga razas de perros o variedades de maíz y sus características heredadas"
            ]
          }
        ]
      },
      {
        "key": "variacion_poblaciones",
        "name": "Variación en las Poblaciones",
        "short_description": "Diferencias entre individuos de la misma especie.",
        "sub_topics": [
          {
            "key": "variacion_observable",
            "name": "Variación Observable",
            "short_description": "Diferencias que podemos ver entre individuos.",
            "example_tasks": [
              "Observa variación en tu salón de clases (altura, color de cabello, forma de cara)",
              "Describe variación en una población de plantas (tamaño, color de flores)",
              "Investiga cómo ningún individuo es exactamente igual a otro"
            ]
          },
          {
            "key": "fuentes_variacion",
            "name": "Fuentes de Variación",
            "short_description": "De dónde vienen las diferencias.",
            "example_tasks": [
              "Explica que la variación viene de heredar diferentes combinaciones de características",
              "Describe cómo el ambiente puede influir en algunas características (nutrición afecta altura)",
              "Investiga la combinación de herencia y ambiente en determinar características"
            ]
          },
          {
            "key": "importancia_variacion",
            "name": "Importancia de la Variación",
            "short_description": "Por qué la diversidad es beneficiosa.",
            "example_tasks": [
              "Explica por qué es bueno que los individuos sean diferentes",
              "Describe cómo la variación ayuda a las especies a sobrevivir cambios",
              "Investiga ejemplos de variación que ayuda a la supervivencia"
            ]
          }
        ]
      },
      {
        "key": "introduccion_genetica",
        "name": "Introducción a la Genética",
        "short_description": "Conceptos básicos de herencia biológica.",
        "sub_topics": [
          {
            "key": "genes_basico",
            "name": "Concepto Básico de Genes",
            "short_description": "Unidades de herencia.",
            "example_tasks": [
              "Explica en términos simples qué es un gen",
              "Describe que los genes contienen información sobre características",
              "Investiga que heredamos genes de ambos padres"
            ]
          },
          {
            "key": "cromosomas_basico",
            "name": "Concepto Básico de Cromosomas",
            "short_description": "Estructuras que contienen genes.",
            "example_tasks": [
              "Explica que los cromosomas son como 'paquetes' de información hereditaria",
              "Describe que las células contienen cromosomas",
              "Investiga que heredamos la mitad de cromosomas de cada padre"
            ]
          },
          {
            "key": "adn_basico",
            "name": "Introducción al ADN",
            "short_description": "Molécula que contiene información genética.",
            "example_tasks": [
              "Explica en términos simples qué es el ADN",
              "Describe que el ADN contiene las 'instrucciones' para nuestras características",
              "Investiga que todas las células del cuerpo tienen el mismo ADN"
            ]
          }
        ]
      },
      {
        "key": "rasgos_dominantes_recesivos",
        "name": "Rasgos Dominantes y Recesivos (Básico)",
        "short_description": "Introducción simple a la expresión de características.",
        "sub_topics": [
          {
            "key": "rasgos_dominantes",
            "name": "Rasgos Dominantes",
            "short_description": "Características que se expresan más comúnmente.",
            "example_tasks": [
              "Describe ejemplos simples de rasgos dominantes (ojos oscuros)",
              "Explica que algunos rasgos se ven más frecuentemente",
              "Investiga rasgos dominantes comunes en humanos"
            ]
          },
          {
            "key": "rasgos_recesivos",
            "name": "Rasgos Recesivos",
            "short_description": "Características que pueden 'saltarse' generaciones.",
            "example_tasks": [
              "Describe ejemplos de rasgos recesivos (ojos claros, cabello rojo)",
              "Explica que algunos rasgos pueden aparecer en nietos aunque no en padres",
              "Investiga por qué dos padres de ojos oscuros pueden tener un hijo de ojos claros"
            ]
          }
        ]
      },
      {
        "key": "seleccion_artificial",
        "name": "Selección Artificial",
        "short_description": "Cómo los humanos han modificado especies.",
        "sub_topics": [
          {
            "key": "domesticacion",
            "name": "Domesticación de Plantas y Animales",
            "short_description": "Selección de características deseables.",
            "example_tasks": [
              "Describe cómo se desarrollaron diferentes razas de perros a partir de lobos",
              "Explica cómo el maíz moderno fue seleccionado del teosinte",
              "Investiga el proceso de crear nuevas variedades de plantas cultivadas"
            ]
          },
          {
            "key": "mejoramiento_genetico",
            "name": "Mejoramiento Genético",
            "short_description": "Crear variedades con características específicas.",
            "example_tasks": [
              "Describe cómo los agricultores seleccionan semillas de las mejores plantas",
              "Explica el cruzamiento selectivo en animales de granja",
              "Investiga variedades mejoradas de cultivos mexicanos (maíz, frijol, chile)"
            ]
          },
          {
            "key": "comparacion_seleccion_natural",
            "name": "Diferencia con Selección Natural",
            "short_description": "Selección humana vs natural.",
            "example_tasks": [
              "Compara cómo los humanos seleccionan vs cómo la naturaleza 'selecciona'",
              "Explica que en la naturaleza sobreviven los más adaptados",
              "Investiga ejemplos de selección natural en acción"
            ]
          }
        ]
      }
    ]
  },

  {
    "key": "salud_higiene",
    "name": "Salud e Higiene",
    "short_description": "Prácticas y hábitos para mantener la salud, prevenir enfermedades y promover el bienestar físico y mental.",
    "sub_topics": [
      {
        "key": "concepto_salud",
        "name": "Concepto de Salud",
        "short_description": "Bienestar físico, mental y social.",
        "sub_topics": [
          {
            "key": "salud_integral",
            "name": "Salud Integral",
            "short_description": "Más que ausencia de enfermedad.",
            "example_tasks": [
              "Explica qué significa estar saludable en cuerpo, mente y relaciones sociales",
              "Describe factores que contribuyen al bienestar integral",
              "Investiga la definición de salud de la Organización Mundial de la Salud"
            ]
          },
          {
            "key": "factores_salud",
            "name": "Factores que Afectan la Salud",
            "short_description": "Alimentación, ejercicio, sueño, ambiente.",
            "example_tasks": [
              "Identifica cinco factores importantes para mantener la salud",
              "Describe cómo tus hábitos diarios afectan tu salud",
              "Investiga la relación entre estilo de vida y enfermedades crónicas"
            ]
          },
          {
            "key": "responsabilidad_salud",
            "name": "Responsabilidad Personal en la Salud",
            "short_description": "Decisiones que afectan nuestro bienestar.",
            "example_tasks": [
              "Describe decisiones diarias que afectan tu salud",
              "Explica por qué es importante cuidar tu salud desde la niñez",
              "Investiga hábitos saludables que puedes adoptar ahora"
            ]
          }
        ]
      },
      {
        "key": "higiene_personal",
        "name": "Higiene Personal",
        "short_description": "Prácticas de limpieza del cuerpo.",
        "sub_topics": [
          {
            "key": "higiene_corporal",
            "name": "Higiene del Cuerpo",
            "short_description": "Baño y limpieza diaria.",
            "example_tasks": [
              "Describe una rutina completa de higiene corporal diaria",
              "Explica por qué es importante bañarse regularmente",
              "Investiga cómo la higiene previene infecciones de la piel"
            ]
          },
          {
            "key": "higiene_bucal",
            "name": "Higiene Bucal",
            "short_description": "Cuidado de dientes y boca.",
            "example_tasks": [
              "Describe la técnica correcta para cepillar los dientes",
              "Explica por qué debes cepillarte al menos dos veces al día",
              "Investiga enfermedades dentales causadas por mala higiene (caries, gingivitis)"
            ]
          },
          {
            "key": "higiene_manos",
            "name": "Lavado de Manos",
            "short_description": "Importancia crítica para prevenir enfermedades.",
            "example_tasks": [
              "Demuestra la técnica correcta de lavado de manos (20 segundos, jabón)",
              "Identifica momentos críticos para lavarse las manos (antes de comer, después del baño)",
              "Investiga cómo el lavado de manos previene la transmisión de enfermedades"
            ]
          },
          {
            "key": "higiene_ropa_calzado",
            "name": "Higiene de Ropa y Calzado",
            "short_description": "Limpieza de vestimenta.",
            "example_tasks": [
              "Explica por qué es importante usar ropa limpia",
              "Describe el cuidado adecuado de uniformes y ropa deportiva",
              "Investiga problemas de salud relacionados con ropa sucia (hongos, irritaciones)"
            ]
          }
        ]
      },
      {
        "key": "prevencion_enfermedades",
        "name": "Prevención de Enfermedades",
        "short_description": "Medidas para evitar enfermedades comunes.",
        "sub_topics": [
          {
            "key": "enfermedades_infecciosas",
            "name": "Enfermedades Infecciosas",
            "short_description": "Causadas por microorganismos.",
            "example_tasks": [
              "Identifica enfermedades infecciosas comunes (gripe, resfriado, diarrea, COVID-19)",
              "Explica cómo se transmiten las enfermedades infecciosas (contacto, aire, agua, alimentos)",
              "Investiga diferencias entre enfermedades causadas por virus y bacterias"
            ]
          },
          {
            "key": "vacunacion",
            "name": "Vacunación",
            "short_description": "Protección mediante vacunas.",
            "example_tasks": [
              "Explica cómo funcionan las vacunas para proteger contra enfermedades",
              "Identifica vacunas importantes del esquema de vacunación mexicano",
              "Investiga enfermedades que han sido controladas gracias a las vacunas (polio, sarampión)"
            ]
          },
          {
            "key": "transmision_enfermedades",
            "name": "Prevención de Transmisión",
            "short_description": "Medidas para no contagiar ni contagiarse.",
            "example_tasks": [
              "Describe medidas para prevenir contagios (cubrir boca al toser, uso de pañuelos desechables)",
              "Explica el concepto de aislamiento cuando estás enfermo",
              "Investiga la importancia del distanciamiento durante epidemias"
            ]
          },
          {
            "key": "enfermedades_cronicas",
            "name": "Prevención de Enfermedades Crónicas",
            "short_description": "Enfermedades a largo plazo relacionadas con estilo de vida.",
            "example_tasks": [
              "Identifica enfermedades crónicas comunes (diabetes, obesidad, hipertensión)",
              "Describe hábitos que previenen enfermedades crónicas (dieta, ejercicio)",
              "Investiga por qué México tiene altas tasas de diabetes y obesidad"
            ]
          }
        ]
      },
      {
        "key": "primeros_auxilios_basicos",
        "name": "Primeros Auxilios Básicos",
        "short_description": "Atención inicial en caso de accidentes o emergencias.",
        "sub_topics": [
          {
            "key": "heridas_raspaduras",
            "name": "Heridas y Raspaduras",
            "short_description": "Tratamiento de lesiones menores.",
            "example_tasks": [
              "Describe cómo limpiar y curar una raspadura correctamente",
              "Explica cuándo una herida necesita atención médica",
              "Investiga la importancia de limpiar heridas para prevenir infecciones"
            ]
          },
          {
            "key": "quemaduras_leves",
            "name": "Quemaduras Leves",
            "short_description": "Tratamiento de quemaduras superficiales.",
            "example_tasks": [
              "Describe qué hacer en caso de quemadura leve (agua fría, no hielo)",
              "Explica qué NO hacer con una quemadura (no aplicar pasta de dientes, mantequilla)",
              "Investiga cuándo buscar ayuda médica para quemaduras"
            ]
          },
          {
            "key": "golpes_moretones",
            "name": "Golpes y Moretones",
            "short_description": "Tratamiento de contusiones.",
            "example_tasks": [
              "Describe el tratamiento básico para un golpe (aplicar hielo, elevar la zona)",
              "Explica por qué se forman moretones",
              "Investiga señales de que un golpe requiere atención médica"
            ]
          },
          {
            "key": "cuando_buscar_ayuda",
            "name": "Cuándo Buscar Ayuda Médica",
            "short_description": "Reconocer emergencias.",
            "example_tasks": [
              "Identifica situaciones de emergencia que requieren llamar al 911",
              "Describe señales de alerta (sangrado abundante, dificultad para respirar, pérdida de conciencia)",
              "Investiga números de emergencia en México"
            ]
          }
        ]
      },
      {
        "key": "salud_mental_emocional",
        "name": "Salud Mental y Emocional",
        "short_description": "Bienestar psicológico y manejo de emociones.",
        "sub_topics": [
          {
            "key": "emociones_saludables",
            "name": "Reconocimiento y Manejo de Emociones",
            "short_description": "Identificar y expresar emociones apropiadamente.",
            "example_tasks": [
              "Identifica diferentes emociones y cómo se sienten en tu cuerpo",
              "Describe formas saludables de expresar emociones (hablar, escribir, arte)",
              "Investiga estrategias para manejar emociones difíciles (respiración, ejercicio)"
            ]
          },
          {
            "key": "estres_infantil",
            "name": "Manejo del Estrés",
            "short_description": "Lidiar con presiones y preocupaciones.",
            "example_tasks": [
              "Identifica situaciones que causan estrés en niños de tu edad",
              "Describe técnicas de relajación (respiración profunda, actividad física)",
              "Investiga la importancia de hablar con adultos de confianza sobre preocupaciones"
            ]
          },
          {
            "key": "autoestima",
            "name": "Autoestima Positiva",
            "short_description": "Valoración saludable de uno mismo.",
            "example_tasks": [
              "Describe qué significa tener autoestima saludable",
              "Identifica tus fortalezas y cualidades positivas",
              "Investiga cómo el acoso escolar afecta la autoestima"
            ]
          },
          {
            "key": "relaciones_saludables",
            "name": "Relaciones Saludables",
            "short_description": "Convivencia respetuosa con otros.",
            "example_tasks": [
              "Describe características de amistades saludables (respeto, apoyo, honestidad)",
              "Explica la importancia de establecer límites personales",
              "Investiga qué hacer si alguien te trata mal o te hace sentir incómodo"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "alimentacion_saludable",
    "name": "Alimentación Saludable",
    "short_description": "Principios de nutrición adecuada, grupos de alimentos y hábitos alimenticios que promueven el crecimiento y desarrollo óptimos.",
    "sub_topics": [
      {
        "key": "nutrientes_esenciales",
        "name": "Nutrientes Esenciales",
        "short_description": "Sustancias que el cuerpo necesita de los alimentos.",
        "sub_topics": [
          {
            "key": "carbohidratos_energia",
            "name": "Carbohidratos",
            "short_description": "Fuente principal de energía.",
            "example_tasks": [
              "Identifica alimentos ricos en carbohidratos (tortilla, pan, arroz, pasta, frutas)",
              "Explica por qué el cuerpo necesita carbohidratos para energía",
              "Compara carbohidratos simples (azúcar) con complejos (cereales integrales)"
            ]
          },
          {
            "key": "proteinas_crecimiento",
            "name": "Proteínas",
            "short_description": "Construcción y reparación de tejidos.",
            "example_tasks": [
              "Identifica fuentes de proteína (frijol, lentejas, pollo, pescado, huevo, leche)",
              "Explica por qué las proteínas son importantes para el crecimiento",
              "Investiga la importancia de combinar leguminosas con cereales"
            ]
          },
          {
            "key": "grasas_saludables",
            "name": "Grasas Saludables",
            "short_description": "Lípidos necesarios con moderación.",
            "example_tasks": [
              "Diferencia entre grasas saludables (aguacate, nueces, aceite de oliva) y no saludables",
              "Explica funciones de las grasas en el cuerpo",
              "Investiga por qué debemos limitar grasas saturadas y trans"
            ]
          },
          {
            "key": "vitaminas_minerales",
            "name": "Vitaminas y Minerales",
            "short_description": "Micronutrientes esenciales.",
            "example_tasks": [
              "Identifica alimentos ricos en vitaminas (frutas, verduras) y minerales (lácteos, verduras)",
              "Describe funciones de vitaminas importantes (A para vista, C para defensas, D para huesos)",
              "Investiga la importancia del hierro y calcio en niños"
            ]
          },
          {
            "key": "agua_hidratacion",
            "name": "Agua e Hidratación",
            "short_description": "Importancia del consumo de agua.",
            "example_tasks": [
              "Explica por qué el agua es el nutriente más importante",
              "Describe cuánta agua debes tomar diariamente (6-8 vasos)",
              "Investiga señales de deshidratación y cómo prevenirla"
            ]
          },
          {
            "key": "fibra_digestion",
            "name": "Fibra Dietética",
            "short_description": "Importancia para la digestión.",
            "example_tasks": [
              "Identifica alimentos ricos en fibra (frutas, verduras, granos enteros, leguminosas)",
              "Explica cómo la fibra ayuda a la digestión",
              "Investiga problemas causados por falta de fibra (estreñimiento)"
            ]
          }
        ]
      },
      {
        "key": "guias_alimentarias_mexico",
        "name": "Guías Alimentarias para México",
        "short_description": "Herramientas oficiales para una alimentación correcta.",
        "sub_topics": [
          {
            "key": "plato_bien_comer_detalle",
            "name": "El Plato del Bien Comer",
            "short_description": "Guía mexicana de alimentación balanceada.",
            "example_tasks": [
              "Identifica los tres grupos: verduras y frutas, cereales, leguminosas y alimentos de origen animal",
              "Planea tres comidas del día usando los tres grupos en cada una",
              "Explica por qué cada grupo es importante y debe estar en cada comida"
            ]
          },
          {
            "key": "jarra_bien_beber_detalle",
            "name": "La Jarra del Buen Beber",
            "short_description": "Guía para hidratación saludable.",
            "example_tasks": [
              "Describe los seis niveles de la jarra (agua, leche, café/té sin azúcar, bebidas no calóricas, jugos, refrescos)",
              "Explica por qué el agua es nivel 1 y debe ser la bebida principal",
              "Investiga problemas de salud relacionados con bebidas azucaradas"
            ]
          },
          {
            "key": "porciones_recomendadas",
            "name": "Porciones Recomendadas",
            "short_description": "Cantidades adecuadas de cada grupo.",
            "example_tasks": [
              "Aprende a estimar porciones adecuadas usando tu mano como referencia",
              "Compara porciones recomendadas con porciones que sueles comer",
              "Investiga consecuencias de comer porciones excesivas"
            ]
          }
        ]
      },
      {
        "key": "habitos_alimenticios_saludables",
        "name": "Hábitos Alimenticios Saludables",
        "short_description": "Prácticas para una mejor nutrición.",
        "sub_topics": [
          {
            "key": "horarios_regulares",
            "name": "Horarios Regulares de Comida",
            "short_description": "Importancia de comer a horas establecidas.",
            "example_tasks": [
              "Describe por qué es importante desayunar, comer y cenar a horas regulares",
              "Explica los beneficios de no saltarse comidas",
              "Investiga cómo horarios irregulares afectan el metabolismo"
            ]
          },
          {
            "key": "desayuno_importante",
            "name": "Importancia del Desayuno",
            "short_description": "Primera comida del día.",
            "example_tasks": [
              "Explica por qué el desayuno es la comida más importante",
              "Describe un desayuno completo y balanceado",
              "Investiga cómo el desayuno afecta el rendimiento escolar"
            ]
          },
          {
            "key": "comer_despacio",
            "name": "Comer Despacio y Masticar Bien",
            "short_description": "Importancia de tomarse tiempo para comer.",
            "example_tasks": [
              "Explica beneficios de comer despacio (mejor digestión, sensación de saciedad)",
              "Describe por qué es importante masticar bien los alimentos",
              "Investiga la relación entre comer rápido y sobrepeso"
            ]
          },
          {
            "key": "variedad_alimentos",
            "name": "Variedad en la Alimentación",
            "short_description": "Importancia de comer alimentos diversos.",
            "example_tasks": [
              "Explica por qué debes comer alimentos variados",
              "Planea un menú semanal con diferentes alimentos cada día",
              "Investiga beneficios de probar nuevos alimentos saludables"
            ]
          },
          {
            "key": "refrigerios_saludables",
            "name": "Refrigerios Saludables",
            "short_description": "Opciones nutritivas entre comidas.",
            "example_tasks": [
              "Identifica refrigerios saludables (frutas, verduras, yogurt, nueces)",
              "Compara refrigerios saludables con opciones poco nutritivas (frituras, dulces)",
              "Planea refrigerios saludables para la escuela durante una semana"
            ]
          }
        ]
      },
      {
        "key": "alimentos_limitar",
        "name": "Alimentos a Limitar",
        "short_description": "Productos que deben consumirse con moderación.",
        "sub_topics": [
          {
            "key": "azucar_exceso",
            "name": "Azúcar en Exceso",
            "short_description": "Problemas del consumo elevado de azúcar.",
            "example_tasks": [
              "Identifica alimentos con alto contenido de azúcar (refrescos, dulces, pasteles)",
              "Explica problemas de salud causados por exceso de azúcar (caries, obesidad, diabetes)",
              "Investiga cuánta azúcar contienen bebidas y alimentos comunes"
            ]
          },
          {
            "key": "sal_exceso",
            "name": "Sal en Exceso",
            "short_description": "Riesgos del consumo elevado de sodio.",
            "example_tasks": [
              "Identifica alimentos con mucha sal (botanas saladas, alimentos procesados)",
              "Explica problemas causados por exceso de sal (hipertensión)",
              "Investiga alternativas para dar sabor sin usar mucha sal (especias, hierbas)"
            ]
          },
          {
            "key": "alimentos_procesados",
            "name": "Alimentos Ultraprocesados",
            "short_description": "Productos industrializados con baja calidad nutricional.",
            "example_tasks": [
              "Identifica alimentos ultraprocesados (frituras, galletas, refrescos, embutidos)",
              "Explica por qué estos alimentos tienen poco valor nutricional",
              "Compara alimentos naturales con sus versiones procesadas"
            ]
          },
          {
            "key": "comida_chatarra",
            "name": "Comida Chatarra",
            "short_description": "Alimentos densos en calorías y pobres en nutrientes.",
            "example_tasks": [
              "Explica qué hace que un alimento sea considerado 'chatarra'",
              "Describe efectos de consumir comida chatarra frecuentemente",
              "Investiga alternativas saludables a tus alimentos chatarra favoritos"
            ]
          }
        ]
      },
      {
        "key": "lectura_etiquetas",
        "name": "Lectura de Etiquetas Nutricionales",
        "short_description": "Interpretación de información en empaques de alimentos.",
        "sub_topics": [
          {
            "key": "tabla_nutricional",
            "name": "Tabla de Información Nutricional",
            "short_description": "Comprensión de datos nutricionales.",
            "example_tasks": [
              "Identifica información en una etiqueta (calorías, proteínas, grasas, azúcares)",
              "Compara etiquetas de dos productos similares",
              "Investiga qué significa 'porción' en las etiquetas"
            ]
          },
          {
            "key": "sellos_advertencia",
            "name": "Sellos de Advertencia",
            "short_description": "Sistema mexicano de etiquetado frontal.",
            "example_tasks": [
              "Identifica los cinco sellos de advertencia (exceso de calorías, azúcares, grasas saturadas, grasas trans, sodio)",
              "Explica qué significa cada sello de advertencia",
              "Investiga por qué México implementó este sistema de etiquetado"
            ]
          },
          {
            "key": "lista_ingredientes",
            "name": "Lista de Ingredientes",
            "short_description": "Comprensión de componentes del producto.",
            "example_tasks": [
              "Explica cómo leer la lista de ingredientes (orden de cantidad)",
              "Identifica ingredientes poco saludables (jarabe de maíz, aceites hidrogenados)",
              "Investiga por qué es mejor elegir productos con pocos ingredientes"
            ]
          }
        ]
      },
      {
        "key": "cultura_alimentaria_mexico",
        "name": "Cultura Alimentaria de México",
        "short_description": "Valoración de la comida tradicional mexicana.",
        "sub_topics": [
          {
            "key": "dieta_tradicional",
            "name": "Dieta Tradicional Mexicana",
            "short_description": "Alimentos base de la alimentación ancestral.",
            "example_tasks": [
              "Identifica alimentos base de la dieta tradicional (maíz, frijol, chile, calabaza, jitomate)",
              "Explica por qué la dieta tradicional mexicana es saludable",
              "Investiga la importancia cultural del maíz en México"
            ]
          },
          {
            "key": "milpa",
            "name": "La Milpa",
            "short_description": "Sistema tradicional de cultivo.",
            "example_tasks": [
              "Describe qué es la milpa y qué cultivos incluye",
              "Explica la complementariedad nutricional de maíz, frijol y calabaza",
              "Investiga la sustentabilidad del sistema milpa"
            ]
          },
          {
            "key": "alimentos_temporada",
            "name": "Alimentos de Temporada",
            "short_description": "Beneficios de consumir productos de estación.",
            "example_tasks": [
              "Identifica frutas y verduras de cada temporada en tu región",
              "Explica ventajas de comer alimentos de temporada (frescura, precio, nutrientes)",
              "Investiga cómo reconocer productos de temporada en el mercado"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "adicciones_prevencion",
    "name": "Adicciones y Prevención",
    "short_description": "Información sobre sustancias adictivas, sus efectos en el cuerpo y estrategias para tomar decisiones saludables y evitar riesgos.",
    "sub_topics": [
      {
        "key": "concepto_adiccion",
        "name": "Concepto de Adicción",
        "short_description": "Qué es la adicción y cómo afecta al cuerpo y cerebro.",
        "sub_topics": [
          {
            "key": "que_es_adiccion",
            "name": "Qué es una Adicción",
            "short_description": "Dependencia física y psicológica de sustancias.",
            "example_tasks": [
              "Explica en términos simples qué es una adicción",
              "Describe cómo una adicción afecta el comportamiento de una persona",
              "Investiga por qué las adicciones son difíciles de superar"
            ]
          },
          {
            "key": "cerebro_adiccion",
            "name": "Efectos en el Cerebro",
            "short_description": "Cómo las sustancias afectan el funcionamiento cerebral.",
            "example_tasks": [
              "Explica cómo las drogas alteran el funcionamiento normal del cerebro",
              "Describe el concepto de dependencia",
              "Investiga por qué el cerebro de niños y adolescentes es más vulnerable"
            ]
          }
        ]
      },
      {
        "key": "tabaco",
        "name": "Tabaco y sus Efectos",
        "short_description": "Consecuencias del consumo de tabaco.",
        "sub_topics": [
          {
            "key": "componentes_tabaco",
            "name": "Componentes Dañinos del Tabaco",
            "short_description": "Sustancias tóxicas en los cigarros.",
            "example_tasks": [
              "Identifica sustancias dañinas en el tabaco (nicotina, alquitrán, monóxido de carbono)",
              "Explica cómo cada sustancia daña el cuerpo",
              "Investiga cuántas sustancias químicas contiene el humo del cigarro"
            ]
          },
          {
            "key": "efectos_salud_tabaco",
            "name": "Efectos en la Salud",
            "short_description": "Enfermedades causadas por fumar.",
            "example_tasks": [
              "Describe enfermedades causadas por el tabaco (cáncer de pulmón, enfisema, enfermedades cardíacas)",
              "Explica efectos inmediatos (mal aliento, tos, falta de aire)",
              "Investiga cómo el tabaco afecta el rendimiento físico"
            ]
          },
          {
            "key": "tabaquismo_pasivo",
            "name": "Tabaquismo Pasivo",
            "short_description": "Daños a no fumadores expuestos al humo.",
            "example_tasks": [
              "Explica qué es el tabaquismo pasivo",
              "Describe cómo afecta a niños y bebés",
              "Investiga leyes en México sobre fumar en lugares públicos"
            ]
          },
          {
            "key": "prevencion_tabaco",
            "name": "Prevención del Tabaquismo",
            "short_description": "Estrategias para no comenzar a fumar.",
            "example_tasks": [
              "Describe razones para no fumar",
              "Explica cómo resistir presión de grupo para fumar",
              "Investiga programas de prevención del tabaquismo en escuelas"
            ]
          }
        ]
      },
      {
        "key": "alcohol",
        "name": "Alcohol y sus Efectos",
        "short_description": "Consecuencias del consumo de alcohol.",
        "sub_topics": [
          {
            "key": "efectos_cuerpo_alcohol",
            "name": "Efectos en el Cuerpo",
            "short_description": "Cómo el alcohol afecta diferentes órganos.",
            "example_tasks": [
              "Describe cómo el alcohol afecta el cerebro, hígado y otros órganos",
              "Explica efectos inmediatos (coordinación, juicio, reflejos)",
              "Investiga efectos a largo plazo del consumo de alcohol"
            ]
          },
          {
            "key": "alcohol_menores",
            "name": "Riesgos para Niños y Adolescentes",
            "short_description": "Por qué es especialmente peligroso en desarrollo.",
            "example_tasks": [
              "Explica por qué el alcohol es más dañino para cerebros en desarrollo",
              "Describe efectos del alcohol en el crecimiento",
              "Investiga por qué la ley prohíbe venta de alcohol a menores"
            ]
          },
          {
            "key": "alcoholismo",
            "name": "Alcoholismo",
            "short_description": "Adicción al alcohol.",
            "example_tasks": [
              "Explica qué es el alcoholismo",
              "Describe cómo afecta a familias",
              "Investiga dónde pueden recibir ayuda personas con problemas de alcohol"
            ]
          },
          {
            "key": "prevencion_alcohol",
            "name": "Prevención",
            "short_description": "Decisiones saludables respecto al alcohol.",
            "example_tasks": [
              "Describe razones para no consumir alcohol durante la niñez y adolescencia",
              "Explica cómo decir NO al alcohol",
              "Investiga factores que protegen contra el uso de alcohol"
            ]
          }
        ]
      },
      {
        "key": "otras_drogas",
        "name": "Otras Drogas",
        "short_description": "Información sobre sustancias ilegales.",
        "sub_topics": [
          {
            "key": "tipos_drogas",
            "name": "Tipos de Drogas",
            "short_description": "Clasificación básica de drogas.",
            "example_tasks": [
              "Identifica diferentes tipos de drogas (estimulantes, depresores, alucinógenos)",
              "Explica brevemente efectos de cada tipo",
              "Investiga por qué todas las drogas ilegales son peligrosas"
            ]
          },
          {
            "key": "efectos_drogas",
            "name": "Efectos y Riesgos",
            "short_description": "Consecuencias del uso de drogas.",
            "example_tasks": [
              "Describe daños físicos causados por drogas",
              "Explica cómo las drogas afectan el cerebro y el comportamiento",
              "Investiga consecuencias sociales del uso de drogas (escuela, familia, amigos)"
            ]
          },
          {
            "key": "mitos_drogas",
            "name": "Mitos sobre las Drogas",
            "short_description": "Información falsa que circula sobre drogas.",
            "example_tasks": [
              "Identifica mitos comunes sobre drogas",
              "Explica por qué estas ideas son falsas y peligrosas",
              "Investiga fuentes confiables de información sobre drogas"
            ]
          }
        ]
      },
      {
        "key": "factores_proteccion",
        "name": "Factores de Protección",
        "short_description": "Elementos que ayudan a evitar adicciones.",
        "sub_topics": [
          {
            "key": "autoestima_decisiones",
            "name": "Autoestima y Toma de Decisiones",
            "short_description": "Fortaleza personal para resistir.",
            "example_tasks": [
              "Describe cómo una buena autoestima te protege de adicciones",
              "Explica la importancia de pensar en consecuencias antes de actuar",
              "Investiga estrategias para fortalecer tu capacidad de tomar buenas decisiones"
            ]
          },
          {
            "key": "familia_apoyo",
            "name": "Familia y Redes de Apoyo",
            "short_description": "Importancia del soporte familiar y social.",
            "example_tasks": [
              "Describe cómo el apoyo familiar protege contra adicciones",
              "Explica la importancia de tener adultos de confianza",
              "Investiga el papel de amistades saludables en prevención"
            ]
          },
          {
            "key": "actividades_saludables",
            "name": "Actividades Saludables",
            "short_description": "Alternativas positivas para usar el tiempo.",
            "example_tasks": [
              "Identifica actividades saludables (deportes, arte, música, lectura)",
              "Explica cómo las actividades positivas protegen contra adicciones",
              "Investiga programas comunitarios para niños y jóvenes"
            ]
          },
          {
            "key": "habilidades_rechazo",
            "name": "Habilidades para Decir NO",
            "short_description": "Estrategias para resistir presión.",
            "example_tasks": [
              "Practica diferentes formas de decir NO de manera firme",
              "Describe situaciones de presión de grupo y cómo enfrentarlas",
              "Investiga por qué es importante alejarse de situaciones de riesgo"
            ]
          }
        ]
      },
      {
        "key": "busqueda_ayuda",
        "name": "Búsqueda de Ayuda",
        "short_description": "Recursos para personas con problemas de adicción.",
        "sub_topics": [
          {
            "key": "reconocer_problema",
            "name": "Reconocer que Hay un Problema",
            "short_description": "Señales de advertencia.",
            "example_tasks": [
              "Identifica señales de que alguien puede tener un problema de adicción",
              "Explica por qué es importante buscar ayuda temprano",
              "Investiga cómo puedes ayudar a un familiar o amigo"
            ]
          },
          {
            "key": "donde_buscar_ayuda",
            "name": "Dónde Buscar Ayuda",
            "short_description": "Recursos y servicios disponibles.",
            "example_tasks": [
              "Identifica lugares donde se puede obtener ayuda (centros de salud, líneas telefónicas)",
              "Explica que las adicciones son tratables",
              "Investiga programas de tratamiento y apoyo en México"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "cuidado_conservacion_ambiente",
    "name": "Cuidado y Conservación del Ambiente",
    "short_description": "Problemas ambientales actuales, su impacto en los ecosistemas y acciones individuales y colectivas para proteger el medio ambiente.",
    "sub_topics": [
      {
        "key": "problemas_ambientales",
        "name": "Problemas Ambientales",
        "short_description": "Principales amenazas al medio ambiente.",
        "sub_topics": [
          {
            "key": "contaminacion_aire",
            "name": "Contaminación del Aire",
            "short_description": "Causas y efectos de la contaminación atmosférica.",
            "example_tasks": [
              "Identifica fuentes de contaminación del aire (vehículos, fábricas, quema de basura)",
              "Describe efectos en la salud humana y el ambiente",
              "Investiga el problema de contaminación en la Ciudad de México"
            ]
          },
          {
            "key": "contaminacion_agua",
            "name": "Contaminación del Agua",
            "short_description": "Contaminación de ríos, lagos y océanos.",
            "example_tasks": [
              "Identifica fuentes de contaminación del agua (aguas residuales, desechos industriales, basura)",
              "Describe cómo afecta a organismos acuáticos y humanos",
              "Investiga la contaminación de ríos y lagos en México"
            ]
          },
          {
            "key": "contaminacion_suelo",
            "name": "Contaminación del Suelo",
            "short_description": "Degradación y contaminación de la tierra.",
            "example_tasks": [
              "Identifica causas de contaminación del suelo (pesticidas, basura, químicos)",
              "Explica cómo afecta la agricultura y cadenas alimentarias",
              "Investiga la erosión del suelo y sus consecuencias"
            ]
          },
          {
            "key": "deforestacion_problema",
            "name": "Deforestación",
            "short_description": "Pérdida de bosques y selvas.",
            "example_tasks": [
              "Describe causas de la deforestación en México",
              "Explica consecuencias (pérdida de biodiversidad, erosión, cambio climático)",
              "Investiga tasas de deforestación en diferentes regiones"
            ]
          },
          {
            "key": "perdida_biodiversidad",
            "name": "Pérdida de Biodiversidad",
            "short_description": "Extinción y amenaza de especies.",
            "example_tasks": [
              "Identifica especies mexicanas en peligro de extinción",
              "Explica causas de la pérdida de biodiversidad",
              "Investiga consecuencias de perder especies en ecosistemas"
            ]
          },
          {
            "key": "cambio_climatico_basico",
            "name": "Cambio Climático",
            "short_description": "Alteración del clima global.",
            "example_tasks": [
              "Explica en términos simples qué es el cambio climático",
              "Describe causas principales (emisión de gases de efecto invernadero)",
              "Investiga efectos observables (derretimiento de hielo, cambios en clima)"
            ]
          }
        ]
      },
      {
        "key": "residuos_basura",
        "name": "Manejo de Residuos",
        "short_description": "Problema de la basura y soluciones.",
        "sub_topics": [
          {
            "key": "problema_basura",
            "name": "El Problema de la Basura",
            "short_description": "Generación excesiva de desechos.",
            "example_tasks": [
              "Calcula cuánta basura genera tu familia en una semana",
              "Describe problemas causados por acumulación de basura",
              "Investiga qué pasa con la basura después de ser recolectada"
            ]
          },
          {
            "key": "clasificacion_residuos",
            "name": "Clasificación de Residuos",
            "short_description": "Tipos de basura y su separación.",
            "example_tasks": [
              "Clasifica residuos en orgánicos, inorgánicos reciclables y no reciclables",
              "Practica separar la basura correctamente en tu casa o escuela",
              "Investiga el código de colores para separación de residuos"
            ]
          },
          {
            "key": "tres_r",
            "name": "Las Tres R: Reducir, Reutilizar, Reciclar",
            "short_description": "Estrategia para manejo de residuos.",
            "example_tasks": [
              "Explica qué significa cada R y su orden de importancia",
              "Da ejemplos de cómo aplicar cada R en tu vida diaria",
              "Investiga por qué REDUCIR es más importante que reciclar"
            ]
          },
          {
            "key": "reciclaje",
            "name": "Reciclaje",
            "short_description": "Transformación de materiales usados.",
            "example_tasks": [
              "Identifica materiales que se pueden reciclar (papel, cartón, vidrio, plástico, metal)",
              "Describe el proceso de reciclaje de diferentes materiales",
              "Investiga centros de reciclaje en tu comunidad"
            ]
          },
          {
            "key": "composta",
            "name": "Composta",
            "short_description": "Reciclaje de residuos orgánicos.",
            "example_tasks": [
              "Explica qué es la composta y cómo se hace",
              "Identifica residuos orgánicos que pueden compostarse",
              "Investiga beneficios de la composta para el suelo y plantas"
            ]
          }
        ]
      },
      {
        "key": "conservacion_recursos",
        "name": "Conservación de Recursos Naturales",
        "short_description": "Uso responsable de recursos.",
        "sub_topics": [
          {
            "key": "ahorro_agua",
            "name": "Ahorro de Agua",
            "short_description": "Uso eficiente del recurso más importante.",
            "example_tasks": [
              "Identifica formas de ahorrar agua en casa (cerrar llaves, duchas cortas, reparar fugas)",
              "Calcula cuánta agua puedes ahorrar con cambios simples",
              "Investiga la escasez de agua en diferentes regiones de México"
            ]
          },
          {
            "key": "ahorro_energia",
            "name": "Ahorro de Energía",
            "short_description": "Reducción del consumo energético.",
            "example_tasks": [
              "Identifica formas de ahorrar energía (apagar luces, desconectar aparatos, usar luz natural)",
              "Explica relación entre ahorro de energía y reducción de contaminación",
              "Investiga energías renovables vs combustibles fósiles"
            ]
          },
          {
            "key": "consumo_responsable",
            "name": "Consumo Responsable",
            "short_description": "Comprar y usar productos de manera consciente.",
            "example_tasks": [
              "Explica qué significa ser un consumidor responsable",
              "Identifica productos que generan menos impacto ambiental",
              "Investiga el ciclo de vida de productos comunes"
            ]
          }
        ]
      },
      {
        "key": "areas_naturales_protegidas",
        "name": "Áreas Naturales Protegidas",
        "short_description": "Espacios destinados a conservación.",
        "sub_topics": [
          {
            "key": "tipos_anp",
            "name": "Tipos de Áreas Protegidas",
            "short_description": "Reservas, parques y santuarios.",
            "example_tasks": [
              "Identifica áreas naturales protegidas cercanas a tu región",
              "Describe diferentes tipos (reservas de la biosfera, parques nacionales, santuarios)",
              "Investiga especies protegidas en estas áreas"
            ]
          },
          {
            "key": "importancia_anp",
            "name": "Importancia de las ANP",
            "short_description": "Por qué protegemos ciertos lugares.",
            "example_tasks": [
              "Explica por qué son importantes las áreas naturales protegidas",
              "Describe servicios ambientales que proporcionan",
              "Investiga reglas de comportamiento en áreas protegidas"
            ]
          },
          {
            "key": "anp_mexico",
            "name": "Áreas Protegidas de México",
            "short_description": "Principales ANP del país.",
            "example_tasks": [
              "Investiga ANP famosas (Reserva de la Biosfera Mariposa Monarca, Sian Ka'an, Arrecifes de Cozumel)",
              "Describe ecosistemas y especies que protegen",
              "Investiga cómo visitarlas de manera responsable"
            ]
          }
        ]
      },
      {
        "key": "acciones_individuales",
        "name": "Acciones Individuales y Colectivas",
        "short_description": "Qué podemos hacer para ayudar al ambiente.",
        "sub_topics": [
          {
            "key": "acciones_casa",
            "name": "Acciones en Casa",
            "short_description": "Cambios en el hogar.",
            "example_tasks": [
              "Crea una lista de 10 acciones ambientales que puedes hacer en casa",
              "Implementa al menos 3 acciones y registra los resultados",
              "Investiga cómo involucrar a tu familia en acciones ambientales"
            ]
          },
          {
            "key": "acciones_escuela",
            "name": "Acciones en la Escuela",
            "short_description": "Iniciativas escolares.",
            "example_tasks": [
              "Propón un proyecto ambiental para tu escuela (separación de basura, huerto escolar)",
              "Organiza una campaña de concientización sobre un tema ambiental",
              "Investiga escuelas sustentables en México"
            ]
          },
          {
            "key": "acciones_comunidad",
            "name": "Acciones en la Comunidad",
            "short_description": "Participación comunitaria.",
            "example_tasks": [
              "Participa en una jornada de limpieza de espacios públicos",
              "Investiga organizaciones ambientales en tu comunidad",
              "Describe cómo las acciones colectivas tienen mayor impacto"
            ]
          },
          {
            "key": "difusion_concientizacion",
            "name": "Difusión y Concientización",
            "short_description": "Compartir información ambiental.",
            "example_tasks": [
              "Crea un cartel o presentación sobre un problema ambiental",
              "Comparte información ambiental con familia y amigos",
              "Investiga el papel de las redes sociales en concientización ambiental"
            ]
          }
        ]
      },
      {
        "key": "desarrollo_sustentable",
        "name": "Desarrollo Sustentable",
        "short_description": "Uso de recursos sin comprometer el futuro.",
        "sub_topics": [
          {
            "key": "concepto_sustentabilidad",
            "name": "Concepto de Sustentabilidad",
            "short_description": "Satisfacer necesidades presentes sin afectar el futuro.",
            "example_tasks": [
              "Explica qué significa desarrollo sustentable",
              "Describe el equilibrio entre necesidades humanas y conservación",
              "Investiga ejemplos de prácticas sustentables"
            ]
          },
          {
            "key": "huella_ecologica",
            "name": "Huella Ecológica",
            "short_description": "Impacto de nuestras acciones en el planeta.",
            "example_tasks": [
              "Explica qué es la huella ecológica",
              "Calcula tu huella ecológica aproximada",
              "Investiga formas de reducir tu huella ecológica"
            ]
          },
          {
            "key": "futuro_sustentable",
            "name": "Construyendo un Futuro Sustentable",
            "short_description": "Visión de un mundo en equilibrio.",
            "example_tasks": [
              "Describe cómo te imaginas un futuro sustentable",
              "Explica por qué las acciones de hoy afectan el mañana",
              "Investiga los Objetivos de Desarrollo Sustentable de la ONU"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "recursos_naturales",
    "name": "Recursos Naturales",
    "short_description": "Identificación, clasificación y uso responsable de los recursos que nos proporciona la naturaleza.",
    "sub_topics": [
      {
        "key": "tipos_recursos",
        "name": "Tipos de Recursos Naturales",
        "short_description": "Clasificación según su capacidad de renovación.",
        "sub_topics": [
          {
            "key": "recursos_renovables",
            "name": "Recursos Renovables",
            "short_description": "Recursos que se regeneran naturalmente.",
            "example_tasks": [
              "Identifica recursos renovables (agua, aire, suelo, bosques, energía solar, viento)",
              "Explica por qué son considerados renovables",
              "Investiga condiciones necesarias para que se renueven"
            ]
          },
          {
            "key": "recursos_no_renovables",
            "name": "Recursos No Renovables",
            "short_description": "Recursos que se agotan con el uso.",
            "example_tasks": [
              "Identifica recursos no renovables (petróleo, gas natural, carbón, minerales metálicos)",
              "Explica por qué no se pueden renovar en tiempos humanos",
              "Investiga cuánto tiempo tomó formarlos y cuánto queda"
            ]
          },
          {
            "key": "recursos_permanentes",
            "name": "Recursos Permanentes",
            "short_description": "Recursos inagotables.",
            "example_tasks": [
              "Identifica recursos permanentes (luz solar, viento, mareas, energía geotérmica)",
              "Explica por qué son considerados inagotables",
              "Investiga su potencial como fuentes de energía"
            ]
          }
        ]
      },
      {
        "key": "agua_recurso",
        "name": "El Agua como Recurso",
        "short_description": "Importancia, disponibilidad y conservación del agua.",
        "sub_topics": [
          {
            "key": "distribucion_agua",
            "name": "Distribución del Agua en la Tierra",
            "short_description": "Agua salada vs agua dulce.",
            "example_tasks": [
              "Describe qué porcentaje del agua en la Tierra es dulce y disponible",
              "Explica por qué el agua dulce es limitada",
              "Investiga la distribución desigual del agua en el mundo"
            ]
          },
          {
            "key": "usos_agua",
            "name": "Usos del Agua",
            "short_description": "Diferentes aplicaciones del agua.",
            "example_tasks": [
              "Identifica usos del agua (consumo humano, agricultura, industria, energía)",
              "Describe qué actividad usa más agua",
              "Investiga el consumo de agua per cápita en México"
            ]
          },
          {
            "key": "escasez_agua",
            "name": "Escasez de Agua",
            "short_description": "Problema de disponibilidad.",
            "example_tasks": [
              "Explica causas de la escasez de agua",
              "Describe regiones de México con problemas de agua",
              "Investiga consecuencias de la escasez de agua"
            ]
          },
          {
            "key": "conservacion_agua",
            "name": "Conservación del Agua",
            "short_description": "Uso eficiente y protección de fuentes.",
            "example_tasks": [
              "Identifica técnicas de conservación del agua",
              "Describe sistemas de captación de agua de lluvia",
              "Investiga tecnologías para purificar y reusar agua"
            ]
          }
        ]
      },
      {
        "key": "suelo_recurso",
        "name": "El Suelo como Recurso",
        "short_description": "Importancia del suelo para la vida.",
        "sub_topics": [
          {
            "key": "formacion_suelo",
            "name": "Formación del Suelo",
            "short_description": "Proceso lento de creación del suelo.",
            "example_tasks": [
              "Describe cómo se forma el suelo a partir de rocas",
              "Explica por qué el suelo tarda cientos de años en formarse",
              "Investiga componentes del suelo (minerales, materia orgánica, agua, aire)"
            ]
          },
          {
            "key": "importancia_suelo",
            "name": "Importancia del Suelo",
            "short_description": "Base de la agricultura y ecosistemas.",
            "example_tasks": [
              "Describe funciones del suelo (soporte para plantas, filtrado de agua, hábitat)",
              "Explica por qué el suelo es esencial para la alimentación humana",
              "Investiga la vida en el suelo (microorganismos, lombrices, insectos)"
            ]
          },
          {
            "key": "degradacion_suelo",
            "name": "Degradación del Suelo",
            "short_description": "Pérdida de calidad y fertilidad.",
            "example_tasks": [
              "Identifica causas de degradación (erosión, contaminación, deforestación)",
              "Describe consecuencias de perder suelo fértil",
              "Investiga la desertificación en México"
            ]
          },
          {
            "key": "conservacion_suelo",
            "name": "Conservación del Suelo",
            "short_description": "Prácticas para proteger el suelo.",
            "example_tasks": [
              "Describe prácticas agrícolas sustentables (rotación de cultivos, terrazas, reforestación)",
              "Explica cómo prevenir la erosión",
              "Investiga la importancia de la materia orgánica para el suelo"
            ]
          }
        ]
      },
      {
        "key": "bosques_selvas",
        "name": "Bosques y Selvas",
        "short_description": "Ecosistemas forestales como recursos.",
        "sub_topics": [
          {
            "key": "servicios_bosques",
            "name": "Servicios de los Bosques",
            "short_description": "Beneficios que proporcionan los bosques.",
            "example_tasks": [
              "Identifica servicios ambientales de bosques (captura de CO₂, producción de oxígeno, regulación de agua)",
              "Describe productos que obtenemos de bosques (madera, papel, alimentos, medicinas)",
              "Investiga el valor económico de servicios ambientales"
            ]
          },
          {
            "key": "deforestacion_causas",
            "name": "Causas de la Deforestación",
            "short_description": "Por qué se pierden los bosques.",
            "example_tasks": [
              "Identifica causas de deforestación en México (agricultura, ganadería, tala ilegal)",
              "Describe el impacto de la expansión urbana",
              "Investiga la relación entre pobreza y deforestación"
            ]
          },
          {
            "key": "manejo_forestal_sustentable",
            "name": "Manejo Forestal Sustentable",
            "short_description": "Uso de bosques sin destruirlos.",
            "example_tasks": [
              "Explica qué es el manejo forestal sustentable",
              "Describe prácticas como tala selectiva y reforestación",
              "Investiga certificaciones de productos forestales sustentables"
            ]
          }
        ]
      },
      {
        "key": "energia_recursos",
        "name": "Energía y Recursos",
        "short_description": "Fuentes de energía y su sustentabilidad.",
        "sub_topics": [
          {
            "key": "combustibles_fosiles",
            "name": "Combustibles Fósiles",
            "short_description": "Petróleo, gas y carbón.",
            "example_tasks": [
              "Explica cómo se formaron los combustibles fósiles",
              "Describe usos principales de cada uno",
              "Investiga problemas ambientales de su uso (contaminación, cambio climático)"
            ]
          },
          {
            "key": "energias_renovables",
            "name": "Energías Renovables",
            "short_description": "Alternativas sustentables.",
            "example_tasks": [
              "Identifica tipos de energía renovable (solar, eólica, hidroeléctrica, geotérmica, biomasa)",
              "Describe ventajas de cada tipo",
              "Investiga el potencial de energías renovables en México"
            ]
          },
          {
            "key": "eficiencia_energetica",
            "name": "Eficiencia Energética",
            "short_description": "Usar menos energía para el mismo resultado.",
            "example_tasks": [
              "Explica qué significa eficiencia energética",
              "Identifica aparatos y tecnologías eficientes",
              "Investiga beneficios económicos y ambientales de la eficiencia"
            ]
          }
        ]
      },
      {
        "key": "minerales_metales",
        "name": "Minerales y Metales",
        "short_description": "Recursos del subsuelo.",
        "sub_topics": [
          {
            "key": "minerales_importantes",
            "name": "Minerales Importantes",
            "short_description": "Recursos minerales y sus usos.",
            "example_tasks": [
              "Identifica minerales importantes (oro, plata, cobre, hierro, sal)",
              "Describe usos de diferentes minerales",
              "Investiga la riqueza mineral de México"
            ]
          },
          {
            "key": "mineria_impacto",
            "name": "Minería y su Impacto",
            "short_description": "Extracción de minerales y consecuencias.",
            "example_tasks": [
              "Describe métodos de extracción minera",
              "Explica impactos ambientales de la minería",
              "Investiga prácticas de minería responsable"
            ]
          },
          {
            "key": "reciclaje_metales",
            "name": "Reciclaje de Metales",
            "short_description": "Recuperación y reutilización.",
            "example_tasks": [
              "Explica por qué es importante reciclar metales",
              "Describe el proceso de reciclaje de aluminio y otros metales",
              "Investiga cuánta energía se ahorra reciclando vs extrayendo minerales nuevos"
            ]
          }
        ]
      },
      {
        "key": "uso_responsable_recursos",
        "name": "Uso Responsable de Recursos",
        "short_description": "Consumo consciente y sustentable.",
        "sub_topics": [
          {
            "key": "economia_circular",
            "name": "Economía Circular",
            "short_description": "Reducir, reutilizar, reciclar y regenerar.",
            "example_tasks": [
              "Explica el concepto de economía circular",
              "Compara con economía lineal (extraer, usar, desechar)",
              "Investiga ejemplos de economía circular en práctica"
            ]
          },
          {
            "key": "consumo_consciente",
            "name": "Consumo Consciente",
            "short_description": "Decisiones de compra responsables.",
            "example_tasks": [
              "Describe qué significa ser un consumidor consciente",
              "Identifica preguntas que hacer antes de comprar algo",
              "Investiga el impacto de nuestras decisiones de consumo"
            ]
          },
          {
            "key": "derecho_generaciones_futuras",
            "name": "Derecho de Generaciones Futuras",
            "short_description": "Responsabilidad con el futuro.",
            "example_tasks": [
              "Explica por qué debemos cuidar recursos para futuras generaciones",
              "Describe cómo tus acciones hoy afectan el mañana",
              "Investiga el concepto de justicia intergeneracional"
            ]
          }
        ]
      }
    ]
  }
]
