[
  {
    "key": "propiedades_materiales",
    "name": "Propiedades de los Materiales",
    "short_description": "Los estudiantes exploran y describen las propiedades observables de diferentes materiales como dureza, flexibilidad, permeabilidad, textura, color y estado físico.",
    "sub_topics": [
      {
        "key": "propiedades_fisicas",
        "name": "Propiedades Físicas",
        "short_description": "Características que se pueden observar o medir sin cambiar la identidad del material.",
        "sub_topics": [
          {
            "key": "dureza_resistencia",
            "name": "Dureza y Resistencia",
            "short_description": "Capacidad de un material para resistir rayones, golpes o deformación.",
            "example_tasks": [
              "Clasifica cinco objetos del salón (lápiz, goma, regla de metal, plastilina, papel) del más duro al más blando intentando rayarlos entre sí.",
              "Diseña un experimento para probar cuál material (madera, cartón, metal, plástico) es más resistente al dejar caer una pelota sobre él.",
              "Explica por qué los cascos de construcción están hechos de materiales duros y menciona dos propiedades que deben tener.",
              "Investiga tres materiales duros que se usan en la construcción de casas en México y describe por qué se eligen para esa función."
            ]
          },
          {
            "key": "flexibilidad_elasticidad",
            "name": "Flexibilidad y Elasticidad",
            "short_description": "Capacidad de un material para doblarse o estirarse y volver a su forma original.",
            "example_tasks": [
              "Compara la flexibilidad de una regla de plástico, una de madera y una de metal doblándolas suavemente. Registra cuál se dobla más fácilmente.",
              "Estira una liga y observa qué sucede cuando la sueltas. Explica si el material es flexible, elástico o ambos.",
              "Menciona tres objetos en tu mochila que sean flexibles y explica por qué esta propiedad es importante para su uso.",
              "Diseña un juguete simple usando materiales flexibles (papel, cartón delgado, ligas) y explica cómo la flexibilidad lo hace funcionar."
            ]
          },
          {
            "key": "permeabilidad",
            "name": "Permeabilidad",
            "short_description": "Capacidad de un material para permitir que líquidos o gases pasen a través de él.",
            "example_tasks": [
              "Vierte agua sobre trozos de tela, papel, plástico y esponja. Registra cuáles materiales dejan pasar el agua y cuáles no.",
              "Explica por qué los impermeables están hechos de materiales impermeables mientras que las toallas son de materiales permeables.",
              "Diseña un filtro casero usando materiales de diferente permeabilidad (arena, grava, tela) para limpiar agua turbia.",
              "Investiga qué materiales se usan para hacer macetas y por qué la permeabilidad es importante para el crecimiento de las plantas."
            ]
          },
          {
            "key": "textura_apariencia",
            "name": "Textura y Apariencia",
            "short_description": "Cómo se siente un material al tacto y cómo se ve (liso, rugoso, brillante, opaco).",
            "example_tasks": [
              "Con los ojos cerrados, toca cinco materiales diferentes (lija, tela, vidrio, madera, piedra) y descríbelos como lisos o rugosos.",
              "Clasifica diez objetos del salón según su apariencia: transparentes, translúcidos u opacos.",
              "Explica por qué el vidrio de las ventanas es transparente mientras que las paredes son opacas. ¿Qué función cumple cada uno?",
              "Crea una tabla con tres columnas (liso/rugoso, brillante/opaco, suave/áspero) y clasifica objetos comunes de tu casa."
            ]
          }
        ]
      },
      {
        "key": "propiedades_quimicas_basicas",
        "name": "Propiedades Químicas Básicas",
        "short_description": "Características que describen cómo un material interactúa con otras sustancias o cambia su composición.",
        "sub_topics": [
          {
            "key": "reactividad_simple",
            "name": "Reactividad con Agua y Aire",
            "short_description": "Cómo diferentes materiales reaccionan cuando se exponen al agua o al aire.",
            "example_tasks": [
              "Observa qué sucede cuando dejas un clavo de hierro, un trozo de aluminio y un pedazo de plástico al aire libre durante una semana.",
              "Coloca una cucharada de sal, azúcar, arena y aceite en vasos con agua. Registra cuáles se disuelven y cuáles no.",
              "Explica por qué algunos metales como el hierro se oxidan (se ponen rojos) cuando se mojan mientras que otros como el oro no cambian.",
              "Investiga qué materiales se usan para fabricar tuberías de agua en México y por qué no se oxidan fácilmente."
            ]
          },
          {
            "key": "combustibilidad",
            "name": "Combustibilidad",
            "short_description": "Capacidad de un material para arder o quemarse cuando se expone al fuego.",
            "example_tasks": [
              "Clasifica los siguientes materiales como combustibles o no combustibles: papel, metal, madera, vidrio, plástico, piedra.",
              "Explica por qué es peligroso acercar papel o tela a una flama mientras que es seguro usar ollas de metal para cocinar.",
              "Menciona tres precauciones de seguridad relacionadas con materiales combustibles en tu casa o escuela.",
              "Investiga qué tipo de materiales se usan para hacer ropa de bomberos y por qué no deben ser combustibles."
            ]
          },
          {
            "key": "solubilidad_basica",
            "name": "Solubilidad Básica",
            "short_description": "Capacidad de una sustancia para disolverse en otra, especialmente en agua.",
            "example_tasks": [
              "Mezcla una cucharada de sal, azúcar, arena y harina en vasos separados con agua. Observa y registra cuáles se disuelven completamente.",
              "Explica qué significa que algo es soluble usando como ejemplo la preparación de agua de jamaica o limonada.",
              "Diseña un experimento para probar si la temperatura del agua afecta qué tan rápido se disuelve el azúcar.",
              "Menciona tres sustancias que usas en tu vida diaria que son solubles en agua y tres que no lo son."
            ]
          }
        ]
      },
      {
        "key": "medicion_propiedades",
        "name": "Medición de Propiedades",
        "short_description": "Técnicas básicas para medir y comparar propiedades de los materiales usando instrumentos simples.",
        "sub_topics": [
          {
            "key": "masa_volumen",
            "name": "Masa y Volumen",
            "short_description": "Medición de cuánta materia tiene un objeto y cuánto espacio ocupa.",
            "example_tasks": [
              "Usa una balanza para medir la masa de cinco objetos diferentes y ordénalos del más liviano al más pesado.",
              "Mide el volumen de líquidos usando una probeta o vaso medidor graduado. Registra el volumen de agua, aceite y jugo.",
              "Explica la diferencia entre masa y peso usando ejemplos cotidianos como una mochila con útiles o sin útiles.",
              "Calcula cuántos vasos de 200 mL necesitas para llenar una botella de 2 litros. Verifica tu respuesta mediante experimentación."
            ]
          },
          {
            "key": "temperatura",
            "name": "Temperatura",
            "short_description": "Medición del nivel de calor o frío de los materiales usando termómetros.",
            "example_tasks": [
              "Mide la temperatura del agua fría del garrafón, del agua tibia y del agua que dejaste al sol. Compara las lecturas.",
              "Registra la temperatura del salón en diferentes momentos del día (mañana, mediodía, tarde) durante una semana.",
              "Explica por qué es importante medir la temperatura cuando cocinamos alimentos o cuando alguien está enfermo.",
              "Diseña un experimento para investigar cómo cambia la temperatura del agua cuando le agregas hielo."
            ]
          },
          {
            "key": "densidad_simple",
            "name": "Densidad Observada",
            "short_description": "Observación de que diferentes materiales tienen diferente 'peso' para el mismo tamaño.",
            "example_tasks": [
              "Compara dos objetos del mismo tamaño aproximado (una pelota de unicel y una pelota de hule). ¿Cuál pesa más? ¿Por qué?",
              "Coloca diferentes objetos en agua (corcho, piedra, madera, metal) y observa cuáles flotan y cuáles se hunden.",
              "Explica por qué una piedra pequeña se hunde en el agua mientras que un tronco grande de madera flota.",
              "Investiga por qué los barcos grandes de metal pueden flotar en el agua aunque el metal sea pesado."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "estados_materia",
    "name": "Estados de la Materia",
    "short_description": "Los estudiantes identifican y comparan los tres estados físicos de la materia (sólido, líquido, gaseoso) y observan cómo la materia puede cambiar de un estado a otro.",
    "sub_topics": [
      {
        "key": "estado_solido",
        "name": "Estado Sólido",
        "short_description": "Características de los sólidos: forma y volumen definidos, partículas muy juntas.",
        "sub_topics": [
          {
            "key": "caracteristicas_solidos",
            "name": "Características de los Sólidos",
            "short_description": "Los sólidos mantienen su forma y volumen sin importar el contenedor donde se coloquen.",
            "example_tasks": [
              "Enumera diez objetos sólidos en tu salón de clases y explica por qué mantienen su forma.",
              "Coloca una piedra, un lápiz y un cubo de madera en diferentes recipientes. Observa si cambian de forma.",
              "Explica por qué los muebles de tu casa (mesa, silla, librero) son sólidos y no líquidos o gases.",
              "Compara un trozo de hielo y un vaso de agua. ¿En qué se parecen? ¿En qué son diferentes? Menciona el estado de cada uno."
            ]
          },
          {
            "key": "tipos_solidos",
            "name": "Tipos de Sólidos",
            "short_description": "Clasificación de sólidos según su dureza, flexibilidad y estructura (cristalinos, amorfos).",
            "example_tasks": [
              "Clasifica estos sólidos según su dureza: diamante (muy duro), madera (medio), plastilina (suave), roca (duro).",
              "Observa cristales de sal y azúcar con una lupa. Dibuja sus formas y describe qué tienen en común.",
              "Compara la estructura de un trozo de vidrio (amorfo) con un cristal de cuarzo. ¿Cuál tiene forma definida?",
              "Investiga qué minerales sólidos se extraen en México (plata, oro, cobre) y para qué se utilizan."
            ]
          }
        ]
      },
      {
        "key": "estado_liquido",
        "name": "Estado Líquido",
        "short_description": "Características de los líquidos: volumen definido pero forma variable, fluyen y se adaptan al recipiente.",
        "sub_topics": [
          {
            "key": "caracteristicas_liquidos",
            "name": "Características de los Líquidos",
            "short_description": "Los líquidos mantienen su volumen pero toman la forma del recipiente que los contiene.",
            "example_tasks": [
              "Vierte 100 mL de agua en recipientes de diferentes formas (vaso, plato hondo, botella). ¿Qué cambia y qué permanece igual?",
              "Enumera diez líquidos que uses en tu vida diaria (agua, leche, jugo, aceite, shampoo, etc.).",
              "Explica por qué puedes tomar agua con un popote pero no puedes 'tomar' una piedra de la misma manera.",
              "Observa cómo fluye el agua, la miel y el aceite por una rampa inclinada. ¿Cuál fluye más rápido? ¿Por qué?"
            ]
          },
          {
            "key": "viscosidad_simple",
            "name": "Viscosidad",
            "short_description": "Diferencias en qué tan fácil o difícil es que un líquido fluya.",
            "example_tasks": [
              "Compara cómo fluye el agua, el aceite de cocina y la miel cuando los viertes desde un recipiente.",
              "Clasifica estos líquidos del menos viscoso al más viscoso: agua, leche, jugo de naranja, miel, shampoo.",
              "Explica por qué es más difícil verter miel fría del refrigerador que miel que ha estado al sol.",
              "Diseña un experimento para medir cuál líquido (agua, aceite, jarabe) tarda más en descender por un tubo inclinado."
            ]
          },
          {
            "key": "tension_superficial",
            "name": "Tensión Superficial",
            "short_description": "Propiedad que hace que la superficie de un líquido se comporte como una película elástica.",
            "example_tasks": [
              "Coloca cuidadosamente un clip de metal sobre la superficie del agua. Observa cómo flota. ¿Qué pasa si agregas jabón?",
              "Observa cómo las gotas de agua forman esferas sobre una hoja encerada o sobre plástico.",
              "Explica cómo algunos insectos como los zapateros pueden caminar sobre el agua sin hundirse.",
              "Investiga por qué las burbujas son esféricas y qué tiene que ver con la tensión superficial del agua jabonosa."
            ]
          }
        ]
      },
      {
        "key": "estado_gaseoso",
        "name": "Estado Gaseoso",
        "short_description": "Características de los gases: no tienen forma ni volumen definidos, se expanden para llenar el espacio disponible.",
        "sub_topics": [
          {
            "key": "caracteristicas_gases",
            "name": "Características de los Gases",
            "short_description": "Los gases se expanden para ocupar todo el espacio disponible y no tienen forma ni volumen fijos.",
            "example_tasks": [
              "Infla un globo y observa cómo el aire toma la forma del globo. ¿Qué pasaría si cambias a un globo de otra forma?",
              "Explica por qué puedes oler el perfume de alguien que está del otro lado del salón después de unos segundos.",
              "Enumera cinco gases que conozcas (aire, oxígeno, dióxido de carbono, vapor de agua, gas LP).",
              "Describe qué sucede cuando abres una botella de refresco. ¿Qué gas sale? ¿Cómo lo sabes?"
            ]
          },
          {
            "key": "aire_atmosfera",
            "name": "El Aire que nos Rodea",
            "short_description": "El aire es una mezcla de gases que no podemos ver pero que ocupa espacio y tiene masa.",
            "example_tasks": [
              "Demuestra que el aire ocupa espacio introduciendo un vaso boca abajo en agua. ¿Por qué no entra el agua completamente?",
              "Siente el aire soplando con un abanico o cuando hace viento. Explica cómo sabes que el aire está ahí aunque no lo veas.",
              "Pesa un globo desinflado y luego inflado. ¿Pesa más cuando tiene aire? ¿Qué demuestra esto?",
              "Investiga qué gases componen el aire que respiramos y cuál es el más abundante."
            ]
          },
          {
            "key": "presion_gases",
            "name": "Presión de los Gases",
            "short_description": "Los gases ejercen presión sobre las paredes de su contenedor.",
            "example_tasks": [
              "Infla un globo lo más que puedas. ¿Qué sientes en tus mejillas? Explica qué es la presión del aire.",
              "Compara cómo se siente un balón de fútbol bien inflado versus uno desinflado. ¿Cuál tiene más presión?",
              "Explica por qué un globo inflado explota si le pones mucho aire o si lo acercas a algo filoso.",
              "Observa cómo funciona una bomba de aire manual para inflar bicicletas. ¿Cómo aumenta la presión del aire?"
            ]
          }
        ]
      },
      {
        "key": "cambios_estado",
        "name": "Cambios de Estado",
        "short_description": "La materia puede cambiar de un estado a otro mediante procesos como fusión, evaporación, condensación y solidificación.",
        "sub_topics": [
          {
            "key": "fusion_solidificacion",
            "name": "Fusión y Solidificación",
            "short_description": "Cambio de sólido a líquido (fusión) y de líquido a sólido (solidificación) mediante calentamiento o enfriamiento.",
            "example_tasks": [
              "Observa cómo un cubo de hielo se derrite cuando lo sacas del congelador. ¿En qué estado empieza y en cuál termina?",
              "Coloca agua en el congelador y observa qué sucede después de 2 horas. Describe el cambio de estado.",
              "Explica qué pasa con la mantequilla cuando la pones en una sartén caliente y cuando la regresas al refrigerador.",
              "Investiga a qué temperatura se derrite el hielo y a qué temperatura se solidifica el agua. ¿Es la misma temperatura?"
            ]
          },
          {
            "key": "evaporacion_condensacion",
            "name": "Evaporación y Condensación",
            "short_description": "Cambio de líquido a gas (evaporación) y de gas a líquido (condensación).",
            "example_tasks": [
              "Coloca un plato con agua al sol y otro en la sombra. Observa cada hora. ¿De cuál se evapora más rápido el agua?",
              "Observa un espejo o vidrio cuando te bañas con agua caliente. ¿Por qué se empaña? ¿Qué cambio de estado ocurre?",
              "Explica qué le sucede al agua de la ropa mojada cuando la cuelgas al sol para secarla.",
              "Calienta agua en una olla con tapa transparente. Observa las gotas que se forman en la tapa. ¿Qué proceso es este?"
            ]
          },
          {
            "key": "sublimacion",
            "name": "Sublimación",
            "short_description": "Cambio directo de sólido a gas sin pasar por el estado líquido.",
            "example_tasks": [
              "Observa cómo el hielo seco (dióxido de carbono sólido) se convierte directamente en gas sin formar un charco.",
              "Deja una bola de naftalina (alcanfor) al aire libre durante varios días. ¿Qué le sucede a su tamaño?",
              "Explica por qué la ropa húmeda se puede secar incluso cuando hace frío y el agua no hierve.",
              "Investiga qué otros materiales pueden sublimarse además del hielo seco y la naftalina."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "cambios_materiales",
    "name": "Cambios en los Materiales",
    "short_description": "Los estudiantes distinguen entre cambios físicos (reversibles, sin nueva sustancia) y cambios químicos (irreversibles, se forman nuevas sustancias) en los materiales.",
    "sub_topics": [
      {
        "key": "cambios_fisicos",
        "name": "Cambios Físicos",
        "short_description": "Transformaciones donde la sustancia mantiene su identidad química pero cambia su forma, tamaño o estado.",
        "sub_topics": [
          {
            "key": "cambios_forma_tamaño",
            "name": "Cambios de Forma y Tamaño",
            "short_description": "Modificaciones en la apariencia física sin cambiar la naturaleza del material.",
            "example_tasks": [
              "Corta una hoja de papel en pedazos pequeños. ¿Sigue siendo papel? ¿Es un cambio físico o químico?",
              "Moldea plastilina en diferentes formas (bola, culebra, cubo). ¿Cambia la sustancia o solo su forma?",
              "Rompe un lápiz en dos pedazos. ¿Los pedazos siguen siendo del mismo material que antes?",
              "Explica por qué doblar una hoja de aluminio es un cambio físico usando el concepto de que la sustancia no cambia."
            ]
          },
          {
            "key": "disolucion_mezclas",
            "name": "Disolución y Mezclas",
            "short_description": "Cuando dos o más sustancias se combinan pero pueden separarse y recuperar sus componentes originales.",
            "example_tasks": [
              "Disuelve sal en agua y luego deja evaporar el agua en un plato. ¿Puedes recuperar la sal? ¿Es un cambio físico?",
              "Mezcla arena y frijoles en un recipiente. ¿Puedes separarlos nuevamente? ¿Cambió alguna sustancia?",
              "Prepara agua de jamaica disolviendo las flores secas en agua caliente. ¿Es un cambio físico o químico? Justifica tu respuesta.",
              "Explica por qué mezclar agua con aceite es un cambio físico aunque no se mezclen completamente."
            ]
          },
          {
            "key": "cambios_estado_fisicos",
            "name": "Cambios de Estado como Cambios Físicos",
            "short_description": "La fusión, solidificación, evaporación y condensación son cambios físicos reversibles.",
            "example_tasks": [
              "Congela agua, luego déjala derretir y vuelve a congelarla. ¿Es la misma sustancia (H₂O) en todos los estados?",
              "Calienta cera de una vela hasta que se derrita, luego deja que se enfríe. ¿Cambió la composición de la cera?",
              "Explica por qué la evaporación del alcohol de un termómetro no es un cambio químico.",
              "Diseña un experimento para demostrar que el agua que se evapora y luego se condensa es la misma sustancia."
            ]
          }
        ]
      },
      {
        "key": "cambios_quimicos",
        "name": "Cambios Químicos",
        "short_description": "Transformaciones donde se forman nuevas sustancias con propiedades diferentes a las originales.",
        "sub_topics": [
          {
            "key": "combustion",
            "name": "Combustión",
            "short_description": "Reacción química donde una sustancia se combina con oxígeno produciendo calor, luz y nuevas sustancias.",
            "example_tasks": [
              "Observa cómo una vela se quema. ¿Puedes recuperar la cera original después? ¿Por qué es un cambio químico?",
              "Compara un trozo de papel antes y después de quemarlo. Enumera tres diferencias en sus propiedades.",
              "Explica por qué necesitamos oxígeno para que algo se queme. ¿Qué pasa si tapas una vela con un vaso?",
              "Investiga qué sustancias se forman cuando quemamos madera (cenizas, dióxido de carbono, vapor de agua). ¿Son iguales a la madera?"
            ]
          },
          {
            "key": "oxidacion_corrosion",
            "name": "Oxidación y Corrosión",
            "short_description": "Reacción del metal con el oxígeno del aire, especialmente en presencia de agua, formando óxidos.",
            "example_tasks": [
              "Observa un clavo de hierro que se oxidó. Compara su color y textura con un clavo nuevo. ¿Es el mismo material?",
              "Diseña un experimento para acelerar la oxidación de un clavo dejándolo en agua, en agua salada y al aire seco.",
              "Explica por qué las bicicletas que se dejan a la intemperie se oxidan más rápido que las guardadas en un lugar seco.",
              "Investiga por qué los barcos se pintan y cómo esto previene la oxidación del metal."
            ]
          },
          {
            "key": "coccion_alimentos",
            "name": "Cocción de Alimentos",
            "short_description": "Cambios químicos que ocurren cuando calentamos alimentos, cambiando su sabor, color, textura y composición.",
            "example_tasks": [
              "Compara un huevo crudo con un huevo cocido. ¿Puedes volver el huevo cocido a su estado crudo? ¿Por qué no?",
              "Observa qué le pasa a una tortilla cuando la calientas en el comal. ¿Cambia su color, olor y textura?",
              "Explica por qué tostar pan es un cambio químico usando evidencias como el cambio de color y olor.",
              "Investiga qué le sucede al azúcar cuando se calienta mucho (caramelización). ¿Se forma una sustancia nueva?"
            ]
          },
          {
            "key": "descomposicion_putrefaccion",
            "name": "Descomposición y Putrefacción",
            "short_description": "Cambios químicos donde los materiales orgánicos se transforman en sustancias más simples por acción de microorganismos.",
            "example_tasks": [
              "Observa cómo cambia una rebanada de pan dejada al aire durante una semana. ¿Qué le sucede? ¿Es un cambio químico?",
              "Compara una manzana fresca con una manzana que se echó a perder. Enumera los cambios en color, olor y textura.",
              "Explica por qué guardamos alimentos en el refrigerador para que no se descompongan tan rápido.",
              "Investiga cómo el proceso de descomposición en la naturaleza ayuda a reciclar nutrientes en el suelo."
            ]
          }
        ]
      },
      {
        "key": "identificacion_cambios",
        "name": "Identificación de Tipos de Cambios",
        "short_description": "Criterios para determinar si un cambio es físico o químico mediante la observación de evidencias.",
        "sub_topics": [
          {
            "key": "evidencias_cambio_quimico",
            "name": "Evidencias de Cambio Químico",
            "short_description": "Señales que indican que ocurrió una reacción química: cambio de color, formación de gas, cambio de temperatura, formación de precipitado.",
            "example_tasks": [
              "Mezcla vinagre con bicarbonato de sodio. Observa las burbujas que se forman. ¿Qué evidencia indica un cambio químico?",
              "Agrega limón a un vaso de leche y observa qué sucede después de unos minutos. ¿Se formó algo nuevo?",
              "Calienta azúcar en una cuchara de metal. Observa el cambio de color a café oscuro. ¿Es un cambio físico o químico?",
              "Enumera cuatro evidencias que te ayudan a identificar si ocurrió un cambio químico."
            ]
          },
          {
            "key": "reversibilidad",
            "name": "Reversibilidad de los Cambios",
            "short_description": "Los cambios físicos generalmente son reversibles mientras que los cambios químicos son irreversibles.",
            "example_tasks": [
              "Clasifica estos procesos como reversibles o irreversibles: derretir hielo, quemar papel, disolver sal, hornear un pastel.",
              "Explica por qué puedes recuperar el agua que se evaporó pero no puedes 'desquemar' un papel.",
              "Diseña un experimento para demostrar que mezclar agua y arena es un cambio reversible.",
              "Investiga si la oxidación del hierro es reversible. ¿Se puede convertir el óxido de hierro de nuevo en hierro puro fácilmente?"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "clasificacion_materiales",
    "name": "Clasificación de Materiales",
    "short_description": "Los estudiantes clasifican materiales según su origen (natural o sintético) y su composición (orgánico o inorgánico) para entender la diversidad de materiales que nos rodean.",
    "sub_topics": [
      {
        "key": "materiales_naturales_sinteticos",
        "name": "Materiales Naturales y Sintéticos",
        "short_description": "Distinción entre materiales que se encuentran en la naturaleza y los que son fabricados por el ser humano.",
        "sub_topics": [
          {
            "key": "materiales_naturales",
            "name": "Materiales Naturales",
            "short_description": "Materiales que provienen directamente de la naturaleza: madera, algodón, lana, piedra, metales en minerales.",
            "example_tasks": [
              "Enumera diez materiales naturales que uses en tu vida diaria y menciona de dónde provienen (plantas, animales, minerales).",
              "Clasifica estos materiales como naturales o sintéticos: algodón, poliéster, madera, plástico, lana, nylon.",
              "Investiga el origen de tres materiales naturales usados en tu ropa: algodón (planta), lana (oveja), seda (gusano de seda).",
              "Explica por qué la madera de los árboles es un material natural mientras que el plástico no lo es."
            ]
          },
          {
            "key": "materiales_sinteticos",
            "name": "Materiales Sintéticos",
            "short_description": "Materiales fabricados por el ser humano a partir de procesos químicos: plásticos, fibras sintéticas, algunos metales procesados.",
            "example_tasks": [
              "Identifica cinco objetos en tu mochila hechos de materiales sintéticos como plástico, nylon o poliéster.",
              "Compara una camiseta de algodón con una de poliéster. ¿Cuál es natural y cuál es sintética? ¿Cómo se sienten diferentes?",
              "Explica por qué el plástico es un material sintético que no existía hace 200 años.",
              "Investiga qué ventajas tienen algunos materiales sintéticos sobre los naturales (durabilidad, resistencia al agua, menor costo)."
            ]
          },
          {
            "key": "transformacion_materiales",
            "name": "Transformación de Materiales Naturales",
            "short_description": "Procesos mediante los cuales los materiales naturales se transforman en productos útiles.",
            "example_tasks": [
              "Describe el proceso de cómo se transforma el algodón desde la planta hasta convertirse en tela para ropa.",
              "Investiga cómo se obtiene el papel a partir de la madera de los árboles.",
              "Explica el proceso de cómo se extrae y procesa el hierro de los minerales hasta convertirse en metal para herramientas.",
              "Compara el proceso de obtener miel (natural) versus fabricar azúcar refinada (procesada) a partir de la caña."
            ]
          }
        ]
      },
      {
        "key": "materiales_organicos_inorganicos",
        "name": "Materiales Orgánicos e Inorgánicos",
        "short_description": "Clasificación de materiales según contengan o no compuestos de carbono asociados con seres vivos.",
        "sub_topics": [
          {
            "key": "materiales_organicos",
            "name": "Materiales Orgánicos",
            "short_description": "Materiales que provienen de seres vivos o contienen carbono: madera, papel, algodón, alimentos, petróleo.",
            "example_tasks": [
              "Clasifica estos materiales como orgánicos o inorgánicos: papel, vidrio, madera, metal, algodón, plástico.",
              "Enumera diez materiales orgánicos en tu casa que provengan de plantas o animales.",
              "Explica por qué el papel es orgánico (viene de árboles) mientras que el vidrio es inorgánico (viene de arena).",
              "Investiga qué le sucede a los materiales orgánicos cuando se descomponen comparado con los inorgánicos."
            ]
          },
          {
            "key": "materiales_inorganicos",
            "name": "Materiales Inorgánicos",
            "short_description": "Materiales que no provienen de seres vivos: metales, minerales, vidrio, cerámica, sal.",
            "example_tasks": [
              "Identifica cinco objetos metálicos en tu salón. ¿Son orgánicos o inorgánicos? ¿De dónde provienen?",
              "Compara cómo se descompone una hoja de árbol (orgánica) versus cómo cambia una piedra (inorgánica) con el tiempo.",
              "Explica por qué la sal de mesa es un material inorgánico aunque la usemos en alimentos.",
              "Investiga tres materiales inorgánicos que se extraen de minas en México: oro, plata, cobre."
            ]
          },
          {
            "key": "biodegradabilidad",
            "name": "Biodegradabilidad",
            "short_description": "Capacidad de los materiales para descomponerse naturalmente por acción de microorganismos.",
            "example_tasks": [
              "Entierra una cáscara de plátano, un trozo de papel y un pedazo de plástico. Revísalos después de dos semanas. ¿Cuál se descompuso?",
              "Clasifica estos materiales como biodegradables o no biodegradables: cartón, vidrio, cáscara de huevo, bolsa de plástico, metal.",
              "Explica por qué es importante usar materiales biodegradables para cuidar el medio ambiente.",
              "Investiga cuánto tiempo tarda en descomponerse cada material: papel (2-6 meses), plástico (100-1000 años), vidrio (millones de años)."
            ]
          }
        ]
      },
      {
        "key": "impacto_ambiental_materiales",
        "name": "Impacto Ambiental de los Materiales",
        "short_description": "Efectos que tiene la extracción, producción y desecho de materiales sobre el medio ambiente.",
        "sub_topics": [
          {
            "key": "extraccion_recursos",
            "name": "Extracción de Recursos Naturales",
            "short_description": "Impactos ambientales de obtener materiales de la naturaleza: minería, tala de árboles, extracción de petróleo.",
            "example_tasks": [
              "Investiga cómo la tala de árboles para obtener madera puede afectar los bosques y la vida silvestre.",
              "Explica qué problemas ambientales puede causar la minería de metales como el oro y la plata.",
              "Describe tres formas de reducir el impacto ambiental al usar materiales naturales (reforestación, minería responsable, reciclaje).",
              "Compara el impacto de usar bolsas de papel (orgánicas, biodegradables) versus bolsas de plástico (sintéticas, no biodegradables)."
            ]
          },
          {
            "key": "contaminacion_desechos",
            "name": "Contaminación por Desechos",
            "short_description": "Problemas causados por la acumulación de materiales no biodegradables en el ambiente.",
            "example_tasks": [
              "Observa fotografías de playas contaminadas con plástico. ¿Qué efectos tiene esto en los animales marinos?",
              "Calcula cuántas botellas de plástico usa tu familia en una semana. ¿Qué pasaría si todas fueran al basurero?",
              "Explica por qué es importante separar los desechos orgánicos de los inorgánicos.",
              "Diseña un cartel para promover la reducción del uso de plásticos desechables en tu escuela."
            ]
          },
          {
            "key": "reducir_reusar_reciclar",
            "name": "Reducir, Reusar y Reciclar",
            "short_description": "Estrategias para minimizar el impacto ambiental de los materiales que usamos.",
            "example_tasks": [
              "Propón tres formas de reducir el uso de materiales en tu casa (usar termos en vez de botellas desechables, bolsas reutilizables).",
              "Crea un proyecto de arte usando materiales reusados (cartón, botellas, tapas, periódico).",
              "Investiga qué materiales se pueden reciclar en tu comunidad y diseña un plan para separar la basura en tu casa.",
              "Explica la diferencia entre reducir (usar menos), reusar (darle otro uso) y reciclar (transformar en nuevo material)."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "mezclas_soluciones",
    "name": "Mezclas y Soluciones",
    "short_description": "Los estudiantes exploran cómo se combinan diferentes materiales formando mezclas homogéneas y heterogéneas, y aprenden sobre el proceso de disolución.",
    "sub_topics": [
      {
        "key": "tipos_mezclas",
        "name": "Tipos de Mezclas",
        "short_description": "Clasificación de mezclas según la uniformidad de sus componentes: homogéneas y heterogéneas.",
        "sub_topics": [
          {
            "key": "mezclas_heterogeneas",
            "name": "Mezclas Heterogéneas",
            "short_description": "Mezclas donde se pueden distinguir sus componentes a simple vista o con instrumentos sencillos.",
            "example_tasks": [
              "Mezcla arena con frijoles en un recipiente. ¿Puedes ver los componentes separados? Esta es una mezcla heterogénea.",
              "Prepara una ensalada mezclando lechuga, tomate y zanahoria. Identifica cada componente de la mezcla.",
              "Observa un puñado de tierra con una lupa. ¿Puedes distinguir diferentes materiales? Enumera al menos tres.",
              "Compara la apariencia de agua con aceite (heterogénea) versus agua con sal disuelta (homogénea). Dibuja lo que observas."
            ]
          },
          {
            "key": "mezclas_homogeneas",
            "name": "Mezclas Homogéneas",
            "short_description": "Mezclas donde los componentes están uniformemente distribuidos y no se distinguen a simple vista.",
            "example_tasks": [
              "Disuelve azúcar en agua hasta que desaparezca completamente. ¿Puedes ver el azúcar? ¿Por qué es una mezcla homogénea?",
              "Observa el aire que te rodea. Aunque es una mezcla de gases, se ve uniforme. ¿Es homogénea o heterogénea?",
              "Prepara agua de sabor disolviendo un sobre de polvo en agua. ¿Se distribuye uniformemente el color y sabor?",
              "Compara leche (homogénea) con chocolate caliente recién preparado (heterogénea si tiene grumos). Explica la diferencia."
            ]
          },
          {
            "key": "identificacion_mezclas",
            "name": "Identificación de Componentes",
            "short_description": "Técnicas para identificar qué sustancias forman parte de una mezcla.",
            "example_tasks": [
              "Examina una muestra de granola. Enumera todos los ingredientes que puedes identificar visualmente.",
              "Analiza una muestra de agua de río con una lupa. ¿Qué partículas o materiales puedes observar?",
              "Clasifica estas mezclas como homogéneas o heterogéneas: refresco, sopa de verduras, aire, chocolate con almendras, vinagre.",
              "Diseña un método para separar los ingredientes de una mezcla de cereales con pasas y nueces."
            ]
          }
        ]
      },
      {
        "key": "soluciones",
        "name": "Soluciones",
        "short_description": "Mezclas homogéneas donde una sustancia (soluto) se disuelve completamente en otra (solvente).",
        "sub_topics": [
          {
            "key": "soluto_solvente",
            "name": "Soluto y Solvente",
            "short_description": "Identificación de la sustancia que se disuelve (soluto) y la que disuelve (solvente) en una solución.",
            "example_tasks": [
              "Cuando preparas agua de jamaica, ¿qué es el soluto y qué es el solvente? Explica tu respuesta.",
              "Disuelve sal en agua. Identifica cuál es el soluto (sal) y cuál es el solvente (agua).",
              "Prepara tres soluciones diferentes: azúcar en agua, chocolate en polvo en leche, refresco en polvo en agua. Identifica soluto y solvente en cada caso.",
              "Explica por qué el agua se conoce como el 'solvente universal' porque disuelve muchas sustancias."
            ]
          },
          {
            "key": "proceso_disolucion",
            "name": "Proceso de Disolución",
            "short_description": "Cómo las partículas del soluto se dispersan uniformemente entre las partículas del solvente.",
            "example_tasks": [
              "Observa cómo se disuelve azúcar en agua: primero se ve, luego desaparece. ¿A dónde va el azúcar?",
              "Agrega una gota de colorante vegetal a un vaso con agua. Observa cómo se dispersa. Describe el proceso que ves.",
              "Compara qué tan rápido se disuelve el azúcar si la revuelves versus si no la mueves. ¿Qué factor acelera la disolución?",
              "Explica qué significa 'disolver' usando tus propias palabras y un dibujo que muestre las partículas antes y después."
            ]
          },
          {
            "key": "factores_afectan_disolucion",
            "name": "Factores que Afectan la Disolución",
            "short_description": "Variables que influyen en qué tan rápido o cuánto se disuelve una sustancia: temperatura, agitación, tamaño de partículas.",
            "example_tasks": [
              "Disuelve azúcar en agua fría y en agua caliente. ¿En cuál se disuelve más rápido? ¿Por qué?",
              "Compara la velocidad de disolución de un terrón de azúcar completo versus azúcar en polvo. ¿Cuál se disuelve más rápido?",
              "Diseña un experimento para probar si la agitación (revolver) afecta qué tan rápido se disuelve la sal en agua.",
              "Prepara té con agua caliente y con agua fría. Compara qué tan rápido se disuelven los componentes del té."
            ]
          },
          {
            "key": "saturacion",
            "name": "Saturación de Soluciones",
            "short_description": "Punto en el cual no se puede disolver más soluto en determinada cantidad de solvente a una temperatura dada.",
            "example_tasks": [
              "Agrega cucharadas de azúcar a un vaso con agua hasta que ya no se disuelva más. ¿Cuántas cucharadas pudiste disolver?",
              "Observa lo que sucede cuando intentas disolver más sal de la que el agua puede aceptar. ¿Qué pasa con el exceso?",
              "Calienta una solución saturada de azúcar en agua. ¿Puedes disolver más azúcar cuando está caliente?",
              "Explica qué es una solución saturada usando el ejemplo de preparar agua de jamaica muy concentrada."
            ]
          }
        ]
      },
      {
        "key": "concentracion",
        "name": "Concentración de Soluciones",
        "short_description": "Cantidad de soluto disuelto en determinada cantidad de solvente: soluciones diluidas, concentradas y saturadas.",
        "sub_topics": [
          {
            "key": "soluciones_diluidas_concentradas",
            "name": "Soluciones Diluidas y Concentradas",
            "short_description": "Comparación de soluciones según la cantidad relativa de soluto que contienen.",
            "example_tasks": [
              "Prepara dos vasos de agua de jamaica: uno con mucha jamaica (concentrado) y otro con poca (diluido). Compara el color y sabor.",
              "Compara el sabor de un refresco recién abierto versus uno al que le agregaste agua. ¿Cuál está más concentrado?",
              "Clasifica estas bebidas de menos a más concentradas: agua natural, agua de limón ligera, limonada concentrada, jugo puro.",
              "Explica cómo puedes hacer más diluida una solución concentrada de chocolate en leche."
            ]
          },
          {
            "key": "medicion_concentracion_simple",
            "name": "Medición Simple de Concentración",
            "short_description": "Formas básicas de expresar concentración usando cucharadas de soluto por vaso de solvente.",
            "example_tasks": [
              "Si usas 2 cucharadas de azúcar en un vaso de agua y 4 cucharadas en otro vaso igual, ¿cuál está más concentrado?",
              "Prepara tres soluciones de sal en agua usando 1, 2 y 3 cucharadas en la misma cantidad de agua. Ordénalas por concentración.",
              "Registra cuántas cucharadas de refresco en polvo usas para preparar un litro de agua. Compáralo con las instrucciones del empaque.",
              "Diseña un método para comparar la concentración de dos soluciones de azúcar en agua sin probarlas."
            ]
          },
          {
            "key": "efectos_concentracion",
            "name": "Efectos de la Concentración",
            "short_description": "Cómo la concentración afecta las propiedades de una solución como sabor, color, densidad.",
            "example_tasks": [
              "Compara el sabor de agua con una pizca de sal versus agua muy salada. ¿Cómo afecta la concentración al sabor?",
              "Observa el color de agua de jamaica preparada con diferente concentración. ¿Es más oscura cuando está más concentrada?",
              "Flota un huevo en agua natural y en agua muy salada (saturada). ¿Qué observas? ¿Por qué sucede esto?",
              "Explica por qué el agua del mar (solución concentrada de sales) sabe muy diferente al agua dulce."
            ]
          }
        ]
      },
      {
        "key": "importancia_soluciones",
        "name": "Importancia de las Soluciones",
        "short_description": "Aplicaciones de las soluciones en la vida cotidiana, la salud, la industria y la naturaleza.",
        "sub_topics": [
          {
            "key": "soluciones_vida_diaria",
            "name": "Soluciones en la Vida Diaria",
            "short_description": "Ejemplos de soluciones que usamos todos los días en casa.",
            "example_tasks": [
              "Enumera diez soluciones que uses en tu casa: jugo, refresco, vinagre, agua de jamaica, jabón líquido, shampoo, alcohol.",
              "Identifica el soluto y el solvente en cada una de estas soluciones comunes: té, café, perfume, pintura líquida.",
              "Explica por qué es importante que la medicina líquida sea una solución homogénea y no heterogénea.",
              "Investiga cómo se prepara el suero oral (solución de sales y azúcar en agua) y por qué es importante para la hidratación."
            ]
          },
          {
            "key": "soluciones_naturaleza",
            "name": "Soluciones en la Naturaleza",
            "short_description": "Soluciones naturales como el agua de mar, la savia de las plantas y los fluidos corporales.",
            "example_tasks": [
              "Investiga qué sustancias están disueltas en el agua del mar (sales, minerales, gases).",
              "Explica cómo las plantas transportan nutrientes disueltos en agua desde las raíces hasta las hojas.",
              "Describe por qué la sangre es una solución compleja que transporta oxígeno, nutrientes y desechos.",
              "Compara la concentración de sales en el agua de mar versus agua de un lago o río."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "metodos_separacion",
    "name": "Métodos de Separación de Mezclas",
    "short_description": "Los estudiantes aprenden técnicas para separar los componentes de mezclas aprovechando las diferencias en sus propiedades físicas.",
    "sub_topics": [
      {
        "key": "separacion_manual",
        "name": "Separación Manual",
        "short_description": "Métodos que usan la observación directa y manipulación manual para separar componentes.",
        "sub_topics": [
          {
            "key": "tamizado",
            "name": "Tamizado",
            "short_description": "Separación de partículas de diferente tamaño usando mallas o tamices.",
            "example_tasks": [
              "Usa un colador de cocina para separar arena fina de piedritas más grandes. ¿Qué queda en el colador y qué pasa al otro lado?",
              "Separa harina de arroz usando un tamiz. Explica cómo el tamaño de las partículas permite la separación.",
              "Diseña un experimento para separar tres materiales de diferente tamaño (frijoles, lentejas, arena) usando tamices.",
              "Investiga cómo se usa el tamizado en la construcción para separar grava de diferentes tamaños."
            ]
          },
          {
            "key": "seleccion_manual",
            "name": "Selección Manual",
            "short_description": "Separación directa de componentes usando las manos o pinzas cuando son fácilmente distinguibles.",
            "example_tasks": [
              "Separa una mezcla de frijoles, arroz y lentejas usando solo tus manos. ¿Qué estrategia usaste?",
              "Retira las piedritas de un puñado de frijoles antes de cocinarlos. ¿Por qué es importante hacer esta separación?",
              "Clasifica botones de diferentes colores y tamaños que están mezclados en una caja.",
              "Explica en qué situaciones la selección manual es el mejor método de separación."
            ]
          },
          {
            "key": "magnetismo",
            "name": "Separación Magnética",
            "short_description": "Uso de imanes para separar materiales magnéticos de los no magnéticos.",
            "example_tasks": [
              "Mezcla clips de metal con piedritas. Usa un imán para separar los clips. ¿Funciona? ¿Por qué?",
              "Diseña un método para separar arena de limaduras de hierro usando un imán.",
              "Investiga qué metales son atraídos por imanes (hierro, níquel, cobalto) y cuáles no (aluminio, cobre, oro).",
              "Explica cómo se usan grandes imanes en centros de reciclaje para separar metales ferrosos de otros materiales."
            ]
          }
        ]
      },
      {
        "key": "separacion_liquidos_solidos",
        "name": "Separación de Líquidos y Sólidos",
        "short_description": "Técnicas para separar componentes sólidos suspendidos en líquidos o para recuperar el solvente.",
        "sub_topics": [
          {
            "key": "filtracion",
            "name": "Filtración",
            "short_description": "Separación de sólidos suspendidos en líquidos usando un material poroso que retiene las partículas.",
            "example_tasks": [
              "Filtra agua con tierra usando un filtro de café o tela. ¿Qué queda en el filtro y qué pasa al otro lado?",
              "Diseña un filtro casero usando capas de arena, grava y algodón para limpiar agua turbia.",
              "Explica cómo funciona un colador cuando preparas agua de jamaica: retiene las flores pero deja pasar el líquido.",
              "Investiga cómo las plantas potabilizadoras usan filtros para limpiar el agua que llega a nuestras casas."
            ]
          },
          {
            "key": "decantacion",
            "name": "Decantación",
            "short_description": "Separación de líquidos de sólidos sedimentados o de líquidos inmiscibles dejándolos reposar.",
            "example_tasks": [
              "Mezcla agua con arena, deja reposar hasta que la arena se asiente en el fondo, y vierte cuidadosamente el agua clara.",
              "Observa cómo el aceite y el agua se separan naturalmente en capas. Identifica cuál queda arriba y por qué.",
              "Explica cómo se usa la decantación para separar el agua de los frijoles después de remojarlos.",
              "Diseña un procedimiento para separar agua de piedras pequeñas usando decantación."
            ]
          },
          {
            "key": "evaporacion",
            "name": "Evaporación",
            "short_description": "Recuperación de un soluto sólido eliminando el solvente líquido mediante calentamiento o exposición al aire.",
            "example_tasks": [
              "Disuelve sal en agua y deja el vaso al sol durante varios días. ¿Qué queda cuando se evapora toda el agua?",
              "Compara qué tan rápido se evapora el agua en un plato (mucha superficie) versus en un vaso (poca superficie).",
              "Explica cómo se obtiene sal de mar mediante evaporación del agua en las salinas.",
              "Diseña un experimento para recuperar azúcar de una solución de agua azucarada usando evaporación."
            ]
          },
          {
            "key": "destilacion_simple",
            "name": "Destilación Simple (concepto básico)",
            "short_description": "Separación mediante evaporación del solvente y condensación de sus vapores para recuperarlo puro.",
            "example_tasks": [
              "Observa cómo se forma vapor cuando hierves agua y cómo se condensa en una tapa fría formando gotas.",
              "Explica el concepto básico de destilación: el agua se evapora (cambia a vapor) y luego se condensa (regresa a líquido).",
              "Discute cómo la destilación se usa para purificar agua o para obtener agua destilada para baterías.",
              "Investiga cómo se puede obtener agua dulce del agua de mar mediante destilación."
            ]
          }
        ]
      },
      {
        "key": "aplicaciones_separacion",
        "name": "Aplicaciones de los Métodos de Separación",
        "short_description": "Uso práctico de las técnicas de separación en la industria, el hogar y la conservación ambiental.",
        "sub_topics": [
          {
            "key": "tratamiento_agua",
            "name": "Tratamiento de Agua",
            "short_description": "Procesos de purificación del agua usando métodos de separación combinados.",
            "example_tasks": [
              "Enumera los pasos que sigue el agua en una planta potabilizadora: sedimentación, filtración, cloración.",
              "Diseña un filtro casero de emergencia usando materiales disponibles (arena, grava, tela, carbón activado).",
              "Explica por qué es importante filtrar y purificar el agua antes de beberla.",
              "Investiga cómo las comunidades rurales en México pueden purificar agua usando métodos simples de separación."
            ]
          },
          {
            "key": "reciclaje",
            "name": "Reciclaje de Materiales",
            "short_description": "Separación de diferentes tipos de desechos para su procesamiento y reutilización.",
            "example_tasks": [
              "Clasifica la basura de un día en tu casa en categorías: orgánica, papel/cartón, plástico, vidrio, metal.",
              "Explica cómo la separación de basura facilita el reciclaje de materiales como plástico, papel y vidrio.",
              "Diseña un sistema de contenedores para separar diferentes tipos de residuos en tu escuela.",
              "Investiga qué métodos se usan en centros de reciclaje para separar metales, plásticos y vidrio."
            ]
          },
          {
            "key": "preparacion_alimentos",
            "name": "Preparación de Alimentos",
            "short_description": "Uso de métodos de separación al cocinar y preparar bebidas.",
            "example_tasks": [
              "Identifica métodos de separación al preparar agua de jamaica: filtración (colar), decantación (servir sin el sedimento).",
              "Explica cómo se usa la filtración cuando hacemos café en cafetera de filtro.",
              "Describe el proceso de colar el caldo de pollo: ¿qué método de separación estás usando?",
              "Enumera tres ejemplos de métodos de separación que hayas visto en la cocina de tu casa."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "agua_propiedades",
    "name": "El Agua y sus Propiedades",
    "short_description": "Los estudiantes exploran las propiedades únicas del agua, su importancia para la vida y sus transformaciones en el ciclo del agua.",
    "sub_topics": [
      {
        "key": "propiedades_fisicas_agua",
        "name": "Propiedades Físicas del Agua",
        "short_description": "Características observables del agua en sus diferentes estados y comportamientos.",
        "sub_topics": [
          {
            "key": "estados_agua",
            "name": "Estados del Agua",
            "short_description": "El agua existe como sólido (hielo), líquido (agua) y gas (vapor) en condiciones naturales.",
            "example_tasks": [
              "Observa cubos de hielo derritiéndose. Registra los cambios que ves cada 5 minutos hasta que se conviertan en agua líquida.",
              "Hierve agua en una olla y observa el vapor que sale. ¿En qué estado está el agua que sale como vapor?",
              "Enumera cinco lugares donde puedas encontrar agua en estado sólido, líquido y gaseoso en la naturaleza.",
              "Explica por qué el agua es la única sustancia común que podemos encontrar fácilmente en los tres estados en la Tierra."
            ]
          },
          {
            "key": "incolora_inodora_insipida",
            "name": "Incolora, Inodora e Insípida",
            "short_description": "El agua pura no tiene color, olor ni sabor propios.",
            "example_tasks": [
              "Compara agua purificada con jugo, leche y refresco. ¿Cuál no tiene color, olor o sabor?",
              "Explica por qué el agua de la llave a veces tiene sabor u olor si el agua pura no debería tenerlo.",
              "Observa agua en un vaso transparente contra una hoja blanca. ¿De qué color es el agua pura?",
              "Investiga por qué el agua del mar sabe salada si el agua pura es insípida."
            ]
          },
          {
            "key": "punto_congelacion_ebullicion",
            "name": "Puntos de Congelación y Ebullición",
            "short_description": "El agua se congela a 0°C y hierve a 100°C a nivel del mar.",
            "example_tasks": [
              "Mide la temperatura del agua cuando está congelándose en el refrigerador usando un termómetro.",
              "Observa la temperatura del agua hirviendo (con supervisión de un adulto). ¿Se acerca a 100°C?",
              "Explica por qué el agua se congela en el congelador y se derrite cuando la sacamos.",
              "Investiga cómo la altitud afecta el punto de ebullición del agua. ¿Hierve a la misma temperatura en la Ciudad de México que en Veracruz?"
            ]
          },
          {
            "key": "expansion_congelacion",
            "name": "Expansión al Congelarse",
            "short_description": "El agua se expande cuando se congela, a diferencia de la mayoría de las sustancias.",
            "example_tasks": [
              "Llena un recipiente de plástico con agua hasta el borde y congélalo. ¿Qué le sucede al nivel del agua cuando se congela?",
              "Explica por qué no debes llenar completamente las charolas de hielo antes de congelarlas.",
              "Investiga por qué el hielo flota en el agua mientras que la mayoría de los sólidos se hunden en sus líquidos.",
              "Discute cómo la expansión del agua al congelarse puede romper tuberías en lugares muy fríos."
            ]
          }
        ]
      },
      {
        "key": "agua_solvente_universal",
        "name": "El Agua como Solvente Universal",
        "short_description": "Capacidad del agua para disolver muchas sustancias diferentes, esencial para la vida.",
        "sub_topics": [
          {
            "key": "disolucion_sustancias",
            "name": "Disolución de Sustancias en Agua",
            "short_description": "Cómo diferentes materiales interactúan con el agua: solubles e insolubles.",
            "example_tasks": [
              "Prueba disolver sal, azúcar, arena, aceite y harina en agua. Clasifica cuáles son solubles y cuáles no.",
              "Explica por qué el agua puede disolver más sustancias que otros líquidos como el aceite.",
              "Observa cómo se disuelve el refresco en polvo en agua fría versus agua caliente. ¿Qué factor afecta la disolución?",
              "Investiga qué sustancias importantes para las plantas (minerales, nutrientes) se disuelven en el agua del suelo."
            ]
          },
          {
            "key": "transporte_nutrientes",
            "name": "Transporte de Nutrientes",
            "short_description": "El agua disuelve y transporta nutrientes en plantas y animales.",
            "example_tasks": [
              "Coloca una rama de apio en agua con colorante vegetal. Observa cómo el agua coloreada sube por el tallo.",
              "Explica cómo la sangre (que es principalmente agua) transporta nutrientes y oxígeno en nuestro cuerpo.",
              "Investiga cómo las plantas absorben minerales del suelo disueltos en agua a través de sus raíces.",
              "Discute por qué es importante tomar agua para que nuestro cuerpo funcione correctamente."
            ]
          },
          {
            "key": "agua_contaminada",
            "name": "Agua y Contaminación",
            "short_description": "Cómo la capacidad del agua de disolver sustancias puede llevar a su contaminación.",
            "example_tasks": [
              "Agrega una gota de colorante vegetal a un vaso con agua limpia. Observa cómo se dispersa rápidamente.",
              "Explica por qué es peligroso tirar productos químicos al agua: se disuelven y se dispersan fácilmente.",
              "Investiga qué contaminantes comunes pueden disolverse en el agua (detergentes, metales pesados, pesticidas).",
              "Diseña un cartel sobre la importancia de no contaminar ríos y lagos, explicando cómo afecta a los seres vivos."
            ]
          }
        ]
      },
      {
        "key": "ciclo_agua",
        "name": "El Ciclo del Agua",
        "short_description": "Movimiento continuo del agua en la Tierra a través de procesos de evaporación, condensación, precipitación e infiltración.",
        "sub_topics": [
          {
            "key": "evaporacion_ciclo",
            "name": "Evaporación",
            "short_description": "Transformación del agua líquida en vapor por acción del calor del sol.",
            "example_tasks": [
              "Coloca dos platos con la misma cantidad de agua, uno al sol y otro a la sombra. ¿De cuál se evapora más rápido el agua?",
              "Dibuja cómo el agua de océanos, ríos y lagos se evapora formando vapor de agua invisible en el aire.",
              "Explica qué le sucede al agua de los charcos después de que llueve. ¿A dónde va el agua?",
              "Mide cuánta agua se evapora de un vaso en una semana. Registra el nivel del agua cada día."
            ]
          },
          {
            "key": "condensacion_nubes",
            "name": "Condensación y Formación de Nubes",
            "short_description": "Transformación del vapor de agua en gotitas líquidas cuando el aire se enfría formando nubes.",
            "example_tasks": [
              "Observa cómo se forman gotas de agua en la parte externa de un vaso con agua helada. ¿De dónde viene esa agua?",
              "Explica cómo se forman las nubes cuando el vapor de agua en el aire se enfría y condensa en gotitas.",
              "Observa tu aliento en un espejo o en un día frío. ¿Qué proceso está ocurriendo?",
              "Investiga por qué las nubes se forman a gran altura donde la temperatura es más baja."
            ]
          },
          {
            "key": "precipitacion",
            "name": "Precipitación",
            "short_description": "Caída de agua desde las nubes en forma de lluvia, nieve o granizo.",
            "example_tasks": [
              "Registra durante un mes cuántos días llueve en tu ciudad. Crea una gráfica con los datos.",
              "Explica la diferencia entre lluvia, nieve y granizo. ¿En qué estado se encuentra el agua en cada caso?",
              "Observa cómo las nubes se ponen oscuras antes de llover. ¿Por qué crees que esto sucede?",
              "Investiga en qué regiones de México llueve más y en cuáles llueve menos durante el año."
            ]
          },
          {
            "key": "escurrimiento_infiltracion",
            "name": "Escurrimiento e Infiltración",
            "short_description": "Movimiento del agua sobre la superficie (escurrimiento) y hacia el subsuelo (infiltración).",
            "example_tasks": [
              "Después de una lluvia, observa hacia dónde fluye el agua: ¿hacia calles, coladeras, jardines?",
              "Compara cómo el agua se infiltra en tierra de jardín versus en concreto. ¿Cuál absorbe más agua?",
              "Explica cómo el agua que se infiltra en el suelo recarga los mantos acuíferos subterráneos.",
              "Diseña un experimento para mostrar cómo diferentes superficies (tierra, arena, arcilla) absorben agua a diferente velocidad."
            ]
          },
          {
            "key": "importancia_ciclo_agua",
            "name": "Importancia del Ciclo del Agua",
            "short_description": "El ciclo del agua mantiene el agua en movimiento constante y disponible para todos los seres vivos.",
            "example_tasks": [
              "Dibuja un diagrama completo del ciclo del agua mostrando evaporación, condensación, precipitación e infiltración.",
              "Explica por qué el ciclo del agua es importante para mantener la vida en la Tierra.",
              "Investiga cómo las actividades humanas (deforestación, pavimentación) pueden afectar el ciclo del agua.",
              "Discute qué pasaría si el ciclo del agua se detuviera o se alterara significativamente."
            ]
          }
        ]
      },
      {
        "key": "conservacion_agua",
        "name": "Conservación del Agua",
        "short_description": "Importancia de cuidar el agua y estrategias para usarla de manera responsable.",
        "sub_topics": [
          {
            "key": "agua_recurso_limitado",
            "name": "El Agua como Recurso Limitado",
            "short_description": "Aunque hay mucha agua en la Tierra, solo un pequeño porcentaje es agua dulce disponible para uso humano.",
            "example_tasks": [
              "Investiga qué porcentaje del agua en la Tierra es salada (océanos) y qué porcentaje es dulce disponible.",
              "Explica por qué no podemos beber agua del mar aunque hay mucha agua en los océanos.",
              "Crea un gráfico que muestre dónde se encuentra el agua dulce en la Tierra (glaciares, ríos, lagos, subterránea).",
              "Discute los problemas de escasez de agua que enfrentan algunas regiones de México."
            ]
          },
          {
            "key": "ahorro_agua_hogar",
            "name": "Ahorro de Agua en el Hogar",
            "short_description": "Acciones que podemos tomar en casa para reducir el desperdicio de agua.",
            "example_tasks": [
              "Enumera diez formas de ahorrar agua en tu casa (cerrar la llave al cepillarte, duchas cortas, reparar fugas).",
              "Calcula cuánta agua se desperdicia si dejas la llave abierta mientras te cepillas los dientes durante 2 minutos.",
              "Diseña un cartel para promover el ahorro de agua en tu escuela con consejos prácticos.",
              "Investiga cuántos litros de agua usa una persona promedio al día y cómo podemos reducir ese consumo."
            ]
          },
          {
            "key": "reuso_agua",
            "name": "Reúso del Agua",
            "short_description": "Estrategias para usar la misma agua más de una vez antes de desecharla.",
            "example_tasks": [
              "Propón formas de reusar el agua en casa (usar agua de enjuague de verduras para regar plantas).",
              "Explica cómo el agua de la regadera mientras se calienta puede recolectarse para otros usos.",
              "Diseña un sistema simple para captar agua de lluvia que pueda usarse para regar el jardín.",
              "Investiga cómo las plantas de tratamiento permiten reusar agua para riego de áreas verdes o industria."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "aire_componentes",
    "name": "El Aire y sus Componentes",
    "short_description": "Los estudiantes exploran la composición del aire, las propiedades de los gases que lo forman y la importancia del aire para la vida.",
    "sub_topics": [
      {
        "key": "composicion_aire",
        "name": "Composición del Aire",
        "short_description": "El aire es una mezcla de gases: principalmente nitrógeno, oxígeno y pequeñas cantidades de otros gases.",
        "sub_topics": [
          {
            "key": "gases_aire",
            "name": "Gases que Componen el Aire",
            "short_description": "Identificación de los principales gases en el aire y sus proporciones aproximadas.",
            "example_tasks": [
              "Investiga qué gases componen el aire: aproximadamente 78% nitrógeno, 21% oxígeno, 1% otros gases.",
              "Crea un gráfico de pastel mostrando las proporciones de nitrógeno, oxígeno y otros gases en el aire.",
              "Explica por qué el nitrógeno es el gas más abundante en el aire aunque no lo usamos para respirar.",
              "Enumera los gases menos abundantes en el aire: dióxido de carbono, argón, vapor de agua, neón."
            ]
          },
          {
            "key": "propiedades_aire",
            "name": "Propiedades del Aire",
            "short_description": "Características del aire: tiene masa, ocupa espacio, se puede comprimir, es invisible.",
            "example_tasks": [
              "Demuestra que el aire ocupa espacio volcando un vaso boca abajo en agua. ¿Por qué no entra el agua completamente?",
              "Pesa un globo desinflado y luego inflado. ¿El aire tiene masa? ¿Cómo lo sabes?",
              "Comprime el aire en una jeringa tapando la punta. ¿Qué observas? ¿Los sólidos y líquidos se comprimen igual?",
              "Explica por qué no podemos ver el aire aunque sabemos que está ahí."
            ]
          }
        ]
      },
      {
        "key": "oxigeno",
        "name": "El Oxígeno",
        "short_description": "Gas esencial para la respiración de la mayoría de los seres vivos y para la combustión.",
        "sub_topics": [
          {
            "key": "oxigeno_respiracion",
            "name": "Oxígeno y Respiración",
            "short_description": "Los seres vivos necesitan oxígeno para obtener energía de los alimentos mediante la respiración.",
            "example_tasks": [
              "Contén la respiración por un momento. ¿Qué sientes? ¿Por qué necesitamos respirar constantemente?",
              "Explica qué sucede cuando inhalamos: el oxígeno entra a nuestros pulmones y pasa a la sangre.",
              "Investiga cómo los peces obtienen oxígeno del agua a través de sus branquias.",
              "Compara la respiración de humanos (pulmones) con la de insectos (espiráculos) y peces (branquias)."
            ]
          },
          {
            "key": "oxigeno_combustion",
            "name": "Oxígeno y Combustión",
            "short_description": "El oxígeno es necesario para que ocurra la combustión; sin oxígeno el fuego se apaga.",
            "example_tasks": [
              "Observa cómo una vela se apaga cuando la cubres con un vaso. ¿Por qué se apaga si ya estaba encendida?",
              "Explica por qué necesitamos soplar al encender una fogata: el oxígeno del aire alimenta las llamas.",
              "Investiga qué pasa con el oxígeno cuando algo se quema: se combina con el material formando nuevas sustancias.",
              "Discute por qué es peligroso estar en un espacio cerrado donde hay combustión (se consume el oxígeno)."
            ]
          },
          {
            "key": "produccion_oxigeno",
            "name": "Producción de Oxígeno",
            "short_description": "Las plantas producen oxígeno durante la fotosíntesis, renovando el oxígeno del aire.",
            "example_tasks": [
              "Observa las burbujas que produce una planta acuática (elodea) expuesta a la luz solar. ¿Qué gas está produciendo?",
              "Explica por qué las plantas son importantes para mantener el oxígeno en el aire.",
              "Investiga cómo los bosques y selvas actúan como 'pulmones del planeta' produciendo oxígeno.",
              "Discute la importancia de cuidar los árboles y plantas para asegurar suficiente oxígeno en el aire."
            ]
          }
        ]
      },
      {
        "key": "dioxido_carbono",
        "name": "El Dióxido de Carbono",
        "short_description": "Gas producido por la respiración y la combustión, usado por las plantas en la fotosíntesis.",
        "sub_topics": [
          {
            "key": "produccion_co2",
            "name": "Producción de Dióxido de Carbono",
            "short_description": "Los seres vivos producen CO₂ al respirar; la combustión también produce CO₂.",
            "example_tasks": [
              "Sopla a través de un popote en agua con azul de bromotimol (indicador). Observa el cambio de color que indica CO₂.",
              "Explica qué gas exhalamos cuando respiramos: dióxido de carbono producido en nuestras células.",
              "Observa las burbujas que produce la levadura al fermentar (produciendo CO₂).",
              "Investiga cómo la combustión de gasolina en los automóviles produce dióxido de carbono."
            ]
          },
          {
            "key": "plantas_co2",
            "name": "Plantas y Dióxido de Carbono",
            "short_description": "Las plantas usan CO₂ del aire durante la fotosíntesis para producir su alimento.",
            "example_tasks": [
              "Explica cómo las plantas absorben CO₂ del aire y lo usan junto con agua y luz solar para crecer.",
              "Investiga el proceso básico de fotosíntesis: CO₂ + agua + luz solar → azúcares + oxígeno.",
              "Discute cómo las plantas y animales forman un ciclo: animales producen CO₂, plantas lo usan y producen O₂.",
              "Calcula cuántos árboles se necesitarían para absorber el CO₂ que produce tu familia."
            ]
          },
          {
            "key": "efecto_invernadero_basico",
            "name": "Efecto Invernadero (concepto básico)",
            "short_description": "El CO₂ en la atmósfera ayuda a mantener la temperatura de la Tierra, pero demasiado causa calentamiento global.",
            "example_tasks": [
              "Investiga qué es el efecto invernadero: algunos gases atrapan el calor del sol manteniendo la Tierra caliente.",
              "Explica por qué el efecto invernadero es necesario para la vida, pero demasiado CO₂ puede ser problemático.",
              "Discute cómo actividades humanas (quemar combustibles, talar árboles) aumentan el CO₂ en el aire.",
              "Propón acciones para reducir la producción de CO₂: usar menos energía, plantar árboles, caminar más."
            ]
          }
        ]
      },
      {
        "key": "contaminacion_aire",
        "name": "Contaminación del Aire",
        "short_description": "Presencia en el aire de sustancias que pueden ser dañinas para la salud y el ambiente.",
        "sub_topics": [
          {
            "key": "fuentes_contaminacion",
            "name": "Fuentes de Contaminación del Aire",
            "short_description": "Actividades humanas y naturales que liberan contaminantes al aire.",
            "example_tasks": [
              "Enumera fuentes de contaminación del aire en tu ciudad: automóviles, fábricas, quema de basura.",
              "Compara la calidad del aire en un día con mucho tráfico versus un domingo tranquilo.",
              "Investiga qué contaminantes comunes hay en el aire de las ciudades: CO₂, monóxido de carbono, partículas.",
              "Explica cómo las erupciones volcánicas y los incendios forestales también contaminan el aire naturalmente."
            ]
          },
          {
            "key": "efectos_contaminacion_aire",
            "name": "Efectos de la Contaminación del Aire",
            "short_description": "Impactos en la salud humana, los seres vivos y el ambiente.",
            "example_tasks": [
              "Investiga problemas de salud causados por aire contaminado: enfermedades respiratorias, alergias, asma.",
              "Observa hojas de plantas cerca de avenidas con mucho tráfico. ¿Se ven diferentes a las de parques?",
              "Explica por qué los días con alta contaminación se recomienda no hacer ejercicio al aire libre.",
              "Discute cómo la contaminación del aire puede afectar los edificios, monumentos y materiales."
            ]
          },
          {
            "key": "mejora_calidad_aire",
            "name": "Mejora de la Calidad del Aire",
            "short_description": "Acciones individuales y colectivas para reducir la contaminación del aire.",
            "example_tasks": [
              "Propón cinco acciones para reducir la contaminación del aire: usar transporte público, plantar árboles, no quemar basura.",
              "Diseña un cartel promoviendo el uso de bicicleta o caminar en lugar de usar automóvil.",
              "Investiga programas en tu ciudad para mejorar la calidad del aire (Hoy No Circula, verificación vehicular).",
              "Explica cómo plantar y cuidar árboles ayuda a limpiar el aire absorbiendo contaminantes."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "combustion_oxidacion",
    "name": "Combustión y Oxidación",
    "short_description": "Los estudiantes exploran reacciones químicas cotidianas donde los materiales se combinan con oxígeno, produciendo cambios observables como luz, calor y nuevas sustancias.",
    "sub_topics": [
      {
        "key": "proceso_combustion",
        "name": "Proceso de Combustión",
        "short_description": "Reacción química rápida donde una sustancia se combina con oxígeno produciendo calor, luz y nuevos productos.",
        "sub_topics": [
          {
            "key": "elementos_combustion",
            "name": "Elementos Necesarios para la Combustión",
            "short_description": "La combustión requiere tres elementos: combustible, oxígeno y temperatura de ignición (triángulo del fuego).",
            "example_tasks": [
              "Identifica los tres elementos del triángulo del fuego observando una vela encendida: cera (combustible), aire (oxígeno), flama (temperatura).",
              "Explica qué sucede cuando apagas una vela soplando: ¿cuál elemento del triángulo estás eliminando?",
              "Diseña un experimento para demostrar que sin oxígeno no hay combustión cubriendo una vela con un frasco.",
              "Investiga diferentes combustibles que se usan en México: gas LP, gasolina, leña, carbón."
            ]
          },
          {
            "key": "productos_combustion",
            "name": "Productos de la Combustión",
            "short_description": "La combustión produce nuevas sustancias: generalmente dióxido de carbono, vapor de agua, cenizas y energía (luz y calor).",
            "example_tasks": [
              "Observa una vela quemándose completamente. ¿Qué queda después? ¿Es lo mismo que antes de quemarla?",
              "Enciende una vela y coloca un plato frío sobre la flama. Observa las gotas que se forman (vapor de agua condensado).",
              "Explica por qué cuando quemamos madera obtenemos cenizas, humo y calor en lugar de más madera.",
              "Investiga qué gas produce tu cuerpo cuando 'quema' los alimentos para obtener energía (respiración celular)."
            ]
          },
          {
            "key": "combustion_completa_incompleta",
            "name": "Combustión Completa e Incompleta",
            "short_description": "Con suficiente oxígeno hay combustión completa (flama azul, poco humo); con poco oxígeno hay combustión incompleta (flama amarilla, mucho humo).",
            "example_tasks": [
              "Compara la flama de una estufa de gas (azul, combustión completa) con una vela (amarilla, combustión incompleta).",
              "Observa el hollín negro que deja una vela en un plato. Esto indica combustión incompleta.",
              "Explica por qué es peligrosa la combustión incompleta en espacios cerrados (produce monóxido de carbono).",
              "Investiga por qué los motores de autos necesitan suficiente aire para quemar la gasolina eficientemente."
            ]
          },
          {
            "key": "seguridad_fuego",
            "name": "Seguridad con el Fuego",
            "short_description": "Precauciones importantes al trabajar con fuego y materiales combustibles.",
            "example_tasks": [
              "Enumera cinco reglas de seguridad cuando hay fuego: no dejar velas desatendidas, tener extintor, alejarse de cortinas.",
              "Explica cómo funciona un extintor: elimina uno de los elementos del triángulo del fuego.",
              "Diseña un plan de evacuación para tu casa en caso de incendio, identificando salidas y punto de reunión.",
              "Investiga qué hacer si tu ropa se incendia: detenerse, tirarse al suelo y rodar para apagar el fuego."
            ]
          }
        ]
      },
      {
        "key": "oxidacion_lenta",
        "name": "Oxidación Lenta",
        "short_description": "Reacción gradual de materiales con el oxígeno del aire sin producir flamas, pero formando óxidos.",
        "sub_topics": [
          {
            "key": "herrumbre",
            "name": "Herrumbre del Hierro",
            "short_description": "El hierro reacciona con oxígeno y agua formando óxido de hierro (herrumbre) de color rojizo.",
            "example_tasks": [
              "Coloca un clavo de hierro en tres ambientes: al aire seco, en agua sin aire, y en agua con aire. ¿Cuál se oxida más rápido?",
              "Compara un clavo nuevo con uno oxidado. Describe los cambios en color, textura y resistencia.",
              "Explica por qué los objetos de hierro se oxidan más rápido en lugares húmedos como la costa.",
              "Investiga métodos para prevenir la oxidación: pintura, galvanizado (recubrimiento con zinc), aceite protector."
            ]
          },
          {
            "key": "oxidacion_otros_metales",
            "name": "Oxidación de Otros Metales",
            "short_description": "Diferentes metales se oxidan de manera distinta: cobre forma pátina verde, plata se pone negra, aluminio forma capa protectora.",
            "example_tasks": [
              "Observa monedas viejas de cobre. ¿De qué color es la capa que se forma? (verde-azulada: pátina)",
              "Compara cómo se ve la plata nueva versus plata vieja que se ha oscurecido. ¿Es oxidación?",
              "Investiga por qué el aluminio no parece oxidarse aunque sí forma óxido (la capa protege el metal debajo).",
              "Explica por qué el oro no se oxida fácilmente y por eso es valioso para joyería."
            ]
          },
          {
            "key": "maduracion_frutas",
            "name": "Maduración y Oscurecimiento de Frutas",
            "short_description": "La oxidación también ocurre en alimentos cuando reaccionan con el oxígeno del aire.",
            "example_tasks": [
              "Corta una manzana por la mitad y deja una mitad al aire. Observa cómo se pone café. ¿Por qué?",
              "Compara cómo se oscurece una manzana con y sin jugo de limón. ¿El ácido del limón previene la oxidación?",
              "Explica por qué los plátanos se ponen negros con el tiempo: es una reacción de oxidación.",
              "Investiga cómo las empresas de alimentos previenen la oxidación en productos como jugos y frutas deshidratadas."
            ]
          },
          {
            "key": "comparacion_combustion_oxidacion",
            "name": "Comparación entre Combustión y Oxidación Lenta",
            "short_description": "Ambas son reacciones con oxígeno, pero la combustión es rápida con flamas mientras la oxidación lenta es gradual sin flamas.",
            "example_tasks": [
              "Compara quemar un papel (combustión rápida) con la oxidación de un clavo (oxidación lenta). ¿En qué se parecen y en qué difieren?",
              "Explica por qué ambos procesos involucran oxígeno pero uno produce fuego y el otro no.",
              "Enumera ejemplos de combustión (quemar leña, vela) y oxidación lenta (herrumbre, maduración de frutas).",
              "Investiga si la oxidación lenta y la combustión rápida producen sustancias similares (ambas producen óxidos)."
            ]
          }
        ]
      },
      {
        "key": "prevencion_oxidacion",
        "name": "Prevención de la Oxidación",
        "short_description": "Métodos para proteger materiales de la oxidación y prolongar su vida útil.",
        "sub_topics": [
          {
            "key": "recubrimientos_protectores",
            "name": "Recubrimientos Protectores",
            "short_description": "Aplicación de pinturas, barnices o metales protectores para evitar contacto con oxígeno y humedad.",
            "example_tasks": [
              "Observa cómo las rejas de tu escuela o casa están pintadas. Explica cómo la pintura previene la oxidación.",
              "Investiga qué es el galvanizado: recubrir hierro con zinc para protegerlo de la oxidación.",
              "Compara un clavo pintado con uno sin pintar dejados en agua salada. ¿Cuál se oxida primero?",
              "Explica por qué los barcos necesitan pintarse regularmente para prevenir la corrosión por el agua salada."
            ]
          },
          {
            "key": "materiales_resistentes",
            "name": "Uso de Materiales Resistentes a la Oxidación",
            "short_description": "Selección de materiales que no se oxidan fácilmente para aplicaciones específicas.",
            "example_tasks": [
              "Enumera materiales que no se oxidan fácilmente: acero inoxidable, aluminio, plástico, vidrio, oro.",
              "Investiga por qué los cubiertos están hechos de acero inoxidable en lugar de hierro común.",
              "Explica por qué los marcos de ventanas modernos a veces son de aluminio en lugar de hierro.",
              "Compara las ventajas y desventajas de usar hierro pintado versus acero inoxidable para barandales."
            ]
          },
          {
            "key": "control_humedad",
            "name": "Control de Humedad",
            "short_description": "Mantener objetos secos para reducir la velocidad de oxidación.",
            "example_tasks": [
              "Explica por qué las herramientas deben guardarse en lugares secos en lugar de húmedos.",
              "Investiga qué son los desecantes (como sobres de gel de sílice) y cómo ayudan a prevenir oxidación.",
              "Compara la oxidación de clavos en aire seco versus aire húmedo. Diseña un experimento para probarlo.",
              "Discute por qué los objetos de metal en regiones costeras se oxidan más rápido que en zonas secas del interior."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "coccion_alimentos",
    "name": "Cocción de Alimentos",
    "short_description": "Los estudiantes exploran los cambios químicos que ocurren cuando cocinamos alimentos, alterando su composición, textura, sabor y valor nutricional.",
    "sub_topics": [
      {
        "key": "cambios_coccion",
        "name": "Cambios Durante la Cocción",
        "short_description": "Transformaciones observables en color, textura, sabor, olor y composición química de los alimentos al cocinarlos.",
        "sub_topics": [
          {
            "key": "cambios_proteinas",
            "name": "Cambios en las Proteínas",
            "short_description": "Las proteínas se desnaturalizan con el calor, cambiando la textura y digestibilidad de los alimentos.",
            "example_tasks": [
              "Observa cómo un huevo crudo líquido se vuelve sólido cuando lo cocinas. ¿Puedes revertir este cambio?",
              "Compara la textura de carne cruda con carne cocida. Explica por qué es más suave y fácil de masticar cuando está cocida.",
              "Investiga por qué la leche forma nata cuando se hierve: las proteínas cambian con el calor.",
              "Explica por qué no podemos 'descocer' un huevo: las proteínas han cambiado permanentemente su estructura."
            ]
          },
          {
            "key": "caramelizacion",
            "name": "Caramelización de Azúcares",
            "short_description": "Los azúcares se transforman cuando se calientan, produciendo color café y sabores complejos.",
            "example_tasks": [
              "Calienta azúcar en una cuchara (con supervisión). Observa cómo cambia de blanca a café y luego a negra.",
              "Compara pan tostado con pan sin tostar. ¿Qué le pasa al color y sabor cuando se tuesta?",
              "Explica por qué la cebolla se pone café y dulce cuando se cocina lentamente: caramelización de sus azúcares naturales.",
              "Investiga cómo se hace el dulce de cajeta o caramelo mediante caramelización de azúcar en la leche."
            ]
          },
          {
            "key": "cambios_color",
            "name": "Cambios de Color",
            "short_description": "El calor provoca reacciones que cambian el color de los alimentos.",
            "example_tasks": [
              "Observa cómo las verduras verdes cambian de color al cocinarlas. ¿Se vuelven más oscuras o más claras?",
              "Compara una tortilla cruda con una cocida en el comal. Describe los cambios de color.",
              "Explica por qué la carne roja se vuelve café cuando se cocina: las proteínas y la hemoglobina cambian.",
              "Investiga qué le sucede al color de los camarones o langostinos al cocinarlos: de gris a rosado/naranja."
            ]
          },
          {
            "key": "perdida_agua",
            "name": "Pérdida de Agua y Concentración",
            "short_description": "La cocción evapora agua, concentrando sabores y cambiando texturas.",
            "example_tasks": [
              "Pesa una rebanada de papa cruda y luego hornéala. Pésala de nuevo. ¿Qué sucedió con el agua que contenía?",
              "Observa cómo se reduce una salsa al hervir. Explica cómo la evaporación concentra el sabor.",
              "Compara frutas frescas con frutas deshidratadas. ¿En qué se diferencian en textura y sabor?",
              "Explica por qué la carne se encoge cuando se cocina: pierde agua por evaporación."
            ]
          }
        ]
      },
      {
        "key": "metodos_coccion",
        "name": "Métodos de Cocción",
        "short_description": "Diferentes formas de aplicar calor a los alimentos, cada una produciendo cambios químicos específicos.",
        "sub_topics": [
          {
            "key": "coccion_agua",
            "name": "Cocción en Agua (Hervir)",
            "short_description": "Cocinar alimentos sumergiéndolos en agua hirviendo, transfiriendo calor y permitiendo intercambio de sustancias.",
            "example_tasks": [
              "Hierve un huevo en agua. Observa cómo el calor del agua cocina el huevo uniformemente.",
              "Compara verduras crudas con verduras hervidas. ¿Qué cambios observas en color, textura y sabor?",
              "Investiga por qué algunos nutrientes se pierden en el agua cuando hervimos verduras.",
              "Explica la diferencia entre hervir (100°C) y cocinar a fuego lento (80-90°C) para diferentes alimentos."
            ]
          },
          {
            "key": "coccion_seca",
            "name": "Cocción Seca (Hornear, Asar)",
            "short_description": "Cocinar con aire caliente sin agregar líquidos, produciendo superficies doradas y crujientes.",
            "example_tasks": [
              "Compara pan horneado con masa cruda. Describe los cambios en textura, color y volumen.",
              "Observa cómo se forma una costra dorada en el pollo asado. ¿Por qué la superficie es diferente al interior?",
              "Explica por qué las galletas se ponen crujientes al hornearse: pérdida de humedad.",
              "Investiga qué temperatura se usa para hornear diferentes alimentos (pan, galletas, pasteles)."
            ]
          },
          {
            "key": "freir",
            "name": "Freír en Aceite",
            "short_description": "Cocinar alimentos sumergiéndolos en aceite caliente, produciendo texturas crujientes y sabores intensos.",
            "example_tasks": [
              "Compara una papa cruda, una hervida y una frita. Describe las diferencias en textura y sabor.",
              "Observa cómo el aceite caliente hace burbujas alrededor de los alimentos: es el agua evaporándose.",
              "Explica por qué los alimentos fritos son más crujientes que los hervidos.",
              "Investiga a qué temperatura debe estar el aceite para freír correctamente (generalmente 170-180°C)."
            ]
          },
          {
            "key": "coccion_vapor",
            "name": "Cocción al Vapor",
            "short_description": "Cocinar alimentos con el vapor de agua hirviendo sin sumergirlos directamente.",
            "example_tasks": [
              "Compara verduras cocidas al vapor con verduras hervidas. ¿Cuáles conservan mejor su color y textura?",
              "Observa cómo se cocinan los tamales al vapor. ¿Por qué no se sumergen en agua?",
              "Explica por qué cocinar al vapor conserva más nutrientes que hervir.",
              "Investiga culturas que usan mucho la cocción al vapor como la cocina china (dim sum, dumplings)."
            ]
          }
        ]
      },
      {
        "key": "fermentacion",
        "name": "Fermentación",
        "short_description": "Proceso químico donde microorganismos transforman los alimentos produciendo nuevos sabores, texturas y conservándolos.",
        "sub_topics": [
          {
            "key": "fermentacion_pan",
            "name": "Fermentación en la Elaboración del Pan",
            "short_description": "La levadura descompone azúcares produciendo gas (CO₂) que hace crecer la masa del pan.",
            "example_tasks": [
              "Mezcla levadura con agua tibia y azúcar. Observa las burbujas que se forman. ¿Qué gas produce la levadura?",
              "Compara masa de pan antes y después de dejarla reposar. ¿Por qué aumenta de tamaño?",
              "Hornea pan con levadura y sin levadura. Compara la textura y el volumen de ambos.",
              "Explica por qué la masa de pan huele diferente después de fermentar: la levadura produce alcohol y CO₂."
            ]
          },
          {
            "key": "fermentacion_lacteos",
            "name": "Fermentación en Productos Lácteos",
            "short_description": "Bacterias transforman la lactosa de la leche en ácido láctico, creando yogurt, queso y crema.",
            "example_tasks": [
              "Compara leche fresca con yogurt. ¿En qué difieren en textura, sabor y acidez?",
              "Investiga cómo se hace el yogurt: bacterias convierten azúcar de la leche en ácido láctico.",
              "Explica por qué el yogurt tiene sabor ácido mientras que la leche es dulce.",
              "Enumera productos lácteos fermentados que consumas: yogurt, queso, jocoque, crema ácida."
            ]
          },
          {
            "key": "otras_fermentaciones",
            "name": "Otras Fermentaciones Alimentarias",
            "short_description": "Diversos alimentos tradicionales mexicanos y del mundo que usan fermentación.",
            "example_tasks": [
              "Investiga cómo se hace el tepache: fermentación de cáscara de piña con piloncillo.",
              "Explica cómo se elabora el pozol (bebida tradicional maya): fermentación de masa de maíz.",
              "Enumera alimentos fermentados de diferentes culturas: kimchi (Corea), chucrut (Alemania), miso (Japón).",
              "Compara vinagre (fermentación de alcohol) con vino (fermentación de uvas). Ambos usan microorganismos."
            ]
          },
          {
            "key": "conservacion_fermentacion",
            "name": "Conservación por Fermentación",
            "short_description": "La fermentación produce ácidos que previenen el crecimiento de bacterias dañinas, conservando alimentos.",
            "example_tasks": [
              "Investiga por qué los encurtidos (pepinillos en vinagre) duran mucho tiempo sin refrigeración.",
              "Explica cómo el proceso de fermentación ayudaba a conservar alimentos antes de la refrigeración.",
              "Compara verduras frescas con verduras fermentadas (encurtidas). ¿Cuáles duran más tiempo?",
              "Discute las ventajas de la fermentación: conservación, nuevos sabores, mejora digestibilidad."
            ]
          }
        ]
      },
      {
        "key": "descomposicion_alimentos",
        "name": "Descomposición de Alimentos",
        "short_description": "Cambios químicos indeseables causados por microorganismos que echan a perder los alimentos.",
        "sub_topics": [
          {
            "key": "putrefaccion",
            "name": "Putrefacción",
            "short_description": "Descomposición de proteínas por bacterias, produciendo olores desagradables y sustancias tóxicas.",
            "example_tasks": [
              "Observa (de lejos) carne o pescado dejados fuera del refrigerador. Describe los cambios que notas.",
              "Explica por qué la comida refrigerada dura más tiempo: el frío ralentiza el crecimiento de bacterias.",
              "Enumera señales de que un alimento se está descomponiendo: mal olor, cambio de color, textura babosa.",
              "Investiga por qué es peligroso comer alimentos descompuestos: las bacterias producen toxinas."
            ]
          },
          {
            "key": "enmohecimiento",
            "name": "Enmohecimiento",
            "short_description": "Crecimiento de hongos en alimentos, visible como manchas de colores (verde, blanco, negro).",
            "example_tasks": [
              "Observa pan dejado en una bolsa cerrada durante una semana. Describe el moho que crece.",
              "Investiga qué condiciones favorecen el crecimiento de moho: humedad, calor, oscuridad.",
              "Compara qué tan rápido se enmohece el pan en el refrigerador versus a temperatura ambiente.",
              "Explica por qué algunos quesos tienen moho (como el queso azul) y es seguro comerlos mientras otros mohos son dañinos."
            ]
          },
          {
            "key": "metodos_conservacion",
            "name": "Métodos de Conservación",
            "short_description": "Técnicas para prevenir o retrasar la descomposición de alimentos.",
            "example_tasks": [
              "Enumera métodos de conservación: refrigeración, congelación, deshidratación, enlatado, fermentación, salado.",
              "Explica cómo la refrigeración conserva alimentos: ralentiza el crecimiento de microorganismos.",
              "Compara frutas frescas, deshidratadas y enlatadas. ¿Cuáles duran más tiempo?",
              "Investiga cómo funcionan los conservadores químicos en alimentos procesados."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "acidos_bases_vida_diaria",
    "name": "Ácidos y Bases en la Vida Diaria",
    "short_description": "Los estudiantes identifican sustancias ácidas y básicas comunes, aprenden a reconocer sus propiedades y entienden su importancia en la vida cotidiana.",
    "sub_topics": [
      {
        "key": "identificacion_acidos_bases",
        "name": "Identificación de Ácidos y Bases",
        "short_description": "Reconocimiento de sustancias ácidas y básicas por sus propiedades características como sabor, tacto y reacción con indicadores.",
        "sub_topics": [
          {
            "key": "acidos_comunes",
            "name": "Ácidos Comunes",
            "short_description": "Sustancias ácidas cotidianas: vinagre, limón, jugos cítricos, refrescos, que tienen sabor agrio.",
            "example_tasks": [
              "Prueba (con supervisión) limón, vinagre y tamarindo. Describe el sabor que tienen en común: ácido o agrio.",
              "Enumera diez alimentos o bebidas ácidas que consumas: naranja, piña, yogurt, refresco, tomate.",
              "Investiga qué ácidos contienen estos alimentos: ácido cítrico (limón), ácido acético (vinagre), ácido láctico (yogurt).",
              "Explica por qué los dientes se pueden dañar si consumes muchas bebidas ácidas: el ácido disuelve el esmalte."
            ]
          },
          {
            "key": "bases_comunes",
            "name": "Bases Comunes",
            "short_description": "Sustancias básicas (alcalinas) cotidianas: jabón, bicarbonato, antiácidos, que se sienten resbalosas al tacto.",
            "example_tasks": [
              "Toca jabón mojado con tus dedos. Describe cómo se siente: resbaloso o jabonoso.",
              "Enumera productos de limpieza básicos en tu casa: jabón, detergente, limpiador de baños, desatascador.",
              "Investiga para qué se usa el bicarbonato de sodio (base): hornear, neutralizar acidez estomacal, limpiar.",
              "Explica por qué el jabón puede irritar los ojos: es una sustancia básica que afecta las membranas sensibles."
            ]
          },
          {
            "key": "propiedades_acidos",
            "name": "Propiedades de los Ácidos",
            "short_description": "Características de los ácidos: sabor agrio, disuelven algunos metales, cambian el color de indicadores.",
            "example_tasks": [
              "Coloca un trozo de cáscara de huevo (carbonato de calcio) en vinagre. Observa las burbujas. ¿Qué está pasando?",
              "Compara cómo reacciona el jugo de limón con bicarbonato de sodio: produce burbujas de CO₂.",
              "Explica por qué los ácidos pueden ser corrosivos: pueden disolver o dañar ciertos materiales.",
              "Investiga qué precauciones debemos tener con ácidos fuertes como el que está en las baterías de auto."
            ]
          },
          {
            "key": "propiedades_bases",
            "name": "Propiedades de las Bases",
            "short_description": "Características de las bases: tacto resbaloso, sabor amargo, neutralizan ácidos.",
            "example_tasks": [
              "Disuelve un poco de bicarbonato en agua y siente la textura. Es resbalosa como el jabón.",
              "Explica por qué las bases se usan en productos de limpieza: disuelven grasas y suciedad.",
              "Investiga por qué algunos antiácidos contienen bases: neutralizan el ácido estomacal.",
              "Discute precauciones con bases fuertes como la sosa cáustica (hidróxido de sodio): pueden quemar la piel."
            ]
          }
        ]
      },
      {
        "key": "indicadores_acido_base",
        "name": "Indicadores Ácido-Base",
        "short_description": "Sustancias que cambian de color según estén en presencia de ácidos o bases, permitiendo identificarlos.",
        "sub_topics": [
          {
            "key": "indicadores_naturales",
            "name": "Indicadores Naturales",
            "short_description": "Extractos de plantas que cambian de color con ácidos y bases: repollo morado, jamaica, bugambilia.",
            "example_tasks": [
              "Hierve repollo morado en agua para obtener un indicador natural. El líquido morado cambiará de color.",
              "Prueba tu indicador de repollo con vinagre (ácido) y bicarbonato disuelto (base). Registra los colores que observas.",
              "Crea una escala de colores probando tu indicador con diferentes sustancias: limón, agua, jabón, limpiador.",
              "Investiga otros indicadores naturales: jugo de jamaica (rojo), pétalos de bugambilia, cúrcuma."
            ]
          },
          {
            "key": "papel_indicador",
            "name": "Papel Tornasol y pH",
            "short_description": "Papel especial que cambia de color indicando si una sustancia es ácida (rojo) o básica (azul).",
            "example_tasks": [
              "Si tienes acceso a papel tornasol, prueba diferentes líquidos y registra si son ácidos o bases.",
              "Crea tu propio papel indicador empapando papel filtro en extracto de repollo morado y dejándolo secar.",
              "Explica qué significa pH: una escala numérica de 0 a 14 donde 7 es neutro, menor que 7 es ácido, mayor es básico.",
              "Investiga aproximadamente el pH de sustancias comunes: limón (2), agua pura (7), jabón (9-10)."
            ]
          },
          {
            "key": "pruebas_identificacion",
            "name": "Pruebas de Identificación",
            "short_description": "Experimentos para clasificar sustancias desconocidas como ácidas, básicas o neutras.",
            "example_tasks": [
              "Recolecta 10 líquidos de tu casa y clasifícalos como ácidos, bases o neutros usando indicador de repollo.",
              "Diseña una tabla registrando: sustancia, predicción (ácido/base/neutro), color con indicador, resultado.",
              "Compara tus resultados con compañeros. ¿Obtuvieron los mismos colores para las mismas sustancias?",
              "Investiga qué sustancias son neutras (pH 7): agua pura, sal disuelta en agua."
            ]
          }
        ]
      },
      {
        "key": "neutralizacion",
        "name": "Neutralización",
        "short_description": "Reacción química donde un ácido y una base se combinan formando sal y agua, perdiendo sus propiedades originales.",
        "sub_topics": [
          {
            "key": "reaccion_neutralizacion",
            "name": "Reacción de Neutralización",
            "short_description": "Cuando mezclamos ácidos con bases en las proporciones correctas, se neutralizan mutuamente.",
            "example_tasks": [
              "Mezcla vinagre (ácido) con bicarbonato (base). Observa la reacción efervescente. ¿Qué gas se libera?",
              "Agrega bicarbonato poco a poco a vinagre con indicador de repollo hasta que el color cambie a neutro.",
              "Explica qué significa neutralizar: el ácido y la base reaccionan eliminando las propiedades de ambos.",
              "Investiga la ecuación simple: ácido + base → sal + agua + energía (a veces gas)."
            ]
          },
          {
            "key": "neutralizacion_vida_diaria",
            "name": "Neutralización en la Vida Diaria",
            "short_description": "Aplicaciones prácticas de la neutralización en medicina, agricultura y el hogar.",
            "example_tasks": [
              "Explica cómo funcionan los antiácidos: neutralizan el exceso de ácido en el estómago.",
              "Investiga por qué se agrega cal (base) a suelos ácidos en agricultura: para neutralizar la acidez.",
              "Discute qué hacer si te cae ácido en la piel: lavar con agua abundante y neutralizar con bicarbonato diluido.",
              "Explica por qué el bicarbonato de sodio ayuda a aliviar la acidez estomacal: neutraliza el ácido gástrico."
            ]
          },
          {
            "key": "productos_neutralizacion",
            "name": "Productos de la Neutralización",
            "short_description": "La neutralización produce sales y agua, sustancias diferentes a los reactivos originales.",
            "example_tasks": [
              "Mezcla vinagre con bicarbonato en un plato y deja evaporar el agua. Observa los cristales blancos (sal) que quedan.",
              "Explica por qué después de la reacción entre ácido y base obtenemos sustancias nuevas.",
              "Investiga ejemplos de sales producidas por neutralización: sal de mesa (NaCl), acetato de sodio.",
              "Compara las propiedades de la sal producida con las del ácido y la base originales: es neutra."
            ]
          }
        ]
      },
      {
        "key": "importancia_acidos_bases",
        "name": "Importancia de Ácidos y Bases",
        "short_description": "Roles esenciales de ácidos y bases en nuestro cuerpo, el ambiente y la industria.",
        "sub_topics": [
          {
            "key": "acidos_bases_cuerpo",
            "name": "Ácidos y Bases en el Cuerpo Humano",
            "short_description": "Nuestro cuerpo mantiene un balance cuidadoso de acidez y alcalinidad para funcionar correctamente.",
            "example_tasks": [
              "Investiga por qué el estómago produce ácido: para digerir alimentos y matar bacterias.",
              "Explica qué es la acidez estomacal: exceso de ácido que sube al esófago causando ardor.",
              "Discute la importancia del pH de la sangre: debe mantenerse cerca de 7.4 (ligeramente básico).",
              "Investiga cómo el cuerpo regula el pH de la sangre usando sistemas buffer (amortiguadores)."
            ]
          },
          {
            "key": "lluvia_acida",
            "name": "Lluvia Ácida",
            "short_description": "Precipitación que contiene ácidos formados por contaminantes en la atmósfera, dañando el ambiente.",
            "example_tasks": [
              "Investiga cómo se forma la lluvia ácida: contaminantes (SO₂, NO₂) reaccionan con agua en las nubes.",
              "Explica efectos de la lluvia ácida: daña plantas, corroe edificios, acidifica lagos.",
              "Diseña un experimento simulando lluvia ácida: rocía vinagre diluido sobre plantas y observa efectos.",
              "Discute cómo reducir la lluvia ácida: disminuir emisiones de fábricas y vehículos."
            ]
          },
          {
            "key": "usos_industriales",
            "name": "Usos Industriales",
            "short_description": "Aplicaciones de ácidos y bases en la fabricación de productos y procesamiento de materiales.",
            "example_tasks": [
              "Investiga usos del ácido sulfúrico en la industria: fabricación de fertilizantes, baterías, limpieza de metales.",
              "Explica cómo se usa la sosa cáustica (base fuerte) para hacer jabón: reacciona con grasas (saponificación).",
              "Enumera productos que contienen ácidos o bases: limpiadores de baños, destapacaños, fertilizantes.",
              "Discute precauciones de seguridad al manejar ácidos y bases industriales: equipo de protección, ventilación."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "ciclos_transformaciones_naturales",
    "name": "Ciclos y Transformaciones Naturales",
    "short_description": "Los estudiantes exploran procesos naturales continuos donde la materia y la energía se transforman en ciclos que sostienen la vida en la Tierra.",
    "sub_topics": [
      {
        "key": "ciclo_agua_detallado",
        "name": "Ciclo del Agua (Detallado)",
        "short_description": "Movimiento continuo del agua entre océanos, atmósfera, tierra y seres vivos mediante cambios de estado.",
        "sub_topics": [
          {
            "key": "energia_sol_ciclo",
            "name": "Energía del Sol y el Ciclo del Agua",
            "short_description": "El sol proporciona la energía necesaria para evaporar el agua y mantener el ciclo en movimiento.",
            "example_tasks": [
              "Diseña un experimento para demostrar que el sol acelera la evaporación del agua.",
              "Explica por qué el ciclo del agua no funcionaría sin la energía del sol.",
              "Calcula cuánta agua se evapora de un recipiente expuesto al sol versus uno en la sombra durante una semana.",
              "Investiga cómo la energía solar también impulsa los vientos que mueven las nubes."
            ]
          },
          {
            "key": "transporte_agua_atmosfera",
            "name": "Transporte de Agua en la Atmósfera",
            "short_description": "El viento mueve el vapor de agua y las nubes a grandes distancias distribuyendo la humedad.",
            "example_tasks": [
              "Observa el movimiento de las nubes durante varios días. ¿En qué dirección se mueven generalmente?",
              "Explica cómo el agua evaporada del océano puede llover tierra adentro lejos de la costa.",
              "Investiga por qué algunas regiones reciben mucha lluvia mientras otras son desérticas.",
              "Discute cómo las montañas afectan la distribución de lluvia: las nubes descargan al subir."
            ]
          },
          {
            "key": "agua_subterranea",
            "name": "Agua Subterránea",
            "short_description": "Parte del agua que se infiltra se almacena bajo tierra en acuíferos, disponible mediante pozos.",
            "example_tasks": [
              "Investiga qué son los acuíferos: capas de roca porosa que almacenan agua subterránea.",
              "Explica cómo se recargan los acuíferos: por infiltración de lluvia a través del suelo.",
              "Discute la importancia del agua subterránea como fuente de agua potable en muchas comunidades.",
              "Investiga problemas de sobreexplotación de acuíferos en México: extracción más rápida que recarga."
            ]
          }
        ]
      },
      {
        "key": "fotosintesis_basica",
        "name": "Fotosíntesis Básica",
        "short_description": "Proceso mediante el cual las plantas transforman dióxido de carbono y agua en azúcares y oxígeno usando energía solar.",
        "sub_topics": [
          {
            "key": "ingredientes_fotosintesis",
            "name": "Ingredientes de la Fotosíntesis",
            "short_description": "Las plantas necesitan luz solar, dióxido de carbono y agua para realizar la fotosíntesis.",
            "example_tasks": [
              "Enumera los tres ingredientes que necesita una planta para hacer fotosíntesis: luz, CO₂, agua.",
              "Explica de dónde obtiene la planta cada ingrediente: luz del sol, CO₂ del aire, agua del suelo.",
              "Diseña un experimento privando a una planta de luz, otra de agua y otra en bolsa cerrada (sin CO₂). Observa los efectos.",
              "Investiga el papel de la clorofila: pigmento verde que captura la energía de la luz."
            ]
          },
          {
            "key": "productos_fotosintesis",
            "name": "Productos de la Fotosíntesis",
            "short_description": "La fotosíntesis produce azúcares (alimento para la planta) y oxígeno (liberado al aire).",
            "example_tasks": [
              "Explica qué produce la planta durante la fotosíntesis: azúcares (glucosa) para su alimento y oxígeno.",
              "Observa burbujas de oxígeno producidas por una planta acuática (elodea) expuesta a luz brillante.",
              "Discute por qué las plantas son importantes para todos los seres vivos: producen oxígeno y alimento.",
              "Investiga qué le sucede al azúcar producido: se usa para energía o se almacena como almidón."
            ]
          },
          {
            "key": "importancia_fotosintesis",
            "name": "Importancia de la Fotosíntesis",
            "short_description": "La fotosíntesis es la base de casi todas las cadenas alimentarias y mantiene el oxígeno en la atmósfera.",
            "example_tasks": [
              "Explica por qué sin plantas no habría vida animal en la Tierra: las plantas producen oxígeno y son la base del alimento.",
              "Traza una cadena alimentaria comenzando con una planta que hace fotosíntesis.",
              "Investiga cómo los bosques y océanos (fitoplancton) producen gran parte del oxígeno terrestre.",
              "Discute la relación entre fotosíntesis y respiración: procesos complementarios en el ciclo de gases."
            ]
          },
          {
            "key": "factores_afectan_fotosintesis",
            "name": "Factores que Afectan la Fotosíntesis",
            "short_description": "La cantidad de luz, agua, CO₂ y temperatura influyen en qué tan rápido las plantas hacen fotosíntesis.",
            "example_tasks": [
              "Compara el crecimiento de plantas en luz brillante versus sombra. ¿Cuáles crecen más rápido?",
              "Explica por qué las plantas crecen más lentamente en invierno: menos luz y temperaturas más bajas.",
              "Diseña un experimento para probar si la cantidad de agua afecta el crecimiento de las plantas.",
              "Investiga por qué los invernaderos aumentan la producción de plantas: controlan luz, temperatura, humedad."
            ]
          }
        ]
      },
      {
        "key": "respiracion_seres_vivos",
        "name": "Respiración en Seres Vivos",
        "short_description": "Proceso mediante el cual los seres vivos obtienen energía de los alimentos usando oxígeno y liberando CO₂.",
        "sub_topics": [
          {
            "key": "respiracion_humana",
            "name": "Respiración Humana",
            "short_description": "Proceso de intercambio de gases: inhalamos oxígeno y exhalamos dióxido de carbono.",
            "example_tasks": [
              "Describe qué sucede cuando inhalas: el oxígeno entra a los pulmones y pasa a la sangre.",
              "Explica qué gas exhalamos principalmente: dióxido de carbono producido por nuestras células.",
              "Mide tu frecuencia respiratoria en reposo y después de ejercicio. ¿Por qué respiras más rápido después?",
              "Investiga cómo la sangre transporta oxígeno (en glóbulos rojos) y CO₂ a los pulmones."
            ]
          },
          {
            "key": "respiracion_plantas",
            "name": "Respiración en Plantas",
            "short_description": "Las plantas también respiran: usan oxígeno y liberan CO₂, especialmente de noche.",
            "example_tasks": [
              "Explica que las plantas hacen fotosíntesis de día (producen O₂) y respiran siempre (consumen O₂).",
              "Aclara el concepto erróneo: las plantas producen más O₂ del que consumen, por eso limpian el aire.",
              "Investiga por qué de noche las plantas solo respiran y no hacen fotosíntesis: no hay luz solar.",
              "Discute el balance: durante el día las plantas producen más oxígeno del que consumen."
            ]
          },
          {
            "key": "respiracion_animales",
            "name": "Respiración en Animales",
            "short_description": "Diferentes animales tienen distintas estructuras para respirar: pulmones, branquias, espiráculos, piel.",
            "example_tasks": [
              "Compara cómo respiran: humanos (pulmones), peces (branquias), insectos (espiráculos), lombrices (piel).",
              "Explica por qué los peces mueren fuera del agua: sus branquias no funcionan en el aire.",
              "Investiga cómo las ballenas y delfines respiran: tienen pulmones y deben subir a la superficie.",
              "Observa un pez en un acuario. ¿Puedes ver el movimiento de sus branquias?"
            ]
          },
          {
            "key": "relacion_fotosintesis_respiracion",
            "name": "Relación entre Fotosíntesis y Respiración",
            "short_description": "Estos dos procesos son complementarios: lo que uno produce, el otro lo consume.",
            "example_tasks": [
              "Crea un diagrama mostrando cómo la fotosíntesis produce O₂ que usa la respiración, y la respiración produce CO₂ que usa la fotosíntesis.",
              "Explica por qué plantas y animales se necesitan mutuamente: intercambian gases necesarios.",
              "Compara las ecuaciones simples: Fotosíntesis (CO₂ + H₂O + luz → azúcar + O₂) vs. Respiración (azúcar + O₂ → energía + CO₂ + H₂O).",
              "Discute cómo estos procesos mantienen estable la composición del aire terrestre."
            ]
          }
        ]
      },
      {
        "key": "descomposicion_materia_organica",
        "name": "Descomposición de Materia Orgánica",
        "short_description": "Proceso natural donde microorganismos transforman restos de seres vivos en nutrientes simples que regresan al suelo.",
        "sub_topics": [
          {
            "key": "descomponedores",
            "name": "Organismos Descomponedores",
            "short_description": "Bacterias, hongos y otros organismos que descomponen materia orgánica muerta.",
            "example_tasks": [
              "Observa con lupa el moho que crece en pan viejo o fruta. Estos son hongos descomponedores.",
              "Explica el papel de los descomponedores: reciclan nutrientes de seres muertos de vuelta al suelo.",
              "Investiga ejemplos de descomponedores: bacterias, hongos, lombrices, insectos.",
              "Discute qué pasaría sin descomponedores: los nutrientes quedarían atrapados en materia muerta acumulada."
            ]
          },
          {
            "key": "compostaje",
            "name": "Compostaje",
            "short_description": "Proceso controlado de descomposición de residuos orgánicos para producir abono rico en nutrientes.",
            "example_tasks": [
              "Crea un pequeño compostero con restos de frutas, verduras y hojas secas. Observa cómo cambia semanalmente.",
              "Enumera qué materiales se pueden compostar: cáscaras de frutas/verduras, hojas, pasto, cartón.",
              "Explica qué NO se debe compostar: carne, lácteos, aceites, plásticos.",
              "Investiga factores que aceleran el compostaje: humedad, aireación, temperatura, proporción carbono/nitrógeno."
            ]
          },
          {
            "key": "nutrientes_suelo",
            "name": "Retorno de Nutrientes al Suelo",
            "short_description": "Los nutrientes liberados por la descomposición enriquecen el suelo y están disponibles para nuevas plantas.",
            "example_tasks": [
              "Observa el suelo del bosque: está lleno de hojas descompuestas que nutren nuevas plantas.",
              "Explica el ciclo: plantas absorben nutrientes → crecen → mueren → se descomponen → nutrientes regresan al suelo.",
              "Compara el crecimiento de plantas en tierra con composta versus tierra pobre en nutrientes.",
              "Investiga qué nutrientes importantes necesitan las plantas: nitrógeno, fósforo, potasio."
            ]
          },
          {
            "key": "importancia_descomposicion",
            "name": "Importancia de la Descomposición",
            "short_description": "La descomposición es esencial para reciclar materia y mantener los ecosistemas funcionando.",
            "example_tasks": [
              "Explica por qué la descomposición es necesaria: sin ella, los nutrientes no estarían disponibles para nuevas plantas.",
              "Discute cómo la descomposición ayuda a mantener el suelo fértil para la agricultura.",
              "Investiga el concepto de ciclo de nutrientes: materia orgánica → descomposición → nutrientes → nuevas plantas.",
              "Compara ecosistemas saludables (con mucha descomposición) versus suelos degradados."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "recursos_minerales",
    "name": "Recursos Minerales",
    "short_description": "Los estudiantes exploran los minerales y metales que se extraen de la Tierra, sus propiedades, usos en la vida diaria y su importancia económica para México.",
    "sub_topics": [
      {
        "key": "minerales_rocas",
        "name": "Minerales y Rocas",
        "short_description": "Diferencias entre minerales (sustancias naturales con composición definida) y rocas (mezclas de minerales).",
        "sub_topics": [
          {
            "key": "que_son_minerales",
            "name": "¿Qué son los Minerales?",
            "short_description": "Sustancias sólidas, naturales, inorgánicas con composición química definida y estructura cristalina.",
            "example_tasks": [
              "Observa muestras de minerales comunes: cuarzo, calcita, pirita, mica. Describe su brillo, color y dureza.",
              "Explica características de los minerales: son sólidos, naturales, tienen composición química específica.",
              "Compara sal de mesa (mineral halita purificado) con azúcar (orgánica, no es mineral).",
              "Investiga la escala de dureza de Mohs: del talco (1, muy suave) al diamante (10, muy duro)."
            ]
          },
          {
            "key": "propiedades_minerales",
            "name": "Propiedades de los Minerales",
            "short_description": "Características que ayudan a identificar minerales: color, brillo, dureza, raya, forma cristalina.",
            "example_tasks": [
              "Prueba la dureza de diferentes minerales intentando rayar uno con otro o con objetos como monedas y vidrio.",
              "Observa el brillo de minerales: metálico (pirita), vítreo (cuarzo), perlado (mica).",
              "Frota un mineral sobre una porcelana blanca sin brillo para ver el color de su 'raya' o polvo.",
              "Examina cristales de sal con lupa. Dibuja su forma geométrica (cúbica)."
            ]
          },
          {
            "key": "rocas",
            "name": "Rocas",
            "short_description": "Materiales sólidos formados por uno o más minerales: ígneas, sedimentarias y metamórficas.",
            "example_tasks": [
              "Observa con lupa una roca de granito. ¿Puedes ver diferentes minerales (cuarzo, feldespato, mica)?",
              "Clasifica rocas según su origen: ígneas (de magma), sedimentarias (de sedimentos), metamórficas (transformadas por presión/calor).",
              "Compara rocas ígneas (basalto, granito), sedimentarias (caliza, arenisca) y metamórficas (mármol, pizarra).",
              "Investiga rocas comunes en tu región de México y para qué se usan en construcción."
            ]
          },
          {
            "key": "usos_rocas_minerales",
            "name": "Usos de Rocas y Minerales",
            "short_description": "Aplicaciones de rocas y minerales en construcción, tecnología, industria y vida diaria.",
            "example_tasks": [
              "Enumera usos del cuarzo: relojes, vidrio, electrónica, joyería.",
              "Investiga para qué se usa la caliza en México: cemento, construcción, neutralizar suelos ácidos.",
              "Identifica minerales en objetos cotidianos: grafito (lápices), yeso (construcción), talco (cosméticos).",
              "Explica por qué el granito se usa en pisos y encimeras: es muy duro y resistente."
            ]
          }
        ]
      },
      {
        "key": "metales",
        "name": "Metales",
        "short_description": "Elementos químicos con propiedades características: brillo, maleabilidad, conductividad.",
        "sub_topics": [
          {
            "key": "propiedades_metales",
            "name": "Propiedades de los Metales",
            "short_description": "Características comunes: brillo metálico, conducen electricidad y calor, son maleables y dúctiles.",
            "example_tasks": [
              "Compara metales (aluminio, cobre, hierro) con no metales (madera, plástico, vidrio). ¿Cuáles brillan más?",
              "Diseña un experimento para probar conductividad eléctrica usando una batería, foco y diferentes materiales.",
              "Explica qué significa que un metal sea maleable: se puede martillar en láminas delgadas (oro, aluminio).",
              "Investiga qué significa dúctil: se puede estirar en alambres (cobre, oro, plata)."
            ]
          },
          {
            "key": "metales_comunes",
            "name": "Metales Comunes y sus Usos",
            "short_description": "Metales utilizados frecuentemente: hierro, cobre, aluminio, oro, plata.",
            "example_tasks": [
              "Enumera usos del cobre: cables eléctricos, tuberías, monedas. ¿Por qué es bueno para estas aplicaciones?",
              "Investiga usos del aluminio: latas, envases, ventanas, aviones. ¿Por qué se prefiere? (ligero, no se oxida fácilmente)",
              "Explica por qué el hierro se usa en construcción (estructuras, varillas): es fuerte y abundante.",
              "Compara metales preciosos (oro, plata, platino) con metales comunes (hierro, aluminio). ¿Por qué algunos son más valiosos?"
            ]
          },
          {
            "key": "aleaciones",
            "name": "Aleaciones",
            "short_description": "Mezclas de metales (o metal con no metal) que combinan propiedades deseables: acero, bronce, latón.",
            "example_tasks": [
              "Investiga qué es el acero: aleación de hierro con carbono, más fuerte que el hierro puro.",
              "Explica qué es el bronce: aleación de cobre y estaño, usado en campanas, esculturas, herramientas antiguas.",
              "Identifica aleaciones en tu casa: acero inoxidable (cubiertos), latón (llaves, bisagras), bronce (cerraduras).",
              "Compara propiedades del hierro puro versus acero. ¿Cuál es más fuerte y resistente a la oxidación?"
            ]
          },
          {
            "key": "extraccion_metales",
            "name": "Extracción de Metales",
            "short_description": "Proceso de obtención de metales a partir de minerales mediante minería y fundición.",
            "example_tasks": [
              "Investiga cómo se extrae el cobre: se saca mineral (malaquita, calcopirita), se tritura, se funde.",
              "Explica qué es un mineral metálico o mena: roca que contiene suficiente metal para extraerlo económicamente.",
              "Discute el proceso de fundición: calentar el mineral para separar el metal puro de las impurezas.",
              "Investiga la minería en México: somos importantes productores de plata, oro, cobre, zinc."
            ]
          }
        ]
      },
      {
        "key": "mineria_mexico",
        "name": "Minería en México",
        "short_description": "México es un importante productor mundial de minerales y metales, especialmente plata.",
        "sub_topics": [
          {
            "key": "historia_mineria_mexico",
            "name": "Historia de la Minería en México",
            "short_description": "La minería ha sido importante desde tiempos prehispánicos y fue crucial en la época colonial.",
            "example_tasks": [
              "Investiga qué metales usaban las culturas prehispánicas: oro, plata, cobre para joyería y ornamentos.",
              "Explica cómo la minería de plata en Zacatecas, Guanajuato y Taxco enriqueció a España en la época colonial.",
              "Enumera ciudades mexicanas que surgieron por la minería: Real del Monte, Guanajuato, Zacatecas, Taxco.",
              "Discute cómo la minería influyó en el desarrollo económico y poblacional de México."
            ]
          },
          {
            "key": "produccion_actual",
            "name": "Producción Minera Actual",
            "short_description": "México es líder mundial en producción de plata y importante productor de otros metales.",
            "example_tasks": [
              "Investiga que México es el principal productor de plata del mundo (más del 20% de la producción global).",
              "Enumera otros minerales y metales importantes en México: oro, cobre, zinc, plomo, fierro, fluorita.",
              "Identifica estados mineros importantes: Sonora, Zacatecas, Chihuahua, Durango, Coahuila.",
              "Explica la importancia económica de la minería: genera empleos, exportaciones, ingresos para el país."
            ]
          },
          {
            "key": "impacto_ambiental_mineria",
            "name": "Impacto Ambiental de la Minería",
            "short_description": "La extracción de minerales puede causar problemas ambientales si no se hace responsablemente.",
            "example_tasks": [
              "Discute impactos negativos de la minería: deforestación, contaminación del agua, alteración del paisaje.",
              "Investiga qué son los jales mineros: residuos de la extracción que pueden contaminar suelos y agua.",
              "Explica la importancia de la minería responsable: restaurar áreas explotadas, tratar aguas residuales.",
              "Propón medidas para reducir impacto ambiental: reciclaje de metales, tecnologías limpias, reforestación."
            ]
          },
          {
            "key": "alternativas_reciclaje",
            "name": "Reciclaje de Metales",
            "short_description": "Recuperar metales de productos usados reduce la necesidad de minería y ahorra energía.",
            "example_tasks": [
              "Explica beneficios del reciclaje de metales: ahorra energía, reduce contaminación, conserva recursos naturales.",
              "Investiga qué metales se reciclan comúnmente: aluminio, cobre, hierro/acero, plata, oro.",
              "Calcula la energía ahorrada: reciclar aluminio usa solo 5% de la energía necesaria para producir aluminio nuevo.",
              "Diseña un programa de recolección de latas de aluminio en tu escuela para reciclarlas."
            ]
          }
        ]
      },
      {
        "key": "minerales_vida_diaria",
        "name": "Minerales en la Vida Diaria",
        "short_description": "Presencia ubicua de minerales y metales en objetos cotidianos que usamos sin darnos cuenta.",
        "sub_topics": [
          {
            "key": "minerales_casa",
            "name": "Minerales en la Casa",
            "short_description": "Identificación de minerales y metales en objetos domésticos.",
            "example_tasks": [
              "Haz un inventario de metales en tu cocina: ollas (aluminio, acero), cubiertos (acero inoxidable), grifos (latón, cromo).",
              "Identifica minerales en productos: sal (halita), yeso (construcción), talco (cosméticos), grafito (lápices).",
              "Explica de qué minerales provienen: vidrio (cuarzo/arena), cerámica (arcilla/caolín), cemento (caliza).",
              "Crea un mapa de tu casa señalando objetos hechos de diferentes minerales y metales."
            ]
          },
          {
            "key": "minerales_tecnologia",
            "name": "Minerales en la Tecnología",
            "short_description": "Minerales especiales usados en dispositivos electrónicos modernos.",
            "example_tasks": [
              "Investiga qué minerales hay en un celular: oro (contactos), cobre (cables), litio (batería), cuarzo (reloj).",
              "Explica por qué el coltán (mineral de tantalio) es importante para electrónica: se usa en capacitores.",
              "Enumera 'tierras raras' usadas en tecnología: neodimio (imanes), litio (baterías), indio (pantallas táctiles).",
              "Discute la importancia de reciclar electrónicos: recuperar minerales valiosos y evitar contaminación."
            ]
          },
          {
            "key": "minerales_nutricion",
            "name": "Minerales en la Nutrición",
            "short_description": "Minerales esenciales que nuestro cuerpo necesita para funcionar correctamente.",
            "example_tasks": [
              "Enumera minerales que necesitamos en la dieta: calcio, hierro, zinc, magnesio, potasio, yodo.",
              "Investiga funciones del calcio: huesos y dientes fuertes, coagulación sanguínea, función muscular.",
              "Explica por qué necesitamos hierro: forma parte de la hemoglobina que transporta oxígeno en la sangre.",
              "Identifica alimentos ricos en minerales: lácteos (calcio), carne/espinacas (hierro), plátanos (potasio), sal yodada (yodo)."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "petroleo_derivados",
    "name": "Petróleo y sus Derivados",
    "short_description": "Los estudiantes exploran el origen del petróleo, su composición, extracción y los numerosos productos que se obtienen de él.",
    "sub_topics": [
      {
        "key": "origen_petroleo",
        "name": "Origen del Petróleo",
        "short_description": "El petróleo se formó hace millones de años a partir de restos de organismos marinos sometidos a calor y presión.",
        "sub_topics": [
          {
            "key": "formacion_petroleo",
            "name": "Formación del Petróleo",
            "short_description": "Proceso de millones de años donde materia orgánica se transforma en petróleo bajo tierra.",
            "example_tasks": [
              "Investiga cómo se forma el petróleo: organismos marinos mueren → se entierran → calor y presión → petróleo (millones de años).",
              "Explica por qué el petróleo es un 'combustible fósil': proviene de restos de seres vivos antiguos.",
              "Discute por qué el petróleo es un recurso no renovable: tarda millones de años en formarse.",
              "Compara el tiempo de formación del petróleo (millones de años) con el ritmo de consumo actual (décadas de reservas)."
            ]
          },
          {
            "key": "composicion_petroleo",
            "name": "Composición del Petróleo",
            "short_description": "El petróleo crudo es una mezcla compleja de hidrocarburos (compuestos de carbono e hidrógeno).",
            "example_tasks": [
              "Investiga qué son los hidrocarburos: moléculas formadas por átomos de carbono e hidrógeno.",
              "Explica que el petróleo crudo es una mezcla de muchos hidrocarburos diferentes, no una sustancia pura.",
              "Describe el aspecto del petróleo crudo: líquido viscoso, negro o café oscuro, con olor fuerte.",
              "Compara petróleo 'ligero' (menos viscoso, más fácil de refinar) con petróleo 'pesado' (viscoso, difícil de procesar)."
            ]
          },
          {
            "key": "extraccion_petroleo",
            "name": "Extracción del Petróleo",
            "short_description": "Proceso de localizar yacimientos petroleros y extraer el petróleo mediante pozos.",
            "example_tasks": [
              "Investiga cómo se localiza el petróleo: estudios geológicos, exploración sísmica, perforaciones de prueba.",
              "Explica cómo se extrae: se perforan pozos profundos hasta llegar a los yacimientos de petróleo.",
              "Discute diferentes lugares de extracción: pozos terrestres, plataformas marinas (offshore).",
              "Investiga la importancia de Pemex en la extracción y producción de petróleo en México."
            ]
          }
        ]
      },
      {
        "key": "refinacion_petroleo",
        "name": "Refinación del Petróleo",
        "short_description": "Proceso de separar el petróleo crudo en diferentes productos útiles mediante destilación.",
        "sub_topics": [
          {
            "key": "destilacion_fraccionada",
            "name": "Destilación Fraccionada",
            "short_description": "Separación de hidrocarburos según sus diferentes puntos de ebullición en una torre de destilación.",
            "example_tasks": [
              "Investiga el proceso de destilación fraccionada: calentar petróleo crudo en una torre donde se separan los componentes.",
              "Explica que diferentes hidrocarburos hierven a diferentes temperaturas y se separan en niveles de la torre.",
              "Enumera fracciones obtenidas de ligera a pesada: gas, gasolina, queroseno, diésel, aceites, asfalto.",
              "Compara fracciones ligeras (pocas moléculas de carbono, volátiles) con pesadas (muchas moléculas, viscosas)."
            ]
          },
          {
            "key": "productos_refineria",
            "name": "Productos de la Refinería",
            "short_description": "Variedad de sustancias útiles obtenidas del petróleo refinado.",
            "example_tasks": [
              "Enumera productos de la refinería: gas LP, gasolina, diésel, queroseno, lubricantes, parafinas, asfalto.",
              "Investiga usos de cada fracción: gas (cocinar), gasolina (autos), queroseno (aviones), diésel (camiones), asfalto (pavimento).",
              "Explica por qué de un solo barril de petróleo se obtienen tantos productos diferentes.",
              "Visita (virtualmente o físicamente) una gasolinera e identifica productos derivados del petróleo."
            ]
          }
        ]
      },
      {
        "key": "derivados_petroleo",
        "name": "Derivados del Petróleo",
        "short_description": "Productos sintéticos fabricados a partir de hidrocarburos del petróleo: plásticos, fertilizantes, medicinas.",
        "sub_topics": [
          {
            "key": "plasticos",
            "name": "Plásticos",
            "short_description": "Polímeros sintéticos fabricados a partir de petróleo, omnipresentes en la vida moderna.",
            "example_tasks": [
              "Enumera 20 objetos de plástico en tu casa: botellas, bolsas, juguetes, recipientes, muebles, aparatos.",
              "Investiga diferentes tipos de plástico: PET (botellas), HDPE (bolsas), PVC (tuberías), PP (tapas).",
              "Explica cómo se hacen los plásticos: moléculas pequeñas de petróleo se unen formando cadenas largas (polimerización).",
              "Discute ventajas del plástico: ligero, duradero, barato, moldeable; y desventajas: no biodegradable, contamina."
            ]
          },
          {
            "key": "fibras_sinteticas",
            "name": "Fibras Sintéticas",
            "short_description": "Materiales textiles fabricados a partir de petróleo: poliéster, nylon, acrílico.",
            "example_tasks": [
              "Revisa las etiquetas de tu ropa. Identifica prendas de poliéster, nylon, acrílico (derivados del petróleo).",
              "Compara telas naturales (algodón, lana) con sintéticas (poliéster, nylon). ¿En qué difieren?",
              "Investiga usos de fibras sintéticas: ropa deportiva (poliéster), medias (nylon), alfombras (acrílico).",
              "Discute ventajas de fibras sintéticas: duraderas, secan rápido, económicas; y desventajas: no respiran bien, no biodegradables."
            ]
          },
          {
            "key": "otros_productos",
            "name": "Otros Productos Petroquímicos",
            "short_description": "Diversidad de productos derivados del petróleo más allá de combustibles y plásticos.",
            "example_tasks": [
              "Enumera productos petroquímicos: fertilizantes, pesticidas, detergentes, pinturas, solventes, cosméticos, medicinas.",
              "Investiga cómo los fertilizantes químicos se hacen del petróleo y ayudan a aumentar producción agrícola.",
              "Identifica productos en tu baño derivados del petróleo: shampoo, crema, pasta dental, desodorante.",
              "Explica cómo muchas medicinas modernas se sintetizan a partir de compuestos del petróleo."
            ]
          },
          {
            "key": "dependencia_petroleo",
            "name": "Dependencia del Petróleo",
            "short_description": "La sociedad moderna depende fuertemente del petróleo para energía, transporte y productos.",
            "example_tasks": [
              "Estima cuántos productos que usas diariamente dependen del petróleo directa o indirectamente.",
              "Discute sectores que dependen del petróleo: transporte, manufactura, agricultura, construcción.",
              "Investiga qué porcentaje de la energía mundial proviene del petróleo (aproximadamente 30-35%).",
              "Reflexiona: ¿Cómo sería la vida moderna sin petróleo? ¿Qué alternativas existen?"
            ]
          }
        ]
      },
      {
        "key": "impacto_ambiental_petroleo",
        "name": "Impacto Ambiental del Petróleo",
        "short_description": "Consecuencias ambientales de la extracción, refinación, uso y desecho de productos petroleros.",
        "sub_topics": [
          {
            "key": "contaminacion_extraccion",
            "name": "Contaminación en la Extracción",
            "short_description": "Derrames de petróleo y daños ambientales durante la exploración y extracción.",
            "example_tasks": [
              "Investiga casos de derrames petroleros famosos: Deepwater Horizon (Golfo de México), Exxon Valdez (Alaska).",
              "Explica efectos de derrames de petróleo: mata vida marina, contamina playas, daña ecosistemas por años.",
              "Discute medidas de prevención: mejores tecnologías, regulaciones estrictas, planes de respuesta a emergencias.",
              "Investiga cómo se limpian derrames: barreras contenedoras, absorbentes, dispersantes químicos, biorremediación."
            ]
          },
          {
            "key": "combustion_contaminacion",
            "name": "Contaminación por Combustión",
            "short_description": "Quemar combustibles fósiles libera gases que contaminan el aire y contribuyen al cambio climático.",
            "example_tasks": [
              "Enumera gases producidos al quemar gasolina/diésel: CO₂, CO, NOx, partículas, compuestos orgánicos volátiles.",
              "Explica cómo el CO₂ de combustibles fósiles contribuye al calentamiento global: atrapa calor en la atmósfera.",
              "Investiga problemas de salud por contaminación del aire: enfermedades respiratorias, asma, problemas cardíacos.",
              "Discute alternativas: vehículos eléctricos, híbridos, transporte público, bicicletas, caminar."
            ]
          },
          {
            "key": "residuos_plasticos",
            "name": "Problema de los Residuos Plásticos",
            "short_description": "Acumulación de plásticos no biodegradables en el ambiente, especialmente océanos.",
            "example_tasks": [
              "Investiga el problema de la 'isla de plástico' en el Océano Pacífico: acumulación gigante de residuos plásticos.",
              "Explica por qué los plásticos son problemáticos: tardan cientos de años en descomponerse.",
              "Discute efectos en animales marinos: ingieren plástico, se enredan, microplásticos entran cadena alimentaria.",
              "Propón soluciones: reducir uso de plásticos desechables, reciclar, usar alternativas biodegradables."
            ]
          },
          {
            "key": "alternativas_sostenibles",
            "name": "Alternativas Sostenibles",
            "short_description": "Energías renovables y materiales alternativos que pueden reducir dependencia del petróleo.",
            "example_tasks": [
              "Enumera fuentes de energía renovable: solar, eólica, hidroeléctrica, geotérmica, biomasa.",
              "Investiga bioplásticos: plásticos hechos de materiales vegetales (maíz, caña de azúcar) que son biodegradables.",
              "Discute vehículos eléctricos e híbridos como alternativa a motores de gasolina/diésel.",
              "Propón acciones personales: usar menos plásticos, ahorrar energía, preferir transporte limpio, reciclar."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "materiales_reciclables",
    "name": "Materiales Reciclables",
    "short_description": "Los estudiantes aprenden sobre la importancia del reciclaje, qué materiales se pueden reciclar y cómo el reciclaje ayuda a conservar recursos y proteger el ambiente.",
    "sub_topics": [
      {
        "key": "que_es_reciclaje",
        "name": "¿Qué es el Reciclaje?",
        "short_description": "Proceso de convertir materiales de desecho en nuevos productos, reduciendo el consumo de recursos frescos.",
        "sub_topics": [
          {
            "key": "concepto_reciclaje",
            "name": "Concepto de Reciclaje",
            "short_description": "Transformar residuos en nuevos materiales útiles en lugar de desecharlos.",
            "example_tasks": [
              "Explica con tus palabras qué significa reciclar: volver a usar materiales de desecho para hacer productos nuevos.",
              "Compara tirar basura (se acumula en rellenos sanitarios) con reciclar (se transforma en productos nuevos).",
              "Investiga el símbolo del reciclaje (tres flechas formando triángulo). ¿Qué representa cada flecha?",
              "Enumera beneficios del reciclaje: ahorra recursos, reduce basura, ahorra energía, protege el ambiente."
            ]
          },
          {
            "key": "tres_r",
            "name": "Las Tres R: Reducir, Reusar, Reciclar",
            "short_description": "Jerarquía de acciones para minimizar residuos, priorizando reducir consumo y reusar antes de reciclar.",
            "example_tasks": [
              "Explica cada R: Reducir (usar menos), Reusar (dar nuevo uso), Reciclar (transformar en nuevo material).",
              "Da ejemplos de reducir: llevar bolsas reutilizables, comprar solo lo necesario, elegir productos con menos empaque.",
              "Da ejemplos de reusar: usar frascos de vidrio para almacenar, donar ropa usada, reparar juguetes.",
              "Explica por qué reducir y reusar son mejores que reciclar: requieren menos energía y recursos."
            ]
          },
          {
            "key": "importancia_reciclaje",
            "name": "Importancia del Reciclaje",
            "short_description": "Beneficios ambientales, económicos y sociales del reciclaje.",
            "example_tasks": [
              "Calcula cuánta basura genera tu familia en una semana. ¿Qué porcentaje se podría reciclar?",
              "Investiga cuánta energía se ahorra reciclando: aluminio (95%), papel (60%), plástico (70%) comparado con fabricar de nuevo.",
              "Explica cómo el reciclaje conserva recursos naturales: menos extracción de minerales, menos tala de árboles.",
              "Discute cómo el reciclaje genera empleos en la recolección, clasificación y procesamiento de materiales."
            ]
          }
        ]
      },
      {
        "key": "tipos_materiales_reciclables",
        "name": "Tipos de Materiales Reciclables",
        "short_description": "Principales categorías de materiales que se pueden reciclar y cómo identificarlos.",
        "sub_topics": [
          {
            "key": "papel_carton",
            "name": "Papel y Cartón",
            "short_description": "Productos de papel se pueden reciclar múltiples veces para hacer nuevo papel.",
            "example_tasks": [
              "Enumera productos de papel reciclables: periódicos, revistas, cajas de cartón, papel de oficina, cuadernos.",
              "Investiga el proceso de reciclaje del papel: recolección → trituración → pulpa → limpieza → nuevo papel.",
              "Explica qué papeles NO se reciclan fácilmente: papel encerado, papel higiénico usado, papel muy sucio con grasa.",
              "Calcula cuántos árboles se salvan reciclando una tonelada de papel (aproximadamente 17 árboles)."
            ]
          },
          {
            "key": "plastico",
            "name": "Plástico",
            "short_description": "Diferentes tipos de plástico reciclable identificados por números del 1 al 7.",
            "example_tasks": [
              "Busca el símbolo de reciclaje con número en envases de plástico. Identifica tipos: 1-PET, 2-HDPE, 3-PVC, etc.",
              "Explica que plásticos tipo 1 (botellas de refresco) y 2 (botellas de leche/shampoo) son los más reciclados.",
              "Investiga qué productos se hacen de plástico reciclado: botellas nuevas, fibras textiles, madera plástica, juguetes.",
              "Discute el problema: no todos los plásticos se reciclan igual de fácil, algunos requieren procesos complejos."
            ]
          },
          {
            "key": "vidrio",
            "name": "Vidrio",
            "short_description": "El vidrio se puede reciclar infinitas veces sin perder calidad.",
            "example_tasks": [
              "Enumera productos de vidrio reciclables: botellas, frascos, envases de alimentos.",
              "Investiga el proceso: vidrio triturado (calcín) se funde y se moldea en nuevos productos de vidrio.",
              "Explica ventajas del vidrio: se recicla 100%, no pierde calidad, ahorra energía (30% menos que vidrio nuevo).",
              "Discute por qué es importante separar vidrio por color (transparente, verde, ámbar) antes de reciclar."
            ]
          },
          {
            "key": "metales",
            "name": "Metales",
            "short_description": "Aluminio, acero y otros metales son altamente reciclables y valiosos.",
            "example_tasks": [
              "Separa latas de aluminio (bebidas) de latas de acero (conservas) usando un imán.",
              "Investiga beneficios de reciclar aluminio: ahorra 95% de energía comparado con producir aluminio de bauxita.",
              "Explica que los metales se pueden reciclar infinitamente sin perder propiedades.",
              "Calcula: una lata de aluminio reciclada puede convertirse en lata nueva en solo 60 días."
            ]
          },
          {
            "key": "organicos",
            "name": "Residuos Orgánicos (Compostaje)",
            "short_description": "Restos de comida y jardín se pueden compostar para crear abono natural.",
            "example_tasks": [
              "Clasifica residuos orgánicos compostables: frutas, verduras, cáscaras de huevo, café, hojas, pasto.",
              "Explica que los orgánicos NO se reciclan igual que plástico/papel: se compostan (descomponen naturalmente).",
              "Investiga beneficios del compostaje: reduce basura en rellenos, produce abono rico en nutrientes, cierra ciclo de nutrientes.",
              "Calcula: aproximadamente 30-40% de la basura doméstica son residuos orgánicos compostables."
            ]
          }
        ]
      },
      {
        "key": "proceso_reciclaje",
        "name": "Proceso de Reciclaje",
        "short_description": "Pasos desde la separación en casa hasta la transformación en nuevos productos.",
        "sub_topics": [
          {
            "key": "separacion_origen",
            "name": "Separación en Origen",
            "short_description": "Clasificar la basura en casa en diferentes categorías facilita el reciclaje.",
            "example_tasks": [
              "Diseña un sistema de separación para tu casa: orgánicos, inorgánicos reciclables, no reciclables.",
              "Crea etiquetas o carteles para botes de basura identificando qué va en cada uno.",
              "Explica por qué es importante lavar envases antes de reciclarlos: evita contaminación de otros materiales.",
              "Investiga el sistema de separación de basura en tu ciudad: ¿qué categorías usan? ¿qué días recogen cada tipo?"
            ]
          },
          {
            "key": "recoleccion_transporte",
            "name": "Recolección y Transporte",
            "short_description": "Los materiales separados se recolectan y transportan a centros de reciclaje.",
            "example_tasks": [
              "Observa los camiones de basura en tu colonia. ¿Vienen diferentes camiones para diferentes tipos de basura?",
              "Investiga a dónde llevan los materiales reciclables: centros de acopio, plantas de reciclaje.",
              "Explica el papel de los pepenadores/recicladores informales en México: recuperan materiales valiosos de la basura.",
              "Propón mejoras al sistema de recolección en tu comunidad para facilitar el reciclaje."
            ]
          },
          {
            "key": "clasificacion_procesamiento",
            "name": "Clasificación y Procesamiento",
            "short_description": "En las plantas de reciclaje se separan, limpian y procesan los materiales.",
            "example_tasks": [
              "Investiga cómo funcionan las plantas de reciclaje: bandas transportadoras, separadores magnéticos, clasificación manual.",
              "Explica procesos de cada material: papel (pulpa), plástico (triturado y fundido), metal (fundición), vidrio (triturado y fundido).",
              "Discute por qué algunos materiales mezclados no se pueden reciclar: difícil separar componentes diferentes.",
              "Investiga tecnologías modernas: separadores ópticos, lectores de códigos de barras, inteligencia artificial."
            ]
          },
          {
            "key": "nuevos_productos",
            "name": "Creación de Nuevos Productos",
            "short_description": "Los materiales reciclados se transforman en productos nuevos completando el ciclo.",
            "example_tasks": [
              "Enumera productos hechos de materiales reciclados: papel reciclado, botellas PET, textiles, madera plástica.",
              "Busca productos con el símbolo de reciclado o que indiquen contenido reciclado.",
              "Investiga ejemplos creativos: muebles de madera plástica, ropa de botellas PET, mochilas de lonas recicladas.",
              "Explica el concepto de 'economía circular': los productos al final de su vida se convierten en recursos para nuevos productos."
            ]
          }
        ]
      },
      {
        "key": "acciones_reciclaje",
        "name": "Acciones para Promover el Reciclaje",
        "short_description": "Actividades individuales y colectivas para fomentar una cultura del reciclaje.",
        "sub_topics": [
          {
            "key": "programa_escolar",
            "name": "Programa de Reciclaje Escolar",
            "short_description": "Iniciativas en la escuela para recolectar y reciclar materiales.",
            "example_tasks": [
              "Diseña un programa de reciclaje para tu escuela: identificar materiales, colocar contenedores, organizar recolección.",
              "Organiza una campaña de acopio de materiales específicos: latas de aluminio, botellas PET, papel/cartón.",
              "Crea materiales educativos: carteles, folletos, presentaciones para enseñar a otros sobre reciclaje.",
              "Calcula cuánto material reciclable genera tu escuela en un mes y establece metas de reciclaje."
            ]
          },
          {
            "key": "proyectos_creativos",
            "name": "Proyectos Creativos con Reciclables",
            "short_description": "Reutilización creativa de materiales para hacer arte, juguetes u objetos útiles.",
            "example_tasks": [
              "Crea un proyecto de arte usando solo materiales reciclados: escultura, collage, instalación.",
              "Diseña juguetes o juegos con materiales reciclados: bolos con botellas, instrumentos musicales, comederos para aves.",
              "Fabrica objetos útiles: portalápices de latas, macetas de botellas, organizadores de cajas de cartón.",
              "Organiza una exposición o concurso de proyectos hechos con materiales reciclados en tu escuela."
            ]
          },
          {
            "key": "conciencia_comunidad",
            "name": "Crear Conciencia en la Comunidad",
            "short_description": "Educar a familia, vecinos y comunidad sobre la importancia del reciclaje.",
            "example_tasks": [
              "Haz una presentación para tu familia explicando cómo separar correctamente la basura.",
              "Diseña y distribuye volantes informativos en tu colonia sobre qué materiales se reciclan y cómo.",
              "Organiza una plática o taller comunitario sobre reciclaje y reducción de residuos.",
              "Crea videos cortos o publicaciones en redes sociales promoviendo el reciclaje con datos y consejos."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "contaminacion_cuidado_ambiental",
    "name": "Contaminación y Cuidado Ambiental",
    "short_description": "Los estudiantes exploran diferentes tipos de contaminación, sus efectos en la salud y el ambiente, y acciones para prevenir y reducir la contaminación.",
    "sub_topics": [
      {
        "key": "tipos_contaminacion",
        "name": "Tipos de Contaminación",
        "short_description": "Diferentes formas en que las actividades humanas introducen sustancias dañinas en el ambiente.",
        "sub_topics": [
          {
            "key": "contaminacion_aire_detalle",
            "name": "Contaminación del Aire",
            "short_description": "Presencia de gases y partículas dañinas en la atmósfera por quema de combustibles, industria y otras fuentes.",
            "example_tasks": [
              "Enumera fuentes de contaminación del aire: vehículos (escape), fábricas (chimeneas), quema de basura, polvo de construcción.",
              "Investiga contaminantes comunes: CO₂, CO, NOx, SO₂, ozono troposférico, partículas PM2.5 y PM10.",
              "Explica efectos en la salud: irritación de ojos/garganta, problemas respiratorios, enfermedades cardíacas, cáncer.",
              "Observa el índice de calidad del aire en tu ciudad. ¿Cuándo está más contaminado? ¿Por qué?"
            ]
          },
          {
            "key": "contaminacion_agua",
            "name": "Contaminación del Agua",
            "short_description": "Sustancias tóxicas o agentes patógenos que degradan la calidad del agua en ríos, lagos y mares.",
            "example_tasks": [
              "Identifica fuentes de contaminación del agua: desagües domésticos, desechos industriales, pesticidas agrícolas, basura.",
              "Enumera contaminantes: bacterias, virus, metales pesados (mercurio, plomo), químicos sintéticos, plásticos.",
              "Explica efectos: enfermedades (diarrea, cólera), muerte de peces y vida acuática, agua no potable.",
              "Investiga el estado de ríos en México: ¿cuáles están más contaminados? ¿Por qué?"
            ]
          },
          {
            "key": "contaminacion_suelo",
            "name": "Contaminación del Suelo",
            "short_description": "Acumulación de sustancias tóxicas en el suelo que afectan su fertilidad y los cultivos.",
            "example_tasks": [
              "Enumera causas: uso excesivo de pesticidas/fertilizantes, vertederos de basura, derrames químicos, minería.",
              "Explica efectos: suelo infértil, contaminación de alimentos cultivados, filtración a aguas subterráneas.",
              "Investiga cómo los pesticidas pueden acumularse en la cadena alimentaria afectando animales y humanos.",
              "Propón alternativas: agricultura orgánica, manejo adecuado de residuos peligrosos, biorremediación."
            ]
          },
          {
            "key": "contaminacion_ruido_luz",
            "name": "Contaminación Acústica y Lumínica",
            "short_description": "Exceso de ruido o luz artificial que afecta la salud y el ambiente.",
            "example_tasks": [
              "Identifica fuentes de ruido: tráfico, construcción, música alta, aeropuertos, fábricas.",
              "Explica efectos del ruido excesivo: estrés, problemas de sueño, pérdida de audición, afecta comunicación de animales.",
              "Investiga contaminación lumínica: exceso de iluminación artificial en ciudades que afecta observación astronómica y ciclos de animales.",
              "Propón soluciones: zonas de silencio, barreras acústicas, regulación de horarios ruidosos, iluminación dirigida."
            ]
          }
        ]
      },
      {
        "key": "efectos_contaminacion",
        "name": "Efectos de la Contaminación",
        "short_description": "Consecuencias de la contaminación en la salud humana, ecosistemas y el planeta.",
        "sub_topics": [
          {
            "key": "salud_humana",
            "name": "Efectos en la Salud Humana",
            "short_description": "Enfermedades y problemas de salud causados por exposición a contaminantes.",
            "example_tasks": [
              "Investiga enfermedades respiratorias asociadas con aire contaminado: asma, bronquitis, EPOC.",
              "Explica cómo el agua contaminada causa enfermedades gastrointestinales: diarrea, tifoidea, hepatitis.",
              "Discute efectos de metales pesados: plomo (daño neurológico), mercurio (afecta sistema nervioso), arsénico (cáncer).",
              "Investiga poblaciones vulnerables: niños, ancianos, personas con enfermedades previas son más afectados."
            ]
          },
          {
            "key": "ecosistemas",
            "name": "Efectos en Ecosistemas",
            "short_description": "Daños a plantas, animales y balance de ecosistemas por contaminación.",
            "example_tasks": [
              "Explica eutrofización: exceso de nutrientes (de fertilizantes) en agua causa proliferación de algas que agotan oxígeno matando peces.",
              "Investiga cómo pesticidas afectan polinizadores como abejas: disminución de poblaciones amenaza producción de alimentos.",
              "Discute bioacumulación: toxinas se concentran en organismos de niveles altos de cadena alimentaria.",
              "Observa efectos locales: ríos contaminados sin peces, áreas con poca vegetación por suelo degradado."
            ]
          },
          {
            "key": "cambio_climatico",
            "name": "Contribución al Cambio Climático",
            "short_description": "Gases contaminantes que atrapan calor causando calentamiento global.",
            "example_tasks": [
              "Explica cómo CO₂, metano y otros gases invernadero atrapan calor en la atmósfera.",
              "Investiga consecuencias del calentamiento global: derretimiento de glaciares, aumento del nivel del mar, eventos climáticos extremos.",
              "Discute cómo la deforestación contribuye: menos árboles absorbiendo CO₂, liberación de carbono almacenado.",
              "Explica el ciclo: más calor → más evaporación → cambios en patrones de lluvia → afecta agricultura y ecosistemas."
            ]
          }
        ]
      },
      {
        "key": "prevencion_control",
        "name": "Prevención y Control de la Contaminación",
        "short_description": "Medidas para reducir, prevenir y remediar la contaminación ambiental.",
        "sub_topics": [
          {
            "key": "tecnologias_limpias",
            "name": "Tecnologías Limpias",
            "short_description": "Innovaciones que reducen emisiones y residuos contaminantes.",
            "example_tasks": [
              "Investiga filtros y convertidores catalíticos en automóviles: reducen emisiones de gases tóxicos.",
              "Explica plantas de tratamiento de aguas residuales: limpian agua antes de devolverla a ríos.",
              "Enumera energías limpias: solar, eólica, hidroeléctrica que no contaminan como combustibles fósiles.",
              "Investiga tecnologías de captura de carbono: atrapan CO₂ antes de que llegue a la atmósfera."
            ]
          },
          {
            "key": "legislacion_regulacion",
            "name": "Legislación y Regulación",
            "short_description": "Leyes y normas que limitan emisiones contaminantes y protegen el ambiente.",
            "example_tasks": [
              "Investiga programas como 'Hoy No Circula': reduce vehículos circulando para disminuir contaminación.",
              "Explica normas de emisiones para vehículos: verificación vehicular obliga a controlar contaminantes.",
              "Discute regulaciones industriales: límites de emisiones, permisos ambientales, sanciones por contaminar.",
              "Investiga áreas naturales protegidas: reservas, parques nacionales donde se restringe actividad humana."
            ]
          },
          {
            "key": "acciones_individuales",
            "name": "Acciones Individuales",
            "short_description": "Hábitos y decisiones personales que reducen nuestra huella contaminante.",
            "example_tasks": [
              "Enumera 10 acciones anticontaminación: usar transporte público/bici, ahorrar energía, reciclar, no quemar basura, consumir responsable.",
              "Calcula tu huella de carbono personal: energía usada, transporte, consumo, residuos generados.",
              "Diseña un plan de acción familiar para reducir contaminación: metas específicas y medibles.",
              "Crea una campaña en redes sociales promoviendo acciones concretas contra la contaminación."
            ]
          },
          {
            "key": "educacion_participacion",
            "name": "Educación y Participación Ciudadana",
            "short_description": "Informar, educar y movilizar a la sociedad para cuidar el ambiente.",
            "example_tasks": [
              "Organiza una limpieza comunitaria de parque, playa o río en tu localidad.",
              "Crea materiales educativos sobre contaminación para distribuir en tu comunidad.",
              "Participa o crea un club ambiental en tu escuela con proyectos de conservación.",
              "Investiga ONGs ambientales en México: ¿cómo puedes participar o apoyar sus esfuerzos?"
            ]
          }
        ]
      },
      {
        "key": "desarrollo_sostenible",
        "name": "Desarrollo Sostenible",
        "short_description": "Balance entre progreso humano y conservación ambiental para las generaciones futuras.",
        "sub_topics": [
          {
            "key": "concepto_sostenibilidad",
            "name": "Concepto de Sostenibilidad",
            "short_description": "Satisfacer necesidades presentes sin comprometer la capacidad de generaciones futuras.",
            "example_tasks": [
              "Explica con tus palabras qué significa desarrollo sostenible: crecer económicamente cuidando el planeta.",
              "Investiga los tres pilares de la sostenibilidad: ambiental, económico, social.",
              "Da ejemplos de prácticas sostenibles: agricultura orgánica, energías renovables, construcción verde, economía circular.",
              "Discute el concepto de 'huella ecológica': cuántos recursos naturales consumimos y cuántos desechos generamos."
            ]
          },
          {
            "key": "recursos_renovables",
            "name": "Uso de Recursos Renovables",
            "short_description": "Aprovechar recursos que se regeneran naturalmente: energía solar, eólica, biomasa.",
            "example_tasks": [
              "Compara recursos renovables (sol, viento, agua) con no renovables (petróleo, carbón, gas natural).",
              "Investiga cómo México aprovecha energías renovables: parques eólicos (Oaxaca), plantas solares, geotermia.",
              "Explica ventajas de renovables: no se agotan, menos contaminación, disponibles localmente.",
              "Propón formas de usar energía renovable en tu escuela: paneles solares, calentadores solares."
            ]
          },
          {
            "key": "consumo_responsable",
            "name": "Consumo Responsable",
            "short_description": "Tomar decisiones de compra considerando el impacto ambiental y social de los productos.",
            "example_tasks": [
              "Antes de comprar, pregúntate: ¿realmente lo necesito? ¿hay alternativa más sostenible? ¿cuánto durará?",
              "Prefiere productos locales: menos transporte, apoyas economía local, generalmente más frescos.",
              "Busca productos con certificaciones ambientales: orgánico, comercio justo, ecoetiquetas.",
              "Evita productos de un solo uso: prefiere reutilizables (botella/bolsa de tela) sobre desechables."
            ]
          },
          {
            "key": "conservacion_biodiversidad",
            "name": "Conservación de la Biodiversidad",
            "short_description": "Proteger la variedad de especies y ecosistemas para mantener el equilibrio natural.",
            "example_tasks": [
              "Explica qué es biodiversidad: variedad de seres vivos (especies, genes, ecosistemas) en un lugar.",
              "Investiga por qué México es megadiverso: gran variedad de climas, geografía, ecosistemas.",
              "Discute amenazas a la biodiversidad: destrucción de hábitats, contaminación, cambio climático, especies invasoras.",
              "Propón acciones de conservación: proteger áreas naturales, no comprar especies en peligro, reforestar, respetar fauna silvestre."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "energia_transformaciones",
    "name": "Energía y sus Transformaciones",
    "short_description": "Los estudiantes exploran el concepto de energía, sus diferentes formas, cómo se transforma de un tipo a otro y su relación con procesos químicos.",
    "sub_topics": [
      {
        "key": "formas_energia",
        "name": "Formas de Energía",
        "short_description": "Diferentes manifestaciones de la energía en la naturaleza y la vida cotidiana.",
        "sub_topics": [
          {
            "key": "energia_luminica",
            "name": "Energía Luminosa",
            "short_description": "Energía transportada por la luz, esencial para la fotosíntesis y la visión.",
            "example_tasks": [
              "Identifica fuentes de energía luminosa: sol (natural), focos, velas, pantallas, linternas.",
              "Explica cómo las plantas usan energía luminosa del sol para hacer fotosíntesis.",
              "Diseña un experimento mostrando que plantas en luz crecen más que plantas en oscuridad.",
              "Investiga cómo paneles solares convierten energía luminosa en energía eléctrica."
            ]
          },
          {
            "key": "energia_termica",
            "name": "Energía Térmica (Calor)",
            "short_description": "Energía relacionada con la temperatura y el movimiento de partículas.",
            "example_tasks": [
              "Identifica fuentes de calor: sol, fuego, estufa, friccón, cuerpo humano.",
              "Explica cómo el calor se transfiere: conducción (tocar), convección (fluidos), radiación (sol).",
              "Diseña experimento: ¿qué materiales conducen mejor el calor? (metal vs. madera vs. plástico)",
              "Investiga cómo el calor acelera reacciones químicas: cocción de alimentos, evaporación."
            ]
          },
          {
            "key": "energia_quimica",
            "name": "Energía Química",
            "short_description": "Energía almacenada en los enlaces de moléculas, liberada en reacciones químicas.",
            "example_tasks": [
              "Explica que los alimentos contienen energía química que liberamos al digerirlos y respirar.",
              "Identifica fuentes de energía química: alimentos, combustibles (gasolina, gas, leña), baterías.",
              "Describe cómo una vela libera energía química almacenada en la cera al quemarse (luz y calor).",
              "Investiga cómo las baterías almacenan energía química y la convierten en energía eléctrica."
            ]
          },
          {
            "key": "energia_mecanica",
            "name": "Energía Mecánica",
            "short_description": "Energía de movimiento (cinética) y posición (potencial).",
            "example_tasks": [
              "Da ejemplos de energía cinética: carro en movimiento, pelota rodando, agua fluyendo.",
              "Da ejemplos de energía potencial: agua en una presa, piedra en una colina, resorte comprimido.",
              "Explica cómo energía potencial se convierte en cinética: soltar una pelota desde altura.",
              "Investiga cómo hidroeléctricas usan energía potencial del agua para generar electricidad."
            ]
          },
          {
            "key": "energia_electrica",
            "name": "Energía Eléctrica",
            "short_description": "Energía transportada por corriente eléctrica, muy versátil y fácil de transmitir.",
            "example_tasks": [
              "Enumera aparatos que usan energía eléctrica: focos, televisión, refrigerador, computadora, licuadora.",
              "Explica cómo llega electricidad a tu casa: plantas generadoras → cables de alta tensión → transformadores → casas.",
              "Investiga diferentes formas de generar electricidad: hidroeléctrica, térmica, solar, eólica, nuclear.",
              "Diseña experimento con circuito simple: batería, cables, foco. Observa flujo de electricidad."
            ]
          }
        ]
      },
      {
        "key": "transformaciones_energia",
        "name": "Transformaciones de Energía",
        "short_description": "La energía cambia de una forma a otra pero no se crea ni se destruye (conservación de energía).",
        "sub_topics": [
          {
            "key": "ejemplos_transformacion",
            "name": "Ejemplos de Transformación",
            "short_description": "Casos cotidianos donde la energía se convierte de un tipo a otro.",
            "example_tasks": [
              "Analiza una vela encendida: química (cera) → térmica (calor) + luminosa (luz).",
              "Describe un foco: eléctrica → luminosa + térmica (por eso se calienta).",
              "Explica una planta solar: luminosa (sol) → química (azúcares en planta).",
              "Analiza tu cuerpo: química (alimentos) → mecánica (movimiento) + térmica (temperatura corporal)."
            ]
          },
          {
            "key": "cadenas_energia",
            "name": "Cadenas de Transformación",
            "short_description": "Series de conversiones de energía en procesos complejos.",
            "example_tasks": [
              "Traza transformaciones en hidroeléctrica: potencial (agua alta) → cinética (agua cayendo) → mecánica (turbina) → eléctrica.",
              "Describe auto de gasolina: química (gasolina) → térmica (explosión) → mecánica (pistones) → cinética (movimiento).",
              "Analiza fotosíntesis y cadena alimentaria: luminosa → química (planta) → química (animal herbívoro) → química (carnívoro).",
              "Explica planta termoeléctrica: química (combustible) → térmica (calor) → mecánica (turbina) → eléctrica."
            ]
          },
          {
            "key": "conservacion_energia",
            "name": "Conservación de la Energía",
            "short_description": "Principio fundamental: la energía total permanece constante, solo se transforma.",
            "example_tasks": [
              "Explica que la energía no se crea ni se destruye, solo cambia de forma.",
              "Analiza péndulo: en punto alto (más potencial, menos cinética), en punto bajo (menos potencial, más cinética), total siempre igual.",
              "Discute por qué necesitamos comer: reponemos energía química que gastamos en actividades.",
              "Investiga eficiencia energética: no toda la energía se convierte útilmente, parte se pierde como calor."
            ]
          }
        ]
      },
      {
        "key": "energia_vida_cotidiana",
        "name": "Energía en la Vida Cotidiana",
        "short_description": "Uso de diferentes formas de energía en nuestras actividades diarias.",
        "sub_topics": [
          {
            "key": "energia_hogar",
            "name": "Energía en el Hogar",
            "short_description": "Diferentes usos de energía en casa y cómo ahorrarla.",
            "example_tasks": [
              "Haz inventario de aparatos en casa y qué tipo de energía usan: eléctrica (mayoría), gas (estufa), solar (calentador).",
              "Calcula aproximadamente cuánta electricidad consume tu familia al mes revisando el recibo de luz.",
              "Propón 10 formas de ahorrar energía en casa: apagar luces, desconectar aparatos, usar focos LED, aprovechar luz natural.",
              "Investiga aparatos 'vampiros': consumen energía aunque estén apagados (modo standby)."
            ]
          },
          {
            "key": "fuentes_energia",
            "name": "Fuentes de Energía",
            "short_description": "Recursos de donde obtenemos energía: renovables y no renovables.",
            "example_tasks": [
              "Clasifica fuentes en renovables (sol, viento, agua, biomasa) y no renovables (petróleo, gas, carbón, uranio).",
              "Investiga ventajas de renovables: no se agotan, menos contaminación; y desventajas: intermitentes, requieren inversión inicial.",
              "Explica problemas de no renovables: se agotan, contaminan, contribuyen al cambio climático.",
              "Propón un futuro energético sostenible: transición gradual de combustibles fósiles a energías limpias."
            ]
          },
          {
            "key": "ahorro_energia",
            "name": "Ahorro y Eficiencia Energética",
            "short_description": "Estrategias para usar menos energía obteniendo los mismos resultados.",
            "example_tasks": [
              "Compara consumo de focos incandescentes vs. LED: LED usa 80% menos energía para la misma luz.",
              "Investiga etiquetas de eficiencia energética en aparatos: A+++ (muy eficiente) a G (poco eficiente).",
              "Diseña plan de ahorro energético para tu escuela: iluminación natural, apagar equipos, sensores de movimiento.",
              "Calcula ahorros económicos: menos energía = menor costo en recibos de luz y gas."
            ]
          }
        ]
      },
      {
        "key": "energia_reacciones_quimicas",
        "name": "Energía en Reacciones Químicas",
        "short_description": "Intercambio de energía durante transformaciones químicas: reacciones exotérmicas y endotérmicas.",
        "sub_topics": [
          {
            "key": "reacciones_exotermicas",
            "name": "Reacciones Exotérmicas",
            "short_description": "Reacciones químicas que liberan energía en forma de calor y/o luz.",
            "example_tasks": [
              "Identifica reacciones exotérmicas: combustión (vela, fogata), respiración celular, mezclar ácido con base.",
              "Observa que al mezclar vinagre con bicarbonato la mezcla se calienta: libera energía.",
              "Explica que en combustión se libera mucha energía almacenada en enlaces químicos.",
              "Investiga cómo el cuerpo usa reacciones exotérmicas (metabolismo) para mantener temperatura de 37°C."
            ]
          },
          {
            "key": "reacciones_endotermicas",
            "name": "Reacciones Endotérmicas",
            "short_description": "Reacciones químicas que absorben energía del entorno, enfriándolo.",
            "example_tasks": [
              "Observa que cuando disuelves ciertas sales (nitrato de amonio) en agua, el vaso se enfría: absorbe calor.",
              "Explica la fotosíntesis como reacción endotérmica: plantas absorben energía luminosa del sol.",
              "Investiga bolsas de hielo instantáneo: contienen sustancias que al mezclarse absorben calor, enfriando.",
              "Compara exotérmicas (liberan calor) con endotérmicas (absorben calor) usando ejemplos cotidianos."
            ]
          },
          {
            "key": "energia_activacion",
            "name": "Energía de Activación",
            "short_description": "Energía inicial necesaria para que comience una reacción química.",
            "example_tasks": [
              "Explica por qué necesitas un cerillo para encender papel: el calor del cerillo proporciona energía de activación.",
              "Observa que gasolina no se quema sola, necesita chispa para iniciar la reacción.",
              "Discute catalizadores: sustancias que reducen energía de activación necesaria (enzimas en el cuerpo).",
              "Investiga cómo temperatura afecta reacciones: más calor = más energía = reacciones más rápidas."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "seguridad_laboratorio",
    "name": "Seguridad en el Laboratorio",
    "short_description": "Los estudiantes aprenden reglas básicas de seguridad, uso correcto de materiales y procedimientos seguros al trabajar con sustancias químicas.",
    "sub_topics": [
      {
        "key": "reglas_seguridad",
        "name": "Reglas Básicas de Seguridad",
        "short_description": "Normas fundamentales para prevenir accidentes al hacer experimentos.",
        "sub_topics": [
          {
            "key": "comportamiento_laboratorio",
            "name": "Comportamiento en el Laboratorio",
            "short_description": "Actitudes y conductas apropiadas durante experimentos.",
            "example_tasks": [
              "Enumera reglas de comportamiento: no correr, no jugar, seguir instrucciones, trabajar con cuidado, preguntar dudas.",
              "Explica por qué es importante estar atento: los accidentes ocurren por descuidos.",
              "Discute por qué no se debe comer ni beber en el laboratorio: riesgo de ingerir sustancias químicas.",
              "Practica escuchar instrucciones completamente antes de comenzar cualquier experimento."
            ]
          },
          {
            "key": "equipo_proteccion",
            "name": "Equipo de Protección Personal",
            "short_description": "Uso de bata, lentes de seguridad y guantes cuando sea necesario.",
            "example_tasks": [
              "Identifica equipo de protección: bata de laboratorio, lentes de seguridad, guantes.",
              "Explica función de cada equipo: bata protege ropa y piel, lentes protegen ojos, guantes protegen manos.",
              "Practica ponerte correctamente lentes de seguridad antes de experimentos con sustancias.",
              "Discute cuándo usar guantes: al manejar sustancias irritantes, calientes o que manchan."
            ]
          },
          {
            "key": "manejo_sustancias",
            "name": "Manejo de Sustancias",
            "short_description": "Cómo manipular seguramente productos químicos y materiales de laboratorio.",
            "example_tasks": [
              "Aprende a leer etiquetas de sustancias: nombre, advertencias, pictogramas de peligro.",
              "Practica técnica correcta: verter líquidos despacio, no regresar sobrantes al frasco original.",
              "Explica regla de oro: agregar ácido al agua, NUNCA agua al ácido (puede salpicar peligrosamente).",
              "Demuestra cómo oler sustancias seguramente: abanicando vapores hacia la nariz, no inhalando directamente."
            ]
          },
          {
            "key": "limpieza_orden",
            "name": "Limpieza y Orden",
            "short_description": "Mantener área de trabajo limpia y organizada.",
            "example_tasks": [
              "Practica limpiar mesa antes y después de experimentos: evita contaminación cruzada.",
              "Aprende a lavar material de vidrio correctamente: agua, jabón, enjuagar bien, dejar secar.",
              "Organiza materiales antes de empezar: tener todo listo evita búsquedas apresuradas que causan accidentes.",
              "Practica desechar residuos apropiadamente: químicos en contenedores especiales, no en la basura común."
            ]
          }
        ]
      },
      {
        "key": "materiales_laboratorio",
        "name": "Materiales de Laboratorio",
        "short_description": "Identificación y uso correcto de instrumentos y recipientes comunes en el laboratorio.",
        "sub_topics": [
          {
            "key": "recipientes_vidrio",
            "name": "Recipientes de Vidrio",
            "short_description": "Vasos de precipitados, tubos de ensayo, matraces y su uso apropiado.",
            "example_tasks": [
              "Identifica recipientes: vaso de precipitados (mezclar), tubo de ensayo (reacciones pequeñas), matraz (soluciones).",
              "Practica técnica para calentar tubos: inclinarlos, moverlos, nunca apuntar hacia personas.",
              "Aprende a manipular vidrio caliente: usar pinzas, nunca tocar directamente, parece frío pero puede quemar.",
              "Explica qué hacer con vidrio roto: no tocar con manos, reportar al maestro, usar recogedor."
            ]
          },
          {
            "key": "instrumentos_medicion",
            "name": "Instrumentos de Medición",
            "short_description": "Probetas, pipetas, balanzas y termómetros para medir volúmenes, masas y temperaturas.",
            "example_tasks": [
              "Practica medir volúmenes con probeta: leer en el menisco (parte baja de la curva del líquido).",
              "Aprende a usar balanza correctamente: tarar (poner en cero), pesar con cuidado, no derramar.",
              "Demuestra uso de termómetro: sumergir en líquido sin tocar fondo, esperar estabilización, leer.",
              "Compara precisión de instrumentos: pipeta (muy precisa) vs. vaso de precipitados (aproximado)."
            ]
          },
          {
            "key": "equipo_calentamiento",
            "name": "Equipo de Calentamiento",
            "short_description": "Mecheros, parrillas, baño maría y su uso seguro.",
            "example_tasks": [
              "Identifica fuentes de calor en el laboratorio escolar: mechero (alcohol o gas), parrilla eléctrica.",
              "Practica encender mechero de alcohol seguramente: cerillo primero, luego abrir válvula lentamente.",
              "Aprende qué nunca hacer: dejar mechero encendido sin supervisión, calentar recipientes cerrados.",
              "Demuestra uso de baño maría: método seguro para calentar sustancias que no deben sobrecalentarse."
            ]
          }
        ]
      },
      {
        "key": "emergencias",
        "name": "Procedimientos de Emergencia",
        "short_description": "Qué hacer en caso de accidentes: derrames, quemaduras, ingestión, salpicaduras.",
        "sub_topics": [
          {
            "key": "primeros_auxilios",
            "name": "Primeros Auxilios Básicos",
            "short_description": "Respuesta inmediata ante accidentes comunes en el laboratorio.",
            "example_tasks": [
              "Aprende qué hacer si te salpica químico en los ojos: lavar inmediatamente con agua abundante 15 minutos, avisar maestro.",
              "Practica procedimiento para quemaduras leves: enfriar con agua fría (no hielo) 10-15 minutos.",
              "Explica qué hacer con derrames: alertar a otros, no tocar, absorber con material apropiado, limpiar según sustancia.",
              "Memoriza: SIEMPRE avisar al maestro inmediatamente ante cualquier accidente, por pequeño que parezca."
            ]
          },
          {
            "key": "salidas_emergencia",
            "name": "Salidas de Emergencia",
            "short_description": "Conocer rutas de evacuación en caso de emergencia mayor.",
            "example_tasks": [
              "Identifica salidas de emergencia en tu aula/laboratorio: ubicación, señalización.",
              "Practica evacuación ordenada: sin correr, sin gritar, seguir instrucciones, reunirse en punto seguro.",
              "Localiza equipo de emergencia: extintor, botiquín, regadera de seguridad, lavaojos.",
              "Aprende cuándo evacuar: fuego descontrolado, derrame grande de químicos peligrosos, alarma."
            ]
          },
          {
            "key": "prevencion_accidentes",
            "name": "Prevención de Accidentes",
            "short_description": "Medidas proactivas para evitar situaciones peligrosas.",
            "example_tasks": [
              "Practica anticipar riesgos: ¿qué podría salir mal? ¿cómo prevenirlo?",
              "Aplica principio de precaución: si no estás seguro, pregunta antes de actuar.",
              "Verifica equipo antes de usar: vidrio sin grietas, conexiones seguras, etiquetas legibles.",
              "Trabaja con compañero: observarse mutuamente ayuda detectar errores antes de que causen problemas."
            ]
          }
        ]
      },
      {
        "key": "desechos_quimicos",
        "name": "Manejo de Desechos Químicos",
        "short_description": "Disposición correcta de residuos químicos para proteger salud y ambiente.",
        "sub_topics": [
          {
            "key": "clasificacion_desechos",
            "name": "Clasificación de Desechos",
            "short_description": "Diferentes categorías de residuos químicos según su peligrosidad.",
            "example_tasks": [
              "Aprende categorías: desechos ácidos, básicos, orgánicos, inorgánicos, inflamables, tóxicos.",
              "Practica identificar desechos: ¿qué tipo es? Leer etiquetas y propiedades de la sustancia.",
              "Explica por qué no mezclar desechos incompatibles: pueden reaccionar peligrosamente.",
              "Investiga símbolos de peligro: corrosivo, tóxico, inflamable, reactivo, irritante."
            ]
          },
          {
            "key": "contenedores_apropiados",
            "name": "Contenedores Apropiados",
            "short_description": "Uso de recipientes específicos para cada tipo de desecho.",
            "example_tasks": [
              "Identifica contenedores de desechos en el laboratorio: etiquetados por tipo de residuo.",
              "Practica desechar correctamente: verter con cuidado en contenedor apropiado, no llenar completamente.",
              "Aprende qué NO va por el drenaje: ácidos/bases concentrados, metales pesados, solventes orgánicos.",
              "Explica por qué usar contenedores etiquetados: facilita tratamiento posterior, previene reacciones peligrosas."
            ]
          },
          {
            "key": "minimizacion_residuos",
            "name": "Minimización de Residuos",
            "short_description": "Estrategias para generar menos desechos químicos.",
            "example_tasks": [
              "Practica usar cantidades mínimas necesarias: no preparar en exceso, medir cuidadosamente.",
              "Aprende técnicas de microscala: experimentos con volúmenes pequeños generan menos residuos.",
              "Reutiliza cuando sea posible: algunos solventes se pueden recuperar y purificar.",
              "Planifica experimentos: organizar reduce errores que generan desechos adicionales."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "metodo_cientifico_basico",
    "name": "Método Científico Básico",
    "short_description": "Los estudiantes aprenden a hacer observaciones, formular preguntas, diseñar experimentos simples y registrar resultados de manera organizada.",
    "sub_topics": [
      {
        "key": "observacion_pregunta",
        "name": "Observación y Formulación de Preguntas",
        "short_description": "Usar los sentidos para observar fenómenos y hacer preguntas investigables.",
        "sub_topics": [
          {
            "key": "observacion_cuidadosa",
            "name": "Observación Cuidadosa",
            "short_description": "Usar todos los sentidos apropiadamente para recopilar información.",
            "example_tasks": [
              "Observa un cubo de hielo derritiéndose: describe todos los cambios que ves, sientes, oyes.",
              "Practica observación cualitativa (descriptiva) vs. cuantitativa (con números): color, olor, textura vs. temperatura, tiempo, masa.",
              "Registra observaciones detalladamente: anotar fecha, hora, condiciones, todo lo que notas.",
              "Aprende a distinguir observación (lo que ves) de inferencia (lo que concluyes): hielo mojado (observación) vs. se está derritiendo (inferencia)."
            ]
          },
          {
            "key": "preguntas_investigables",
            "name": "Preguntas Investigables",
            "short_description": "Formular preguntas que se pueden responder mediante experimentos.",
            "example_tasks": [
              "Transforma observaciones en preguntas: veo que azúcar se disuelve en agua → ¿qué tan rápido se disuelve? ¿qué factores lo afectan?",
              "Practica hacer preguntas específicas: no '¿por qué las plantas crecen?' sino '¿cómo afecta la luz el crecimiento de las plantas?'",
              "Identifica preguntas investigables (se pueden probar) vs. no investigables (opiniones): '¿qué color es mejor?' (no) vs. '¿qué color absorbe más calor?' (sí)",
              "Genera múltiples preguntas sobre un fenómeno: combustión de vela → ¿qué se necesita? ¿qué produce? ¿cuánto dura según tamaño?"
            ]
          }
        ]
      },
      {
        "key": "hipotesis_prediccion",
        "name": "Hipótesis y Predicción",
        "short_description": "Proponer explicaciones tentativas y predecir resultados de experimentos.",
        "sub_topics": [
          {
            "key": "formular_hipotesis",
            "name": "Formular Hipótesis",
            "short_description": "Proponer respuesta tentativa basada en conocimientos previos.",
            "example_tasks": [
              "Aprende formato: 'Si [hago esto], entonces [pasará esto] porque [razón]'. Ejemplo: Si aumento temperatura del agua, entonces el azúcar se disolverá más rápido porque el calor acelera movimiento de moléculas.",
              "Practica con situaciones cotidianas: ¿Qué pasará si dejo pan fuera del refrigerador? Hipótesis: Se enmohecerá porque los hongos crecen en ambientes cálidos y húmedos.",
              "Distingue hipótesis (explicación tentativa) de predicción (resultado esperado): Hipótesis explica por qué, predicción dice qué esperas observar.",
              "Aprende que hipótesis puede ser incorrecta: no es fracaso, es aprendizaje que lleva a nuevas preguntas."
            ]
          },
          {
            "key": "hacer_predicciones",
            "name": "Hacer Predicciones",
            "short_description": "Anticipar resultados específicos basándose en la hipótesis.",
            "example_tasks": [
              "Practica predecir resultados específicos: 'Predigo que el hielo en agua caliente se derretirá en 3 minutos mientras que en agua fría tardará 10 minutos.'",
              "Compara predicción (antes del experimento) con resultado (después): ¿coincidieron? ¿por qué sí o no?",
              "Aprende a hacer predicciones medibles: no solo 'será más rápido' sino 'será el doble de rápido' o 'tardará 5 minutos menos'.",
              "Diseña predicciones para diferentes escenarios: ¿qué pasará si cambio temperatura? ¿si cambio cantidad? ¿si cambio material?"
            ]
          }
        ]
      },
      {
        "key": "diseño_experimental",
        "name": "Diseño Experimental",
        "short_description": "Planear experimentos controlando variables para probar hipótesis.",
        "sub_topics": [
          {
            "key": "variables",
            "name": "Identificar Variables",
            "short_description": "Reconocer variable independiente (la que cambias), dependiente (la que mides) y controladas (las que mantienes igual).",
            "example_tasks": [
              "En experimento de disolución de azúcar: Variable independiente = temperatura del agua, Variable dependiente = tiempo de disolución, Variables controladas = cantidad de azúcar, cantidad de agua, tipo de azúcar, agitación.",
              "Practica identificar variables en experimentos comunes: germinación de semillas, oxidación de metales, crecimiento de plantas.",
              "Explica por qué controlar variables: para saber que el cambio observado se debe a la variable independiente, no a otros factores.",
              "Diseña experimento cambiando solo UNA variable a la vez: si cambias varias, no sabrás cuál causó el efecto."
            ]
          },
          {
            "key": "grupo_control",
            "name": "Grupo de Control",
            "short_description": "Tener un grupo sin cambios para comparar con el grupo experimental.",
            "example_tasks": [
              "Explica qué es grupo de control: grupo que NO recibe el tratamiento, sirve de comparación.",
              "Diseña experimento con control: probar efecto de fertilizante → plantas con fertilizante (experimental) vs. plantas sin fertilizante (control).",
              "Practica mantener todo igual entre grupos excepto la variable probada.",
              "Compara resultados: ¿el grupo experimental fue diferente del control? ¿cuánto?"
            ]
          },
          {
            "key": "repeticion_muestras",
            "name": "Repetición y Múltiples Muestras",
            "short_description": "Hacer el experimento varias veces y con múltiples sujetos para asegurar confiabilidad.",
            "example_tasks": [
              "Explica por qué repetir: un resultado puede ser casualidad, varios resultados similares son más confiables.",
              "Practica hacer experimento 3-5 veces: promediar resultados da valor más preciso.",
              "Usa múltiples sujetos/muestras: no una planta sino 10 plantas, no un ensayo sino cinco.",
              "Identifica resultados inconsistentes: si uno es muy diferente, puede ser error experimental."
            ]
          }
        ]
      },
      {
        "key": "registro_analisis",
        "name": "Registro y Análisis de Datos",
        "short_description": "Anotar observaciones y resultados de manera organizada y analizarlos para sacar conclusiones.",
        "sub_topics": [
          {
            "key": "cuaderno_laboratorio",
            "name": "Cuaderno de Laboratorio",
            "short_description": "Registrar procedimientos, observaciones y datos de forma clara y organizada.",
            "example_tasks": [
              "Practica formato de reporte: Título, Fecha, Pregunta, Hipótesis, Materiales, Procedimiento, Datos, Conclusiones.",
              "Registra MIENTRAS haces el experimento: anotar inmediatamente, no confiar en memoria.",
              "Incluye detalles: cantidades exactas, tiempos, temperaturas, observaciones inesperadas.",
              "Usa dibujos y diagramas: a veces una imagen comunica mejor que palabras."
            ]
          },
          {
            "key": "tablas_graficas",
            "name": "Tablas y Gráficas",
            "short_description": "Organizar datos numéricos en tablas y representarlos visualmente en gráficas.",
            "example_tasks": [
              "Crea tablas organizando datos: columnas para cada variable, filas para cada medición.",
              "Practica hacer gráficas de barras: comparar categorías (ej: tiempo de disolución en agua fría/tibia/caliente).",
              "Aprende gráficas de líneas: mostrar cambios en el tiempo (ej: temperatura del agua vs. tiempo).",
              "Interpreta gráficas: ¿qué patrón ves? ¿aumenta, disminuye, permanece constante?"
            ]
          },
          {
            "key": "analisis_patrones",
            "name": "Análisis de Patrones",
            "short_description": "Buscar tendencias, relaciones y patrones en los datos.",
            "example_tasks": [
              "Identifica patrones: ¿cuando X aumenta, Y también aumenta? ¿disminuye? ¿no cambia?",
              "Calcula promedios: sumar todos los valores y dividir por cantidad de mediciones.",
              "Compara resultados con predicciones: ¿coincidieron? ¿por qué sí o no?",
              "Identifica anomalías: datos que no siguen el patrón general (pueden indicar error o algo interesante)."
            ]
          }
        ]
      },
      {
        "key": "conclusiones_comunicacion",
        "name": "Conclusiones y Comunicación",
        "short_description": "Interpretar resultados, sacar conclusiones y comunicarlas efectivamente.",
        "sub_topics": [
          {
            "key": "sacar_conclusiones",
            "name": "Sacar Conclusiones",
            "short_description": "Determinar si los datos apoyan o rechazan la hipótesis.",
            "example_tasks": [
              "Practica formato de conclusión: 'Los datos [apoyan/no apoyan] mi hipótesis porque [evidencia de los resultados].'",
              "Basa conclusiones en evidencia: citar datos específicos, no solo 'funcionó' o 'no funcionó'.",
              "Aprende que rechazar hipótesis no es fracaso: también es conocimiento valioso que lleva a nuevas preguntas.",
              "Identifica limitaciones del experimento: ¿qué pudo afectar resultados? ¿qué mejorarías?"
            ]
          },
          {
            "key": "comunicar_resultados",
            "name": "Comunicar Resultados",
            "short_description": "Presentar hallazgos claramente a otros mediante reportes, carteles o presentaciones.",
            "example_tasks": [
              "Crea reporte escrito siguiendo formato científico: introducción, metodología, resultados, conclusiones.",
              "Diseña cartel científico: título llamativo, pregunta, hipótesis, procedimiento resumido, resultados (gráficas), conclusión.",
              "Practica presentación oral: explicar experimento en 3-5 minutos, responder preguntas.",
              "Usa lenguaje claro y preciso: evitar ambigüedades, definir términos técnicos."
            ]
          },
          {
            "key": "nuevas_preguntas",
            "name": "Generar Nuevas Preguntas",
            "short_description": "Usar resultados para formular nuevas preguntas investigables.",
            "example_tasks": [
              "Practica: después de cada experimento, pregunta '¿Qué más podríamos investigar?'",
              "Identifica variables no probadas: si probaste temperatura, ¿qué pasa con cantidad, tipo, o agitación?",
              "Propón extensiones: si azúcar se disolvió más rápido en agua caliente, ¿pasa lo mismo con sal? ¿con otros sólidos?",
              "Aprende que ciencia es proceso continuo: cada respuesta genera nuevas preguntas."
            ]
          }
        ]
      }
    ]
  }
]
