[
  {
    "key": "introduccion_estudio_historia",
    "name": "Introducción al Estudio de la Historia",
    "short_description": "Los estudiantes aprenden qué es la historia, cómo se mide el tiempo histórico y la importancia de las fuentes históricas para comprender el pasado.",
    "sub_topics": [
      {
        "key": "que_es_historia",
        "name": "¿Qué es la Historia?",
        "short_description": "Comprensión del concepto de historia como el estudio del pasado humano y su importancia para entender el presente.",
        "sub_topics": [
          {
            "key": "definicion_historia",
            "name": "Definición y Objeto de Estudio",
            "short_description": "Identificar la historia como la ciencia que estudia los acontecimientos del pasado de la humanidad.",
            "example_tasks": [
              "Explica con tus propias palabras qué es la historia y por qué es importante estudiarla",
              "Menciona tres razones por las que conocer el pasado nos ayuda a entender el presente",
              "Elabora un dibujo que represente la diferencia entre historia (pasado de la humanidad) y prehistoria (antes de la escritura)"
            ]
          },
          {
            "key": "pasado_presente_futuro",
            "name": "Relación entre Pasado, Presente y Futuro",
            "short_description": "Comprender cómo los acontecimientos del pasado influyen en el presente y pueden orientar el futuro.",
            "example_tasks": [
              "Describe cómo una tradición de tu familia o comunidad viene del pasado y se practica en el presente",
              "Investiga un invento del pasado (como la rueda o la escritura) y explica cómo cambió la vida de las personas",
              "Compara cómo era la educación en la época de tus abuelos con la educación actual"
            ]
          }
        ]
      },
      {
        "key": "medicion_tiempo_historico",
        "name": "La Medición del Tiempo Histórico",
        "short_description": "Aprendizaje de las unidades de tiempo histórico, calendarios y sistemas de periodización.",
        "sub_topics": [
          {
            "key": "unidades_tiempo",
            "name": "Unidades de Tiempo: Década, Siglo y Milenio",
            "short_description": "Identificar y utilizar las principales unidades de medida del tiempo histórico.",
            "example_tasks": [
              "Calcula cuántos años hay en 3 décadas, 2 siglos y 1 milenio",
              "Ubica en qué siglo ocurrieron los siguientes años: 1521, 1810, 1910, 2010",
              "Crea una línea del tiempo personal que muestre los acontecimientos importantes de tu vida organizados por años"
            ]
          },
          {
            "key": "antes_despues_cristo",
            "name": "Antes de Cristo (a.C.) y Después de Cristo (d.C.)",
            "short_description": "Comprender el sistema de datación occidental basado en el nacimiento de Cristo.",
            "example_tasks": [
              "Ordena cronológicamente los siguientes años: 500 a.C., 100 d.C., 2000 a.C., 1500 d.C.",
              "Explica por qué los años antes de Cristo se cuentan en orden inverso (de mayor a menor)",
              "Calcula cuántos años transcurrieron entre el año 300 a.C. y el año 200 d.C."
            ]
          },
          {
            "key": "lineas_tiempo",
            "name": "Elaboración de Líneas del Tiempo",
            "short_description": "Construir líneas del tiempo para organizar y visualizar acontecimientos históricos.",
            "example_tasks": [
              "Elabora una línea del tiempo de la historia de México con al menos 5 acontecimientos importantes desde la época prehispánica hasta la actualidad",
              "Crea una línea del tiempo que muestre la evolución de los medios de transporte a través de la historia",
              "Diseña una línea del tiempo de tu escuela desde su fundación hasta hoy, incluyendo eventos importantes"
            ]
          }
        ]
      },
      {
        "key": "fuentes_historicas",
        "name": "Las Fuentes Históricas",
        "short_description": "Identificación y análisis de fuentes primarias y secundarias para la construcción del conocimiento histórico.",
        "sub_topics": [
          {
            "key": "tipos_fuentes",
            "name": "Fuentes Primarias y Secundarias",
            "short_description": "Distinguir entre fuentes primarias (testimonios directos) y fuentes secundarias (interpretaciones posteriores).",
            "example_tasks": [
              "Clasifica las siguientes fuentes como primarias o secundarias: una fotografía antigua, un libro de historia, una carta de la época colonial, un documental",
              "Busca en tu casa un objeto que pueda ser considerado fuente primaria para la historia de tu familia y describe qué información proporciona",
              "Explica por qué los códices prehispánicos son fuentes primarias para conocer las culturas antiguas de México"
            ]
          },
          {
            "key": "fuentes_escritas",
            "name": "Fuentes Escritas",
            "short_description": "Reconocer documentos escritos como cartas, códices, crónicas y periódicos como fuentes históricas.",
            "example_tasks": [
              "Lee un fragmento de una carta de la época de la Independencia y extrae tres datos históricos que proporcione",
              "Investiga qué son los códices mexicas y menciona dos ejemplos importantes",
              "Compara cómo se presentaba una noticia en un periódico antiguo versus un periódico actual"
            ]
          },
          {
            "key": "fuentes_materiales",
            "name": "Fuentes Materiales y Arqueológicas",
            "short_description": "Identificar objetos, construcciones y restos arqueológicos como fuentes para estudiar el pasado.",
            "example_tasks": [
              "Describe qué información nos pueden dar las pirámides de Teotihuacán sobre la civilización que las construyó",
              "Investiga un objeto prehispánico encontrado en excavaciones arqueológicas y explica qué revela sobre la vida de esa época",
              "Imagina que eres arqueólogo y encuentras una vasija de cerámica mexica: ¿qué podrías aprender de ella sobre esa cultura?"
            ]
          },
          {
            "key": "fuentes_orales_iconograficas",
            "name": "Fuentes Orales e Iconográficas",
            "short_description": "Valorar testimonios orales, pinturas, fotografías y videos como fuentes históricas.",
            "example_tasks": [
              "Entrevista a un adulto mayor de tu familia sobre cómo era la vida cuando era niño y elabora un resumen de lo que te cuente",
              "Analiza una fotografía histórica de la Revolución Mexicana y describe qué detalles te dan información sobre esa época",
              "Explica por qué las tradiciones orales son importantes para conocer la historia de los pueblos indígenas de México"
            ]
          }
        ]
      },
      {
        "key": "periodizacion_historica",
        "name": "La Periodización de la Historia",
        "short_description": "Comprensión de las grandes etapas o periodos en que se divide la historia universal y de México.",
        "sub_topics": [
          {
            "key": "periodos_historia_universal",
            "name": "Periodos de la Historia Universal",
            "short_description": "Identificar la Prehistoria, Edad Antigua, Edad Media, Edad Moderna y Edad Contemporánea.",
            "example_tasks": [
              "Elabora un esquema que muestre los cinco periodos de la historia universal con sus fechas aproximadas",
              "Menciona una característica principal de cada periodo de la historia universal",
              "Ubica en qué periodo histórico universal se desarrollaron las civilizaciones mesoamericanas"
            ]
          },
          {
            "key": "periodos_historia_mexico",
            "name": "Periodos de la Historia de México",
            "short_description": "Conocer la división tradicional: México Prehispánico, Conquista, Virreinato, Independencia, Siglo XIX, Revolución y México Contemporáneo.",
            "example_tasks": [
              "Crea una línea del tiempo de México dividida en los principales periodos históricos del país",
              "Describe brevemente qué caracteriza a cada uno de los grandes periodos de la historia de México",
              "Investiga aproximadamente cuántos años duró cada periodo de la historia de México"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "la_prehistoria",
    "name": "La Prehistoria",
    "short_description": "Estudio de la evolución humana y las primeras formas de vida en sociedad antes de la invención de la escritura.",
    "sub_topics": [
      {
        "key": "origen_ser_humano",
        "name": "El Origen del Ser Humano",
        "short_description": "Comprensión de las teorías sobre la evolución humana y la aparición del Homo sapiens.",
        "sub_topics": [
          {
            "key": "evolucion_humana",
            "name": "La Evolución de los Homínidos",
            "short_description": "Conocer las principales etapas de la evolución humana desde los primeros homínidos hasta el Homo sapiens.",
            "example_tasks": [
              "Elabora un diagrama que muestre la evolución del ser humano desde los primeros homínidos hasta el Homo sapiens",
              "Describe tres características que diferencian a los seres humanos de otros primates",
              "Investiga en qué continente apareció el Homo sapiens y cómo se dispersó por el mundo"
            ]
          },
          {
            "key": "africa_cuna_humanidad",
            "name": "África: Cuna de la Humanidad",
            "short_description": "Reconocer África como el lugar de origen de los primeros seres humanos según evidencias científicas.",
            "example_tasks": [
              "Ubica en un mapa de África las regiones donde se han encontrado los restos de homínidos más antiguos",
              "Explica por qué África es considerada la cuna de la humanidad",
              "Investiga qué son los fósiles de Lucy y Australopithecus y por qué son importantes"
            ]
          }
        ]
      },
      {
        "key": "paleolitico",
        "name": "El Paleolítico o Edad de Piedra Antigua",
        "short_description": "Características de la vida de los primeros grupos humanos cazadores-recolectores.",
        "sub_topics": [
          {
            "key": "nomadismo_cazadores_recolectores",
            "name": "El Nomadismo y los Cazadores-Recolectores",
            "short_description": "Comprender el modo de vida nómada y las actividades de caza, pesca y recolección.",
            "example_tasks": [
              "Explica qué significa ser nómada y por qué los grupos del Paleolítico vivían así",
              "Describe las principales actividades que realizaban los cazadores-recolectores para sobrevivir",
              "Compara la vida nómada del Paleolítico con la vida sedentaria actual, mencionando ventajas y desventajas de cada una"
            ]
          },
          {
            "key": "descubrimiento_fuego",
            "name": "El Descubrimiento y Uso del Fuego",
            "short_description": "Valorar la importancia del dominio del fuego para la supervivencia y desarrollo humano.",
            "example_tasks": [
              "Menciona tres usos que los seres humanos del Paleolítico daban al fuego",
              "Explica cómo el fuego cambió la vida de los primeros grupos humanos",
              "Investiga cómo crees que los humanos prehistóricos aprendieron a controlar el fuego"
            ]
          },
          {
            "key": "herramientas_piedra",
            "name": "Las Primeras Herramientas de Piedra",
            "short_description": "Reconocer la fabricación de herramientas de piedra como avance tecnológico fundamental.",
            "example_tasks": [
              "Describe para qué servían las herramientas de piedra elaboradas por los humanos del Paleolítico",
              "Dibuja tres herramientas de piedra del Paleolítico y explica su función",
              "Explica por qué el desarrollo de herramientas fue importante para la evolución humana"
            ]
          },
          {
            "key": "arte_rupestre",
            "name": "El Arte Rupestre",
            "short_description": "Identificar las pinturas rupestres como primeras manifestaciones artísticas y su posible significado.",
            "example_tasks": [
              "Observa imágenes de pinturas rupestres de las cuevas de Altamira o Lascaux y describe qué representan",
              "Investiga qué técnicas y materiales usaban los humanos prehistóricos para pintar en las cuevas",
              "Explica qué teorías existen sobre por qué los humanos del Paleolítico creaban arte rupestre"
            ]
          }
        ]
      },
      {
        "key": "neolitico",
        "name": "El Neolítico o Edad de Piedra Nueva",
        "short_description": "La Revolución Neolítica: agricultura, sedentarismo y primeras aldeas.",
        "sub_topics": [
          {
            "key": "revolucion_agricola",
            "name": "La Revolución Agrícola",
            "short_description": "Comprender el inicio de la agricultura como transformación fundamental de la vida humana.",
            "example_tasks": [
              "Explica qué fue la Revolución Neolítica o Revolución Agrícola y por qué se considera una revolución",
              "Menciona las primeras plantas que fueron domesticadas por los seres humanos en diferentes partes del mundo",
              "Describe cómo el descubrimiento de la agricultura cambió la forma de vida de los grupos humanos"
            ]
          },
          {
            "key": "domesticacion_animales",
            "name": "La Domesticación de Animales",
            "short_description": "Reconocer la domesticación de animales como complemento de la agricultura.",
            "example_tasks": [
              "Investiga cuáles fueron los primeros animales domesticados por el ser humano y para qué se utilizaban",
              "Explica las ventajas que obtuvieron los grupos humanos al domesticar animales",
              "Compara la vida de los animales salvajes con la de los animales domesticados"
            ]
          },
          {
            "key": "sedentarismo_aldeas",
            "name": "El Sedentarismo y las Primeras Aldeas",
            "short_description": "Comprender el paso del nomadismo al sedentarismo y la formación de asentamientos permanentes.",
            "example_tasks": [
              "Explica qué significa sedentarismo y por qué la agricultura permitió a los humanos volverse sedentarios",
              "Describe cómo eran las primeras aldeas del Neolítico",
              "Menciona tres consecuencias del sedentarismo en la organización social de los grupos humanos"
            ]
          },
          {
            "key": "nuevas_tecnologias_neolitico",
            "name": "Nuevas Tecnologías: Cerámica y Tejidos",
            "short_description": "Identificar los avances tecnológicos del Neolítico como la cerámica, el tejido y herramientas pulidas.",
            "example_tasks": [
              "Explica por qué la invención de la cerámica fue importante para las comunidades neolíticas",
              "Describe las diferencias entre las herramientas de piedra del Paleolítico y las del Neolítico",
              "Investiga qué materiales se usaban para tejer en el Neolítico y qué productos se fabricaban"
            ]
          }
        ]
      },
      {
        "key": "edad_metales",
        "name": "La Edad de los Metales",
        "short_description": "El descubrimiento de la metalurgia y su impacto en el desarrollo de las sociedades.",
        "sub_topics": [
          {
            "key": "trabajo_metales",
            "name": "El Trabajo del Cobre, Bronce y Hierro",
            "short_description": "Conocer las etapas del uso de metales y sus aplicaciones.",
            "example_tasks": [
              "Ordena cronológicamente el uso de los siguientes metales: hierro, cobre, bronce",
              "Explica las ventajas de las herramientas de metal sobre las de piedra",
              "Investiga para qué se utilizaban los metales en las sociedades antiguas además de hacer herramientas"
            ]
          },
          {
            "key": "especializacion_trabajo",
            "name": "Especialización del Trabajo",
            "short_description": "Comprender cómo el dominio de la metalurgia llevó a una mayor división del trabajo.",
            "example_tasks": [
              "Explica qué es la especialización del trabajo y da ejemplos de oficios especializados en la Edad de los Metales",
              "Describe por qué no todas las personas de una comunidad podían dedicarse a trabajar metales",
              "Menciona tres oficios o trabajos especializados que surgieron en las primeras sociedades con agricultura y metalurgia"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "primeras_civilizaciones_agricolas",
    "name": "Las Primeras Civilizaciones Agrícolas",
    "short_description": "Estudio de las civilizaciones que surgieron en torno a grandes ríos en Mesopotamia, Egipto y el Mediterráneo.",
    "sub_topics": [
      {
        "key": "mesopotamia",
        "name": "Mesopotamia: Entre Dos Ríos",
        "short_description": "Conocimiento de las civilizaciones que se desarrollaron entre los ríos Tigris y Éufrates.",
        "sub_topics": [
          {
            "key": "ubicacion_mesopotamia",
            "name": "Ubicación Geográfica y Medio Ambiente",
            "short_description": "Identificar la región de Mesopotamia y su importancia para el desarrollo de civilizaciones.",
            "example_tasks": [
              "Localiza en un mapa la región de Mesopotamia y los ríos Tigris y Éufrates",
              "Explica por qué las primeras civilizaciones surgieron cerca de los ríos",
              "Describe el clima y las características geográficas de Mesopotamia en la antigüedad"
            ]
          },
          {
            "key": "sumerios",
            "name": "Los Sumerios",
            "short_description": "Reconocer a los sumerios como una de las primeras civilizaciones y sus aportaciones.",
            "example_tasks": [
              "Menciona tres inventos o aportaciones importantes de los sumerios a la humanidad",
              "Investiga qué eran las ciudades-estado sumerias y menciona dos ejemplos",
              "Explica qué son los zigurats y cuál era su función en las ciudades sumerias"
            ]
          },
          {
            "key": "escritura_cuneiforme",
            "name": "La Invención de la Escritura Cuneiforme",
            "short_description": "Valorar la escritura cuneiforme como uno de los primeros sistemas de escritura de la humanidad.",
            "example_tasks": [
              "Explica qué es la escritura cuneiforme y cómo se elaboraba",
              "Investiga por qué la invención de la escritura marca el fin de la Prehistoria y el inicio de la Historia",
              "Describe para qué usaban los sumerios la escritura en su vida diaria"
            ]
          },
          {
            "key": "codigo_hammurabi",
            "name": "El Código de Hammurabi",
            "short_description": "Conocer uno de los primeros códigos legales escritos de la humanidad.",
            "example_tasks": [
              "Investiga qué era el Código de Hammurabi y quién lo creó",
              "Lee alguna ley del Código de Hammurabi y explica qué nos dice sobre la sociedad babilónica",
              "Compara el concepto de justicia en el Código de Hammurabi (ojo por ojo) con las leyes actuales"
            ]
          }
        ]
      },
      {
        "key": "antiguo_egipto",
        "name": "El Antiguo Egipto",
        "short_description": "Las civilizaciones que florecieron a orillas del río Nilo y sus grandes logros culturales.",
        "sub_topics": [
          {
            "key": "rio_nilo",
            "name": "El Río Nilo: Don de Egipto",
            "short_description": "Comprender la importancia del Nilo para el desarrollo de la civilización egipcia.",
            "example_tasks": [
              "Explica por qué el historiador griego Heródoto llamó a Egipto 'el don del Nilo'",
              "Describe cómo las inundaciones anuales del Nilo beneficiaban a la agricultura egipcia",
              "Localiza en un mapa el río Nilo y las principales ciudades del Antiguo Egipto"
            ]
          },
          {
            "key": "faraones_gobierno",
            "name": "Los Faraones y el Gobierno Teocrático",
            "short_description": "Conocer el sistema de gobierno egipcio centrado en la figura del faraón como dios-rey.",
            "example_tasks": [
              "Explica qué era un faraón y por qué los egipcios lo consideraban un dios",
              "Menciona tres faraones famosos del Antiguo Egipto y una característica de cada uno",
              "Describe la organización social de Egipto en forma de pirámide, desde el faraón hasta los esclavos"
            ]
          },
          {
            "key": "piramides",
            "name": "Las Pirámides y las Tumbas",
            "short_description": "Reconocer las pirámides como monumentos funerarios y su importancia en la cultura egipcia.",
            "example_tasks": [
              "Investiga cómo y para qué se construyeron las pirámides de Giza",
              "Explica qué creían los egipcios sobre la vida después de la muerte y cómo se relaciona con las pirámides",
              "Describe el proceso de momificación que realizaban los egipcios y por qué era importante"
            ]
          },
          {
            "key": "jeroglificos",
            "name": "Los Jeroglíficos Egipcios",
            "short_description": "Identificar el sistema de escritura jeroglífica y su función en la sociedad egipcia.",
            "example_tasks": [
              "Explica qué son los jeroglíficos y en qué se diferencian de la escritura actual",
              "Investiga qué es la Piedra Rosetta y por qué fue importante para descifrar los jeroglíficos",
              "Escribe tu nombre usando algunos símbolos inspirados en los jeroglíficos egipcios"
            ]
          },
          {
            "key": "aportes_egipto",
            "name": "Aportaciones Científicas y Culturales",
            "short_description": "Valorar las contribuciones de Egipto en matemáticas, medicina, astronomía y arte.",
            "example_tasks": [
              "Menciona tres aportaciones científicas o tecnológicas del Antiguo Egipto",
              "Investiga cómo los egipcios usaban las matemáticas para construir las pirámides y medir sus tierras",
              "Describe el arte egipcio mencionando características de sus pinturas y esculturas"
            ]
          }
        ]
      },
      {
        "key": "civilizaciones_mediterraneo",
        "name": "Civilizaciones del Mediterráneo",
        "short_description": "Conocimiento de las culturas que se desarrollaron en torno al Mar Mediterráneo.",
        "sub_topics": [
          {
            "key": "fenicios",
            "name": "Los Fenicios: Navegantes y Comerciantes",
            "short_description": "Reconocer a los fenicios como expertos marineros y su aporte del alfabeto.",
            "example_tasks": [
              "Explica por qué los fenicios fueron importantes para el comercio en el mundo antiguo",
              "Investiga qué es el alfabeto fenicio y cómo influyó en los alfabetos posteriores",
              "Localiza en un mapa las principales ciudades fenicias como Tiro, Sidón y Biblos"
            ]
          },
          {
            "key": "hebreos",
            "name": "Los Hebreos y el Monoteísmo",
            "short_description": "Comprender la importancia de los hebreos por su religión monoteísta.",
            "example_tasks": [
              "Explica qué significa monoteísmo y en qué se diferencia del politeísmo",
              "Menciona personajes importantes de la historia hebrea como Abraham, Moisés o David",
              "Investiga qué es la Torá y por qué es importante para el pueblo hebreo"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "civilizaciones_antiguas_asia",
    "name": "Civilizaciones Antiguas de Asia",
    "short_description": "Estudio de las grandes civilizaciones que florecieron en India y China, sus logros y aportaciones.",
    "sub_topics": [
      {
        "key": "antigua_china",
        "name": "La Antigua China",
        "short_description": "Conocimiento de la civilización china, sus dinastías y principales aportaciones culturales.",
        "sub_topics": [
          {
            "key": "rios_china",
            "name": "Los Ríos Amarillo y Azul",
            "short_description": "Identificar la importancia de los ríos en el desarrollo de la civilización china.",
            "example_tasks": [
              "Localiza en un mapa de China los ríos Amarillo (Huang He) y Azul (Yangtsé)",
              "Explica por qué estos ríos fueron importantes para el desarrollo de la agricultura en China",
              "Describe los beneficios y peligros que representaban las inundaciones de estos ríos"
            ]
          },
          {
            "key": "dinastias_chinas",
            "name": "Las Dinastías Imperiales",
            "short_description": "Conocer el sistema de gobierno dinástico en China y algunas dinastías importantes.",
            "example_tasks": [
              "Explica qué es una dinastía y cómo funcionaba el gobierno imperial en China",
              "Investiga sobre la dinastía Shang o la dinastía Zhou y menciona sus características principales",
              "Describe qué era el Mandato del Cielo y cómo legitimaba el poder del emperador"
            ]
          },
          {
            "key": "gran_muralla",
            "name": "La Gran Muralla China",
            "short_description": "Reconocer la Gran Muralla como una de las construcciones más impresionantes de la antigüedad.",
            "example_tasks": [
              "Investiga por qué y cuándo se construyó la Gran Muralla China",
              "Describe las dimensiones aproximadas de la Gran Muralla y cómo era su construcción",
              "Explica qué función defensiva cumplía la Gran Muralla"
            ]
          },
          {
            "key": "inventos_chinos",
            "name": "Inventos Chinos: Papel, Pólvora, Brújula e Imprenta",
            "short_description": "Valorar las importantes invenciones chinas que transformaron al mundo.",
            "example_tasks": [
              "Menciona los cuatro grandes inventos de la antigua China y explica brevemente para qué servía cada uno",
              "Investiga cómo se fabricaba el papel en la antigua China y por qué fue un invento revolucionario",
              "Explica cómo el invento de la brújula ayudó a los navegantes y exploradores"
            ]
          },
          {
            "key": "confucianismo",
            "name": "El Confucianismo",
            "short_description": "Comprender los principios básicos de las enseñanzas de Confucio.",
            "example_tasks": [
              "Investiga quién fue Confucio y cuáles eran sus principales enseñanzas",
              "Explica qué valores promueve el confucianismo como el respeto a los mayores y la armonía social",
              "Describe cómo el confucianismo influyó en la sociedad y gobierno de China"
            ]
          }
        ]
      },
      {
        "key": "antigua_india",
        "name": "La Antigua India",
        "short_description": "Las civilizaciones del valle del Indo y del Ganges, religiones y estructura social.",
        "sub_topics": [
          {
            "key": "valle_indo",
            "name": "La Civilización del Valle del Indo",
            "short_description": "Conocer las primeras ciudades planificadas como Harappa y Mohenjo-Daro.",
            "example_tasks": [
              "Localiza en un mapa el río Indo y las antiguas ciudades de Harappa y Mohenjo-Daro",
              "Describe las características de la planificación urbana de estas ciudades antiguas",
              "Investiga qué evidencias arqueológicas se han encontrado sobre la vida en el Valle del Indo"
            ]
          },
          {
            "key": "sistema_castas",
            "name": "El Sistema de Castas",
            "short_description": "Comprender la organización social de India basada en castas.",
            "example_tasks": [
              "Explica qué es el sistema de castas y enumera las principales castas de la India antigua",
              "Describe cómo el sistema de castas determinaba la vida de las personas desde su nacimiento",
              "Investiga qué son los 'intocables' o parias en el sistema de castas"
            ]
          },
          {
            "key": "hinduismo",
            "name": "El Hinduismo",
            "short_description": "Reconocer las creencias básicas de una de las religiones más antiguas del mundo.",
            "example_tasks": [
              "Menciona tres dioses importantes del hinduismo y qué representan",
              "Explica qué es el karma y la reencarnación según el hinduismo",
              "Investiga qué son los Vedas y por qué son textos sagrados del hinduismo"
            ]
          },
          {
            "key": "budismo",
            "name": "El Budismo y las Enseñanzas de Buda",
            "short_description": "Conocer la vida de Siddhartha Gautama y los principios del budismo.",
            "example_tasks": [
              "Investiga quién fue Siddhartha Gautama y cómo se convirtió en el Buda",
              "Explica las Cuatro Nobles Verdades del budismo",
              "Describe el concepto del Nirvana y el Camino Óctuple en el budismo"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "poblamiento_america",
    "name": "El Poblamiento de América",
    "short_description": "Teorías sobre la llegada de los primeros pobladores al continente americano y el desarrollo de las primeras culturas.",
    "sub_topics": [
      {
        "key": "teorias_poblamiento",
        "name": "Teorías sobre el Poblamiento",
        "short_description": "Conocimiento de las principales teorías que explican cómo llegaron los primeros humanos a América.",
        "sub_topics": [
          {
            "key": "teoria_estrecho_bering",
            "name": "Teoría del Estrecho de Bering",
            "short_description": "Comprender la teoría más aceptada sobre el cruce desde Asia por el estrecho de Bering.",
            "example_tasks": [
              "Localiza en un mapa el estrecho de Bering entre Asia y América",
              "Explica cómo y cuándo pudieron cruzar los primeros grupos humanos desde Asia hasta América según esta teoría",
              "Describe qué condiciones climáticas permitieron que se formara un puente de tierra en el estrecho de Bering"
            ]
          },
          {
            "key": "otras_teorias",
            "name": "Otras Teorías de Poblamiento",
            "short_description": "Reconocer que existen otras teorías como la oceánica o la costera.",
            "example_tasks": [
              "Investiga la teoría del poblamiento por vía marítima desde el océano Pacífico",
              "Explica por qué algunos científicos piensan que pudo haber varias rutas de migración hacia América",
              "Menciona qué tipo de evidencias (fósiles, herramientas) ayudan a los científicos a estudiar el poblamiento de América"
            ]
          }
        ]
      },
      {
        "key": "primeros_pobladores",
        "name": "Los Primeros Pobladores de América",
        "short_description": "Características de los grupos nómadas cazadores-recolectores que habitaron América.",
        "sub_topics": [
          {
            "key": "caza_megafauna",
            "name": "Caza de Megafauna",
            "short_description": "Conocer la caza de grandes animales como mamuts y bisontes por los primeros americanos.",
            "example_tasks": [
              "Investiga qué animales de la megafauna habitaban América durante la Edad del Hielo",
              "Describe las técnicas que usaban los cazadores primitivos para cazar mamuts",
              "Explica por qué desaparecieron muchos de estos grandes animales"
            ]
          },
          {
            "key": "adaptacion_ambientes",
            "name": "Adaptación a Diversos Ambientes",
            "short_description": "Comprender cómo los grupos humanos se adaptaron a diferentes regiones de América.",
            "example_tasks": [
              "Describe cómo se adaptaron los grupos humanos a vivir en ambientes diversos como desiertos, selvas y zonas frías",
              "Menciona diferencias en el modo de vida de los grupos que habitaban en la costa versus los que vivían en las montañas",
              "Investiga cómo el clima influyó en el tipo de vivienda y vestimenta de los primeros americanos"
            ]
          }
        ]
      },
      {
        "key": "agricultura_america",
        "name": "El Desarrollo de la Agricultura en América",
        "short_description": "El inicio de la domesticación de plantas y la transición al sedentarismo en Mesoamérica y los Andes.",
        "sub_topics": [
          {
            "key": "domesticacion_maiz",
            "name": "La Domesticación del Maíz",
            "short_description": "Reconocer al maíz como la planta fundamental de las culturas mesoamericanas.",
            "example_tasks": [
              "Investiga cómo y dónde se domesticó el maíz en México hace miles de años",
              "Explica por qué el maíz fue tan importante para el desarrollo de las civilizaciones mesoamericanas",
              "Describe el proceso de transformación del teocintle (planta silvestre) en el maíz cultivado"
            ]
          },
          {
            "key": "otras_plantas_americanas",
            "name": "Otras Plantas Domesticadas",
            "short_description": "Conocer otras plantas importantes domesticadas en América como frijol, calabaza, papa, cacao.",
            "example_tasks": [
              "Menciona al menos cinco plantas que fueron domesticadas originalmente en América",
              "Investiga en qué regiones de América se domesticaron la papa, el cacao y el algodón",
              "Explica cómo estas plantas domesticadas cambiaron la alimentación y forma de vida de los pueblos americanos"
            ]
          },
          {
            "key": "primeras_aldeas_america",
            "name": "Las Primeras Aldeas Agrícolas",
            "short_description": "Comprender la formación de asentamientos permanentes en Mesoamérica y Aridoamérica.",
            "example_tasks": [
              "Describe cómo era la vida en las primeras aldeas agrícolas de Mesoamérica",
              "Explica qué ventajas trajo el sedentarismo a los grupos humanos de América",
              "Investiga aproximadamente cuándo se establecieron las primeras aldeas permanentes en el territorio que hoy es México"
            ]
          }
        ]
      },
      {
        "key": "areas_culturales_mexico",
        "name": "Áreas Culturales de México Antiguo",
        "short_description": "Identificación de las tres grandes áreas culturales: Aridoamérica, Oasisamérica y Mesoamérica.",
        "sub_topics": [
          {
            "key": "aridoamerica",
            "name": "Aridoamérica",
            "short_description": "Conocer las características de esta región árida y sus habitantes nómadas.",
            "example_tasks": [
              "Localiza en un mapa la región de Aridoamérica en el norte de México",
              "Describe el clima y la vegetación de Aridoamérica y cómo influyeron en la vida de sus habitantes",
              "Explica por qué los grupos de Aridoamérica mantuvieron un modo de vida nómada o seminómada"
            ]
          },
          {
            "key": "oasisamerica",
            "name": "Oasisamérica",
            "short_description": "Reconocer las culturas sedentarias que aprovecharon oasis en zonas desérticas.",
            "example_tasks": [
              "Investiga qué culturas habitaron Oasisamérica, como los Hohokam, Mogollón y Anasazi",
              "Describe cómo usaban sistemas de irrigación para cultivar en zonas desérticas",
              "Explica qué son las casas acantilado o cliff dwellings y dónde se encuentran"
            ]
          },
          {
            "key": "mesoamerica_concepto",
            "name": "Mesoamérica: Concepto y Características",
            "short_description": "Definir Mesoamérica como área cultural con rasgos compartidos por múltiples civilizaciones.",
            "example_tasks": [
              "Delimita en un mapa el territorio que abarcaba Mesoamérica",
              "Menciona cinco características culturales comunes a todas las civilizaciones mesoamericanas",
              "Explica por qué Mesoamérica es considerada un área cultural y no solo una región geográfica"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "mesoamerica_concepto_caracteristicas",
    "name": "Mesoamérica: Concepto y Características Generales",
    "short_description": "Comprensión de Mesoamérica como superárea cultural con rasgos compartidos por todas las civilizaciones que la habitaron.",
    "sub_topics": [
      {
        "key": "definicion_mesoamerica",
        "name": "Definición de Mesoamérica",
        "short_description": "Identificar Mesoamérica como concepto geográfico-cultural propuesto por Paul Kirchhoff.",
        "sub_topics": [
          {
            "key": "limites_geograficos",
            "name": "Límites Geográficos y Temporales",
            "short_description": "Conocer la extensión territorial de Mesoamérica y su desarrollo temporal.",
            "example_tasks": [
              "Traza en un mapa los límites de Mesoamérica, desde el norte de México hasta Centroamérica",
              "Explica por qué los límites de Mesoamérica cambiaron a lo largo del tiempo",
              "Investiga qué estados actuales de México formaban parte del territorio mesoamericano"
            ]
          },
          {
            "key": "diversidad_geografica",
            "name": "Diversidad Geográfica y Climática",
            "short_description": "Reconocer la variedad de ambientes naturales dentro de Mesoamérica.",
            "example_tasks": [
              "Describe tres tipos de paisajes diferentes que existían en Mesoamérica (costa, altiplano, selva)",
              "Explica cómo la diversidad geográfica influyó en las actividades económicas de las culturas mesoamericanas",
              "Menciona qué recursos naturales había en cada región de Mesoamérica"
            ]
          }
        ]
      },
      {
        "key": "rasgos_comunes_mesoamerica",
        "name": "Rasgos Culturales Comunes",
        "short_description": "Identificar las características compartidas por todas las civilizaciones mesoamericanas.",
        "sub_topics": [
          {
            "key": "agricultura_maiz_base",
            "name": "Agricultura Basada en el Maíz",
            "short_description": "Reconocer al maíz como alimento fundamental de todas las culturas mesoamericanas.",
            "example_tasks": [
              "Explica por qué el maíz era tan importante en la dieta y cultura mesoamericanas",
              "Describe la trilogía alimenticia mesoamericana: maíz, frijol y calabaza",
              "Investiga técnicas agrícolas usadas en Mesoamérica como las chinampas y el cultivo en terrazas"
            ]
          },
          {
            "key": "calendario_escritura",
            "name": "Uso de Calendarios y Escritura",
            "short_description": "Comprender que las culturas mesoamericanas desarrollaron sistemas calendáricos y de escritura.",
            "example_tasks": [
              "Explica qué eran los calendarios solar y ritual en Mesoamérica",
              "Investiga qué culturas mesoamericanas desarrollaron sistemas de escritura",
              "Describe cómo se relacionaban los calendarios con la religión y la agricultura"
            ]
          },
          {
            "key": "religion_politeista",
            "name": "Religión Politeísta",
            "short_description": "Reconocer las creencias religiosas compartidas y la importancia de los rituales.",
            "example_tasks": [
              "Explica qué significa politeísmo y menciona dioses venerados en varias culturas mesoamericanas",
              "Describe la importancia de los sacrificios en las religiones mesoamericanas",
              "Investiga qué creían los mesoamericanos sobre la creación del mundo y del ser humano"
            ]
          },
          {
            "key": "juego_pelota",
            "name": "El Juego de Pelota",
            "short_description": "Conocer el juego de pelota como práctica ritual compartida en Mesoamérica.",
            "example_tasks": [
              "Describe cómo se jugaba el juego de pelota mesoamericano y qué significado tenía",
              "Explica qué representaba el juego de pelota en la cosmovisión mesoamericana",
              "Investiga en qué culturas mesoamericanas se practicaba el juego de pelota y cómo eran las canchas"
            ]
          },
          {
            "key": "comercio_mercados",
            "name": "Comercio y Mercados",
            "short_description": "Comprender la importancia del intercambio comercial entre las regiones de Mesoamérica.",
            "example_tasks": [
              "Menciona productos que se intercambiaban entre diferentes regiones de Mesoamérica",
              "Explica cómo funcionaban los mercados o tianguis en las ciudades mesoamericanas",
              "Investiga qué se usaba como moneda de intercambio en Mesoamérica (cacao, mantas)"
            ]
          }
        ]
      },
      {
        "key": "periodos_mesoamerica",
        "name": "Periodización de Mesoamérica",
        "short_description": "Conocer la división de la historia mesoamericana en tres periodos: Preclásico, Clásico y Posclásico.",
        "sub_topics": [
          {
            "key": "preclasico",
            "name": "Periodo Preclásico (2500 a.C. - 200 d.C.)",
            "short_description": "Identificar las primeras aldeas, el surgimiento de centros ceremoniales y la cultura olmeca.",
            "example_tasks": [
              "Describe las principales características del periodo Preclásico en Mesoamérica",
              "Explica cómo evolucionaron las aldeas agrícolas hasta convertirse en centros ceremoniales",
              "Menciona qué cultura dominó durante gran parte del Preclásico"
            ]
          },
          {
            "key": "clasico",
            "name": "Periodo Clásico (200 d.C. - 900 d.C.)",
            "short_description": "Reconocer el florecimiento de grandes ciudades como Teotihuacán y las ciudades mayas.",
            "example_tasks": [
              "Enumera las principales culturas que florecieron durante el periodo Clásico",
              "Explica por qué este periodo se llama Clásico y qué lo caracteriza",
              "Investiga qué acontecimientos marcaron el final del periodo Clásico"
            ]
          },
          {
            "key": "posclasico",
            "name": "Periodo Posclásico (900 d.C. - 1521 d.C.)",
            "short_description": "Comprender el surgimiento de estados militaristas y el predominio mexica.",
            "example_tasks": [
              "Describe las características del periodo Posclásico en Mesoamérica",
              "Menciona las principales culturas del Posclásico como toltecas, mixtecas y mexicas",
              "Explica qué cambios políticos y militares caracterizaron al Posclásico respecto al Clásico"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "los_olmecas",
    "name": "Los Olmecas: La Cultura Madre",
    "short_description": "Estudio de la civilización olmeca como la primera gran cultura de Mesoamérica y sus aportaciones fundamentales.",
    "sub_topics": [
      {
        "key": "ubicacion_olmeca",
        "name": "Ubicación Temporal y Geográfica",
        "short_description": "Identificar el área del Golfo de México donde se desarrolló la cultura olmeca.",
        "sub_topics": [
          {
            "key": "region_olmeca",
            "name": "La Región Olmeca",
            "short_description": "Localizar los principales centros olmecas en Veracruz y Tabasco.",
            "example_tasks": [
              "Localiza en un mapa los principales sitios olmecas: San Lorenzo, La Venta y Tres Zapotes",
              "Describe las características geográficas de la región olmeca (selva, ríos, clima)",
              "Explica aproximadamente en qué periodo (siglos) se desarrolló la cultura olmeca"
            ]
          }
        ]
      },
      {
        "key": "caracteristicas_olmecas",
        "name": "Características de la Cultura Olmeca",
        "short_description": "Conocer las principales manifestaciones culturales y sociales de los olmecas.",
        "sub_topics": [
          {
            "key": "cabezas_colosales",
            "name": "Las Cabezas Colosales",
            "short_description": "Reconocer las cabezas colosales como la manifestación artística más emblemática olmeca.",
            "example_tasks": [
              "Describe las características de las cabezas colosales olmecas (tamaño, material, rasgos)",
              "Investiga qué podrían representar las cabezas colosales según los arqueólogos",
              "Explica cómo trasladaban los olmecas las enormes piedras de basalto para hacer las esculturas"
            ]
          },
          {
            "key": "religion_olmeca",
            "name": "Religión y Deidades",
            "short_description": "Comprender las creencias religiosas olmecas y sus principales dioses.",
            "example_tasks": [
              "Investiga qué representaba el jaguar en la religión olmeca y por qué era importante",
              "Describe las características del dios olmeca del jaguar o hombre-jaguar",
              "Explica qué papel jugaban los gobernantes olmecas en la religión"
            ]
          },
          {
            "key": "escritura_calendario_olmeca",
            "name": "Escritura y Calendario",
            "short_description": "Reconocer a los olmecas como posibles creadores de los primeros sistemas de escritura y calendario.",
            "example_tasks": [
              "Investiga si los olmecas desarrollaron un sistema de escritura y qué evidencias existen",
              "Explica la importancia de que los olmecas hayan usado calendarios",
              "Menciona cómo influyeron los olmecas en el desarrollo de la escritura y calendario de otras culturas"
            ]
          },
          {
            "key": "comercio_influencia_olmeca",
            "name": "Comercio e Influencia Cultural",
            "short_description": "Comprender cómo los olmecas influyeron en otras regiones de Mesoamérica.",
            "example_tasks": [
              "Explica por qué los olmecas son llamados la 'cultura madre' de Mesoamérica",
              "Investiga qué productos comerciaban los olmecas con otras regiones",
              "Menciona evidencias de influencia olmeca en otras culturas mesoamericanas"
            ]
          }
        ]
      },
      {
        "key": "organizacion_social_olmeca",
        "name": "Organización Social y Política",
        "short_description": "Conocer la estructura social jerarquizada de los olmecas.",
        "sub_topics": [
          {
            "key": "gobierno_olmeca",
            "name": "Sistema de Gobierno Teocrático",
            "short_description": "Comprender el poder de los gobernantes-sacerdotes olmecas.",
            "example_tasks": [
              "Explica qué es un gobierno teocrático y cómo funcionaba entre los olmecas",
              "Describe la organización social olmeca desde los gobernantes hasta los campesinos",
              "Investiga qué evidencias arquitectónicas muestran el poder de la élite olmeca"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "los_mayas",
    "name": "Los Mayas: Una Civilización Extraordinaria",
    "short_description": "Estudio profundo de la civilización maya, sus ciudades-estado, conocimientos científicos y legado cultural.",
    "sub_topics": [
      {
        "key": "ubicacion_maya",
        "name": "Ubicación y Desarrollo Temporal",
        "short_description": "Identificar el extenso territorio maya y sus diferentes periodos de desarrollo.",
        "sub_topics": [
          {
            "key": "area_maya",
            "name": "El Área Maya",
            "short_description": "Localizar el territorio maya en México, Guatemala, Belice, Honduras y El Salvador.",
            "example_tasks": [
              "Delimita en un mapa el territorio que ocupó la civilización maya en Mesoamérica",
              "Menciona los estados actuales de México donde existieron ciudades mayas",
              "Describe las diferencias geográficas entre el área maya del norte, central y sur"
            ]
          },
          {
            "key": "periodos_mayas",
            "name": "Periodos de la Civilización Maya",
            "short_description": "Conocer las etapas Preclásica, Clásica y Posclásica de la cultura maya.",
            "example_tasks": [
              "Elabora una línea del tiempo con los tres periodos principales de la civilización maya",
              "Explica qué caracterizó al periodo Clásico maya y por qué se considera su época de esplendor",
              "Investiga qué sucedió durante el colapso maya alrededor del año 900 d.C."
            ]
          }
        ]
      },
      {
        "key": "ciudades_mayas",
        "name": "Las Ciudades-Estado Mayas",
        "short_description": "Comprender la organización política descentralizada en múltiples ciudades-estado.",
        "sub_topics": [
          {
            "key": "principales_ciudades",
            "name": "Principales Ciudades Mayas",
            "short_description": "Conocer las grandes urbes mayas como Tikal, Palenque, Chichén Itzá y Uxmal.",
            "example_tasks": [
              "Localiza en un mapa al menos cinco ciudades mayas importantes como Tikal, Palenque, Copán, Chichén Itzá y Uxmal",
              "Describe las características arquitectónicas de las ciudades mayas (pirámides, palacios, observatorios)",
              "Investiga cuál era la ciudad maya más grande durante el periodo Clásico"
            ]
          },
          {
            "key": "arquitectura_maya",
            "name": "Arquitectura y Urbanismo",
            "short_description": "Reconocer los logros arquitectónicos mayas y la planificación de sus ciudades.",
            "example_tasks": [
              "Describe las características de las pirámides mayas y en qué se diferencian de las egipcias",
              "Explica qué función tenían los diferentes edificios en una ciudad maya (templos, palacios, juego de pelota)",
              "Investiga qué es el Castillo de Kukulcán en Chichén Itzá y su relación con el calendario"
            ]
          },
          {
            "key": "gobierno_ciudades_estado",
            "name": "Gobierno de las Ciudades-Estado",
            "short_description": "Comprender que cada ciudad maya era independiente con su propio gobernante.",
            "example_tasks": [
              "Explica qué es una ciudad-estado y por qué los mayas no formaron un imperio unificado",
              "Describe el papel del halach uinic (gobernante supremo) en las ciudades mayas",
              "Investiga cómo era la rivalidad y las alianzas entre diferentes ciudades mayas"
            ]
          }
        ]
      },
      {
        "key": "conocimientos_mayas",
        "name": "Conocimientos Científicos Mayas",
        "short_description": "Valorar los avances mayas en matemáticas, astronomía y calendario.",
        "sub_topics": [
          {
            "key": "matematicas_mayas",
            "name": "Matemáticas y el Concepto del Cero",
            "short_description": "Reconocer que los mayas desarrollaron un sistema numérico vigesimal con el cero.",
            "example_tasks": [
              "Explica cómo funcionaba el sistema numérico maya con puntos, rayas y el símbolo del cero",
              "Investiga por qué el descubrimiento del cero fue tan importante para las matemáticas",
              "Practica escribiendo números en el sistema maya (por ejemplo, escribe el número 25 en numeración maya)"
            ]
          },
          {
            "key": "astronomia_maya",
            "name": "Astronomía Maya",
            "short_description": "Comprender los conocimientos astronómicos y observatorios mayas.",
            "example_tasks": [
              "Describe cómo los mayas observaban el movimiento de los astros y para qué usaban este conocimiento",
              "Investiga qué es El Caracol de Chichén Itzá y su función como observatorio astronómico",
              "Explica cómo los mayas podían predecir eclipses con precisión"
            ]
          },
          {
            "key": "calendarios_mayas",
            "name": "Los Calendarios Mayas",
            "short_description": "Conocer los calendarios Haab (solar) y Tzolkin (ritual) y la Cuenta Larga.",
            "example_tasks": [
              "Explica las diferencias entre el calendario Haab de 365 días y el Tzolkin de 260 días",
              "Describe para qué usaban los mayas cada uno de sus calendarios",
              "Investiga qué es la Cuenta Larga maya y cómo medía periodos históricos extensos"
            ]
          }
        ]
      },
      {
        "key": "escritura_codices_mayas",
        "name": "Escritura y Códices Mayas",
        "short_description": "Valorar la escritura jeroglífica maya y los códices que preservaron su conocimiento.",
        "sub_topics": [
          {
            "key": "jeroglificos_mayas",
            "name": "La Escritura Jeroglífica",
            "short_description": "Reconocer el complejo sistema de escritura maya que combinaba logogramas y fonogramas.",
            "example_tasks": [
              "Describe cómo era la escritura maya y en qué soportes se escribía (estelas, muros, códices)",
              "Explica qué tipo de información registraban los mayas en su escritura",
              "Investiga cómo se logró descifrar la escritura maya en el siglo XX"
            ]
          },
          {
            "key": "codices_supervivientes",
            "name": "Los Códices Mayas",
            "short_description": "Conocer los pocos códices que sobrevivieron a la conquista.",
            "example_tasks": [
              "Menciona los nombres de los tres o cuatro códices mayas que se conservan actualmente",
              "Investiga por qué sobrevivieron tan pocos códices mayas y qué pasó con los demás",
              "Describe qué tipo de información contenían los códices (astronomía, rituales, profecías)"
            ]
          }
        ]
      },
      {
        "key": "sociedad_religion_maya",
        "name": "Sociedad y Religión Maya",
        "short_description": "Comprender la organización social jerarquizada y las creencias religiosas mayas.",
        "sub_topics": [
          {
            "key": "organizacion_social_maya",
            "name": "Estructura Social Maya",
            "short_description": "Identificar las diferentes clases sociales en la sociedad maya.",
            "example_tasks": [
              "Elabora un esquema piramidal de la sociedad maya desde los nobles hasta los esclavos",
              "Explica qué papel desempeñaban los sacerdotes en la sociedad maya",
              "Describe las actividades de los campesinos mayas que formaban la mayoría de la población"
            ]
          },
          {
            "key": "religion_cosmoision_maya",
            "name": "Religión y Cosmovisión",
            "short_description": "Comprender las creencias religiosas mayas sobre la creación y el universo.",
            "example_tasks": [
              "Investiga qué es el Popol Vuh y qué narra sobre la creación según los mayas",
              "Explica cómo concebían los mayas el universo dividido en tres niveles (cielo, tierra, inframundo)",
              "Menciona algunos dioses importantes de la religión maya como Kukulcán, Chaac o Itzamná"
            ]
          },
          {
            "key": "rituales_sacrificios",
            "name": "Rituales y Sacrificios",
            "short_description": "Conocer las prácticas rituales mayas incluyendo sacrificios.",
            "example_tasks": [
              "Describe algunos rituales mayas relacionados con la agricultura y la lluvia",
              "Explica qué tipos de sacrificios realizaban los mayas y por qué eran importantes en su religión",
              "Investiga qué era el cenote sagrado de Chichén Itzá y su uso ritual"
            ]
          }
        ]
      },
      {
        "key": "economia_vida_cotidiana_maya",
        "name": "Economía y Vida Cotidiana",
        "short_description": "Conocer las actividades económicas y la vida diaria del pueblo maya.",
        "sub_topics": [
          {
            "key": "agricultura_maya",
            "name": "Agricultura y Alimentación",
            "short_description": "Comprender las técnicas agrícolas mayas y su dieta basada en el maíz.",
            "example_tasks": [
              "Describe la técnica agrícola de milpa o roza-tumba-quema usada por los mayas",
              "Menciona los principales cultivos de los mayas además del maíz",
              "Explica cómo los mayas adaptaron la agricultura a diferentes ambientes (selva, tierras altas)"
            ]
          },
          {
            "key": "comercio_artesanias",
            "name": "Comercio y Artesanías",
            "short_description": "Reconocer la importancia del comercio y las habilidades artesanales mayas.",
            "example_tasks": [
              "Investiga qué productos comerciaban los mayas entre diferentes regiones",
              "Describe las artesanías mayas como cerámica, tejidos y trabajo en jade",
              "Explica qué se usaba como moneda de intercambio en el comercio maya"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "teotihuacan_culturas_centro",
    "name": "Teotihuacán y las Culturas del Centro de México",
    "short_description": "Estudio de Teotihuacán como la gran metrópoli del Clásico y otras culturas contemporáneas del Altiplano Central.",
    "sub_topics": [
      {
        "key": "teotihuacan_ciudad",
        "name": "Teotihuacán: La Ciudad de los Dioses",
        "short_description": "Conocimiento de Teotihuacán como la ciudad más grande e influyente del periodo Clásico.",
        "sub_topics": [
          {
            "key": "ubicacion_teotihuacan",
            "name": "Ubicación y Desarrollo",
            "short_description": "Localizar Teotihuacán en el Valle de México y conocer su desarrollo temporal.",
            "example_tasks": [
              "Ubica Teotihuacán en un mapa del Valle de México y menciona en qué estado actual se encuentra",
              "Investiga aproximadamente cuándo se fundó Teotihuacán y cuándo alcanzó su máximo esplendor",
              "Explica qué significa el nombre 'Teotihuacán' en náhuatl"
            ]
          },
          {
            "key": "planificacion_urbana",
            "name": "Planificación Urbana",
            "short_description": "Reconocer la organización urbana de Teotihuacán con la Calzada de los Muertos como eje.",
            "example_tasks": [
              "Describe cómo estaba organizada la ciudad de Teotihuacán con sus calles y edificios",
              "Explica qué es la Calzada de los Muertos y qué edificios importantes se encuentran a lo largo de ella",
              "Investiga cuántos habitantes se estima que vivían en Teotihuacán en su época de esplendor"
            ]
          },
          {
            "key": "piramides_teotihuacan",
            "name": "Las Grandes Pirámides",
            "short_description": "Conocer las pirámides del Sol, la Luna y el Templo de Quetzalcóatl.",
            "example_tasks": [
              "Compara el tamaño de la Pirámide del Sol con otras estructuras antiguas del mundo",
              "Describe las características del Templo de Quetzalcóatl (Serpiente Emplumada) y su decoración",
              "Investiga qué función tenían las grandes pirámides de Teotihuacán"
            ]
          },
          {
            "key": "influencia_teotihuacan",
            "name": "Influencia Cultural y Comercial",
            "short_description": "Comprender cómo Teotihuacán influyó en otras regiones de Mesoamérica.",
            "example_tasks": [
              "Explica cómo Teotihuacán mantuvo relaciones comerciales con regiones lejanas como el área maya",
              "Investiga qué productos fabricaban en Teotihuacán que se comerciaban por toda Mesoamérica",
              "Menciona evidencias de influencia teotihuacana en otras ciudades mesoamericanas"
            ]
          },
          {
            "key": "decadencia_teotihuacan",
            "name": "Decadencia y Abandono",
            "short_description": "Conocer las teorías sobre el colapso de Teotihuacán.",
            "example_tasks": [
              "Investiga aproximadamente cuándo y cómo fue abandonada la ciudad de Teotihuacán",
              "Menciona algunas teorías que explican por qué Teotihuacán fue abandonada",
              "Explica qué encontraron los mexicas siglos después cuando llegaron a las ruinas de Teotihuacán"
            ]
          }
        ]
      },
      {
        "key": "cultura_zapoteca",
        "name": "Los Zapotecas de Monte Albán",
        "short_description": "Estudio de la civilización zapoteca en Oaxaca y su centro ceremonial Monte Albán.",
        "sub_topics": [
          {
            "key": "monte_alban",
            "name": "Monte Albán",
            "short_description": "Conocer Monte Albán como el principal centro zapoteca.",
            "example_tasks": [
              "Localiza Monte Albán en un mapa de Oaxaca y describe su ubicación en la cima de un cerro",
              "Investiga cuándo fue fundada Monte Albán y cuánto tiempo fue habitada",
              "Describe las principales estructuras de Monte Albán como la Gran Plaza y los juegos de pelota"
            ]
          },
          {
            "key": "escritura_zapoteca",
            "name": "Escritura y Calendario Zapoteca",
            "short_description": "Reconocer que los zapotecas desarrollaron uno de los primeros sistemas de escritura en Mesoamérica.",
            "example_tasks": [
              "Investiga qué son los danzantes de Monte Albán y qué representan",
              "Explica la importancia de la escritura zapoteca para la historia de Mesoamérica",
              "Describe el calendario zapoteca y su relación con otros calendarios mesoamericanos"
            ]
          },
          {
            "key": "sociedad_zapoteca",
            "name": "Organización Social y Economía",
            "short_description": "Comprender la estructura social y actividades económicas zapotecas.",
            "example_tasks": [
              "Describe la organización social de los zapotecas desde los gobernantes hasta los campesinos",
              "Menciona las principales actividades económicas de los zapotecas",
              "Investiga qué productos artesanales elaboraban los zapotecas"
            ]
          }
        ]
      },
      {
        "key": "otras_culturas_clasico",
        "name": "Otras Culturas del Periodo Clásico",
        "short_description": "Conocimiento de culturas contemporáneas como totonacas y huastecos.",
        "sub_topics": [
          {
            "key": "totonacas_tajin",
            "name": "Los Totonacas y El Tajín",
            "short_description": "Conocer la cultura totonaca y su centro ceremonial El Tajín en Veracruz.",
            "example_tasks": [
              "Localiza la región totonaca en el estado de Veracruz",
              "Describe las características de la Pirámide de los Nichos en El Tajín",
              "Investiga qué es la danza de los voladores y su origen totonaco"
            ]
          },
          {
            "key": "cultura_huasteca",
            "name": "La Cultura Huasteca",
            "short_description": "Identificar a los huastecos y su ubicación en la costa del Golfo.",
            "example_tasks": [
              "Ubica en un mapa la región huasteca que abarca partes de Veracruz, San Luis Potosí y Tamaulipas",
              "Investiga qué idioma hablaban los huastecos y su relación con los mayas",
              "Describe las esculturas huastecas características como el Adolescente Huasteco"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "mexicas_aztecas",
    "name": "Los Mexicas (Aztecas): El Imperio del Posclásico",
    "short_description": "Estudio profundo del imperio mexica, su fundación, expansión, organización social, religión y legado cultural.",
    "sub_topics": [
      {
        "key": "origen_peregrinacion_mexica",
        "name": "Origen y Peregrinación",
        "short_description": "Conocer el mito de origen de los mexicas y su peregrinación desde Aztlán.",
        "sub_topics": [
          {
            "key": "aztlan_origen",
            "name": "El Mito de Aztlán",
            "short_description": "Comprender el relato mítico del lugar de origen de los mexicas.",
            "example_tasks": [
              "Investiga qué era Aztlán según la tradición mexica y por qué se les llama también aztecas",
              "Describe cómo era representado Aztlán en los códices mexicas",
              "Explica qué dios guió a los mexicas durante su peregrinación según el mito"
            ]
          },
          {
            "key": "peregrinacion_valle_mexico",
            "name": "La Peregrinación al Valle de México",
            "short_description": "Conocer el largo viaje de los mexicas hasta llegar al Valle de México.",
            "example_tasks": [
              "Describe el viaje que realizaron los mexicas guiados por su dios Huitzilopochtli",
              "Investiga aproximadamente cuánto tiempo duró la peregrinación mexica",
              "Explica qué señal buscaban los mexicas para fundar su ciudad según la profecía"
            ]
          },
          {
            "key": "fundacion_tenochtitlan",
            "name": "La Fundación de Tenochtitlan (1325)",
            "short_description": "Comprender cómo y dónde fundaron los mexicas su capital.",
            "example_tasks": [
              "Explica la leyenda de la fundación de Tenochtitlan con el águila devorando una serpiente sobre un nopal",
              "Investiga en qué año se fundó Tenochtitlan y dónde estaba ubicada exactamente",
              "Describe por qué los mexicas eligieron un islote en el lago de Texcoco para fundar su ciudad"
            ]
          }
        ]
      },
      {
        "key": "tenochtitlan_ciudad",
        "name": "Tenochtitlan: La Gran Ciudad",
        "short_description": "Conocer las características de Tenochtitlan como una de las ciudades más grandes del mundo en su época.",
        "sub_topics": [
          {
            "key": "organizacion_urbana_tenochtitlan",
            "name": "Organización y Arquitectura Urbana",
            "short_description": "Comprender cómo estaba organizada la ciudad de Tenochtitlan.",
            "example_tasks": [
              "Describe cómo estaba organizada Tenochtitlan con sus calzadas, canales y barrios (calpullis)",
              "Investiga cuántos habitantes tenía Tenochtitlan en su época de esplendor",
              "Explica qué eran las chinampas y cómo se usaban para cultivar en el lago"
            ]
          },
          {
            "key": "templo_mayor",
            "name": "El Templo Mayor",
            "short_description": "Conocer el principal centro ceremonial mexica dedicado a Huitzilopochtli y Tláloc.",
            "example_tasks": [
              "Describe el Templo Mayor y explica a qué dioses estaba dedicado",
              "Investiga dónde se encuentra actualmente el sitio arqueológico del Templo Mayor",
              "Explica qué tipo de ceremonias se realizaban en el Templo Mayor"
            ]
          },
          {
            "key": "tlatelolco_mercado",
            "name": "Tlatelolco y el Gran Mercado",
            "short_description": "Reconocer la importancia de Tlatelolco como centro comercial.",
            "example_tasks": [
              "Describe cómo era el tianguis (mercado) de Tlatelolco según las crónicas españolas",
              "Investiga qué productos se vendían en el mercado de Tlatelolco",
              "Explica la importancia del comercio para la economía mexica"
            ]
          }
        ]
      },
      {
        "key": "expansion_imperio_mexica",
        "name": "La Expansión del Imperio Mexica",
        "short_description": "Comprender cómo los mexicas conquistaron un vasto territorio en Mesoamérica.",
        "sub_topics": [
          {
            "key": "triple_alianza",
            "name": "La Triple Alianza",
            "short_description": "Conocer la alianza entre Tenochtitlan, Texcoco y Tlacopan.",
            "example_tasks": [
              "Explica qué fue la Triple Alianza y qué ciudades la formaban",
              "Investiga cómo se repartían los tributos conquistados entre las tres ciudades",
              "Describe el papel de cada ciudad en la Triple Alianza"
            ]
          },
          {
            "key": "conquistas_tributos",
            "name": "Conquistas y Sistema de Tributos",
            "short_description": "Comprender el sistema de dominación basado en tributos.",
            "example_tasks": [
              "Describe cómo los mexicas conquistaban y dominaban otros pueblos",
              "Investiga qué tipo de tributos pagaban los pueblos conquistados a Tenochtitlan",
              "Explica qué era la Matrícula de Tributos y qué información contiene"
            ]
          },
          {
            "key": "guerreros_mexicas",
            "name": "Los Guerreros Mexicas",
            "short_description": "Conocer la organización militar y las órdenes de guerreros águila y jaguar.",
            "example_tasks": [
              "Describe las características de los guerreros águila y los guerreros jaguar",
              "Investiga qué era la guerra florida o xochiyáoyotl y cuál era su propósito",
              "Explica la importancia social de ser un guerrero distinguido en la sociedad mexica"
            ]
          }
        ]
      },
      {
        "key": "sociedad_mexica",
        "name": "Organización Social Mexica",
        "short_description": "Comprender la estructura jerárquica de la sociedad mexica.",
        "sub_topics": [
          {
            "key": "tlatoani",
            "name": "El Tlatoani: Gobernante Supremo",
            "short_description": "Conocer el papel del tlatoani como máxima autoridad política y religiosa.",
            "example_tasks": [
              "Explica qué era el tlatoani y cuáles eran sus funciones en el gobierno mexica",
              "Menciona tres tlatoanis importantes como Moctezuma I, Ahuízotl o Moctezuma II",
              "Investiga cómo se elegía al nuevo tlatoani cuando moría el anterior"
            ]
          },
          {
            "key": "clases_sociales_mexicas",
            "name": "Las Clases Sociales",
            "short_description": "Identificar las diferentes clases sociales en la sociedad mexica.",
            "example_tasks": [
              "Elabora una pirámide social mexica mostrando desde los pipiltin (nobles) hasta los tlacotin (esclavos)",
              "Explica qué eran los calpullis y cómo funcionaban en la organización social",
              "Describe las actividades y forma de vida de los macehuales (gente común)"
            ]
          },
          {
            "key": "educacion_mexica",
            "name": "Educación: Calmécac y Telpochcalli",
            "short_description": "Comprender el sistema educativo mexica diferenciado por clase social.",
            "example_tasks": [
              "Explica qué era el calmécac y quiénes estudiaban ahí",
              "Describe qué se enseñaba en el telpochcalli y quiénes asistían",
              "Compara la educación que recibían los nobles con la de los macehuales"
            ]
          }
        ]
      },
      {
        "key": "religion_mexica",
        "name": "Religión y Cosmovisión Mexica",
        "short_description": "Conocer las creencias religiosas, dioses principales y prácticas rituales mexicas.",
        "sub_topics": [
          {
            "key": "principales_dioses_mexicas",
            "name": "Los Principales Dioses",
            "short_description": "Identificar las deidades más importantes del panteón mexica.",
            "example_tasks": [
              "Describe a Huitzilopochtli, dios de la guerra y patrono de los mexicas",
              "Explica quiénes eran Quetzalcóatl, Tláloc, Tezcatlipoca y Coatlicue, y qué representaban",
              "Investiga la historia del mito de los Cinco Soles en la cosmogonía mexica"
            ]
          },
          {
            "key": "sacrificios_humanos",
            "name": "Los Sacrificios Humanos",
            "short_description": "Comprender el significado religioso de los sacrificios en la cosmovisión mexica.",
            "example_tasks": [
              "Explica por qué los mexicas realizaban sacrificios humanos según sus creencias religiosas",
              "Investiga cómo creían los mexicas que mantenían el movimiento del sol con los sacrificios",
              "Describe brevemente cómo se realizaba un sacrificio en el Templo Mayor"
            ]
          },
          {
            "key": "calendario_fiestas",
            "name": "Calendario y Fiestas Religiosas",
            "short_description": "Conocer el calendario ritual mexica y las principales festividades.",
            "example_tasks": [
              "Explica cómo funcionaba el calendario ritual mexica de 260 días (tonalpohualli)",
              "Describe el calendario solar de 365 días (xiuhpohualli) y su relación con la agricultura",
              "Investiga qué era la ceremonia del Fuego Nuevo que se celebraba cada 52 años"
            ]
          }
        ]
      },
      {
        "key": "economia_mexica",
        "name": "Economía Mexica",
        "short_description": "Comprender las actividades económicas y el sistema de comercio mexica.",
        "sub_topics": [
          {
            "key": "agricultura_chinampas",
            "name": "Agricultura en Chinampas",
            "short_description": "Reconocer las chinampas como innovación agrícola mexica.",
            "example_tasks": [
              "Explica qué eran las chinampas y cómo se construían en el lago de Texcoco",
              "Investiga qué cultivos se producían en las chinampas",
              "Describe las ventajas de las chinampas para la producción agrícola"
            ]
          },
          {
            "key": "comercio_pochtecas",
            "name": "Los Pochtecas: Comerciantes",
            "short_description": "Conocer el papel de los comerciantes especializados en el imperio mexica.",
            "example_tasks": [
              "Describe quiénes eran los pochtecas y qué función cumplían en la sociedad mexica",
              "Investiga qué productos comerciaban los pochtecas con regiones lejanas",
              "Explica cómo los pochtecas también servían como espías para el tlatoani"
            ]
          },
          {
            "key": "artesanias_oficios",
            "name": "Artesanías y Oficios Especializados",
            "short_description": "Reconocer la variedad de oficios especializados en Tenochtitlan.",
            "example_tasks": [
              "Menciona al menos cinco oficios especializados que existían en Tenochtitlan",
              "Describe las técnicas de orfebrería y trabajo de metales preciosos de los mexicas",
              "Investiga cómo trabajaban los artesanos mexicas el jade, las plumas y las piedras preciosas"
            ]
          }
        ]
      },
      {
        "key": "conocimientos_mexicas",
        "name": "Conocimientos y Cultura Mexica",
        "short_description": "Valorar los conocimientos científicos, artísticos y culturales de los mexicas.",
        "sub_topics": [
          {
            "key": "codices_escritura",
            "name": "Códices y Escritura Pictográfica",
            "short_description": "Conocer el sistema de escritura y los códices mexicas.",
            "example_tasks": [
              "Explica cómo era la escritura pictográfica mexica y en qué se diferencia de un alfabeto",
              "Investiga qué información se registraba en los códices mexicas",
              "Menciona algunos códices mexicas importantes como el Códice Borbónico o el Códice Mendoza"
            ]
          },
          {
            "key": "medicina_herbolaria",
            "name": "Medicina y Herbolaria",
            "short_description": "Reconocer los conocimientos médicos y uso de plantas medicinales.",
            "example_tasks": [
              "Investiga qué plantas medicinales usaban los médicos mexicas para curar enfermedades",
              "Describe cómo los mexicas clasificaban y conocían las propiedades de cientos de plantas",
              "Explica qué era un tícitl y qué funciones desempeñaba en la sociedad mexica"
            ]
          },
          {
            "key": "arte_escultura",
            "name": "Arte y Escultura",
            "short_description": "Valorar las manifestaciones artísticas mexicas.",
            "example_tasks": [
              "Describe las características de la escultura mexica usando como ejemplo la Piedra del Sol",
              "Investiga qué representa la Coatlicue, una de las esculturas mexicas más famosas",
              "Explica el significado simbólico de los elementos representados en el arte mexica"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "conquista_mexico",
    "name": "La Conquista de México",
    "short_description": "Estudio del proceso de conquista española del imperio mexica, sus causas, desarrollo y consecuencias para los pueblos indígenas.",
    "sub_topics": [
      {
        "key": "antecedentes_conquista",
        "name": "Antecedentes de la Conquista",
        "short_description": "Comprensión del contexto europeo y las primeras expediciones españolas a América.",
        "sub_topics": [
          {
            "key": "expansion_europea",
            "name": "La Expansión Europea",
            "short_description": "Conocer las causas que motivaron la exploración europea del siglo XV-XVI.",
            "example_tasks": [
              "Explica qué factores impulsaron a los europeos a buscar nuevas rutas comerciales hacia Asia",
              "Investiga qué papel jugaron los avances tecnológicos como la brújula y la carabela en las exploraciones",
              "Describe la situación de España después de la Reconquista en 1492"
            ]
          },
          {
            "key": "llegada_espanoles_caribe",
            "name": "La Llegada de los Españoles al Caribe",
            "short_description": "Conocer los viajes de Colón y la presencia española en las Antillas.",
            "example_tasks": [
              "Investiga cuándo llegó Cristóbal Colón a América y a qué islas arribó primero",
              "Explica por qué los españoles establecieron sus primeras colonias en las islas del Caribe",
              "Describe cómo fueron las primeras interacciones entre españoles y pueblos indígenas del Caribe"
            ]
          },
          {
            "key": "expediciones_previas_mexico",
            "name": "Expediciones Previas a México",
            "short_description": "Conocer las expediciones de Hernández de Córdoba y Juan de Grijalva.",
            "example_tasks": [
              "Investiga quiénes fueron Francisco Hernández de Córdoba y Juan de Grijalva y qué exploraron",
              "Explica qué información trajeron estas expediciones sobre las tierras y pueblos de México",
              "Describe por qué estas expediciones motivaron una tercera expedición más ambiciosa"
            ]
          }
        ]
      },
      {
        "key": "expedicion_cortes",
        "name": "La Expedición de Hernán Cortés",
        "short_description": "Estudio del viaje de Cortés desde Cuba hasta Tenochtitlan.",
        "sub_topics": [
          {
            "key": "salida_cuba",
            "name": "La Salida desde Cuba (1519)",
            "short_description": "Conocer el inicio de la expedición de Cortés y su desembarco en las costas mexicanas.",
            "example_tasks": [
              "Investiga quién era Hernán Cortés y por qué fue elegido para dirigir la expedición a México",
              "Explica por qué el gobernador de Cuba, Diego Velázquez, intentó detener la expedición de Cortés",
              "Describe cuántos hombres y barcos componían la expedición de Cortés cuando salió de Cuba"
            ]
          },
          {
            "key": "fundacion_veracruz",
            "name": "La Fundación de Veracruz",
            "short_description": "Comprender la importancia estratégica de fundar el primer ayuntamiento español.",
            "example_tasks": [
              "Explica por qué Cortés fundó la Villa Rica de la Vera Cruz al llegar a las costas mexicanas",
              "Investiga qué significó para Cortés fundar un ayuntamiento en términos legales y políticos",
              "Describe el famoso episodio del hundimiento de las naves y por qué Cortés lo hizo"
            ]
          },
          {
            "key": "malinche",
            "name": "La Malinche: Intérprete y Intermediaria",
            "short_description": "Conocer el papel de Malintzin como traductora e intermediaria cultural.",
            "example_tasks": [
              "Investiga quién fue Malintzin (La Malinche) y cómo llegó a ser intérprete de Cortés",
              "Explica la importancia de La Malinche como traductora entre náhuatl, maya y español",
              "Describe diferentes perspectivas históricas sobre el papel de La Malinche en la conquista"
            ]
          },
          {
            "key": "alianzas_indigenas",
            "name": "Alianzas con Pueblos Indígenas",
            "short_description": "Comprender cómo Cortés formó alianzas con pueblos enemigos de los mexicas.",
            "example_tasks": [
              "Explica por qué pueblos como los totonacas y tlaxcaltecas se aliaron con los españoles",
              "Investiga qué beneficios esperaban obtener los tlaxcaltecas al aliarse con Cortés contra los mexicas",
              "Describe cómo las rivalidades entre pueblos mesoamericanos facilitaron la conquista española"
            ]
          }
        ]
      },
      {
        "key": "encuentro_moctezuma",
        "name": "El Encuentro entre Cortés y Moctezuma",
        "short_description": "Conocer el primer contacto entre españoles y el tlatoani mexica.",
        "sub_topics": [
          {
            "key": "entrada_tenochtitlan",
            "name": "La Entrada a Tenochtitlan (1519)",
            "short_description": "Comprender cómo los españoles fueron recibidos en la capital mexica.",
            "example_tasks": [
              "Describe cómo fue la entrada de los españoles a Tenochtitlan por la calzada de Iztapalapa",
              "Investiga qué impresión causó Tenochtitlan en los españoles según las crónicas",
              "Explica por qué Moctezuma II recibió a los españoles en lugar de atacarlos"
            ]
          },
          {
            "key": "captura_moctezuma",
            "name": "La Captura de Moctezuma",
            "short_description": "Conocer cómo Cortés tomó prisionero al tlatoani mexica.",
            "example_tasks": [
              "Investiga cómo y por qué Cortés decidió tomar prisionero a Moctezuma II",
              "Explica cómo reaccionaron los mexicas ante el encarcelamiento de su tlatoani",
              "Describe la situación de tensión que se vivió en Tenochtitlan con Moctezuma cautivo"
            ]
          },
          {
            "key": "matanza_templo_mayor",
            "name": "La Matanza del Templo Mayor",
            "short_description": "Comprender el ataque español durante la fiesta de Tóxcatl.",
            "example_tasks": [
              "Investiga qué sucedió durante la Matanza del Templo Mayor ordenada por Pedro de Alvarado",
              "Explica por qué este acontecimiento provocó el levantamiento de los mexicas",
              "Describe las consecuencias de la matanza para las relaciones entre españoles y mexicas"
            ]
          }
        ]
      },
      {
        "key": "resistencia_mexica",
        "name": "La Resistencia Mexica",
        "short_description": "Estudio de la lucha de los mexicas contra los invasores españoles.",
        "sub_topics": [
          {
            "key": "noche_triste",
            "name": "La Noche Triste (30 de junio de 1520)",
            "short_description": "Conocer la huida de los españoles de Tenochtitlan.",
            "example_tasks": [
              "Describe qué sucedió durante la Noche Triste cuando los españoles intentaron huir de Tenochtitlan",
              "Investiga por qué se llama Noche Triste y cuántos españoles murieron esa noche",
              "Explica cómo murió Moctezuma II durante estos acontecimientos"
            ]
          },
          {
            "key": "cuitlahuac",
            "name": "Cuitláhuac: Tlatoani Resistente",
            "short_description": "Reconocer el liderazgo de Cuitláhuac en la resistencia contra los españoles.",
            "example_tasks": [
              "Investiga quién fue Cuitláhuac y cómo llegó a ser tlatoani después de Moctezuma II",
              "Explica qué acciones tomó Cuitláhuac para defender Tenochtitlan de los españoles",
              "Describe cómo y por qué murió Cuitláhuac poco después de asumir el poder"
            ]
          },
          {
            "key": "cuauhtemoc",
            "name": "Cuauhtémoc: El Último Tlatoani",
            "short_description": "Valorar la defensa heroica de Cuauhtémoc ante el sitio de Tenochtitlan.",
            "example_tasks": [
              "Investiga quién fue Cuauhtémoc y por qué es considerado un héroe en la historia de México",
              "Explica cómo Cuauhtémoc organizó la defensa de Tenochtitlan durante el sitio",
              "Describe la famosa frase atribuida a Cuauhtémoc al ser capturado por los españoles"
            ]
          }
        ]
      },
      {
        "key": "caida_tenochtitlan",
        "name": "La Caída de Tenochtitlan",
        "short_description": "Comprensión del sitio y conquista final de la capital mexica.",
        "sub_topics": [
          {
            "key": "sitio_tenochtitlan",
            "name": "El Sitio de Tenochtitlan (1521)",
            "short_description": "Conocer las estrategias del sitio español que duró varios meses.",
            "example_tasks": [
              "Describe cómo Cortés organizó el sitio de Tenochtitlan cortando las calzadas y el suministro de agua y alimentos",
              "Investiga qué eran los bergantines construidos por los españoles y cómo se usaron en el sitio",
              "Explica el papel de los aliados indígenas en el sitio de Tenochtitlan"
            ]
          },
          {
            "key": "caida_13_agosto_1521",
            "name": "La Caída Final (13 de agosto de 1521)",
            "short_description": "Comprender los últimos días de resistencia y la captura de Cuauhtémoc.",
            "example_tasks": [
              "Investiga qué sucedió el 13 de agosto de 1521 cuando cayó Tenochtitlan",
              "Describe cómo fue capturado Cuauhtémoc y qué pasó con él después",
              "Explica en qué estado quedó la ciudad de Tenochtitlan después de tres meses de sitio y combates"
            ]
          }
        ]
      },
      {
        "key": "factores_conquista",
        "name": "Factores que Permitieron la Conquista",
        "short_description": "Análisis de las múltiples causas que facilitaron la victoria española.",
        "sub_topics": [
          {
            "key": "ventajas_tecnologicas",
            "name": "Ventajas Tecnológicas Españolas",
            "short_description": "Reconocer las armas y tecnología que favorecieron a los españoles.",
            "example_tasks": [
              "Menciona ventajas tecnológicas de los españoles como armas de fuego, caballos y armaduras de metal",
              "Explica el impacto psicológico que causaron los caballos y armas de fuego en los indígenas",
              "Describe por qué las armas de acero eran superiores a las de obsidiana usadas por los mexicas"
            ]
          },
          {
            "key": "alianzas_divisiones",
            "name": "Alianzas y Divisiones Políticas",
            "short_description": "Comprender cómo las rivalidades entre pueblos favorecieron a los conquistadores.",
            "example_tasks": [
              "Explica cómo los españoles aprovecharon el resentimiento de los pueblos sometidos por los mexicas",
              "Investiga cuántos guerreros indígenas aliados acompañaban a los españoles en el sitio de Tenochtitlan",
              "Describe por qué sin los aliados indígenas hubiera sido imposible la conquista española"
            ]
          },
          {
            "key": "enfermedades_epidemias",
            "name": "Las Enfermedades y Epidemias",
            "short_description": "Comprender el devastador impacto de las enfermedades europeas en la población indígena.",
            "example_tasks": [
              "Investiga qué enfermedades traídas por los europeos afectaron gravemente a los indígenas",
              "Explica por qué la viruela fue tan mortal para la población indígena que no tenía inmunidad",
              "Describe cómo la epidemia de viruela debilitó la resistencia mexica durante el sitio de Tenochtitlan"
            ]
          }
        ]
      },
      {
        "key": "consecuencias_conquista",
        "name": "Consecuencias de la Conquista",
        "short_description": "Comprender los profundos cambios que trajo la conquista para los pueblos indígenas.",
        "sub_topics": [
          {
            "key": "destruccion_cultural",
            "name": "Destrucción del Mundo Indígena",
            "short_description": "Reconocer la destrucción de templos, códices y estructuras políticas.",
            "example_tasks": [
              "Describe qué sucedió con los templos y edificios de Tenochtitlan después de la conquista",
              "Investiga cuántos códices prehispánicos fueron destruidos por los conquistadores y frailes",
              "Explica cómo cambió la organización política y social de los pueblos indígenas tras la conquista"
            ]
          },
          {
            "key": "catastrofe_demografica",
            "name": "Catástrofe Demográfica",
            "short_description": "Comprender la drástica disminución de la población indígena.",
            "example_tasks": [
              "Investiga cuántos habitantes se estima que había en Mesoamérica antes y después de la conquista",
              "Explica las causas de la disminución de la población indígena (enfermedades, trabajos forzados, guerras)",
              "Describe el impacto social y económico de la pérdida de población indígena"
            ]
          },
          {
            "key": "mestizaje_inicio",
            "name": "Inicio del Mestizaje",
            "short_description": "Reconocer el inicio de la mezcla de poblaciones y culturas.",
            "example_tasks": [
              "Explica qué es el mestizaje y cómo comenzó después de la conquista",
              "Investiga quiénes fueron los primeros mestizos en la Nueva España",
              "Describe cómo el mestizaje transformaría demográfica y culturalmente a México"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "virreinato_nueva_espana",
    "name": "El Virreinato de Nueva España",
    "short_description": "Estudio de la organización política, administrativa y territorial de Nueva España durante los tres siglos de dominio español.",
    "sub_topics": [
      {
        "key": "organizacion_politica_virreinato",
        "name": "Organización Política del Virreinato",
        "short_description": "Comprensión de la estructura de gobierno virreinal y su relación con España.",
        "sub_topics": [
          {
            "key": "virreinato_concepto",
            "name": "El Virreinato como Institución",
            "short_description": "Conocer qué era un virreinato y cómo funcionaba.",
            "example_tasks": [
              "Explica qué era un virreinato y qué relación tenía con el rey de España",
              "Investiga cuándo se estableció oficialmente el Virreinato de Nueva España",
              "Describe qué territorios abarcaba el Virreinato de Nueva España en su máxima extensión"
            ]
          },
          {
            "key": "virrey",
            "name": "El Virrey: Representante del Rey",
            "short_description": "Comprender las funciones y poderes del virrey.",
            "example_tasks": [
              "Explica qué era el virrey y qué funciones desempeñaba en la Nueva España",
              "Investiga quién fue el primer virrey de Nueva España y menciona otros virreyes importantes",
              "Describe dónde residía el virrey y cómo era su palacio en la Ciudad de México"
            ]
          },
          {
            "key": "audiencia_instituciones",
            "name": "La Real Audiencia y Otras Instituciones",
            "short_description": "Conocer otras instituciones de gobierno colonial.",
            "example_tasks": [
              "Investiga qué era la Real Audiencia y qué funciones tenía en el gobierno virreinal",
              "Explica qué papel jugaban los corregidores y alcaldes mayores en las provincias",
              "Describe cómo funcionaba el Consejo de Indias en España para gobernar las colonias"
            ]
          }
        ]
      },
      {
        "key": "division_territorial",
        "name": "División Territorial",
        "short_description": "Conocer cómo se organizaba el territorio de la Nueva España.",
        "sub_topics": [
          {
            "key": "reinos_provincias",
            "name": "Reinos y Provincias",
            "short_description": "Identificar las principales divisiones administrativas del virreinato.",
            "example_tasks": [
              "Menciona algunos de los reinos que formaban parte de la Nueva España como Nueva Galicia o Nuevo León",
              "Investiga qué provincias importantes existían en el territorio de la Nueva España",
              "Explica cómo se administraban las diferentes regiones del virreinato"
            ]
          },
          {
            "key": "capital_ciudad_mexico",
            "name": "La Ciudad de México: Capital del Virreinato",
            "short_description": "Comprender la importancia de la Ciudad de México construida sobre Tenochtitlan.",
            "example_tasks": [
              "Describe cómo se construyó la Ciudad de México sobre las ruinas de Tenochtitlan",
              "Investiga qué edificios importantes se construyeron en la capital como la Catedral y el Palacio Virreinal",
              "Explica por qué la Ciudad de México era el centro político, económico y cultural de Nueva España"
            ]
          }
        ]
      },
      {
        "key": "conquista_espiritual",
        "name": "La Conquista Espiritual",
        "short_description": "Estudio del proceso de evangelización y la imposición del cristianismo.",
        "sub_topics": [
          {
            "key": "ordenes_religiosas",
            "name": "Las Órdenes Religiosas",
            "short_description": "Conocer las órdenes que participaron en la evangelización.",
            "example_tasks": [
              "Menciona las principales órdenes religiosas que llegaron a evangelizar Nueva España: franciscanos, dominicos, agustinos",
              "Investiga qué actividades realizaban los frailes además de predicar el cristianismo",
              "Describe quiénes fueron los 'doce apóstoles' franciscanos que llegaron en 1524"
            ]
          },
          {
            "key": "metodos_evangelizacion",
            "name": "Métodos de Evangelización",
            "short_description": "Comprender cómo se realizó la conversión de los indígenas al cristianismo.",
            "example_tasks": [
              "Explica qué métodos usaban los frailes para enseñar la religión católica a los indígenas",
              "Investiga cómo se destruyeron templos prehispánicos y se construyeron iglesias en su lugar",
              "Describe el papel de las imágenes y el teatro en la evangelización de los pueblos indígenas"
            ]
          },
          {
            "key": "sincretismo_religioso",
            "name": "Sincretismo Religioso",
            "short_description": "Reconocer la mezcla de creencias indígenas y católicas.",
            "example_tasks": [
              "Explica qué es el sincretismo religioso y cómo se manifestó en la Nueva España",
              "Investiga ejemplos de sincretismo como la asociación de santos católicos con deidades prehispánicas",
              "Describe el significado de las apariciones de la Virgen de Guadalupe en 1531 para el sincretismo religioso"
            ]
          },
          {
            "key": "resistencia_cultural",
            "name": "Resistencia y Conservación Cultural Indígena",
            "short_description": "Comprender cómo algunos pueblos indígenas mantuvieron sus tradiciones.",
            "example_tasks": [
              "Investiga formas en que los pueblos indígenas conservaron sus tradiciones a pesar de la evangelización",
              "Explica cómo algunos indígenas ocultaron prácticas religiosas prehispánicas durante la colonia",
              "Describe el papel de las lenguas indígenas en la preservación de la cultura"
            ]
          }
        ]
      },
      {
        "key": "evangelizadores_destacados",
        "name": "Evangelizadores Destacados",
        "short_description": "Conocer a algunos frailes que defendieron a los indígenas.",
        "sub_topics": [
          {
            "key": "bartolome_las_casas",
            "name": "Fray Bartolomé de las Casas",
            "short_description": "Reconocer la defensa de los derechos indígenas por Las Casas.",
            "example_tasks": [
              "Investiga quién fue Bartolomé de las Casas y por qué defendió a los indígenas",
              "Explica qué denunciaba Las Casas sobre el trato a los indígenas en sus escritos",
              "Describe el impacto de la obra de Las Casas en las Leyes Nuevas de 1542"
            ]
          },
          {
            "key": "vasco_de_quiroga",
            "name": "Vasco de Quiroga",
            "short_description": "Conocer la labor social de Vasco de Quiroga en Michoacán.",
            "example_tasks": [
              "Investiga quién fue Vasco de Quiroga y qué hizo por los pueblos indígenas de Michoacán",
              "Explica qué eran los hospitales-pueblo fundados por Vasco de Quiroga",
              "Describe por qué los indígenas purépechas llamaban a Vasco de Quiroga 'Tata Vasco'"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "vida_cotidiana_nueva_espana",
    "name": "La Vida Cotidiana en la Nueva España",
    "short_description": "Estudio de la sociedad virreinal, el sistema de castas, la vida diaria y las manifestaciones culturales.",
    "sub_topics": [
      {
        "key": "sistema_castas",
        "name": "El Sistema de Castas",
        "short_description": "Comprensión de la compleja jerarquía social basada en el origen étnico.",
        "sub_topics": [
          {
            "key": "grupos_sociales",
            "name": "Los Grupos Sociales",
            "short_description": "Identificar los principales grupos: españoles peninsulares, criollos, indígenas, negros y castas.",
            "example_tasks": [
              "Explica las diferencias entre españoles peninsulares y criollos",
              "Describe la posición social de los indígenas en la sociedad novohispana",
              "Investiga cómo llegaron personas africanas a la Nueva España y qué trabajos realizaban"
            ]
          },
          {
            "key": "castas_mestizaje",
            "name": "Las Castas y el Mestizaje",
            "short_description": "Conocer las denominaciones de las diferentes mezclas étnicas.",
            "example_tasks": [
              "Menciona al menos cinco nombres de castas como mestizo, mulato, zambo, castizo",
              "Investiga qué eran las pinturas de castas y qué representaban",
              "Explica cómo el sistema de castas determinaba los derechos y obligaciones de las personas"
            ]
          },
          {
            "key": "desigualdad_social",
            "name": "Desigualdad y Privilegios",
            "short_description": "Comprender la desigualdad estructural de la sociedad colonial.",
            "example_tasks": [
              "Describe qué privilegios tenían los españoles peninsulares que no tenían otros grupos",
              "Explica por qué los criollos, a pesar de ser hijos de españoles, tenían menos derechos",
              "Investiga qué trabajos y actividades estaban prohibidos para ciertos grupos sociales"
            ]
          }
        ]
      },
      {
        "key": "vida_grupos_sociales",
        "name": "Vida de los Diferentes Grupos Sociales",
        "short_description": "Conocer la vida cotidiana de cada grupo social.",
        "sub_topics": [
          {
            "key": "vida_elite",
            "name": "La Vida de la Élite",
            "short_description": "Comprender el estilo de vida de españoles y criollos ricos.",
            "example_tasks": [
              "Describe cómo vivían las familias españolas adineradas en la Ciudad de México",
              "Investiga qué tipo de educación recibían los hijos de las familias de la élite",
              "Explica qué actividades sociales y de entretenimiento realizaba la élite novohispana"
            ]
          },
          {
            "key": "vida_pueblos_indigenas",
            "name": "La Vida de los Pueblos Indígenas",
            "short_description": "Conocer las condiciones de vida de la población indígena.",
            "example_tasks": [
              "Describe las actividades diarias de los indígenas que vivían en comunidades rurales",
              "Investiga qué tributos debían pagar los indígenas a las autoridades españolas",
              "Explica cómo funcionaba el sistema de la encomienda y el repartimiento"
            ]
          },
          {
            "key": "vida_castas_populares",
            "name": "La Vida de las Castas y Sectores Populares",
            "short_description": "Comprender la vida de mestizos, mulatos y grupos populares urbanos.",
            "example_tasks": [
              "Describe qué oficios desempeñaban mestizos y mulatos en las ciudades",
              "Investiga cómo era la vida en los barrios populares de la Ciudad de México",
              "Explica las limitaciones sociales y económicas que enfrentaban las castas"
            ]
          }
        ]
      },
      {
        "key": "familia_genero",
        "name": "Familia y Género",
        "short_description": "Comprender los roles de género y la organización familiar en la época colonial.",
        "sub_topics": [
          {
            "key": "papel_mujer",
            "name": "El Papel de la Mujer",
            "short_description": "Conocer las limitaciones y roles asignados a las mujeres.",
            "example_tasks": [
              "Describe qué actividades y roles se esperaban de las mujeres en la sociedad novohispana",
              "Investiga qué opciones de vida tenían las mujeres: matrimonio o convento principalmente",
              "Explica cómo algunas mujeres destacaron en actividades intelectuales como Sor Juana Inés de la Cruz"
            ]
          },
          {
            "key": "matrimonio_familia",
            "name": "Matrimonio y Familia",
            "short_description": "Comprender la organización familiar y las costumbres matrimoniales.",
            "example_tasks": [
              "Describe cómo se arreglaban los matrimonios en las familias de la élite",
              "Investiga qué papel jugaba la Iglesia en la regulación de los matrimonios",
              "Explica la importancia de la familia extensa en la sociedad novohispana"
            ]
          }
        ]
      },
      {
        "key": "alimentacion_vestimenta",
        "name": "Alimentación y Vestimenta",
        "short_description": "Conocer la vida material: comida, ropa y costumbres cotidianas.",
        "sub_topics": [
          {
            "key": "fusion_gastronomica",
            "name": "Fusión Gastronómica",
            "short_description": "Reconocer la mezcla de tradiciones culinarias indígenas y españolas.",
            "example_tasks": [
              "Menciona alimentos indígenas que se mezclaron con ingredientes europeos en la cocina novohispana",
              "Investiga el origen de platillos mestizos como el mole, los tamales con carne de cerdo",
              "Describe las diferencias en la alimentación entre los grupos sociales"
            ]
          },
          {
            "key": "vestimenta_identidad",
            "name": "Vestimenta e Identidad",
            "short_description": "Comprender cómo la ropa reflejaba la posición social.",
            "example_tasks": [
              "Describe cómo se vestían los españoles de la élite en contraste con los indígenas",
              "Investiga qué prendas estaban prohibidas para ciertos grupos sociales",
              "Explica cómo la vestimenta era una forma de identificar la posición social de una persona"
            ]
          }
        ]
      },
      {
        "key": "fiestas_entretenimiento",
        "name": "Fiestas y Entretenimiento",
        "short_description": "Conocer las celebraciones, festividades religiosas y diversiones.",
        "sub_topics": [
          {
            "key": "fiestas_religiosas",
            "name": "Fiestas Religiosas",
            "short_description": "Reconocer la importancia de las celebraciones del calendario católico.",
            "example_tasks": [
              "Describe cómo se celebraban festividades religiosas como Semana Santa y Corpus Christi",
              "Investiga el origen de celebraciones como el Día de Muertos que mezclan tradiciones indígenas y católicas",
              "Explica qué papel jugaban las procesiones y ceremonias religiosas en la vida social"
            ]
          },
          {
            "key": "diversiones_juegos",
            "name": "Diversiones y Juegos",
            "short_description": "Conocer las formas de entretenimiento de la época.",
            "example_tasks": [
              "Menciona entretenimientos populares como corridas de toros, peleas de gallos y juegos de azar",
              "Investiga qué tipo de teatro y música se presentaba en la Nueva España",
              "Describe las diferencias en las diversiones de los diferentes grupos sociales"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "economia_colonial",
    "name": "La Economía Colonial",
    "short_description": "Estudio de las actividades económicas del virreinato: minería, agricultura, ganadería y comercio.",
    "sub_topics": [
      {
        "key": "mineria_novohispana",
        "name": "La Minería: Motor de la Economía",
        "short_description": "Comprensión de la explotación minera como principal actividad económica.",
        "sub_topics": [
          {
            "key": "centros_mineros",
            "name": "Principales Centros Mineros",
            "short_description": "Identificar las regiones mineras más importantes de Nueva España.",
            "example_tasks": [
              "Localiza en un mapa los principales centros mineros como Zacatecas, Guanajuato y Taxco",
              "Investiga qué metales se extraían principalmente en las minas novohispanas",
              "Explica cómo el descubrimiento de minas impulsó la fundación de nuevas ciudades"
            ]
          },
          {
            "key": "trabajo_minero",
            "name": "Trabajo en las Minas",
            "short_description": "Comprender las duras condiciones del trabajo minero.",
            "example_tasks": [
              "Describe las condiciones de trabajo en las minas durante la época colonial",
              "Investiga el sistema de trabajo forzado de los indígenas en las minas",
              "Explica qué era el azogue (mercurio) y cómo se usaba para procesar la plata"
            ]
          },
          {
            "key": "riqueza_espana",
            "name": "La Plata y el Enriquecimiento de España",
            "short_description": "Comprender cómo la riqueza minera beneficiaba principalmente a España.",
            "example_tasks": [
              "Investiga qué porcentaje de la plata extraída iba a España como impuesto real",
              "Explica cómo la plata de América enriqueció a la Corona española",
              "Describe el sistema de flotas y galeones que transportaban la plata a España"
            ]
          }
        ]
      },
      {
        "key": "agricultura_ganaderia",
        "name": "Agricultura y Ganadería",
        "short_description": "Conocer las actividades agropecuarias del virreinato.",
        "sub_topics": [
          {
            "key": "haciendas",
            "name": "Las Haciendas",
            "short_description": "Comprender el sistema de haciendas como unidades productivas.",
            "example_tasks": [
              "Explica qué era una hacienda y cómo funcionaba en la Nueva España",
              "Investiga qué productos se cultivaban en las haciendas (trigo, caña de azúcar, maíz)",
              "Describe la vida de los trabajadores en las haciendas"
            ]
          },
          {
            "key": "introduccion_especies",
            "name": "Introducción de Nuevas Especies",
            "short_description": "Reconocer plantas y animales traídos de Europa.",
            "example_tasks": [
              "Menciona animales que los españoles introdujeron en América como caballos, vacas, cerdos, ovejas",
              "Investiga plantas europeas que se cultivaron en Nueva España como trigo, vid y olivo",
              "Explica cómo estas nuevas especies transformaron la agricultura y alimentación"
            ]
          },
          {
            "key": "tierra_indigenas",
            "name": "Tierras Comunales Indígenas",
            "short_description": "Comprender la conservación parcial de tierras comunales.",
            "example_tasks": [
              "Investiga cómo algunos pueblos indígenas conservaron tierras comunales para su sustento",
              "Explica el constante despojo de tierras indígenas por hacendados españoles",
              "Describe qué cultivaban los indígenas en sus parcelas comunales"
            ]
          }
        ]
      },
      {
        "key": "comercio_monopolio",
        "name": "Comercio y Monopolio",
        "short_description": "Comprender el sistema comercial controlado por España.",
        "sub_topics": [
          {
            "key": "monopolio_comercial",
            "name": "El Monopolio Comercial",
            "short_description": "Conocer las restricciones comerciales impuestas por España.",
            "example_tasks": [
              "Explica qué era el monopolio comercial y cómo España controlaba todo el comercio con sus colonias",
              "Investiga qué productos estaba prohibido producir en Nueva España para no competir con España",
              "Describe el sistema de flotas que regulaba el comercio entre España y América"
            ]
          },
          {
            "key": "nao_china",
            "name": "La Nao de China",
            "short_description": "Conocer el comercio transpacífico entre Acapulco y Filipinas.",
            "example_tasks": [
              "Investiga qué era la Nao de China o Galeón de Manila y qué ruta seguía",
              "Menciona productos orientales que llegaban a Nueva España por esta ruta comercial",
              "Explica la importancia del puerto de Acapulco en el comercio con Asia"
            ]
          },
          {
            "key": "contrabando",
            "name": "El Contrabando",
            "short_description": "Comprender el comercio ilegal como respuesta al monopolio.",
            "example_tasks": [
              "Explica por qué surgió el contrabando en la Nueva España",
              "Investiga con qué países se realizaba comercio ilegal (Inglaterra, Francia, Holanda)",
              "Describe las medidas que tomaban las autoridades para combatir el contrabando"
            ]
          }
        ]
      },
      {
        "key": "artesanias_obrajes",
        "name": "Artesanías y Obrajes",
        "short_description": "Conocer la producción artesanal y manufactura textil.",
        "sub_topics": [
          {
            "key": "artesanos_gremios",
            "name": "Artesanos y Gremios",
            "short_description": "Comprender la organización de los oficios artesanales.",
            "example_tasks": [
              "Explica qué eran los gremios y cómo regulaban los oficios artesanales",
              "Menciona oficios artesanales importantes en las ciudades como herreros, carpinteros, alfareros",
              "Investiga cómo se aprendía un oficio: aprendiz, oficial, maestro"
            ]
          },
          {
            "key": "obrajes",
            "name": "Los Obrajes",
            "short_description": "Conocer los talleres de producción textil.",
            "example_tasks": [
              "Investiga qué eran los obrajes y qué productos fabricaban",
              "Describe las condiciones de trabajo en los obrajes textiles",
              "Explica por qué los obrajes eran considerados lugares de trabajo forzado"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "arte_cultura_nueva_espana",
    "name": "El Arte y la Cultura en la Nueva España",
    "short_description": "Estudio de las manifestaciones artísticas, arquitectónicas, literarias y educativas del periodo virreinal.",
    "sub_topics": [
      {
        "key": "arquitectura_colonial",
        "name": "Arquitectura Colonial",
        "short_description": "Conocer los estilos arquitectónicos y principales construcciones del virreinato.",
        "sub_topics": [
          {
            "key": "arquitectura_religiosa",
            "name": "Arquitectura Religiosa",
            "short_description": "Reconocer conventos, catedrales e iglesias como principales obras.",
            "example_tasks": [
              "Describe las características de la Catedral Metropolitana de la Ciudad de México",
              "Investiga qué son los conventos del siglo XVI en las laderas del Popocatépetl declarados Patrimonio de la Humanidad",
              "Explica los diferentes estilos arquitectónicos usados: gótico, renacentista, barroco, churrigueresco"
            ]
          },
          {
            "key": "arquitectura_civil",
            "name": "Arquitectura Civil",
            "short_description": "Conocer palacios, casas señoriales y edificios públicos.",
            "example_tasks": [
              "Describe cómo eran las casas de la élite en las ciudades coloniales",
              "Investiga ejemplos de arquitectura civil como el Palacio de Minería o la Casa de los Azulejos",
              "Explica la función de los portales y plazas en las ciudades novohispanas"
            ]
          }
        ]
      },
      {
        "key": "arte_barroco",
        "name": "El Arte Barroco Novohispano",
        "short_description": "Comprender el desarrollo del arte barroco en pintura y escultura.",
        "sub_topics": [
          {
            "key": "pintura_colonial",
            "name": "Pintura Colonial",
            "short_description": "Conocer la pintura religiosa y de castas.",
            "example_tasks": [
              "Investiga quiénes fueron pintores importantes como Cristóbal de Villalpando o Juan Correa",
              "Describe las características de la pintura barroca novohispana",
              "Explica qué representaban las pinturas de castas del siglo XVIII"
            ]
          },
          {
            "key": "escultura_retablos",
            "name": "Escultura y Retablos",
            "short_description": "Reconocer los retablos dorados como expresión máxima del barroco.",
            "example_tasks": [
              "Describe qué son los retablos y cómo eran los retablos barrocos dorados",
              "Investiga ejemplos de retablos en iglesias como el de la Capilla del Rosario en Puebla",
              "Explica las técnicas de tallado y dorado usadas en los retablos"
            ]
          }
        ]
      },
      {
        "key": "educacion_cultura_intelectual",
        "name": "Educación y Cultura Intelectual",
        "short_description": "Conocer las instituciones educativas y la vida intelectual del virreinato.",
        "sub_topics": [
          {
            "key": "universidad_colegios",
            "name": "La Real y Pontificia Universidad",
            "short_description": "Reconocer la fundación de la universidad en 1551.",
            "example_tasks": [
              "Investiga cuándo se fundó la Real y Pontificia Universidad de México y qué se estudiaba",
              "Explica quiénes podían estudiar en la universidad y quiénes estaban excluidos",
              "Describe las carreras que se impartían: teología, leyes, medicina, artes"
            ]
          },
          {
            "key": "sor_juana",
            "name": "Sor Juana Inés de la Cruz",
            "short_description": "Valorar la obra de la poeta y pensadora más importante de la Nueva España.",
            "example_tasks": [
              "Investiga quién fue Sor Juana Inés de la Cruz y por qué es considerada una figura importante",
              "Describe algunas obras importantes de Sor Juana como 'Primero sueño' o sus villancicos",
              "Explica los obstáculos que enfrentó Sor Juana como mujer intelectual en su época"
            ]
          },
          {
            "key": "imprenta_libros",
            "name": "La Imprenta y los Libros",
            "short_description": "Conocer la llegada de la imprenta y la producción de libros.",
            "example_tasks": [
              "Investiga cuándo llegó la imprenta a la Nueva España y qué se imprimía",
              "Explica el papel de la censura religiosa sobre los libros en la época colonial",
              "Describe qué tipo de obras se publicaban: religiosas, científicas, crónicas"
            ]
          }
        ]
      },
      {
        "key": "musica_teatro",
        "name": "Música y Teatro",
        "short_description": "Conocer las expresiones musicales y teatrales del virreinato.",
        "sub_topics": [
          {
            "key": "musica_religiosa_profana",
            "name": "Música Religiosa y Profana",
            "short_description": "Reconocer la importancia de la música en la vida colonial.",
            "example_tasks": [
              "Investiga qué tipo de música se interpretaba en las iglesias y catedrales",
              "Describe la música popular y profana que se tocaba en fiestas y celebraciones",
              "Explica cómo la música indígena se mezcló con la europea"
            ]
          },
          {
            "key": "teatro_colonial",
            "name": "Teatro y Representaciones",
            "short_description": "Conocer el teatro religioso y las pastorelas.",
            "example_tasks": [
              "Explica qué eran los autos sacramentales representados en las iglesias",
              "Investiga el origen de las pastorelas navideñas en la época colonial",
              "Describe cómo el teatro se usaba para evangelizar a los indígenas"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "movimiento_independencia",
    "name": "El Movimiento de Independencia",
    "short_description": "Estudio del proceso de independencia de México desde sus causas hasta la consumación en 1821.",
    "sub_topics": [
      {
        "key": "causas_independencia",
        "name": "Causas de la Independencia",
        "short_description": "Comprensión de los factores internos y externos que motivaron el movimiento independentista.",
        "sub_topics": [
          {
            "key": "causas_internas",
            "name": "Causas Internas",
            "short_description": "Identificar las tensiones sociales y económicas en la Nueva España.",
            "example_tasks": [
              "Explica la desigualdad entre criollos y españoles peninsulares como causa de descontento",
              "Investiga cómo la explotación de indígenas y castas generó inconformidad social",
              "Describe el control económico de España sobre la Nueva España y sus efectos"
            ]
          },
          {
            "key": "causas_externas",
            "name": "Causas Externas",
            "short_description": "Reconocer la influencia de acontecimientos internacionales.",
            "example_tasks": [
              "Investiga cómo influyeron las ideas de la Ilustración en los criollos novohispanos",
              "Explica el impacto de la Independencia de Estados Unidos (1776) como ejemplo",
              "Describe cómo la Revolución Francesa (1789) inspiró ideas de libertad e igualdad"
            ]
          },
          {
            "key": "invasion_napoleonica",
            "name": "La Invasión Napoleónica a España",
            "short_description": "Comprender cómo la crisis política española desencadenó la independencia.",
            "example_tasks": [
              "Investiga qué sucedió cuando Napoleón invadió España en 1808 y capturó al rey Fernando VII",
              "Explica cómo la crisis en España creó un vacío de poder en las colonias",
              "Describe qué eran las Juntas que se formaron en España y América"
            ]
          }
        ]
      },
      {
        "key": "inicio_independencia",
        "name": "Inicio del Movimiento (1810)",
        "short_description": "Conocer el grito de Dolores y la primera etapa de la insurgencia.",
        "sub_topics": [
          {
            "key": "conspiracion_queretaro",
            "name": "La Conspiración de Querétaro",
            "short_description": "Comprender la organización previa al inicio de la lucha armada.",
            "example_tasks": [
              "Investiga quiénes participaban en la Conspiración de Querétaro para independizar la Nueva España",
              "Explica el papel de Josefa Ortiz de Domínguez en avisar que la conspiración había sido descubierta",
              "Describe por qué los conspiradores tuvieron que adelantar el inicio del movimiento"
            ]
          },
          {
            "key": "grito_dolores",
            "name": "El Grito de Dolores (16 de septiembre de 1810)",
            "short_description": "Conocer el inicio oficial del movimiento de independencia.",
            "example_tasks": [
              "Investiga qué sucedió la madrugada del 16 de septiembre de 1810 en Dolores, Guanajuato",
              "Explica qué proclamó Miguel Hidalgo cuando llamó a la población a levantarse en armas",
              "Describe por qué el 16 de septiembre se celebra como el inicio de la Independencia"
            ]
          },
          {
            "key": "hidalgo_lider",
            "name": "Miguel Hidalgo: Padre de la Patria",
            "short_description": "Valorar el liderazgo de Hidalgo en la primera etapa del movimiento.",
            "example_tasks": [
              "Investiga quién era Miguel Hidalgo y Costilla antes de iniciar el movimiento",
              "Describe las ideas de Hidalgo sobre la abolición de la esclavitud y los tributos indígenas",
              "Explica por qué Hidalgo es llamado 'Padre de la Patria'"
            ]
          }
        ]
      },
      {
        "key": "campana_hidalgo",
        "name": "La Campaña de Hidalgo",
        "short_description": "Conocer las batallas y el avance del ejército insurgente.",
        "sub_topics": [
          {
            "key": "toma_alhondiga",
            "name": "La Toma de la Alhóndiga de Granaditas",
            "short_description": "Reconocer la primera gran victoria insurgente.",
            "example_tasks": [
              "Describe la batalla en la Alhóndiga de Granaditas en Guanajuato",
              "Investiga quién fue el Pípila y qué papel jugó en la toma de la Alhóndiga",
              "Explica las consecuencias de esta victoria para el movimiento insurgente"
            ]
          },
          {
            "key": "virgen_guadalupe_estandarte",
            "name": "La Virgen de Guadalupe como Estandarte",
            "short_description": "Comprender el simbolismo religioso del movimiento.",
            "example_tasks": [
              "Investiga por qué Hidalgo eligió la imagen de la Virgen de Guadalupe como estandarte",
              "Explica cómo el uso de símbolos religiosos atrajo el apoyo popular",
              "Describe qué representaba la Virgen de Guadalupe para los insurgentes"
            ]
          },
          {
            "key": "batalla_monte_cruces",
            "name": "La Batalla del Monte de las Cruces",
            "short_description": "Conocer la victoria cerca de la Ciudad de México.",
            "example_tasks": [
              "Investiga qué sucedió en la batalla del Monte de las Cruces cerca de la capital",
              "Explica por qué Hidalgo decidió no atacar la Ciudad de México después de ganar",
              "Describe las consecuencias de esta decisión para el movimiento"
            ]
          },
          {
            "key": "derrota_captura_hidalgo",
            "name": "Derrota y Captura de Hidalgo",
            "short_description": "Comprender el final de la campaña de Hidalgo.",
            "example_tasks": [
              "Describe la derrota insurgente en la Batalla de Puente de Calderón en 1811",
              "Investiga cómo fueron capturados Hidalgo y otros líderes insurgentes en Acatita de Baján",
              "Explica qué sucedió con Hidalgo después de su captura y fusilamiento en Chihuahua"
            ]
          }
        ]
      },
      {
        "key": "morelos_organizacion",
        "name": "José María Morelos y la Organización del Movimiento",
        "short_description": "Estudio de la segunda etapa con mayor organización política y militar.",
        "sub_topics": [
          {
            "key": "morelos_lider",
            "name": "José María Morelos y Pavón",
            "short_description": "Conocer al líder que dio estructura al movimiento independentista.",
            "example_tasks": [
              "Investiga quién era José María Morelos antes de unirse al movimiento de Hidalgo",
              "Describe las cualidades militares y políticas de Morelos como líder",
              "Explica cómo Morelos organizó el movimiento de manera más efectiva que Hidalgo"
            ]
          },
          {
            "key": "campanas_militares_morelos",
            "name": "Campañas Militares de Morelos",
            "short_description": "Reconocer las victorias militares en el sur.",
            "example_tasks": [
              "Menciona las principales victorias de Morelos como el Sitio de Cuautla",
              "Investiga cómo Morelos controló gran parte del sur del país",
              "Describe la estrategia militar de Morelos basada en la guerra de guerrillas"
            ]
          },
          {
            "key": "sentimientos_nacion",
            "name": "Sentimientos de la Nación",
            "short_description": "Valorar el documento político de Morelos.",
            "example_tasks": [
              "Investiga qué era el documento 'Sentimientos de la Nación' presentado por Morelos en 1813",
              "Menciona tres puntos importantes del documento como la independencia, la abolición de la esclavitud y la igualdad",
              "Explica por qué este documento es considerado fundamental para la historia de México"
            ]
          },
          {
            "key": "congreso_chilpancingo",
            "name": "El Congreso de Chilpancingo",
            "short_description": "Conocer la organización política del movimiento insurgente.",
            "example_tasks": [
              "Investiga qué fue el Congreso de Chilpancingo convocado por Morelos en 1813",
              "Explica qué se declaró en este congreso sobre la independencia de México",
              "Describe la importancia de establecer un gobierno insurgente organizado"
            ]
          },
          {
            "key": "constitucion_apatzingan",
            "name": "La Constitución de Apatzingán (1814)",
            "short_description": "Reconocer la primera constitución mexicana.",
            "example_tasks": [
              "Investiga qué establecía la Constitución de Apatzingán de 1814",
              "Explica los principios de soberanía popular y división de poderes en la constitución",
              "Describe por qué esta constitución nunca entró en vigor"
            ]
          },
          {
            "key": "captura_muerte_morelos",
            "name": "Captura y Muerte de Morelos",
            "short_description": "Comprender el final de la etapa de Morelos.",
            "example_tasks": [
              "Investiga cómo fue capturado Morelos en 1815 cuando escoltaba al Congreso",
              "Describe el juicio y fusilamiento de Morelos",
              "Explica qué sucedió con el movimiento insurgente después de la muerte de Morelos"
            ]
          }
        ]
      },
      {
        "key": "resistencia_insurgente",
        "name": "La Resistencia Insurgente (1815-1820)",
        "short_description": "Conocer la etapa de resistencia con líderes como Guerrero.",
        "sub_topics": [
          {
            "key": "vicente_guerrero",
            "name": "Vicente Guerrero",
            "short_description": "Reconocer la tenacidad de Guerrero en la lucha.",
            "example_tasks": [
              "Investiga quién fue Vicente Guerrero y cómo continuó la lucha en el sur",
              "Describe por qué Guerrero se negó a rendirse a pesar de las dificultades",
              "Explica la famosa frase de Guerrero: 'La Patria es primero'"
            ]
          },
          {
            "key": "otros_insurgentes",
            "name": "Otros Líderes Insurgentes",
            "short_description": "Conocer a otros insurgentes que mantuvieron la resistencia.",
            "example_tasks": [
              "Menciona insurgentes como Guadalupe Victoria, Nicolás Bravo o Pedro Ascencio",
              "Investiga qué regiones controlaban estos líderes insurgentes",
              "Describe cómo mantuvieron viva la lucha por la independencia"
            ]
          }
        ]
      },
      {
        "key": "consumacion_independencia",
        "name": "La Consumación de la Independencia",
        "short_description": "Comprender cómo se logró finalmente la independencia en 1821.",
        "sub_topics": [
          {
            "key": "plan_iguala",
            "name": "El Plan de Iguala",
            "short_description": "Conocer el acuerdo que permitió la independencia.",
            "example_tasks": [
              "Investiga qué proponía el Plan de Iguala proclamado por Iturbide en 1821",
              "Explica las Tres Garantías: Religión, Independencia y Unión",
              "Describe por qué el Plan de Iguala fue aceptado por diferentes grupos sociales"
            ]
          },
          {
            "key": "abrazo_acatempan",
            "name": "El Abrazo de Acatempan",
            "short_description": "Comprender la alianza entre Iturbide y Guerrero.",
            "example_tasks": [
              "Investiga qué fue el Abrazo de Acatempan entre Agustín de Iturbide y Vicente Guerrero",
              "Explica por qué Guerrero aceptó aliarse con Iturbide, quien había sido realista",
              "Describe la importancia de esta alianza para lograr la independencia"
            ]
          },
          {
            "key": "ejercito_trigarante",
            "name": "El Ejército Trigarante",
            "short_description": "Conocer el ejército que consumó la independencia.",
            "example_tasks": [
              "Explica qué era el Ejército Trigarante y qué representaban sus colores",
              "Investiga cómo el Ejército Trigarante ganó apoyo en todo el país",
              "Describe la bandera trigarante que representaba las Tres Garantías"
            ]
          },
          {
            "key": "entrada_ejercito_trigarante",
            "name": "Entrada del Ejército Trigarante (27 de septiembre de 1821)",
            "short_description": "Reconocer la consumación oficial de la independencia.",
            "example_tasks": [
              "Investiga qué sucedió el 27 de septiembre de 1821 cuando el Ejército Trigarante entró a la Ciudad de México",
              "Describe cómo fue recibido el ejército por la población",
              "Explica por qué esta fecha marca la consumación de la independencia"
            ]
          },
          {
            "key": "tratados_cordoba",
            "name": "Los Tratados de Córdoba",
            "short_description": "Conocer el reconocimiento español de la independencia.",
            "example_tasks": [
              "Investiga qué establecían los Tratados de Córdoba firmados por Iturbide y O'Donojú",
              "Explica cómo estos tratados reconocían la independencia de México",
              "Describe las condiciones bajo las cuales España aceptaba la separación"
            ]
          }
        ]
      },
      {
        "key": "personajes_independencia",
        "name": "Personajes de la Independencia",
        "short_description": "Valorar el papel de diversos héroes de la independencia.",
        "sub_topics": [
          {
            "key": "heroinas_independencia",
            "name": "Heroínas de la Independencia",
            "short_description": "Reconocer la participación de mujeres en el movimiento.",
            "example_tasks": [
              "Investiga el papel de Josefa Ortiz de Domínguez, Leona Vicario y otras heroínas",
              "Describe las actividades que realizaron las mujeres en apoyo al movimiento insurgente",
              "Explica los riesgos que enfrentaron las mujeres que participaron en la independencia"
            ]
          },
          {
            "key": "ninos_heroes_independencia",
            "name": "Otros Personajes Importantes",
            "short_description": "Conocer a otros participantes del movimiento independentista.",
            "example_tasks": [
              "Menciona personajes como Ignacio Allende, Juan Aldama, Mariano Abasolo",
              "Investiga el papel de los hermanos Galeana y los hermanos Bravo",
              "Describe las contribuciones de intelectuales como Andrés Quintana Roo y Carlos María de Bustamante"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "primeros_anos_mexico_independiente",
    "name": "Los Primeros Años del México Independiente",
    "short_description": "Estudio de la difícil organización política, económica y social de México tras la independencia (1821-1854).",
    "sub_topics": [
      {
        "key": "primer_imperio",
        "name": "El Primer Imperio Mexicano",
        "short_description": "Conocer el breve imperio de Agustín de Iturbide.",
        "sub_topics": [
          {
            "key": "iturbide_emperador",
            "name": "Iturbide como Emperador",
            "short_description": "Comprender la coronación y gobierno de Iturbide.",
            "example_tasks": [
              "Investiga cómo Agustín de Iturbide se proclamó emperador de México en 1822",
              "Explica por qué algunos grupos apoyaron el imperio y otros se opusieron",
              "Describe los problemas que enfrentó Iturbide como emperador"
            ]
          },
          {
            "key": "caida_imperio",
            "name": "Caída del Imperio",
            "short_description": "Conocer la abdicación de Iturbide y el fin del imperio.",
            "example_tasks": [
              "Investiga cómo el Plan de Casa Mata derrocó a Iturbide en 1823",
              "Explica qué sucedió con Iturbide después de abdicar",
              "Describe por qué el experimento imperial duró tan poco tiempo"
            ]
          }
        ]
      },
      {
        "key": "republica_federal",
        "name": "La República Federal",
        "short_description": "Comprender la organización de México como república federal.",
        "sub_topics": [
          {
            "key": "constitucion_1824",
            "name": "La Constitución de 1824",
            "short_description": "Conocer la primera constitución republicana.",
            "example_tasks": [
              "Investiga qué establecía la Constitución de 1824 sobre la organización del país",
              "Explica qué es un sistema federal y cómo funcionaba en México",
              "Describe la división de poderes establecida en la constitución"
            ]
          },
          {
            "key": "guadalupe_victoria",
            "name": "Guadalupe Victoria: Primer Presidente",
            "short_description": "Reconocer al primer presidente de México.",
            "example_tasks": [
              "Investiga quién fue Guadalupe Victoria y por qué cambió su nombre",
              "Describe los principales logros de su gobierno (1824-1829)",
              "Explica los desafíos que enfrentó como primer presidente"
            ]
          }
        ]
      },
      {
        "key": "conflictos_politicos",
        "name": "Conflictos Políticos: Federalistas vs Centralistas",
        "short_description": "Comprender las luchas entre diferentes proyectos políticos.",
        "sub_topics": [
          {
            "key": "federalistas_centralistas",
            "name": "Federalistas y Centralistas",
            "short_description": "Identificar las diferencias entre ambos grupos.",
            "example_tasks": [
              "Explica qué defendían los federalistas sobre la organización del país",
              "Investiga qué proponían los centralistas en contraste con los federalistas",
              "Describe por qué estos grupos se enfrentaban constantemente"
            ]
          },
          {
            "key": "yorkinos_escoceses",
            "name": "Logias Masónicas: Yorkinos y Escoceses",
            "short_description": "Conocer las organizaciones políticas de la época.",
            "example_tasks": [
              "Investiga qué eran las logias masónicas yorkinas y escocesas",
              "Explica las diferencias políticas entre yorkinos (liberales) y escoceses (conservadores)",
              "Describe cómo estas logias influyeron en la política mexicana"
            ]
          }
        ]
      },
      {
        "key": "inestabilidad_politica",
        "name": "Inestabilidad Política y Pronunciamientos",
        "short_description": "Comprender la constante inestabilidad gubernamental.",
        "sub_topics": [
          {
            "key": "pronunciamientos",
            "name": "Los Pronunciamientos Militares",
            "short_description": "Conocer cómo los militares derrocaban gobiernos.",
            "example_tasks": [
              "Explica qué era un pronunciamiento y cómo funcionaba",
              "Investiga cuántos presidentes tuvo México en sus primeras décadas y por qué cambiaban tanto",
              "Describe el papel del ejército en la política mexicana del siglo XIX"
            ]
          },
          {
            "key": "santa_anna",
            "name": "Antonio López de Santa Anna",
            "short_description": "Conocer al personaje más polémico del siglo XIX mexicano.",
            "example_tasks": [
              "Investiga quién fue Antonio López de Santa Anna y cuántas veces fue presidente",
              "Explica por qué Santa Anna es una figura controversial en la historia de México",
              "Describe algunos de los cambios políticos durante sus gobiernos"
            ]
          }
        ]
      },
      {
        "key": "perdidas_territoriales",
        "name": "Pérdidas Territoriales",
        "short_description": "Comprender cómo México perdió gran parte de su territorio.",
        "sub_topics": [
          {
            "key": "independencia_texas",
            "name": "La Independencia de Texas (1836)",
            "short_description": "Conocer la separación de Texas de México.",
            "example_tasks": [
              "Investiga las causas de la independencia de Texas en 1836",
              "Describe la Batalla del Álamo y su significado histórico",
              "Explica qué sucedió en la Batalla de San Jacinto donde Santa Anna fue derrotado y capturado"
            ]
          },
          {
            "key": "guerra_mexico_eu",
            "name": "La Guerra México-Estados Unidos (1846-1848)",
            "short_description": "Comprender la invasión estadounidense y sus consecuencias.",
            "example_tasks": [
              "Investiga las causas de la guerra entre México y Estados Unidos",
              "Describe batallas importantes como la defensa del Castillo de Chapultepec",
              "Explica qué territorios perdió México según el Tratado de Guadalupe Hidalgo"
            ]
          },
          {
            "key": "ninos_heroes",
            "name": "Los Niños Héroes",
            "short_description": "Valorar el heroísmo de los cadetes que defendieron Chapultepec.",
            "example_tasks": [
              "Investiga quiénes fueron los Niños Héroes del Castillo de Chapultepec",
              "Describe cómo defendieron los cadetes el castillo ante la invasión estadounidense",
              "Explica por qué su sacrificio es recordado en la historia mexicana"
            ]
          },
          {
            "key": "tratado_guadalupe_hidalgo",
            "name": "El Tratado de Guadalupe Hidalgo (1848)",
            "short_description": "Conocer las consecuencias del tratado de paz.",
            "example_tasks": [
              "Investiga qué territorios cedió México a Estados Unidos en el tratado",
              "Explica cuánto pagó Estados Unidos por los territorios anexados",
              "Describe cómo este tratado afectó al territorio y población de México"
            ]
          }
        ]
      },
      {
        "key": "problemas_economicos",
        "name": "Problemas Económicos",
        "short_description": "Comprender la crisis económica del México independiente.",
        "sub_topics": [
          {
            "key": "crisis_financiera",
            "name": "Crisis Financiera y Deuda",
            "short_description": "Conocer los problemas de deuda y bancarrota.",
            "example_tasks": [
              "Investiga por qué México tenía grandes deudas con países extranjeros",
              "Explica cómo la guerra de independencia destruyó la economía minera",
              "Describe los problemas de recaudación de impuestos del gobierno"
            ]
          },
          {
            "key": "deterioro_infraestructura",
            "name": "Deterioro de la Infraestructura",
            "short_description": "Comprender el abandono de caminos, minas y haciendas.",
            "example_tasks": [
              "Describe el estado de la economía mexicana después de años de guerras",
              "Investiga cómo la inestabilidad política impedía el desarrollo económico",
              "Explica las consecuencias sociales de la crisis económica"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "reforma_liberal",
    "name": "La Reforma Liberal",
    "short_description": "Estudio del movimiento liberal reformista, sus leyes y la guerra de Reforma (1854-1861).",
    "sub_topics": [
      {
        "key": "plan_ayutla",
        "name": "El Plan de Ayutla (1854)",
        "short_description": "Conocer el levantamiento que derrocó a Santa Anna.",
        "sub_topics": [
          {
            "key": "revolucion_ayutla",
            "name": "La Revolución de Ayutla",
            "short_description": "Comprender el movimiento contra la dictadura de Santa Anna.",
            "example_tasks": [
              "Investiga qué proponía el Plan de Ayutla proclamado en 1854",
              "Explica por qué los liberales se levantaron contra Santa Anna",
              "Describe cómo triunfó el movimiento y Santa Anna salió del país"
            ]
          }
        ]
      },
      {
        "key": "liberales_reformistas",
        "name": "Los Liberales Reformistas",
        "short_description": "Conocer a los líderes del movimiento de Reforma.",
        "sub_topics": [
          {
            "key": "benito_juarez",
            "name": "Benito Juárez",
            "short_description": "Valorar la figura de Juárez como líder reformista.",
            "example_tasks": [
              "Investiga quién fue Benito Juárez y cómo llegó a la presidencia",
              "Describe el origen indígena zapoteco de Juárez y su formación",
              "Explica por qué Juárez es considerado uno de los personajes más importantes de México"
            ]
          },
          {
            "key": "otros_liberales",
            "name": "Otros Líderes Liberales",
            "short_description": "Conocer a otros reformistas importantes.",
            "example_tasks": [
              "Menciona reformistas como Melchor Ocampo, Ignacio Ramírez, Guillermo Prieto",
              "Investiga las ideas liberales que defendían estos personajes",
              "Describe las contribuciones de cada uno a la Reforma"
            ]
          }
        ]
      },
      {
        "key": "leyes_reforma",
        "name": "Las Leyes de Reforma",
        "short_description": "Comprender las leyes que transformaron a México.",
        "sub_topics": [
          {
            "key": "ley_juarez",
            "name": "Ley Juárez (1855)",
            "short_description": "Conocer la ley que limitó los privilegios del clero y el ejército.",
            "example_tasks": [
              "Investiga qué establecía la Ley Juárez sobre los fueros eclesiásticos y militares",
              "Explica por qué esta ley causó conflicto con la Iglesia",
              "Describe el concepto de igualdad ante la ley propuesto"
            ]
          },
          {
            "key": "ley_lerdo",
            "name": "Ley Lerdo (1856)",
            "short_description": "Comprender la desamortización de bienes corporativos.",
            "example_tasks": [
              "Investiga qué proponía la Ley Lerdo sobre las propiedades de la Iglesia",
              "Explica cómo esta ley afectó también a las tierras comunales indígenas",
              "Describe las consecuencias no deseadas de esta ley"
            ]
          },
          {
            "key": "ley_iglesias",
            "name": "Ley Iglesias (1857)",
            "short_description": "Conocer la regulación de servicios parroquiales.",
            "example_tasks": [
              "Investiga qué establecía la Ley Iglesias sobre el cobro de servicios religiosos",
              "Explica cómo esta ley buscaba proteger a los pobres",
              "Describe la oposición de la Iglesia a esta ley"
            ]
          }
        ]
      },
      {
        "key": "constitucion_1857",
        "name": "La Constitución de 1857",
        "short_description": "Valorar la constitución liberal que rigió a México.",
        "sub_topics": [
          {
            "key": "principios_constitucion",
            "name": "Principios de la Constitución",
            "short_description": "Conocer los derechos y garantías establecidos.",
            "example_tasks": [
              "Investiga qué derechos individuales garantizaba la Constitución de 1857",
              "Explica los principios de libertad, igualdad y propiedad en la constitución",
              "Describe la división de poderes y el sistema federal establecido"
            ]
          },
          {
            "key": "oposicion_constitucion",
            "name": "Oposición Conservadora",
            "short_description": "Comprender el rechazo conservador y de la Iglesia.",
            "example_tasks": [
              "Investiga por qué los conservadores rechazaron la Constitución de 1857",
              "Explica cómo la Iglesia excomulgó a quienes juraran la constitución",
              "Describe las tensiones que llevaron a la Guerra de Reforma"
            ]
          }
        ]
      },
      {
        "key": "guerra_reforma",
        "name": "La Guerra de Reforma (1858-1861)",
        "short_description": "Comprender la guerra civil entre liberales y conservadores.",
        "sub_topics": [
          {
            "key": "inicio_guerra",
            "name": "Inicio del Conflicto",
            "short_description": "Conocer el Plan de Tacubaya y el inicio de la guerra.",
            "example_tasks": [
              "Investiga qué proponía el Plan de Tacubaya que inició la guerra",
              "Explica cómo México tuvo dos gobiernos: uno liberal y uno conservador",
              "Describe las principales zonas controladas por cada bando"
            ]
          },
          {
            "key": "desarrollo_guerra",
            "name": "Desarrollo de la Guerra",
            "short_description": "Conocer las batallas y cambios de la guerra civil.",
            "example_tasks": [
              "Menciona batallas importantes de la Guerra de Reforma",
              "Investiga cómo se financiaban ambos bandos durante la guerra",
              "Describe las dificultades que enfrentó el gobierno de Juárez"
            ]
          },
          {
            "key": "triunfo_liberal",
            "name": "Triunfo Liberal (1861)",
            "short_description": "Comprender la victoria de los liberales.",
            "example_tasks": [
              "Investiga cómo los liberales lograron derrotar a los conservadores",
              "Explica qué pasó cuando Juárez regresó a la Ciudad de México en 1861",
              "Describe las leyes adicionales de Reforma promulgadas durante la guerra"
            ]
          }
        ]
      },
      {
        "key": "consecuencias_reforma",
        "name": "Consecuencias de la Reforma",
        "short_description": "Comprender los cambios que trajo el movimiento reformista.",
        "sub_topics": [
          {
            "key": "separacion_iglesia_estado",
            "name": "Separación Iglesia-Estado",
            "short_description": "Reconocer la secularización del Estado mexicano.",
            "example_tasks": [
              "Explica qué significa la separación entre Iglesia y Estado",
              "Investiga cómo cambió el papel de la Iglesia en la sociedad mexicana",
              "Describe la nacionalización de los bienes eclesiásticos"
            ]
          },
          {
            "key": "modernizacion_estado",
            "name": "Modernización del Estado",
            "short_description": "Comprender las transformaciones institucionales.",
            "example_tasks": [
              "Menciona instituciones modernas creadas por los liberales",
              "Investiga cómo se estableció el Registro Civil para nacimientos, matrimonios y defunciones",
              "Describe la importancia de la educación laica promovida por los reformistas"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "intervencion_francesa_segundo_imperio",
    "name": "La Intervención Francesa y el Segundo Imperio",
    "short_description": "Estudio de la invasión francesa, el imperio de Maximiliano y la Restauración de la República (1862-1867).",
    "sub_topics": [
      {
        "key": "causas_intervencion",
        "name": "Causas de la Intervención Francesa",
        "short_description": "Comprender las razones de la invasión.",
        "sub_topics": [
          {
            "key": "deuda_externa",
            "name": "La Deuda Externa",
            "short_description": "Conocer el problema de la deuda con países europeos.",
            "example_tasks": [
              "Investiga por qué México debía dinero a Francia, España e Inglaterra",
              "Explica qué hizo Juárez al suspender el pago de la deuda en 1861",
              "Describe la reacción de los países europeos ante esta suspensión"
            ]
          },
          {
            "key": "convenio_londres",
            "name": "El Convenio de Londres",
            "short_description": "Conocer el acuerdo de las potencias europeas.",
            "example_tasks": [
              "Investiga qué establecía el Convenio de Londres entre Francia, España e Inglaterra",
              "Explica por qué España e Inglaterra se retiraron después de negociar",
              "Describe las verdaderas intenciones de Francia de establecer un imperio"
            ]
          }
        ]
      },
      {
        "key": "resistencia_mexicana",
        "name": "La Resistencia Mexicana",
        "short_description": "Conocer la defensa contra la invasión francesa.",
        "sub_topics": [
          {
            "key": "batalla_cinco_mayo",
            "name": "La Batalla del 5 de Mayo de 1862",
            "short_description": "Valorar la victoria mexicana en Puebla.",
            "example_tasks": [
              "Investiga qué sucedió en la Batalla de Puebla el 5 de mayo de 1862",
              "Describe el papel del general Ignacio Zaragoza en la victoria",
              "Explica la importancia simbólica de esta batalla aunque no detuvo la invasión"
            ]
          },
          {
            "key": "avance_frances",
            "name": "El Avance Francés",
            "short_description": "Comprender cómo los franceses ocuparon México.",
            "example_tasks": [
              "Investiga cómo los franceses finalmente tomaron Puebla en 1863",
              "Describe la entrada del ejército francés a la Ciudad de México",
              "Explica cómo Juárez se retiró al norte para continuar la resistencia"
            ]
          }
        ]
      },
      {
        "key": "segundo_imperio",
        "name": "El Segundo Imperio Mexicano",
        "short_description": "Estudio del gobierno de Maximiliano de Habsburgo.",
        "sub_topics": [
          {
            "key": "maximiliano_emperador",
            "name": "Maximiliano y Carlota",
            "short_description": "Conocer a los emperadores impuestos por Francia.",
            "example_tasks": [
              "Investiga quiénes eran Maximiliano de Habsburgo y Carlota de Bélgica",
              "Explica cómo fue ofrecida la corona mexicana a Maximiliano",
              "Describe la llegada de los emperadores a México en 1864"
            ]
          },
          {
            "key": "gobierno_maximiliano",
            "name": "El Gobierno de Maximiliano",
            "short_description": "Comprender las políticas del imperio.",
            "example_tasks": [
              "Investiga qué políticas liberales adoptó Maximiliano sorprendiendo a los conservadores",
              "Explica por qué Maximiliano respetó algunas Leyes de Reforma",
              "Describe los problemas que enfrentó Maximiliano con los conservadores que lo apoyaron"
            ]
          },
          {
            "key": "resistencia_juarista",
            "name": "La Resistencia Republicana de Juárez",
            "short_description": "Conocer cómo Juárez mantuvo la lucha.",
            "example_tasks": [
              "Investiga cómo Juárez organizó la resistencia desde el norte del país",
              "Explica el lema de Juárez: 'El respeto al derecho ajeno es la paz'",
              "Describe el apoyo popular que mantuvo Juárez durante el imperio"
            ]
          }
        ]
      },
      {
        "key": "caida_imperio",
        "name": "La Caída del Segundo Imperio",
        "short_description": "Comprender el fin del imperio y la Restauración de la República.",
        "sub_topics": [
          {
            "key": "retiro_franceses",
            "name": "Retiro de las Tropas Francesas",
            "short_description": "Conocer por qué Francia abandonó a Maximiliano.",
            "example_tasks": [
              "Investiga por qué Napoleón III retiró sus tropas de México en 1866",
              "Explica la presión de Estados Unidos para que Francia abandonara México",
              "Describe cómo el retiro francés debilitó al imperio"
            ]
          },
          {
            "key": "sitio_queretaro",
            "name": "El Sitio de Querétaro",
            "short_description": "Conocer la última resistencia imperial.",
            "example_tasks": [
              "Investiga cómo las fuerzas republicanas sitiaron Querétaro en 1867",
              "Describe la captura de Maximiliano en el Cerro de las Campanas",
              "Explica qué sucedió con Carlota cuando el imperio cayó"
            ]
          },
          {
            "key": "fusilamiento_maximiliano",
            "name": "Fusilamiento de Maximiliano",
            "short_description": "Comprender la ejecución del emperador.",
            "example_tasks": [
              "Investiga por qué Juárez decidió fusilar a Maximiliano a pesar de las peticiones internacionales",
              "Describe el fusilamiento de Maximiliano, Miramón y Mejía el 19 de junio de 1867",
              "Explica el significado político de esta ejecución para afirmar la soberanía"
            ]
          },
          {
            "key": "restauracion_republica",
            "name": "La Restauración de la República",
            "short_description": "Reconocer el retorno del gobierno republicano.",
            "example_tasks": [
              "Investiga cómo Juárez regresó a la Ciudad de México en julio de 1867",
              "Explica qué significó la Restauración de la República para México",
              "Describe los desafíos que enfrentó el país después de años de guerra"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "porfiriato",
    "name": "El Porfiriato",
    "short_description": "Estudio del largo gobierno de Porfirio Díaz, la modernización económica y las desigualdades sociales (1876-1911).",
    "sub_topics": [
      {
        "key": "ascenso_porfirio_diaz",
        "name": "El Ascenso de Porfirio Díaz",
        "short_description": "Conocer cómo Díaz llegó al poder.",
        "sub_topics": [
          {
            "key": "plan_tuxtepec",
            "name": "El Plan de Tuxtepec (1876)",
            "short_description": "Comprender la rebelión que llevó a Díaz a la presidencia.",
            "example_tasks": [
              "Investiga qué proponía el Plan de Tuxtepec proclamado por Porfirio Díaz",
              "Explica por qué Díaz se rebeló contra el presidente Sebastián Lerdo de Tejada",
              "Describe la ironía de que Díaz se opusiera a la reelección y luego se reeligiera múltiples veces"
            ]
          },
          {
            "key": "porfirio_diaz_personaje",
            "name": "Porfirio Díaz: El Personaje",
            "short_description": "Conocer la trayectoria militar y política de Díaz.",
            "example_tasks": [
              "Investiga la carrera militar de Porfirio Díaz durante la Reforma y contra la Intervención",
              "Describe cómo Díaz pasó de ser un héroe liberal a un dictador",
              "Explica cuántos años gobernó Porfirio Díaz a México"
            ]
          }
        ]
      },
      {
        "key": "sistema_politico_porfirista",
        "name": "El Sistema Político Porfirista",
        "short_description": "Comprender cómo funcionaba la dictadura de Díaz.",
        "sub_topics": [
          {
            "key": "lema_pax_porfiriana",
            "name": "Lema: 'Orden y Progreso'",
            "short_description": "Conocer la justificación ideológica del régimen.",
            "example_tasks": [
              "Explica qué significaba el lema 'Orden y Progreso' del Porfiriato",
              "Investiga cómo Díaz justificaba su permanencia en el poder",
              "Describe la 'Pax Porfiriana' como periodo de estabilidad sin libertades"
            ]
          },
          {
            "key": "control_politico",
            "name": "Control Político y Represión",
            "short_description": "Comprender los métodos de control del régimen.",
            "example_tasks": [
              "Investiga cómo Díaz controlaba las elecciones y eliminaba la oposición",
              "Explica qué eran los 'pan o palo' como métodos de control",
              "Describe el papel de los rurales en mantener el orden porfirista"
            ]
          },
          {
            "key": "cientificos",
            "name": "Los Científicos",
            "short_description": "Conocer al grupo de asesores de Díaz.",
            "example_tasks": [
              "Investiga quiénes eran los 'Científicos' y qué ideas promovían",
              "Explica cómo los Científicos aplicaban el positivismo al gobierno de México",
              "Describe la influencia de este grupo en las políticas económicas"
            ]
          }
        ]
      },
      {
        "key": "modernizacion_economica",
        "name": "Modernización Económica",
        "short_description": "Conocer el desarrollo económico durante el Porfiriato.",
        "sub_topics": [
          {
            "key": "ferrocarriles",
            "name": "Construcción de Ferrocarriles",
            "short_description": "Reconocer la expansión de la red ferroviaria.",
            "example_tasks": [
              "Investiga cuántos kilómetros de vías férreas se construyeron durante el Porfiriato",
              "Explica la importancia de los ferrocarriles para la economía mexicana",
              "Describe cómo los ferrocarriles conectaron al país pero favorecieron el comercio exterior"
            ]
          },
          {
            "key": "inversion_extranjera",
            "name": "Inversión Extranjera",
            "short_description": "Comprender el papel del capital extranjero.",
            "example_tasks": [
              "Investiga qué sectores de la economía controlaban empresas extranjeras",
              "Explica las concesiones otorgadas a empresas estadounidenses, inglesas y francesas",
              "Describe las ventajas y desventajas de la inversión extranjera"
            ]
          },
          {
            "key": "mineria_petroleo",
            "name": "Minería y Petróleo",
            "short_description": "Conocer la explotación de recursos naturales.",
            "example_tasks": [
              "Investiga el desarrollo de la industria minera durante el Porfiriato",
              "Explica cómo comenzó la explotación petrolera en México",
              "Describe quiénes eran los dueños de las empresas mineras y petroleras"
            ]
          },
          {
            "key": "industria_comercio",
            "name": "Industria y Comercio",
            "short_description": "Reconocer el crecimiento industrial limitado.",
            "example_tasks": [
              "Menciona industrias que se desarrollaron como textiles, tabaco y alimentos",
              "Investiga cómo el desarrollo industrial benefició principalmente a extranjeros y élites",
              "Describe el crecimiento del comercio exterior durante este periodo"
            ]
          }
        ]
      },
      {
        "key": "desigualdad_social_porfiriato",
        "name": "Desigualdad Social",
        "short_description": "Comprender las profundas desigualdades del régimen porfirista.",
        "sub_topics": [
          {
            "key": "concentracion_tierra",
            "name": "Concentración de la Tierra",
            "short_description": "Conocer el despojo de tierras a comunidades.",
            "example_tasks": [
              "Investiga cómo las haciendas crecieron a costa de las tierras comunales indígenas",
              "Explica qué eran las compañías deslindadoras y cómo facilitaron el despojo",
              "Describe el porcentaje de población que no tenía tierras al final del Porfiriato"
            ]
          },
          {
            "key": "condiciones_trabajadores",
            "name": "Condiciones de Trabajadores",
            "short_description": "Comprender la explotación laboral.",
            "example_tasks": [
              "Describe las condiciones de trabajo en haciendas, minas y fábricas durante el Porfiriato",
              "Investiga las jornadas laborales, salarios y tiendas de raya",
              "Explica cómo funcionaba el sistema de endeudamiento de los peones"
            ]
          },
          {
            "key": "huelgas_obreras",
            "name": "Huelgas Obreras",
            "short_description": "Conocer las protestas laborales reprimidas.",
            "example_tasks": [
              "Investiga qué sucedió en la huelga de Cananea en 1906",
              "Describe la represión de la huelga de Río Blanco en 1907",
              "Explica cómo estas huelgas mostraron el descontento social"
            ]
          }
        ]
      },
      {
        "key": "cultura_porfiriato",
        "name": "Cultura y Sociedad Porfiriana",
        "short_description": "Conocer las manifestaciones culturales y la vida social.",
        "sub_topics": [
          {
            "key": "afrancesamiento",
            "name": "El Afrancesamiento",
            "short_description": "Comprender la imitación de modelos franceses.",
            "example_tasks": [
              "Investiga cómo la élite porfiriana imitaba costumbres y modas francesas",
              "Describe la transformación de la Ciudad de México al estilo parisino",
              "Explica la construcción de edificios como el Palacio de Bellas Artes"
            ]
          },
          {
            "key": "educacion_cultura",
            "name": "Educación y Cultura",
            "short_description": "Reconocer avances limitados en educación.",
            "example_tasks": [
              "Investiga el papel de Justo Sierra en la educación porfiriana",
              "Explica por qué la mayoría de la población seguía siendo analfabeta",
              "Describe el contraste entre la cultura de élite y la popular"
            ]
          }
        ]
      },
      {
        "key": "oposicion_porfiriato",
        "name": "Oposición al Porfiriato",
        "short_description": "Conocer los movimientos que se oponían a la dictadura.",
        "sub_topics": [
          {
            "key": "hermanos_flores_magon",
            "name": "Los Hermanos Flores Magón",
            "short_description": "Reconocer la oposición anarquista.",
            "example_tasks": [
              "Investiga quiénes fueron Ricardo y Enrique Flores Magón",
              "Explica qué era el periódico 'Regeneración' y sus críticas al régimen",
              "Describe las ideas anarquistas del magonismo"
            ]
          },
          {
            "key": "madero_oposicion",
            "name": "Francisco I. Madero y la Oposición Política",
            "short_description": "Conocer al líder que desafió a Díaz.",
            "example_tasks": [
              "Investiga quién era Francisco I. Madero y qué proponía",
              "Explica qué decía el libro 'La sucesión presidencial en 1910'",
              "Describe la formación del Partido Antirreeleccionista"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "revolucion_mexicana",
    "name": "La Revolución Mexicana",
    "short_description": "Estudio del movimiento armado que transformó a México entre 1910 y 1920, sus líderes, etapas y logros.",
    "sub_topics": [
      {
        "key": "inicio_revolucion",
        "name": "Inicio de la Revolución (1910)",
        "short_description": "Conocer los acontecimientos que iniciaron el movimiento revolucionario.",
        "sub_topics": [
          {
            "key": "elecciones_1910",
            "name": "Las Elecciones de 1910",
            "short_description": "Comprender el fraude electoral que desencadenó la revolución.",
            "example_tasks": [
              "Investiga cómo Porfirio Díaz encarceló a Francisco I. Madero durante las elecciones",
              "Explica cómo Díaz se declaró ganador de las elecciones fraudulentas",
              "Describe la indignación popular ante el fraude electoral"
            ]
          },
          {
            "key": "plan_san_luis",
            "name": "El Plan de San Luis (5 de octubre de 1910)",
            "short_description": "Conocer el llamado a la insurrección armada.",
            "example_tasks": [
              "Investiga qué proponía el Plan de San Luis proclamado por Madero desde Texas",
              "Explica por qué Madero llamaba a levantarse en armas el 20 de noviembre de 1910",
              "Describe las principales demandas del plan: sufragio efectivo y no reelección"
            ]
          },
          {
            "key": "levantamientos_armados",
            "name": "Los Levantamientos Armados",
            "short_description": "Reconocer el inicio de la lucha armada en varias regiones.",
            "example_tasks": [
              "Investiga cómo diferentes grupos se levantaron en armas en noviembre de 1910",
              "Menciona levantamientos en Chihuahua, Puebla y otras regiones",
              "Describe cómo creció el movimiento revolucionario en los primeros meses"
            ]
          }
        ]
      },
      {
        "key": "lideres_revolucionarios",
        "name": "Líderes Revolucionarios",
        "short_description": "Conocer a los principales jefes de la Revolución.",
        "sub_topics": [
          {
            "key": "francisco_villa",
            "name": "Francisco Villa: El Centauro del Norte",
            "short_description": "Valorar el liderazgo de Villa en el norte.",
            "example_tasks": [
              "Investiga quién fue Francisco Villa (Doroteo Arango) y cómo se unió a la Revolución",
              "Describe la formación de la División del Norte bajo el mando de Villa",
              "Explica por qué Villa era popular entre los campesinos del norte"
            ]
          },
          {
            "key": "emiliano_zapata",
            "name": "Emiliano Zapata: Caudillo del Sur",
            "short_description": "Reconocer la lucha zapatista por la tierra.",
            "example_tasks": [
              "Investiga quién fue Emiliano Zapata y por qué luchaba",
              "Explica el lema zapatista: 'Tierra y Libertad'",
              "Describe el arraigo de Zapata en las comunidades campesinas de Morelos"
            ]
          },
          {
            "key": "otros_lideres",
            "name": "Otros Líderes Revolucionarios",
            "short_description": "Conocer a otros jefes revolucionarios.",
            "example_tasks": [
              "Menciona líderes como Pascual Orozco, Álvaro Obregón, Venustiano Carranza",
              "Investiga las diferencias entre los grupos revolucionarios",
              "Describe cómo cada líder representaba intereses de diferentes grupos sociales"
            ]
          }
        ]
      },
      {
        "key": "renuncia_diaz",
        "name": "La Renuncia de Porfirio Díaz",
        "short_description": "Comprender el triunfo del movimiento maderista.",
        "sub_topics": [
          {
            "key": "tratados_ciudad_juarez",
            "name": "Los Tratados de Ciudad Juárez (1911)",
            "short_description": "Conocer el acuerdo que puso fin al Porfiriato.",
            "example_tasks": [
              "Investiga qué establecían los Tratados de Ciudad Juárez firmados en mayo de 1911",
              "Explica cómo estos tratados forzaron la renuncia de Porfirio Díaz",
              "Describe la salida de Díaz al exilio en Francia"
            ]
          },
          {
            "key": "gobierno_madero",
            "name": "El Gobierno de Madero",
            "short_description": "Comprender la presidencia democrática de Madero.",
            "example_tasks": [
              "Investiga cómo Francisco I. Madero llegó a la presidencia en 1911",
              "Explica los principios democráticos que Madero intentó implementar",
              "Describe los problemas que enfrentó Madero desde diferentes sectores"
            ]
          }
        ]
      },
      {
        "key": "plan_ayala",
        "name": "El Plan de Ayala",
        "short_description": "Conocer el programa agrario zapatista.",
        "sub_topics": [
          {
            "key": "demandas_zapatistas",
            "name": "Las Demandas Agrarias",
            "short_description": "Comprender la exigencia de restitución de tierras.",
            "example_tasks": [
              "Investiga qué proponía el Plan de Ayala proclamado por Zapata en 1911",
              "Explica por qué Zapata se levantó contra Madero",
              "Describe las demandas de devolución de tierras a las comunidades"
            ]
          }
        ]
      },
      {
        "key": "decena_tragica",
        "name": "La Decena Trágica",
        "short_description": "Comprender el golpe de estado contra Madero.",
        "sub_topics": [
          {
            "key": "golpe_estado_huerta",
            "name": "El Golpe de Estado de Victoriano Huerta",
            "short_description": "Conocer la traición y asesinato de Madero.",
            "example_tasks": [
              "Investiga qué sucedió durante los diez días de febrero de 1913 llamados la Decena Trágica",
              "Explica cómo el general Victoriano Huerta traicionó a Madero",
              "Describe el asesinato de Madero y el vicepresidente Pino Suárez"
            ]
          },
          {
            "key": "usurpacion_huerta",
            "name": "La Usurpación de Huerta",
            "short_description": "Comprender la dictadura de Huerta.",
            "example_tasks": [
              "Investiga cómo Huerta se proclamó presidente ilegalmente",
              "Explica por qué el gobierno de Huerta es llamado 'usurpación'",
              "Describe la represión del gobierno huertista"
            ]
          }
        ]
      },
      {
        "key": "lucha_constitucionalista",
        "name": "La Lucha Constitucionalista",
        "short_description": "Conocer el movimiento para derrocar a Huerta.",
        "sub_topics": [
          {
            "key": "plan_guadalupe",
            "name": "El Plan de Guadalupe",
            "short_description": "Reconocer el levantamiento contra Huerta.",
            "example_tasks": [
              "Investiga qué proponía el Plan de Guadalupe proclamado por Carranza en 1913",
              "Explica cómo se formó el Ejército Constitucionalista",
              "Describe la alianza de Villa, Zapata, Obregón y Carranza contra Huerta"
            ]
          },
          {
            "key": "caida_huerta",
            "name": "La Caída de Huerta (1914)",
            "short_description": "Comprender la derrota del usurpador.",
            "example_tasks": [
              "Investiga las batallas que llevaron a la derrota de Huerta",
              "Explica cómo la intervención estadounidense en Veracruz afectó a Huerta",
              "Describe la renuncia y huida de Huerta en julio de 1914"
            ]
          }
        ]
      },
      {
        "key": "lucha_entre_revolucionarios",
        "name": "La Lucha entre Revolucionarios",
        "short_description": "Comprender el conflicto entre facciones revolucionarias.",
        "sub_topics": [
          {
            "key": "convencion_aguascalientes",
            "name": "La Convención de Aguascalientes",
            "short_description": "Conocer el intento de unificar a los revolucionarios.",
            "example_tasks": [
              "Investiga qué fue la Convención de Aguascalientes de 1914",
              "Explica las diferencias entre villistas-zapatistas y carrancistas",
              "Describe cómo la Convención fracasó en unificar a los revolucionarios"
            ]
          },
          {
            "key": "villa_zapata_ciudad_mexico",
            "name": "Villa y Zapata en la Ciudad de México",
            "short_description": "Conocer el encuentro histórico de los caudillos.",
            "example_tasks": [
              "Investiga el encuentro entre Villa y Zapata en la Ciudad de México en diciembre de 1914",
              "Describe la famosa fotografía de Villa y Zapata en la silla presidencial",
              "Explica por qué ninguno de los dos quiso asumir la presidencia"
            ]
          },
          {
            "key": "triunfo_carrancistas",
            "name": "El Triunfo Carrancista",
            "short_description": "Comprender la victoria de Carranza.",
            "example_tasks": [
              "Investiga cómo Carranza y Obregón derrotaron militarmente a Villa y Zapata",
              "Explica las batallas de Celaya donde Obregón venció a Villa",
              "Describe cómo Carranza consolidó su poder en 1915-1916"
            ]
          }
        ]
      },
      {
        "key": "constitucion_1917",
        "name": "La Constitución de 1917",
        "short_description": "Valorar la constitución que plasmó los ideales revolucionarios.",
        "sub_topics": [
          {
            "key": "congreso_constituyente",
            "name": "El Congreso Constituyente",
            "short_description": "Conocer la creación de la nueva constitución.",
            "example_tasks": [
              "Investiga cómo se convocó al Congreso Constituyente en Querétaro",
              "Explica quiénes participaron en la redacción de la constitución",
              "Describe los debates entre moderados y radicales en el Congreso"
            ]
          },
          {
            "key": "articulos_fundamentales",
            "name": "Artículos Fundamentales",
            "short_description": "Comprender los artículos más importantes.",
            "example_tasks": [
              "Investiga qué establece el Artículo 3° sobre educación laica, gratuita y obligatoria",
              "Explica qué garantiza el Artículo 27 sobre propiedad de tierras y recursos naturales",
              "Describe qué derechos laborales protege el Artículo 123"
            ]
          },
          {
            "key": "importancia_constitucion",
            "name": "Importancia de la Constitución",
            "short_description": "Valorar la constitución como logro revolucionario.",
            "example_tasks": [
              "Explica por qué la Constitución de 1917 fue avanzada para su época",
              "Investiga cómo la constitución recogió las demandas de campesinos y obreros",
              "Describe por qué esta constitución sigue vigente en México hasta hoy (con reformas)"
            ]
          }
        ]
      },
      {
        "key": "fin_revolucion",
        "name": "El Fin de la Etapa Armada",
        "short_description": "Comprender el final del conflicto armado.",
        "sub_topics": [
          {
            "key": "asesinato_zapata",
            "name": "Asesinato de Emiliano Zapata (1919)",
            "short_description": "Conocer la traición y muerte de Zapata.",
            "example_tasks": [
              "Investiga cómo fue asesinado Zapata en la Hacienda de Chinameca",
              "Explica la traición del coronel Jesús Guajardo",
              "Describe el impacto de la muerte de Zapata en el movimiento campesino"
            ]
          },
          {
            "key": "muerte_carranza",
            "name": "Muerte de Carranza (1920)",
            "short_description": "Conocer el fin del gobierno carrancista.",
            "example_tasks": [
              "Investiga cómo Carranza fue asesinado en Tlaxcalaltongo",
              "Explica qué fue el Plan de Agua Prieta contra Carranza",
              "Describe cómo Obregón llegó al poder después de Carranza"
            ]
          },
          {
            "key": "muerte_villa",
            "name": "Asesinato de Francisco Villa (1923)",
            "short_description": "Conocer la muerte del último gran caudillo.",
            "example_tasks": [
              "Investiga cómo fue asesinado Villa en Parral, Chihuahua",
              "Explica las circunstancias del asesinato de Villa cuando se había retirado",
              "Describe el legado de Villa como líder revolucionario"
            ]
          }
        ]
      },
      {
        "key": "consecuencias_revolucion",
        "name": "Consecuencias de la Revolución",
        "short_description": "Comprender los cambios que trajo la Revolución.",
        "sub_topics": [
          {
            "key": "transformacion_social",
            "name": "Transformación Social",
            "short_description": "Reconocer los cambios en la estructura social.",
            "example_tasks": [
              "Investiga cómo la Revolución terminó con el poder de las élites porfiristas",
              "Explica el surgimiento de nuevos grupos sociales y políticos",
              "Describe cómo mejoró la situación de campesinos y obreros"
            ]
          },
          {
            "key": "reformas_tierra",
            "name": "Reforma Agraria",
            "short_description": "Comprender el reparto de tierras.",
            "example_tasks": [
              "Investiga cómo comenzó el reparto de tierras después de la Revolución",
              "Explica qué son los ejidos creados por la reforma agraria",
              "Describe el impacto del reparto agrario en las comunidades campesinas"
            ]
          },
          {
            "key": "nacionalismo_cultural",
            "name": "Nacionalismo y Cultura",
            "short_description": "Reconocer el renacimiento cultural mexicano.",
            "example_tasks": [
              "Investiga el movimiento muralista con Diego Rivera, Orozco y Siqueiros",
              "Explica cómo la Revolución inspiró nuevas expresiones artísticas y culturales",
              "Describe la valorización de las raíces indígenas y mestizas de México"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "reconstruccion_nacional",
    "name": "La Reconstrucción Nacional",
    "short_description": "Estudio del periodo de reorganización y construcción institucional después de la Revolución (1920-1940).",
    "sub_topics": [
      {
        "key": "gobiernos_sonorenses",
        "name": "Los Gobiernos Sonorenses",
        "short_description": "Conocer los gobiernos de Obregón y Calles.",
        "sub_topics": [
          {
            "key": "gobierno_obregon",
            "name": "El Gobierno de Álvaro Obregón (1920-1924)",
            "short_description": "Comprender el inicio de la reconstrucción.",
            "example_tasks": [
              "Investiga las principales acciones del gobierno de Obregón",
              "Explica cómo Obregón buscó la pacificación del país",
              "Describe el impulso a la educación con José Vasconcelos como secretario"
            ]
          },
          {
            "key": "vasconcelos_educacion",
            "name": "José Vasconcelos y la Educación",
            "short_description": "Valorar la campaña educativa posrevolucionaria.",
            "example_tasks": [
              "Investiga la campaña de alfabetización impulsada por Vasconcelos",
              "Explica el lema 'Por mi raza hablará el espíritu' de la UNAM",
              "Describe cómo Vasconcelos promovió el muralismo y la cultura popular"
            ]
          },
          {
            "key": "gobierno_calles",
            "name": "El Gobierno de Plutarco Elías Calles (1924-1928)",
            "short_description": "Conocer las reformas del callismo.",
            "example_tasks": [
              "Investiga las políticas económicas y sociales de Calles",
              "Explica la creación del Banco de México en 1925",
              "Describe el inicio de la institucionalización del país"
            ]
          }
        ]
      },
      {
        "key": "guerra_cristera",
        "name": "La Guerra Cristera",
        "short_description": "Comprender el conflicto religioso entre Iglesia y Estado.",
        "sub_topics": [
          {
            "key": "conflicto_religioso",
            "name": "El Conflicto entre Estado e Iglesia",
            "short_description": "Conocer las causas del levantamiento cristero.",
            "example_tasks": [
              "Investiga cómo la aplicación de artículos anticlericales provocó tensión",
              "Explica qué era la Ley Calles que limitaba el culto religioso",
              "Describe la reacción de los católicos ante las restricciones"
            ]
          },
          {
            "key": "levantamiento_cristero",
            "name": "El Levantamiento Armado (1926-1929)",
            "short_description": "Comprender la guerra cristera.",
            "example_tasks": [
              "Investiga cómo se desarrolló la guerra cristera principalmente en el occidente de México",
              "Explica el grito de los cristeros: '¡Viva Cristo Rey!'",
              "Describe cómo terminó el conflicto con los Arreglos de 1929"
            ]
          }
        ]
      },
      {
        "key": "maximato",
        "name": "El Maximato",
        "short_description": "Conocer el periodo de control de Calles detrás del poder.",
        "sub_topics": [
          {
            "key": "jefe_maximo",
            "name": "Calles como 'Jefe Máximo'",
            "short_description": "Comprender el control político de Calles.",
            "example_tasks": [
              "Investiga cómo Calles controló a los presidentes entre 1928 y 1934",
              "Explica por qué este periodo se llama Maximato",
              "Describe a los presidentes títere del Maximato"
            ]
          },
          {
            "key": "creacion_pnr",
            "name": "Creación del PNR (1929)",
            "short_description": "Conocer el origen del partido oficial.",
            "example_tasks": [
              "Investiga la fundación del Partido Nacional Revolucionario (PNR)",
              "Explica cómo el PNR institucionalizó el poder revolucionario",
              "Describe la evolución del PNR al PRM y luego al PRI"
            ]
          }
        ]
      },
      {
        "key": "cardenismo",
        "name": "El Cardenismo",
        "short_description": "Estudio del gobierno nacionalista y reformista de Lázaro Cárdenas.",
        "sub_topics": [
          {
            "key": "gobierno_cardenas",
            "name": "El Gobierno de Lázaro Cárdenas (1934-1940)",
            "short_description": "Comprender las reformas cardenistas.",
            "example_tasks": [
              "Investiga cómo Cárdenas se independizó del control de Calles",
              "Explica el exilio de Calles y el fin del Maximato",
              "Describe el carácter popular y nacionalista del gobierno cardenista"
            ]
          },
          {
            "key": "reforma_agraria_cardenas",
            "name": "Reforma Agraria Cardenista",
            "short_description": "Reconocer el mayor reparto de tierras de la historia.",
            "example_tasks": [
              "Investiga cuántas hectáreas repartió Cárdenas a los campesinos",
              "Explica la creación de ejidos colectivos durante el cardenismo",
              "Describe el impacto social del reparto agrario más extenso"
            ]
          },
          {
            "key": "expropiacion_petrolera",
            "name": "La Expropiación Petrolera (18 de marzo de 1938)",
            "short_description": "Valorar la nacionalización del petróleo.",
            "example_tasks": [
              "Investiga por qué Cárdenas decidió expropiar las compañías petroleras extranjeras",
              "Explica la reacción popular de apoyo a la expropiación",
              "Describe cómo se creó Petróleos Mexicanos (PEMEX) como empresa estatal"
            ]
          },
          {
            "key": "educacion_socialista",
            "name": "Educación Socialista",
            "short_description": "Conocer la reforma educativa cardenista.",
            "example_tasks": [
              "Investiga qué era la educación socialista promovida por Cárdenas",
              "Explica el énfasis en la educación rural y técnica",
              "Describe la construcción de escuelas en comunidades rurales"
            ]
          },
          {
            "key": "apoyo_republicanos_espanoles",
            "name": "Apoyo a los Republicanos Españoles",
            "short_description": "Reconocer el asilo a refugiados de la Guerra Civil Española.",
            "example_tasks": [
              "Investiga cómo México recibió a miles de refugiados españoles",
              "Explica el apoyo de Cárdenas a la República Española",
              "Describe las contribuciones de los exiliados españoles a México"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "mexico_siglo_xx",
    "name": "México en el Siglo XX",
    "short_description": "Estudio del desarrollo político, económico y social de México desde 1940 hasta finales del siglo XX.",
    "sub_topics": [
      {
        "key": "milagro_mexicano",
        "name": "El Milagro Mexicano (1940-1970)",
        "short_description": "Conocer el periodo de crecimiento económico sostenido.",
        "sub_topics": [
          {
            "key": "industrializacion",
            "name": "Industrialización y Urbanización",
            "short_description": "Comprender la transformación económica.",
            "example_tasks": [
              "Investiga cómo México pasó de ser rural a urbano durante este periodo",
              "Explica el modelo de sustitución de importaciones",
              "Describe el crecimiento de ciudades como México, Guadalajara y Monterrey"
            ]
          },
          {
            "key": "estabilidad_politica",
            "name": "Estabilidad Política",
            "short_description": "Reconocer el sistema de partido hegemónico.",
            "example_tasks": [
              "Investiga cómo el PRI dominó la política mexicana por décadas",
              "Explica el sistema presidencialista fuerte del siglo XX",
              "Describe la alternancia ordenada de presidentes priistas"
            ]
          }
        ]
      },
      {
        "key": "movimiento_1968",
        "name": "El Movimiento Estudiantil de 1968",
        "short_description": "Comprender la lucha por la democracia y la represión.",
        "sub_topics": [
          {
            "key": "demandas_estudiantiles",
            "name": "Las Demandas Estudiantiles",
            "short_description": "Conocer las peticiones del movimiento.",
            "example_tasks": [
              "Investiga qué pedían los estudiantes en las manifestaciones de 1968",
              "Explica el contexto de movimientos juveniles en el mundo",
              "Describe la represión contra el movimiento estudiantil"
            ]
          },
          {
            "key": "tlatelolco",
            "name": "La Masacre de Tlatelolco (2 de octubre)",
            "short_description": "Conocer la trágica represión del movimiento.",
            "example_tasks": [
              "Investiga qué sucedió en la Plaza de las Tres Culturas el 2 de octubre de 1968",
              "Explica el impacto de esta masacre en la sociedad mexicana",
              "Describe cómo este acontecimiento es recordado en la memoria histórica"
            ]
          }
        ]
      },
      {
        "key": "crisis_economicas",
        "name": "Crisis Económicas",
        "short_description": "Comprender las crisis que afectaron a México.",
        "sub_topics": [
          {
            "key": "crisis_1982",
            "name": "La Crisis de 1982",
            "short_description": "Conocer la crisis de la deuda y sus consecuencias.",
            "example_tasks": [
              "Investiga qué causó la crisis económica de 1982",
              "Explica la nacionalización de la banca por López Portillo",
              "Describe el impacto social de la crisis: inflación y desempleo"
            ]
          },
          {
            "key": "neoliberalismo",
            "name": "Políticas Neoliberales",
            "short_description": "Comprender el cambio de modelo económico.",
            "example_tasks": [
              "Investiga qué son las políticas neoliberales adoptadas desde los 80",
              "Explica la privatización de empresas estatales",
              "Describe la apertura comercial y el TLCAN (1994)"
            ]
          }
        ]
      },
      {
        "key": "transicion_democratica",
        "name": "La Transición Democrática",
        "short_description": "Conocer el proceso hacia la alternancia política.",
        "sub_topics": [
          {
            "key": "reformas_electorales",
            "name": "Reformas Electorales",
            "short_description": "Comprender los cambios hacia elecciones más limpias.",
            "example_tasks": [
              "Investiga las reformas electorales que hicieron más competitivas las elecciones",
              "Explica la creación del IFE (ahora INE) como organismo autónomo",
              "Describe la participación de partidos de oposición"
            ]
          },
          {
            "key": "alternancia_2000",
            "name": "La Alternancia del Año 2000",
            "short_description": "Reconocer el fin de la hegemonía del PRI.",
            "example_tasks": [
              "Investiga cómo Vicente Fox del PAN ganó las elecciones de 2000",
              "Explica qué significó el fin de 71 años de gobiernos del PRI",
              "Describe las expectativas y desafíos de la alternancia"
            ]
          }
        ]
      },
      {
        "key": "movimientos_sociales_s_xx",
        "name": "Movimientos Sociales",
        "short_description": "Conocer las luchas sociales del siglo XX.",
        "sub_topics": [
          {
            "key": "ezln_1994",
            "name": "El Movimiento Zapatista (EZLN)",
            "short_description": "Comprender el levantamiento indígena de 1994.",
            "example_tasks": [
              "Investiga qué es el EZLN y por qué se levantó en Chiapas en 1994",
              "Explica las demandas del movimiento zapatista por derechos indígenas",
              "Describe el impacto del zapatismo en la conciencia nacional"
            ]
          },
          {
            "key": "otros_movimientos",
            "name": "Otros Movimientos Sociales",
            "short_description": "Reconocer diversas luchas sociales.",
            "example_tasks": [
              "Menciona movimientos como el feminista, ecologista o por derechos humanos",
              "Investiga el papel de las organizaciones de la sociedad civil",
              "Describe cómo los movimientos sociales influyeron en cambios políticos"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "mexico_contemporaneo",
    "name": "México Contemporáneo",
    "short_description": "Estudio de México desde finales del siglo XX hasta la actualidad, sus desafíos y transformaciones.",
    "sub_topics": [
      {
        "key": "mexico_globalizado",
        "name": "México en el Mundo Globalizado",
        "short_description": "Comprender la inserción de México en la economía global.",
        "sub_topics": [
          {
            "key": "tlcan_tmec",
            "name": "TLCAN y T-MEC",
            "short_description": "Conocer los tratados de libre comercio.",
            "example_tasks": [
              "Investiga qué es el TLCAN firmado en 1994 con EE.UU. y Canadá",
              "Explica cómo el TLCAN cambió la economía mexicana",
              "Describe la actualización al T-MEC en años recientes"
            ]
          },
          {
            "key": "migracion",
            "name": "Migración",
            "short_description": "Comprender los flujos migratorios.",
            "example_tasks": [
              "Investiga las causas de la migración de mexicanos a Estados Unidos",
              "Explica el impacto de las remesas en la economía mexicana",
              "Describe los desafíos de los migrantes mexicanos"
            ]
          }
        ]
      },
      {
        "key": "desafios_contemporaneos",
        "name": "Desafíos del México Actual",
        "short_description": "Reconocer los principales retos del país.",
        "sub_topics": [
          {
            "key": "desigualdad_pobreza",
            "name": "Desigualdad y Pobreza",
            "short_description": "Comprender la persistencia de problemas sociales.",
            "example_tasks": [
              "Investiga los niveles de desigualdad económica en México",
              "Explica los programas sociales para combatir la pobreza",
              "Describe las diferencias entre regiones desarrolladas y marginadas"
            ]
          },
          {
            "key": "seguridad_violencia",
            "name": "Seguridad y Violencia",
            "short_description": "Conocer los desafíos de seguridad pública.",
            "example_tasks": [
              "Investiga el problema del crimen organizado en México",
              "Explica las estrategias gubernamentales para la seguridad",
              "Describe el impacto de la violencia en comunidades"
            ]
          },
          {
            "key": "medio_ambiente",
            "name": "Desafíos Ambientales",
            "short_description": "Reconocer los problemas ecológicos.",
            "example_tasks": [
              "Investiga problemas ambientales como contaminación y deforestación",
              "Explica la importancia de la conservación de la biodiversidad",
              "Describe iniciativas para el desarrollo sustentable"
            ]
          }
        ]
      },
      {
        "key": "fortalezas_mexico_actual",
        "name": "Fortalezas del México Actual",
        "short_description": "Valorar los logros y potencial de México.",
        "sub_topics": [
          {
            "key": "democracia_participacion",
            "name": "Democracia y Participación Ciudadana",
            "short_description": "Reconocer los avances democráticos.",
            "example_tasks": [
              "Investiga cómo ha mejorado la transparencia electoral",
              "Explica el papel de la sociedad civil organizada",
              "Describe mecanismos de participación ciudadana"
            ]
          },
          {
            "key": "diversidad_cultural",
            "name": "Diversidad Cultural",
            "short_description": "Valorar la riqueza cultural de México.",
            "example_tasks": [
              "Investiga la diversidad de pueblos indígenas en México",
              "Explica la importancia del patrimonio cultural mexicano",
              "Describe manifestaciones culturales contemporáneas"
            ]
          },
          {
            "key": "jovenes_innovacion",
            "name": "Jóvenes e Innovación",
            "short_description": "Reconocer el potencial de las nuevas generaciones.",
            "example_tasks": [
              "Investiga iniciativas juveniles de innovación y emprendimiento",
              "Explica el papel de la tecnología en la transformación del país",
              "Describe ejemplos de jóvenes mexicanos destacados"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "patrimonio_memoria_historica",
    "name": "Patrimonio Cultural y Memoria Histórica",
    "short_description": "Valoración del patrimonio histórico de México y la importancia de preservar la memoria colectiva.",
    "sub_topics": [
      {
        "key": "sitios_arqueologicos",
        "name": "Sitios Arqueológicos",
        "short_description": "Reconocer la importancia de las zonas arqueológicas.",
        "sub_topics": [
          {
            "key": "principales_zonas",
            "name": "Principales Zonas Arqueológicas",
            "short_description": "Conocer los sitios prehispánicos más importantes.",
            "example_tasks": [
              "Menciona zonas arqueológicas importantes como Teotihuacán, Chichén Itzá, Monte Albán, Palenque",
              "Investiga cuáles son Patrimonio de la Humanidad por la UNESCO",
              "Explica la importancia de preservar estos sitios"
            ]
          }
        ]
      },
      {
        "key": "monumentos_historicos",
        "name": "Monumentos y Edificios Históricos",
        "short_description": "Valorar el patrimonio arquitectónico colonial y moderno.",
        "sub_topics": [
          {
            "key": "centros_historicos",
            "name": "Centros Históricos",
            "short_description": "Reconocer los centros históricos de ciudades mexicanas.",
            "example_tasks": [
              "Investiga el Centro Histórico de la Ciudad de México",
              "Menciona otros centros históricos importantes como Puebla, Oaxaca, Guanajuato",
              "Explica por qué es importante conservar estos espacios"
            ]
          },
          {
            "key": "monumentos_independencia_revolucion",
            "name": "Monumentos a la Independencia y Revolución",
            "short_description": "Conocer monumentos que conmemoran la historia.",
            "example_tasks": [
              "Investiga monumentos como el Ángel de la Independencia o el Monumento a la Revolución",
              "Explica qué acontecimientos históricos conmemoran",
              "Describe su importancia simbólica para los mexicanos"
            ]
          }
        ]
      },
      {
        "key": "museos_memoria",
        "name": "Museos y Espacios de Memoria",
        "short_description": "Valorar los museos como espacios educativos.",
        "sub_topics": [
          {
            "key": "museos_historia",
            "name": "Museos de Historia",
            "short_description": "Conocer los principales museos históricos.",
            "example_tasks": [
              "Investiga el Museo Nacional de Antropología y su importancia",
              "Menciona otros museos históricos como el Museo de Historia Nacional (Castillo de Chapultepec)",
              "Explica el papel de los museos en la educación histórica"
            ]
          }
        ]
      },
      {
        "key": "simbolos_nacionales",
        "name": "Símbolos Nacionales",
        "short_description": "Valorar los símbolos patrios y su significado.",
        "sub_topics": [
          {
            "key": "bandera_escudo_himno",
            "name": "Bandera, Escudo e Himno",
            "short_description": "Comprender el significado de los símbolos patrios.",
            "example_tasks": [
              "Investiga el significado de los colores de la bandera mexicana",
              "Explica los elementos del escudo nacional y su origen en la leyenda mexica",
              "Describe la importancia del Himno Nacional Mexicano"
            ]
          },
          {
            "key": "fechas_civicas",
            "name": "Fechas Cívicas",
            "short_description": "Conocer las principales conmemoraciones históricas.",
            "example_tasks": [
              "Menciona las fechas cívicas más importantes: 16 de septiembre, 20 de noviembre, 5 de mayo",
              "Investiga qué acontecimientos se conmemoran en cada fecha",
              "Explica por qué es importante recordar estos acontecimientos"
            ]
          }
        ]
      },
      {
        "key": "importancia_historia",
        "name": "La Importancia de Conocer la Historia",
        "short_description": "Reflexionar sobre el valor del conocimiento histórico.",
        "sub_topics": [
          {
            "key": "identidad_nacional",
            "name": "Historia e Identidad Nacional",
            "short_description": "Comprender cómo la historia forma nuestra identidad.",
            "example_tasks": [
              "Explica cómo conocer la historia ayuda a entender quiénes somos como mexicanos",
              "Investiga qué elementos del pasado forman parte de la identidad mexicana",
              "Describe la importancia de valorar las diferentes culturas que formaron México"
            ]
          },
          {
            "key": "leccion_historia",
            "name": "Aprender del Pasado",
            "short_description": "Valorar las lecciones que nos da la historia.",
            "example_tasks": [
              "Explica cómo los errores del pasado nos enseñan para el futuro",
              "Investiga ejemplos de cómo la historia nos ayuda a tomar mejores decisiones",
              "Describe por qué es importante preservar la memoria histórica"
            ]
          },
          {
            "key": "responsabilidad_historica",
            "name": "Nuestra Responsabilidad con la Historia",
            "short_description": "Reconocer el compromiso de las nuevas generaciones.",
            "example_tasks": [
              "Explica qué significa ser responsables con el patrimonio histórico",
              "Investiga formas en que los jóvenes pueden contribuir a preservar la historia",
              "Describe cómo puedes participar en el cuidado del patrimonio cultural de tu comunidad"
            ]
          }
        ]
      }
    ]
  }
]
