[
  {
    "key": "prehistoria_primeras_civilizaciones",
    "name": "Prehistoria y las primeras civilizaciones",
    "short_description": "Estudio del origen de la humanidad, el desarrollo de las primeras sociedades y el surgimiento de las civilizaciones antiguas en Mesopotamia y Egipto.",
    "sub_topics": [
      {
        "key": "origen_evolucion_humana",
        "name": "Origen y evolución del ser humano",
        "short_description": "Teorías sobre el origen humano, proceso de hominización y etapas de la evolución.",
        "sub_topics": [
          {
            "key": "proceso_hominizacion",
            "name": "Proceso de hominización",
            "short_description": "Características que distinguen a los homínidos de otros primates y etapas evolutivas.",
            "example_tasks": [
              "Elabora una línea de tiempo que muestre las principales especies de homínidos desde el Australopithecus hasta el Homo sapiens, indicando sus características principales",
              "Compara las características físicas y culturales del Homo habilis, Homo erectus y Homo sapiens utilizando una tabla comparativa",
              "Analiza un mapa que muestre las rutas de migración del Homo sapiens fuera de África y explica los factores que permitieron su expansión global"
            ]
          },
          {
            "key": "teoria_poblamiento_america",
            "name": "Teorías del poblamiento de América",
            "short_description": "Diferentes hipótesis sobre cómo y cuándo llegaron los primeros humanos al continente americano.",
            "example_tasks": [
              "Describe las principales teorías del poblamiento de América (Estrecho de Bering, ruta costera del Pacífico, teoría australiana) y evalúa las evidencias arqueológicas de cada una",
              "Localiza en un mapa las posibles rutas de migración hacia América y explica las condiciones climáticas del periodo glacial que las hicieron posibles",
              "Investiga los sitios arqueológicos más antiguos de América (Clovis, Monte Verde, Pedra Furada) y argumenta cuál teoría del poblamiento apoyan"
            ]
          },
          {
            "key": "periodos_prehistoria",
            "name": "Periodos de la prehistoria",
            "short_description": "Paleolítico, Mesolítico y Neolítico: características y avances tecnológicos de cada periodo.",
            "example_tasks": [
              "Elabora un cuadro comparativo de los periodos Paleolítico, Mesolítico y Neolítico, destacando la tecnología, organización social y actividades económicas de cada uno",
              "Explica cómo la invención de la agricultura durante el Neolítico transformó las sociedades humanas en términos de sedentarización, demografía y jerarquización social",
              "Analiza pinturas rupestres del Paleolítico y discute qué información proporcionan sobre las creencias, actividades y capacidades cognitivas de los humanos prehistóricos"
            ]
          }
        ]
      },
      {
        "key": "mesopotamia",
        "name": "Mesopotamia: cuna de la civilización",
        "short_description": "Desarrollo de las primeras ciudades-estado en Mesopotamia, sus características políticas, sociales y culturales.",
        "sub_topics": [
          {
            "key": "sumerios_primeras_ciudades",
            "name": "Los sumerios y las primeras ciudades",
            "short_description": "Surgimiento de las ciudades-estado sumerias y sus innovaciones tecnológicas y culturales.",
            "example_tasks": [
              "Describe la organización política, económica y religiosa de las ciudades-estado sumerias como Ur, Uruk y Lagash",
              "Explica la importancia de la invención de la escritura cuneiforme para la administración y el desarrollo cultural de Mesopotamia, utilizando ejemplos de tablillas",
              "Analiza el Código de Hammurabi como fuente histórica: identifica tres leyes específicas y explica qué revelan sobre la sociedad babilónica y su sistema de justicia"
            ]
          },
          {
            "key": "imperios_mesopotamicos",
            "name": "Imperios de Mesopotamia",
            "short_description": "Acadios, babilonios, asirios y persas: expansión territorial y legado cultural.",
            "example_tasks": [
              "Elabora una línea de tiempo de los principales imperios mesopotámicos (Acadio, Babilónico, Asirio, Persa) indicando sus periodos de dominio y territorios controlados",
              "Compara las estrategias militares y administrativas del Imperio Asirio y el Imperio Persa, explicando cómo cada uno mantuvo el control sobre sus vastos territorios",
              "Investiga las contribuciones culturales de Mesopotamia en matemáticas, astronomía, arquitectura y derecho, y explica su influencia en civilizaciones posteriores"
            ]
          }
        ]
      },
      {
        "key": "antiguo_egipto",
        "name": "El Antiguo Egipto",
        "short_description": "Civilización egipcia: geografía, periodos históricos, organización política y religión.",
        "sub_topics": [
          {
            "key": "geografia_nilo",
            "name": "El Nilo y la geografía de Egipto",
            "short_description": "Importancia del río Nilo en el desarrollo de la civilización egipcia.",
            "example_tasks": [
              "Explica por qué Heródoto llamó a Egipto 'un don del Nilo', describiendo cómo las inundaciones anuales permitieron el desarrollo agrícola y la prosperidad",
              "Localiza en un mapa del Antiguo Egipto el Alto y Bajo Egipto, las cataratas del Nilo, y las principales ciudades como Menfis, Tebas y Alejandría",
              "Compara las condiciones geográficas de Mesopotamia y Egipto, explicando cómo influyeron en el desarrollo político y cultural diferente de ambas civilizaciones"
            ]
          },
          {
            "key": "periodos_historia_egipcia",
            "name": "Periodos de la historia egipcia",
            "short_description": "Imperio Antiguo, Medio y Nuevo: características y faraones destacados de cada periodo.",
            "example_tasks": [
              "Elabora una línea de tiempo de los tres grandes periodos del Antiguo Egipto (Antiguo, Medio y Nuevo), identificando faraones importantes y logros de cada época",
              "Describe las diferencias políticas y culturales entre el Imperio Antiguo (era de las pirámides), el Imperio Medio (expansión cultural) y el Imperio Nuevo (expansión militar)",
              "Investiga el reinado de Hatshepsut, Akenatón o Ramsés II y explica su importancia en la historia egipcia, incluyendo sus reformas o conquistas principales"
            ]
          },
          {
            "key": "sociedad_religion_egipcia",
            "name": "Sociedad y religión egipcia",
            "short_description": "Estructura social, politeísmo, culto a los muertos y papel del faraón como dios-rey.",
            "example_tasks": [
              "Elabora una pirámide social del Antiguo Egipto explicando las funciones y privilegios de cada grupo: faraón, sacerdotes, escribas, artesanos, campesinos y esclavos",
              "Explica las creencias egipcias sobre el más allá mediante el análisis del Libro de los Muertos y el proceso de momificación, describiendo su significado religioso",
              "Describe el papel dual del faraón como líder político y religioso, explicando cómo esta concepción divina del poder legitimaba su autoridad absoluta",
              "Identifica las principales divinidades egipcias (Ra, Osiris, Isis, Anubis, Horus) y explica sus funciones en el panteón y su importancia en la vida cotidiana"
            ]
          },
          {
            "key": "cultura_ciencia_egipcia",
            "name": "Cultura y ciencia en Egipto",
            "short_description": "Escritura jeroglífica, arquitectura monumental, avances en medicina y astronomía.",
            "example_tasks": [
              "Explica cómo la Piedra Rosetta permitió descifrar los jeroglíficos egipcios y qué información ha proporcionado sobre la civilización egipcia",
              "Describe las características arquitectónicas de las pirámides de Giza y explica los conocimientos matemáticos y de ingeniería necesarios para su construcción",
              "Investiga los avances médicos del Antiguo Egipto mediante el análisis del Papiro Edwin Smith, identificando técnicas quirúrgicas y conocimientos anatómicos"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "civilizaciones_mediterraneo",
    "name": "Civilizaciones del Mediterráneo",
    "short_description": "Desarrollo de las civilizaciones griega y romana, sus sistemas políticos, filosóficos y culturales que fundamentaron la civilización occidental.",
    "sub_topics": [
      {
        "key": "antigua_grecia",
        "name": "La Antigua Grecia",
        "short_description": "Evolución política, cultural y filosófica de las polis griegas y su legado a la civilización occidental.",
        "sub_topics": [
          {
            "key": "polis_griegas",
            "name": "Las polis griegas",
            "short_description": "Organización de las ciudades-estado griegas, especialmente Atenas y Esparta.",
            "example_tasks": [
              "Elabora un cuadro comparativo entre Atenas y Esparta, considerando su organización política, educación, papel de la mujer y actividades económicas",
              "Explica el desarrollo de la democracia ateniense desde las reformas de Solón y Clístenes hasta Pericles, describiendo las instituciones democráticas y sus limitaciones",
              "Analiza las causas y consecuencias de las Guerras Médicas, explicando cómo la victoria griega influyó en el desarrollo político y cultural del siglo V a.C.",
              "Describe el sistema político espartano y explica cómo la educación militar (agogé) y la organización social estaban diseñadas para mantener el poder militar"
            ]
          },
          {
            "key": "cultura_filosofia_griega",
            "name": "Cultura y filosofía griega",
            "short_description": "Aportes griegos en filosofía, ciencia, literatura, teatro y artes plásticas.",
            "example_tasks": [
              "Compara las ideas filosóficas de Sócrates, Platón y Aristóteles sobre la verdad, la justicia y la organización del Estado ideal",
              "Explica las características de la tragedia y la comedia griegas mediante el análisis de obras de Sófocles, Eurípides o Aristófanes, identificando temas universales",
              "Describe los Juegos Olímpicos antiguos como expresión de la cultura griega: su origen religioso, su importancia política y las disciplinas atléticas",
              "Investiga las contribuciones de los griegos a la ciencia mediante el estudio de figuras como Tales de Mileto, Pitágoras, Hipócrates o Arquímedes"
            ]
          },
          {
            "key": "alejandro_helenismo",
            "name": "Alejandro Magno y el helenismo",
            "short_description": "Conquistas de Alejandro Magno y difusión de la cultura griega en el mundo helenístico.",
            "example_tasks": [
              "Elabora un mapa del imperio de Alejandro Magno mostrando las rutas de sus conquistas desde Macedonia hasta la India y las ciudades fundadas",
              "Explica el concepto de helenismo y cómo la fusión de elementos griegos, persas, egipcios e indios creó una cultura cosmopolita",
              "Describe la importancia de Alejandría como centro cultural helenístico, destacando su biblioteca, el faro y los avances científicos realizados allí"
            ]
          }
        ]
      },
      {
        "key": "roma_republica",
        "name": "Roma: de la República al Imperio",
        "short_description": "Desarrollo político de Roma desde la monarquía hasta el imperio, incluyendo su expansión territorial.",
        "sub_topics": [
          {
            "key": "republica_romana",
            "name": "La República romana",
            "short_description": "Organización política republicana, lucha entre patricios y plebeyos, y expansión territorial.",
            "example_tasks": [
              "Explica la organización política de la República romana describiendo las funciones del Senado, los cónsules, los tribunos de la plebe y las asambleas populares",
              "Analiza el conflicto entre patricios y plebeyos durante la República, identificando las conquistas políticas de los plebeyos como los tribunos y las Leyes de las XII Tablas",
              "Describe las causas y consecuencias de las Guerras Púnicas, explicando cómo la victoria sobre Cartago transformó a Roma en potencia mediterránea",
              "Investiga las reformas de los hermanos Graco y explica por qué su intento de redistribución de tierras generó conflictos que debilitaron la República"
            ]
          },
          {
            "key": "crisis_republica_imperio",
            "name": "Crisis de la República y surgimiento del Imperio",
            "short_description": "Guerras civiles, triunviratos y establecimiento del principado de Augusto.",
            "example_tasks": [
              "Explica las causas de la crisis de la República romana en el siglo I a.C., incluyendo las guerras civiles, los conflictos sociales y el papel de los caudillos militares",
              "Describe la figura de Julio César: sus conquistas en las Galias, su dictadura y su asesinato, explicando su impacto en la transición de República a Imperio",
              "Analiza cómo Octavio Augusto estableció el principado manteniendo apariencias republicanas pero concentrando el poder, inaugurando la Pax Romana",
              "Compara el Primer y Segundo Triunvirato, identificando a sus miembros, sus conflictos internos y cómo ambos terminaron en guerras civiles"
            ]
          },
          {
            "key": "imperio_romano_apogeo",
            "name": "El Imperio Romano en su apogeo",
            "short_description": "Expansión máxima, romanización, administración imperial y vida en Roma.",
            "example_tasks": [
              "Elabora un mapa del Imperio Romano en su máxima extensión durante el gobierno de Trajano, identificando provincias, fronteras (limes) y principales ciudades",
              "Explica el proceso de romanización en las provincias conquistadas mediante el análisis de la difusión del latín, el derecho romano, las calzadas y las ciudades",
              "Describe la vida cotidiana en la antigua Roma distinguiendo entre diferentes clases sociales: patricios, plebeyos, libertos y esclavos",
              "Analiza la arquitectura e ingeniería romanas mediante el estudio de obras como el Coliseo, los acueductos, las termas y el Panteón"
            ]
          },
          {
            "key": "crisis_caida_imperio",
            "name": "Crisis y caída del Imperio Romano",
            "short_description": "Factores de la crisis del siglo III, división del imperio y caída de Roma occidental.",
            "example_tasks": [
              "Identifica las causas internas y externas de la crisis del Imperio Romano en el siglo III: crisis económica, inestabilidad política, presión de los pueblos bárbaros",
              "Explica la división del Imperio Romano en Oriente y Occidente realizada por Diocleciano y consolidada por Teodosio, analizando las razones de esta decisión",
              "Describe el proceso de caída del Imperio Romano de Occidente en 476 d.C., explicando el papel de las invasiones bárbaras y los factores internos de debilitamiento",
              "Compara la evolución del Imperio Romano de Oriente (Bizantino) tras 476, explicando por qué sobrevivió mil años más que Occidente"
            ]
          }
        ]
      },
      {
        "key": "legado_grecorromano",
        "name": "Legado de las civilizaciones clásicas",
        "short_description": "Herencia cultural, política, jurídica y filosófica de Grecia y Roma en la civilización occidental.",
        "sub_topics": [
          {
            "key": "derecho_instituciones",
            "name": "Derecho romano e instituciones políticas",
            "short_description": "Influencia del derecho romano y modelos políticos clásicos en el mundo moderno.",
            "example_tasks": [
              "Explica los principios fundamentales del derecho romano (presunción de inocencia, derecho a la defensa, igualdad ante la ley) y su influencia en los sistemas jurídicos actuales",
              "Compara las instituciones democráticas de la Atenas clásica con los sistemas democráticos modernos, identificando similitudes y diferencias",
              "Analiza conceptos políticos clásicos como república, ciudadanía, separación de poderes y su aplicación en gobiernos contemporáneos, incluyendo el mexicano"
            ]
          },
          {
            "key": "arte_cultura_clasica",
            "name": "Arte, literatura y pensamiento clásico",
            "short_description": "Influencia permanente del arte, la literatura y la filosofía grecorromana.",
            "example_tasks": [
              "Identifica elementos de la arquitectura clásica (columnas, frontones, cúpulas) en edificios gubernamentales de México y explica por qué se adoptaron estos estilos",
              "Analiza cómo los mitos griegos y romanos continúan influyendo en la literatura, el cine y la cultura popular contemporánea con ejemplos específicos",
              "Explica la vigencia del pensamiento filosófico griego en áreas como la ética, la lógica y la política mediante ejemplos de pensadores modernos que retoman estas ideas"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "civilizaciones_asia",
    "name": "Civilizaciones de Asia",
    "short_description": "Desarrollo de las grandes civilizaciones asiáticas: India, China, Japón y otras culturas del Lejano Oriente, sus aportes culturales y sistemas filosóficos.",
    "sub_topics": [
      {
        "key": "india_antigua",
        "name": "La India antigua",
        "short_description": "Civilización del valle del Indo, vedismo, hinduismo, budismo y estructura social.",
        "sub_topics": [
          {
            "key": "civilizacion_valle_indo",
            "name": "Civilización del valle del Indo",
            "short_description": "Harappa y Mohenjo-Daro: urbanismo, comercio y declive de esta cultura.",
            "example_tasks": [
              "Describe las características urbanísticas de Harappa y Mohenjo-Daro, destacando su planificación en cuadrícula, sistemas de drenaje y arquitectura",
              "Explica la importancia del comercio en la civilización del Indo mediante el análisis de sellos encontrados y evidencias de intercambio con Mesopotamia",
              "Investiga las teorías sobre el declive de la civilización del Indo: cambios climáticos, inundaciones, invasiones arias o agotamiento de recursos"
            ]
          },
          {
            "key": "vedismo_hinduismo",
            "name": "Vedismo e hinduismo",
            "short_description": "Textos védicos, sistema de castas, creencias hindúes y conceptos de karma y reencarnación.",
            "example_tasks": [
              "Explica la estructura del sistema de castas en la India antigua (brahmanes, chatrías, vaisias, sudras e intocables) y su justificación religiosa",
              "Describe los conceptos fundamentales del hinduismo: karma, dharma, samsara (reencarnación) y moksha (liberación), explicando cómo se relacionan",
              "Analiza los Vedas como fuente histórica y religiosa, explicando qué información proporcionan sobre la sociedad aria que se estableció en la India",
              "Compara las principales divinidades hindúes (Brahma, Vishnu, Shiva) y explica el concepto de Trimurti y las múltiples manifestaciones de lo divino"
            ]
          },
          {
            "key": "budismo",
            "name": "El budismo",
            "short_description": "Vida de Buda, las Cuatro Nobles Verdades, el Óctuple Sendero y expansión del budismo.",
            "example_tasks": [
              "Narra la vida de Siddhartha Gautama y su transformación en Buda, explicando cómo su búsqueda espiritual dio origen al budismo",
              "Explica las Cuatro Nobles Verdades del budismo (el sufrimiento existe, tiene causa, puede cesar, existe un camino para cesarlo) y el Óctuple Sendero",
              "Elabora un mapa mostrando la expansión del budismo desde la India hacia el sudeste asiático, China, Tíbet y Japón, identificando las diferentes escuelas",
              "Compara las enseñanzas del hinduismo y el budismo sobre el sufrimiento, la reencarnación y el camino hacia la liberación espiritual"
            ]
          }
        ]
      },
      {
        "key": "china_antigua",
        "name": "China antigua",
        "short_description": "Dinastías chinas, confucianismo, taoísmo, legismo y grandes invenciones chinas.",
        "sub_topics": [
          {
            "key": "primeras_dinastias_china",
            "name": "Primeras dinastías: Shang, Zhou, Qin y Han",
            "short_description": "Desarrollo político, unificación imperial y expansión bajo las primeras dinastías.",
            "example_tasks": [
              "Elabora una línea de tiempo de las dinastías Shang, Zhou, Qin y Han, identificando los principales logros políticos, culturales y tecnológicos de cada una",
              "Explica cómo Qin Shi Huang unificó China en 221 a.C.: estandarización de la escritura, moneda, pesos y medidas, y construcción de la Gran Muralla",
              "Describe el sistema de gobierno bajo la dinastía Han y explica cómo se estableció el confucianismo como ideología oficial del Estado",
              "Analiza el sistema de la Ruta de la Seda durante la dinastía Han, explicando qué productos se comercializaban y su impacto en el intercambio cultural"
            ]
          },
          {
            "key": "filosofias_chinas",
            "name": "Filosofías chinas: confucianismo, taoísmo y legismo",
            "short_description": "Principales corrientes de pensamiento que influyeron en la sociedad y política china.",
            "example_tasks": [
              "Explica las enseñanzas de Confucio sobre la virtud, la piedad filial, la jerarquía social y el buen gobierno, utilizando ejemplos de las Analectas",
              "Describe los principios del taoísmo según Laozi: el Tao (camino), la armonía con la naturaleza, el wu wei (no acción forzada) y el equilibrio yin-yang",
              "Compara el confucianismo (orden moral y ritual), el taoísmo (armonía natural) y el legismo (ley estricta) como sistemas para organizar la sociedad",
              "Analiza la influencia del confucianismo en la estructura familiar, la educación y el sistema de exámenes para funcionarios en la China imperial"
            ]
          },
          {
            "key": "innovaciones_china",
            "name": "Innovaciones y aportes chinos",
            "short_description": "Grandes inventos chinos: papel, imprenta, pólvora, brújula y su impacto mundial.",
            "example_tasks": [
              "Identifica los 'Cuatro Grandes Inventos' de China (papel, imprenta, pólvora, brújula) y explica cómo cada uno transformó el desarrollo humano",
              "Explica el impacto de la invención del papel y la imprenta en la difusión del conocimiento, comparando con los sistemas de escritura anteriores",
              "Describe cómo la brújula y la pólvora, inventadas en China, revolucionaron la navegación y la guerra cuando llegaron a Europa",
              "Investiga otros aportes chinos a la humanidad como la porcelana, la seda, el papel moneda o la sismografía"
            ]
          }
        ]
      },
      {
        "key": "japon_feudal",
        "name": "Japón feudal",
        "short_description": "Desarrollo del sistema feudal japonés, cultura samurái y sintoísmo.",
        "sub_topics": [
          {
            "key": "sistema_feudal_japones",
            "name": "El sistema feudal japonés",
            "short_description": "Shogunato, daimyos, samuráis y estructura jerárquica de la sociedad japonesa.",
            "example_tasks": [
              "Explica la estructura jerárquica del Japón feudal: emperador, shogun, daimyos, samuráis, campesinos, artesanos y comerciantes",
              "Describe el código bushido de los samuráis, explicando valores como lealtad, honor, disciplina y autosacrificio",
              "Compara el feudalismo japonés con el feudalismo europeo, identificando similitudes y diferencias en estructura social, valores y organización militar",
              "Analiza el papel del shogunato Tokugawa (1603-1868) en la unificación de Japón y su política de aislamiento (sakoku)"
            ]
          },
          {
            "key": "cultura_religion_japon",
            "name": "Cultura y religión en Japón",
            "short_description": "Sintoísmo, budismo zen, y expresiones artísticas como el teatro Noh y la ceremonia del té.",
            "example_tasks": [
              "Explica las creencias fundamentales del sintoísmo: veneración de los kami (espíritus), pureza ritual y conexión con la naturaleza y los ancestros",
              "Describe cómo el budismo zen influyó en la cultura japonesa a través de prácticas como la meditación, los jardines zen y la ceremonia del té",
              "Analiza expresiones artísticas japonesas como el haiku, el teatro Noh o Kabuki, explicando qué valores culturales reflejan"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "civilizaciones_mesoamericanas",
    "name": "Civilizaciones Mesoamericanas",
    "short_description": "Desarrollo de las culturas prehispánicas de Mesoamérica: olmecas, mayas, teotihuacanos, toltecas, mexicas y otras civilizaciones que florecieron en el territorio mexicano.",
    "sub_topics": [
      {
        "key": "caracteristicas_mesoamerica",
        "name": "Características de Mesoamérica",
        "short_description": "Definición del área cultural, periodos históricos y rasgos culturales comunes.",
        "sub_topics": [
          {
            "key": "area_cultural_mesoamerica",
            "name": "Mesoamérica como área cultural",
            "short_description": "Delimitación geográfica y rasgos culturales compartidos por las civilizaciones mesoamericanas.",
            "example_tasks": [
              "Localiza en un mapa los límites geográficos de Mesoamérica, identificando las actuales regiones de México, Guatemala, Belice, Honduras y El Salvador que abarcaba",
              "Enumera y explica los rasgos culturales compartidos por las civilizaciones mesoamericanas: agricultura basada en maíz, calendario ritual, juego de pelota, escritura, pirámides",
              "Compara Mesoamérica con otras áreas culturales de América (Aridoamérica, Oasisamérica, Andes) destacando sus diferencias geográficas y culturales"
            ]
          },
          {
            "key": "periodos_mesoamerica",
            "name": "Periodos históricos de Mesoamérica",
            "short_description": "Preclásico, Clásico y Posclásico: características y culturas representativas.",
            "example_tasks": [
              "Elabora una línea de tiempo de los tres grandes periodos de Mesoamérica (Preclásico 2500 a.C.-200 d.C., Clásico 200-900 d.C., Posclásico 900-1521 d.C.) con las culturas principales",
              "Describe las características distintivas del periodo Clásico: florecimiento urbano, desarrollo científico y artístico, y ejemplos como Teotihuacán y las ciudades mayas",
              "Explica las transformaciones del periodo Posclásico: militarismo, ciudades-estado, migraciones y conflictos, ejemplificando con toltecas y mexicas"
            ]
          }
        ]
      },
      {
        "key": "olmecas",
        "name": "Los olmecas: cultura madre",
        "short_description": "Primera gran civilización mesoamericana, sus centros ceremoniales y legado cultural.",
        "sub_topics": [
          {
            "key": "desarrollo_olmeca",
            "name": "Desarrollo de la cultura olmeca",
            "short_description": "Ubicación, cronología, centros ceremoniales y organización social olmeca.",
            "example_tasks": [
              "Localiza en un mapa los principales centros olmecas: San Lorenzo, La Venta y Tres Zapotes en la región del Golfo de México (Veracruz y Tabasco)",
              "Describe las características de las cabezas colosales olmecas y explica qué revelan sobre la organización social, el poder político y las capacidades técnicas de esta cultura",
              "Explica por qué se considera a los olmecas como 'cultura madre' de Mesoamérica, identificando elementos que transmitieron a culturas posteriores"
            ]
          },
          {
            "key": "legado_olmeca",
            "name": "Legado cultural olmeca",
            "short_description": "Aportes olmecas en religión, arte, escritura y calendario adoptados por culturas posteriores.",
            "example_tasks": [
              "Identifica elementos religiosos olmecas (culto al jaguar, dualidad serpiente-ave) que influyeron en la iconografía de culturas posteriores como los mayas",
              "Describe evidencias de escritura olmeca y su posible influencia en el desarrollo de sistemas de escritura mesoamericanos posteriores",
              "Analiza objetos de jade olmeca y explica la importancia de este material en el comercio y la cosmovisión mesoamericana"
            ]
          }
        ]
      },
      {
        "key": "mayas",
        "name": "La civilización maya",
        "short_description": "Desarrollo urbano, científico y cultural de los mayas en el periodo Clásico y Posclásico.",
        "sub_topics": [
          {
            "key": "ciudades_mayas",
            "name": "Ciudades-estado mayas",
            "short_description": "Organización política descentralizada, arquitectura y principales ciudades del mundo maya.",
            "example_tasks": [
              "Elabora un mapa localizando las principales ciudades mayas del periodo Clásico: Tikal, Palenque, Copán, Calakmul, Yaxchilán y Bonampak",
              "Describe la organización política de los mayas en ciudades-estado independientes gobernadas por halach uinic (jefe supremo) y explica las relaciones entre ciudades",
              "Analiza la arquitectura maya mediante el estudio de estructuras como El Castillo en Chichén Itzá o el Templo de las Inscripciones en Palenque",
              "Explica el colapso maya del periodo Clásico (siglo IX) identificando posibles causas: guerras, sequías, sobrepoblación, degradación ambiental"
            ]
          },
          {
            "key": "ciencia_mayas",
            "name": "Ciencia y conocimiento maya",
            "short_description": "Matemáticas, astronomía, calendario y sistema de escritura jeroglífica.",
            "example_tasks": [
              "Explica el sistema matemático maya basado en el vigesimal, el uso del cero y su aplicación en calendarios y astronomía",
              "Describe los calendarios mayas: el Haab (365 días solar), el Tzolkin (260 días ritual) y la Cuenta Larga, explicando su funcionamiento e importancia religiosa",
              "Analiza los conocimientos astronómicos mayas mediante el estudio de construcciones como el observatorio El Caracol en Chichén Itzá",
              "Explica el sistema de escritura jeroglífica maya utilizando ejemplos de códices y estelas, describiendo cómo se descifraron"
            ]
          },
          {
            "key": "sociedad_religion_maya",
            "name": "Sociedad y religión maya",
            "short_description": "Estructura social, cosmovisión, divinidades y prácticas religiosas mayas.",
            "example_tasks": [
              "Elabora una pirámide social maya mostrando la jerarquía: nobles y sacerdotes, guerreros, artesanos y comerciantes, campesinos y esclavos",
              "Describe la cosmovisión maya sobre la creación del mundo utilizando el Popol Vuh como fuente, explicando los intentos de crear a los humanos",
              "Explica el significado religioso del juego de pelota maya, su relación con mitos de los gemelos heroicos y su función ritual",
              "Identifica principales divinidades mayas como Itzamná, Chaac, Kukulkán y explica sus funciones en el panteón y en la vida cotidiana"
            ]
          }
        ]
      },
      {
        "key": "teotihuacan",
        "name": "Teotihuacán: la ciudad de los dioses",
        "short_description": "Desarrollo urbano, comercial y religioso de Teotihuacán durante el periodo Clásico.",
        "sub_topics": [
          {
            "key": "urbanismo_teotihuacan",
            "name": "Urbanismo y arquitectura teotihuacana",
            "short_description": "Planificación urbana, grandes pirámides y conjunto arquitectónico de Teotihuacán.",
            "example_tasks": [
              "Describe la planificación urbana de Teotihuacán: la Calzada de los Muertos, orientación astronómica y distribución de barrios residenciales y de artesanos",
              "Analiza las Pirámides del Sol y la Luna explicando sus dimensiones, función religiosa y el significado cosmológico de su ubicación",
              "Explica el Templo de Quetzalcóatl (Ciudadela) describiendo su decoración con serpientes emplumadas y máscaras de Tláloc",
              "Investiga los murales de Tepantitla y otros conjuntos habitacionales, explicando qué información proporcionan sobre la vida cotidiana y las creencias teotihuacanas"
            ]
          },
          {
            "key": "economia_influencia_teotihuacan",
            "name": "Economía e influencia de Teotihuacán",
            "short_description": "Red comercial, producción artesanal y expansión cultural teotihuacana en Mesoamérica.",
            "example_tasks": [
              "Explica la economía teotihuacana basada en la agricultura (chinampas), la producción de obsidiana y el comercio a larga distancia con otras regiones",
              "Describe la influencia cultural de Teotihuacán en otras áreas de Mesoamérica mediante evidencias arqueológicas en Monte Albán, Tikal y otras ciudades",
              "Analiza las teorías sobre el colapso de Teotihuacán (siglos VII-VIII): incendios, invasiones, conflictos internos o cambios climáticos"
            ]
          }
        ]
      },
      {
        "key": "culturas_posclasico",
        "name": "Culturas del Posclásico",
        "short_description": "Toltecas, mixtecas, zapotecas, tarascos y otras culturas que florecieron antes de los mexicas.",
        "sub_topics": [
          {
            "key": "toltecas",
            "name": "Los toltecas de Tula",
            "short_description": "Militarismo tolteca, la figura de Quetzalcóatl y su influencia en culturas posteriores.",
            "example_tasks": [
              "Describe las características militaristas de la cultura tolteca evidenciadas en los atlantes de Tula y otros elementos arquitectónicos",
              "Explica la leyenda de Ce Acatl Topiltzin Quetzalcóatl y su conflicto con los seguidores de Tezcatlipoca, relacionándola con eventos históricos",
              "Analiza la influencia tolteca en Chichén Itzá mediante la comparación de elementos arquitectónicos, escultóricos e iconográficos entre ambas ciudades"
            ]
          },
          {
            "key": "oaxaca_zapotecas_mixtecas",
            "name": "Zapotecas y mixtecas en Oaxaca",
            "short_description": "Desarrollo cultural en Oaxaca: Monte Albán zapoteca y arte mixteca.",
            "example_tasks": [
              "Describe el desarrollo de Monte Albán como centro zapoteca: su sistema de escritura, arquitectura, danzantes y orientación astronómica",
              "Explica las características del arte mixteca, especialmente en códices (Nuttall, Vindobonensis) y orfebrería de oro y turquesa",
              "Compara la organización política y las expresiones culturales de zapotecas y mixtecas en la región de Oaxaca"
            ]
          },
          {
            "key": "tarascos",
            "name": "El señorío tarasco de Michoacán",
            "short_description": "Cultura purépecha, sus yácatas y resistencia al imperio mexica.",
            "example_tasks": [
              "Localiza el territorio del señorío tarasco o purépecha en Michoacán y explica su organización política centralizada con capital en Tzintzuntzan",
              "Describe las yácatas (estructuras piramidales mixtas circulares y rectangulares) características de la arquitectura tarasca",
              "Explica cómo los tarascos resistieron exitosamente los intentos de conquista mexica, manteniendo su independencia hasta la llegada española"
            ]
          }
        ]
      },
      {
        "key": "mexicas_aztecas",
        "name": "Los mexicas (aztecas)",
        "short_description": "Fundación de Tenochtitlán, expansión imperial, organización política, economía y religión mexica.",
        "sub_topics": [
          {
            "key": "origen_fundacion_tenochtitlan",
            "name": "Origen y fundación de Tenochtitlán",
            "short_description": "Migración mexica desde Aztlán, la profecía del águila y establecimiento en el lago de Texcoco.",
            "example_tasks": [
              "Narra la migración mexica desde el mítico Aztlán guiados por Huitzilopochtli hasta su llegada al valle de México en el siglo XIV",
              "Explica el mito fundacional de Tenochtitlán: la profecía del águila devorando una serpiente sobre un nopal y su significado",
              "Describe cómo los mexicas fundaron Tenochtitlán en 1325 en un islote del lago de Texcoco y desarrollaron chinampas para la agricultura",
              "Analiza el desarrollo urbano de Tenochtitlán: calzadas, acueductos, el Templo Mayor, mercados y barrios (calpulli)"
            ]
          },
          {
            "key": "expansion_imperio_mexica",
            "name": "Expansión del imperio mexica",
            "short_description": "Triple Alianza, conquistas militares y tributos de los pueblos sometidos.",
            "example_tasks": [
              "Explica la formación de la Triple Alianza entre Tenochtitlán, Texcoco y Tlacopan para derrotar a Azcapotzalco y controlar el valle de México",
              "Elabora un mapa del imperio mexica en su máxima extensión mostrando los territorios conquistados y las regiones que resistieron como Tlaxcala y Michoacán",
              "Describe el sistema de tributos mexica utilizando la Matrícula de Tributos como fuente, identificando productos que las provincias debían entregar",
              "Analiza las guerras floridas (xochiyaóyotl) explicando su función ritual de capturar prisioneros para sacrificios y entrenar guerreros"
            ]
          },
          {
            "key": "organizacion_social_mexica",
            "name": "Organización social y política mexica",
            "short_description": "Estructura jerárquica, gobierno del tlatoani, nobleza y pueblo común.",
            "example_tasks": [
              "Elabora una pirámide social mexica mostrando al tlatoani en la cima, seguido de nobles (pipiltin), sacerdotes, guerreros, comerciantes (pochtecas), artesanos, campesinos (macehualtin) y esclavos (tlacotin)",
              "Describe las funciones del tlatoani (emperador), el cihuacóatl (consejero), el tlatocan (consejo) y los calpullis (barrios) en la organización política",
              "Explica el sistema educativo mexica distinguiendo entre el calmécac (para nobles) y el telpochcalli (para el pueblo común)",
              "Analiza el papel de los pochtecas como comerciantes de larga distancia y espías que obtenían información sobre territorios potencialmente conquistables"
            ]
          },
          {
            "key": "religion_mexica",
            "name": "Religión y cosmovisión mexica",
            "short_description": "Politeísmo, mito de los cinco soles, sacrificios humanos y Templo Mayor.",
            "example_tasks": [
              "Explica el mito de los cinco soles o eras cosmogónicas y el papel de los mexicas en mantener vivo al Quinto Sol mediante sacrificios a Huitzilopochtli",
              "Describe las principales divinidades mexicas: Huitzilopochtli (guerra y sol), Tláloc (lluvia), Quetzalcóatl (viento y conocimiento), Coatlicue (tierra), Tezcatlipoca (noche)",
              "Analiza la función religiosa y simbólica de los sacrificios humanos en la cosmovisión mexica y su relación con el equilibrio cósmico",
              "Describe el Templo Mayor de Tenochtitlán con sus dos santuarios dedicados a Huitzilopochtli y Tláloc, explicando su orientación y simbolismo",
              "Explica el calendario mexica: el tonalpohualli (260 días ritual) y el xiuhpohualli (365 días solar) y su función en la vida religiosa y agrícola"
            ]
          },
          {
            "key": "economia_vida_cotidiana_mexica",
            "name": "Economía y vida cotidiana mexica",
            "short_description": "Agricultura chinampera, comercio, mercados y vida diaria en Tenochtitlán.",
            "example_tasks": [
              "Explica el sistema de chinampas como técnica agrícola intensiva en el lago de Texcoco y su importancia para alimentar a la gran población de Tenochtitlán",
              "Describe el mercado de Tlatelolco como centro comercial donde se intercambiaban productos de todo el imperio usando cacao y mantas como moneda",
              "Analiza la vida cotidiana de diferentes clases sociales mexicas: vivienda, alimentación, vestimenta y actividades diarias",
              "Explica el papel de las mujeres en la sociedad mexica: en el hogar, como sacerdotisas, parteras y comerciantes"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "edad_media",
    "name": "Edad Media",
    "short_description": "Periodo histórico europeo entre la caída de Roma (476) y la caída de Constantinopla (1453): feudalismo, cristianismo, islam, arte románico y gótico.",
    "sub_topics": [
      {
        "key": "alta_edad_media",
        "name": "Alta Edad Media",
        "short_description": "Formación de los reinos germánicos, imperio carolingio y sistema feudal.",
        "sub_topics": [
          {
            "key": "reinos_germanicos",
            "name": "Los reinos germánicos",
            "short_description": "Invasiones bárbaras y establecimiento de nuevos reinos en el antiguo territorio romano.",
            "example_tasks": [
              "Elabora un mapa mostrando los principales reinos germánicos establecidos tras la caída de Roma: visigodos, ostrogodos, francos, anglosajones, vándalos",
              "Explica el proceso de fusión entre elementos romanos y germánicos en los nuevos reinos: derecho, lengua, religión y organización política",
              "Describe el reino franco de los merovingios y carolingios como el más duradero e influyente de los reinos germánicos"
            ]
          },
          {
            "key": "imperio_carolingio",
            "name": "El imperio carolingio",
            "short_description": "Carlomagno, expansión franca, renacimiento carolingio y división del imperio.",
            "example_tasks": [
              "Describe las conquistas de Carlomagno y su coronación como emperador en el año 800, explicando su intento de restaurar el Imperio Romano de Occidente",
              "Explica el renacimiento carolingio: promoción de la educación, preservación de textos clásicos, escritura carolina y arquitectura",
              "Analiza el Tratado de Verdún (843) que dividió el imperio carolingio entre los nietos de Carlomagno, originando los futuros Francia, Alemania e Italia"
            ]
          },
          {
            "key": "feudalismo",
            "name": "El sistema feudal",
            "short_description": "Organización política, económica y social basada en la tenencia de tierras y relaciones de vasallaje.",
            "example_tasks": [
              "Explica la estructura jerárquica del feudalismo: rey, señores feudales, vasallos, caballeros y siervos, describiendo las obligaciones mutuas",
              "Describe el sistema de vasallaje mediante la ceremonia de homenaje e investidura, explicando los deberes del señor y del vasallo",
              "Analiza el feudo como unidad económica autosuficiente: tierras de labor, reserva señorial, tierras comunes y servicios de los siervos",
              "Compara la condición de los siervos con la de los esclavos romanos, identificando similitudes y diferencias en derechos y obligaciones"
            ]
          }
        ]
      },
      {
        "key": "iglesia_medieval",
        "name": "La Iglesia en la Edad Media",
        "short_description": "Poder religioso y político de la Iglesia católica, monasterios, cultura y conflictos.",
        "sub_topics": [
          {
            "key": "poder_iglesia",
            "name": "El poder de la Iglesia",
            "short_description": "Jerarquía eclesiástica, influencia política y económica del papado.",
            "example_tasks": [
              "Describe la organización jerárquica de la Iglesia medieval: Papa, cardenales, arzobispos, obispos, sacerdotes y monjes",
              "Explica el conflicto entre el poder temporal y espiritual mediante la Querella de las Investiduras entre el Papa Gregorio VII y Enrique IV",
              "Analiza las fuentes del poder económico de la Iglesia: tierras, diezmos, donaciones y su papel como principal terrateniente feudal"
            ]
          },
          {
            "key": "monasticismo",
            "name": "Monasterios y vida monástica",
            "short_description": "Órdenes religiosas, regla benedictina, scriptorium y preservación cultural.",
            "example_tasks": [
              "Describe la Regla de San Benito y su influencia en la organización de los monasterios medievales: ora et labora (reza y trabaja)",
              "Explica el papel de los monasterios como centros de preservación del conocimiento mediante los scriptorium donde se copiaban manuscritos",
              "Compara diferentes órdenes monásticas: benedictinos (trabajo y oración), cistercienses (reforma austera), franciscanos y dominicos (órdenes mendicantes)"
            ]
          },
          {
            "key": "cruzadas",
            "name": "Las Cruzadas",
            "short_description": "Guerras santas para recuperar Tierra Santa, consecuencias políticas, económicas y culturales.",
            "example_tasks": [
              "Explica las causas de las Cruzadas: motivos religiosos, control de Tierra Santa, intereses económicos y políticos de nobles y comerciantes",
              "Describe el desarrollo de las principales Cruzadas (1095-1291) identificando victorias temporales cristianas y reconquista musulmana final",
              "Analiza las consecuencias de las Cruzadas: reapertura del comercio mediterráneo, intercambio cultural entre Oriente y Occidente, debilitamiento del feudalismo",
              "Evalúa el impacto de las Cruzadas en las relaciones entre cristianismo e islam, incluyendo tanto conflictos como intercambios culturales"
            ]
          }
        ]
      },
      {
        "key": "islam_expansion",
        "name": "El Islam y su expansión",
        "short_description": "Surgimiento del islam, califatos árabes, expansión territorial y aportes culturales.",
        "sub_topics": [
          {
            "key": "mahoma_islam",
            "name": "Mahoma y el nacimiento del Islam",
            "short_description": "Vida de Mahoma, revelación del Corán, hegira y los cinco pilares del Islam.",
            "example_tasks": [
              "Narra la vida de Mahoma: su juventud en La Meca, las revelaciones del arcángel Gabriel, la hegira a Medina (622) y el establecimiento del islam",
              "Explica los cinco pilares del Islam: shahada (profesión de fe), salat (oración), zakat (limosna), sawm (ayuno del Ramadán), hajj (peregrinación a La Meca)",
              "Describe el Corán como texto sagrado del Islam y la Sunna como conjunto de tradiciones del profeta Mahoma"
            ]
          },
          {
            "key": "expansion_islamica",
            "name": "Expansión del Islam",
            "short_description": "Califatos ortodoxos, omeyas y abasidas: conquistas y administración imperial.",
            "example_tasks": [
              "Elabora un mapa mostrando la expansión del Islam desde Arabia hasta España, norte de África, Medio Oriente, Persia y Asia Central en el siglo VIII",
              "Describe los califatos ortodoxos, omeya (capital en Damasco) y abasida (capital en Bagdad), identificando sus características políticas y culturales",
              "Explica la conquista musulmana de la península ibérica en 711 y el establecimiento de Al-Ándalus, que duró hasta 1492",
              "Analiza la Batalla de Poitiers (732) donde los francos detuvieron el avance musulmán en Europa occidental"
            ]
          },
          {
            "key": "cultura_islamica",
            "name": "Cultura y ciencia en el mundo islámico",
            "short_description": "Edad de oro islámica: filosofía, ciencia, matemáticas, arquitectura y preservación del conocimiento clásico.",
            "example_tasks": [
              "Explica los aportes científicos del mundo islámico medieval: álgebra (Al-Juarismi), medicina (Avicena), óptica (Alhazen), química y astronomía",
              "Describe la Casa de la Sabiduría en Bagdad como centro de traducción y estudio donde se preservaron y comentaron textos griegos, persas e indios",
              "Analiza la arquitectura islámica mediante ejemplos como la Mezquita de Córdoba, la Alhambra de Granada o la Cúpula de la Roca en Jerusalén",
              "Explica cómo el mundo islámico transmitió conocimientos de las civilizaciones antiguas a Europa medieval, facilitando el Renacimiento"
            ]
          }
        ]
      },
      {
        "key": "imperio_bizantino",
        "name": "El Imperio Bizantino",
        "short_description": "Continuidad del Imperio Romano de Oriente, Justiniano, cisma religioso y legado cultural.",
        "sub_topics": [
          {
            "key": "constantinopla_bizancio",
            "name": "Constantinopla y el Imperio de Oriente",
            "short_description": "Ubicación estratégica, organización administrativa y economía bizantina.",
            "example_tasks": [
              "Explica la ubicación estratégica de Constantinopla como puente entre Europa y Asia, controlando rutas comerciales del Mediterráneo y el Mar Negro",
              "Describe la organización del Imperio Bizantino: gobierno centralizado, burocracia eficiente, ejército profesional y economía basada en comercio",
              "Analiza cómo Bizancio preservó el legado romano mientras desarrollaba una identidad cultural griega y cristiana ortodoxa propia"
            ]
          },
          {
            "key": "justiniano",
            "name": "Justiniano y el apogeo bizantino",
            "short_description": "Reconquistas de Justiniano, Código Justiniano y Santa Sofía.",
            "example_tasks": [
              "Describe las campañas militares de Justiniano I para reconquistar territorios del antiguo Imperio Romano de Occidente: norte de África, Italia, sur de España",
              "Explica la importancia del Código Justiniano (Corpus Iuris Civilis) como compilación del derecho romano y su influencia en sistemas jurídicos posteriores",
              "Analiza la basílica de Santa Sofía en Constantinopla como obra maestra de la arquitectura bizantina, describiendo su cúpula y mosaicos"
            ]
          },
          {
            "key": "cisma_oriente_occidente",
            "name": "Cisma entre Oriente y Occidente",
            "short_description": "División entre las iglesias católica y ortodoxa en 1054.",
            "example_tasks": [
              "Explica las causas del Cisma de Oriente de 1054: diferencias doctrinales, disputas sobre autoridad papal, uso de iconos y lengua litúrgica",
              "Compara las características de la Iglesia católica romana y la Iglesia ortodoxa griega tras la separación",
              "Describe la caída de Constantinopla ante los turcos otomanos en 1453, marcando el fin del Imperio Bizantino y el fin de la Edad Media"
            ]
          }
        ]
      },
      {
        "key": "baja_edad_media",
        "name": "Baja Edad Media",
        "short_description": "Renacimiento comercial y urbano, crisis del siglo XIV, desarrollo de monarquías nacionales.",
        "sub_topics": [
          {
            "key": "renacimiento_comercial",
            "name": "Renacimiento comercial y urbano",
            "short_description": "Crecimiento de ciudades, gremios, ferias y surgimiento de la burguesía.",
            "example_tasks": [
              "Explica el renacimiento del comercio en los siglos XI-XIII: reapertura de rutas mediterráneas, ferias, Liga Hanseática y ciudades italianas",
              "Describe la organización de los gremios medievales (maestros, oficiales, aprendices) y su función en regular la producción artesanal",
              "Analiza el surgimiento de la burguesía urbana como nueva clase social basada en el comercio y su demanda de autonomía mediante cartas forales"
            ]
          },
          {
            "key": "crisis_siglo_XIV",
            "name": "Crisis del siglo XIV",
            "short_description": "Peste negra, guerras, hambrunas y transformaciones sociales.",
            "example_tasks": [
              "Describe el impacto demográfico, económico y social de la peste negra (1347-1351) que eliminó entre un tercio y la mitad de la población europea",
              "Explica las consecuencias de la crisis del siglo XIV: debilitamiento del feudalismo, escasez de mano de obra, mejores condiciones para campesinos sobrevivientes",
              "Analiza la Guerra de los Cien Años (1337-1453) entre Inglaterra y Francia como ejemplo de los conflictos que marcaron el fin de la Edad Media"
            ]
          },
          {
            "key": "monarquias_nacionales",
            "name": "Formación de monarquías nacionales",
            "short_description": "Centralización del poder real y surgimiento de los Estados nacionales modernos.",
            "example_tasks": [
              "Explica el proceso de centralización monárquica: fortalecimiento del poder real, creación de ejércitos permanentes, burocracia y recaudación fiscal",
              "Describe la formación de monarquías nacionales en Francia, Inglaterra y España durante los siglos XIV-XV",
              "Analiza la Reconquista española culminada en 1492 con la toma de Granada y la unificación bajo los Reyes Católicos"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "renacimiento_humanismo",
    "name": "Renacimiento y Humanismo",
    "short_description": "Movimiento cultural europeo de los siglos XV-XVI que rescató la cultura clásica, promovió el antropocentrismo y transformó el arte, la ciencia y el pensamiento.",
    "sub_topics": [
      {
        "key": "caracteristicas_renacimiento",
        "name": "Características del Renacimiento",
        "short_description": "Ruptura con la Edad Media, antropocentrismo, racionalismo y retorno a los valores clásicos.",
        "sub_topics": [
          {
            "key": "humanismo",
            "name": "El humanismo renacentista",
            "short_description": "Corriente intelectual centrada en el ser humano, el estudio de las humanidades y los textos clásicos.",
            "example_tasks": [
              "Define el humanismo renacentista explicando su énfasis en el ser humano, la razón, la dignidad individual y el estudio de autores grecolatinos",
              "Compara la mentalidad medieval (teocéntrica) con la renacentista (antropocéntrica) identificando cambios en la concepción del mundo y del ser humano",
              "Describe las contribuciones de humanistas como Petrarca, Erasmo de Rotterdam y Tomás Moro al desarrollo del pensamiento renacentista"
            ]
          },
          {
            "key": "origen_italia",
            "name": "Italia: cuna del Renacimiento",
            "short_description": "Factores que hicieron de Italia el centro del Renacimiento: ciudades-estado, mecenazgo y herencia clásica.",
            "example_tasks": [
              "Explica por qué el Renacimiento surgió en Italia: prosperidad de ciudades comerciales, mecenazgo de familias ricas, cercanía a ruinas romanas",
              "Describe el papel de las ciudades-estado italianas (Florencia, Venecia, Roma) como centros culturales y económicos del Renacimiento",
              "Analiza el mecenazgo de familias como los Medici en Florencia, explicando cómo patrocinaban artistas, arquitectos y eruditos"
            ]
          }
        ]
      },
      {
        "key": "arte_renacentista",
        "name": "Arte renacentista",
        "short_description": "Renovación artística basada en la observación de la naturaleza, perspectiva, anatomía y temas clásicos.",
        "sub_topics": [
          {
            "key": "pintura_escultura",
            "name": "Pintura y escultura renacentista",
            "short_description": "Grandes maestros del Renacimiento: técnicas, obras y aportes artísticos.",
            "example_tasks": [
              "Describe las innovaciones técnicas de la pintura renacentista: perspectiva lineal, sfumato, claroscuro, óleo y estudio anatómico",
              "Analiza obras de Leonardo da Vinci (La Última Cena, La Mona Lisa) identificando características renacentistas como composición, realismo y simbolismo",
              "Compara estilos de los grandes maestros: Leonardo (sfumato y estudios científicos), Miguel Ángel (monumentalidad) y Rafael (armonía y equilibrio)",
              "Explica la escultura renacentista mediante obras de Donatello (David) y Miguel Ángel (David, Pietà, Moisés) destacando el estudio del cuerpo humano"
            ]
          },
          {
            "key": "arquitectura_renacentista",
            "name": "Arquitectura renacentista",
            "short_description": "Recuperación de elementos clásicos: cúpulas, columnas, proporciones matemáticas.",
            "example_tasks": [
              "Describe características de la arquitectura renacentista: simetría, proporción matemática, columnas clásicas, arcos de medio punto, cúpulas",
              "Analiza la cúpula de la catedral de Florencia diseñada por Brunelleschi como innovación técnica y símbolo del Renacimiento",
              "Explica el diseño de la Basílica de San Pedro en Roma destacando las contribuciones de Bramante, Miguel Ángel y Bernini"
            ]
          }
        ]
      },
      {
        "key": "revolucion_cientifica",
        "name": "Revolución científica",
        "short_description": "Transformación del pensamiento científico mediante la observación, experimentación y método científico.",
        "sub_topics": [
          {
            "key": "heliocentrismo",
            "name": "Revolución astronómica",
            "short_description": "Copérnico, Galileo y Kepler: del geocentrismo al heliocentrismo.",
            "example_tasks": [
              "Explica la teoría heliocéntrica de Nicolás Copérnico y cómo contradijo el modelo geocéntrico ptolemaico aceptado por la Iglesia",
              "Describe las observaciones de Galileo Galilei con el telescopio: lunas de Júpiter, fases de Venus, manchas solares, que confirmaron el heliocentrismo",
              "Analiza el juicio de Galileo por la Inquisición en 1633 y el conflicto entre ciencia y autoridad religiosa",
              "Explica las leyes de Kepler sobre el movimiento planetario y cómo mejoraron el modelo heliocéntrico de Copérnico"
            ]
          },
          {
            "key": "metodo_cientifico",
            "name": "Desarrollo del método científico",
            "short_description": "Francis Bacon, Descartes y el empirismo: observación, hipótesis, experimentación.",
            "example_tasks": [
              "Describe el método científico propuesto por Francis Bacon basado en la observación empírica y la inducción experimental",
              "Explica el racionalismo de René Descartes expresado en 'Pienso, luego existo' y su método de duda metódica",
              "Compara el empirismo (conocimiento por experiencia) y el racionalismo (conocimiento por razón) como fundamentos de la ciencia moderna"
            ]
          },
          {
            "key": "avances_cientificos",
            "name": "Otros avances científicos",
            "short_description": "Contribuciones en anatomía, física, matemáticas y medicina.",
            "example_tasks": [
              "Describe los estudios anatómicos de Andreas Vesalius que corrigieron errores de Galeno mediante disecciones directas",
              "Explica los aportes de Isaac Newton: ley de la gravitación universal, leyes del movimiento, cálculo infinitesimal y óptica",
              "Analiza cómo la invención del microscopio por Leeuwenhoek revolucionó la biología permitiendo observar microorganismos"
            ]
          }
        ]
      },
      {
        "key": "reforma_protestante",
        "name": "La Reforma protestante",
        "short_description": "Movimiento religioso del siglo XVI que dividió al cristianismo occidental en católicos y protestantes.",
        "sub_topics": [
          {
            "key": "lutero_reforma",
            "name": "Martín Lutero y el inicio de la Reforma",
            "short_description": "95 tesis contra las indulgencias, doctrina luterana y ruptura con Roma.",
            "example_tasks": [
              "Explica las causas de la Reforma protestante: corrupción eclesiástica, venta de indulgencias, poder político del papado, aspiraciones de príncipes alemanes",
              "Describe las 95 tesis de Martín Lutero (1517) que criticaban las indulgencias y desencadenaron la Reforma protestante",
              "Explica las doctrinas fundamentales del luteranismo: salvación por la fe sola (sola fide), autoridad de la Biblia (sola scriptura), sacerdocio universal",
              "Analiza la Dieta de Worms (1521) donde Lutero fue declarado hereje y la protección que recibió de príncipes alemanes"
            ]
          },
          {
            "key": "expansion_protestantismo",
            "name": "Expansión del protestantismo",
            "short_description": "Calvinismo, anglicanismo y otras iglesias reformadas en Europa.",
            "example_tasks": [
              "Describe el calvinismo de Juan Calvino: predestinación, teocracia en Ginebra, ética del trabajo y su influencia en Suiza, Países Bajos y Escocia",
              "Explica el origen de la Iglesia anglicana bajo Enrique VIII de Inglaterra, combinando causas políticas (divorcio) y religiosas",
              "Compara las principales ramas protestantes: luteranismo (Alemania, Escandinavia), calvinismo (Suiza, Países Bajos), anglicanismo (Inglaterra)"
            ]
          },
          {
            "key": "contrarreforma",
            "name": "La Contrarreforma católica",
            "short_description": "Respuesta de la Iglesia católica: Concilio de Trento, jesuitas e Inquisición.",
            "example_tasks": [
              "Explica las decisiones del Concilio de Trento (1545-1563): reafirmación de doctrinas católicas, reforma del clero, prohibición de venta de indulgencias",
              "Describe el papel de la Compañía de Jesús (jesuitas) fundada por Ignacio de Loyola en la Contrarreforma: educación, misiones, defensa del papado",
              "Analiza el uso de la Inquisición y el Índice de libros prohibidos como instrumentos de control doctrinal durante la Contrarreforma",
              "Evalúa las consecuencias de la Reforma: división permanente del cristianismo, guerras de religión, desarrollo de la tolerancia religiosa gradual"
            ]
          }
        ]
      },
      {
        "key": "exploraciones_geograficas",
        "name": "Exploraciones geográficas",
        "short_description": "Grandes descubrimientos geográficos de los siglos XV-XVI: causas, viajes y consecuencias del encuentro de dos mundos.",
        "sub_topics": [
          {
            "key": "causas_exploraciones",
            "name": "Causas de las exploraciones",
            "short_description": "Motivos económicos, tecnológicos, religiosos y políticos de los viajes de exploración.",
            "example_tasks": [
              "Identifica las causas de las exploraciones: búsqueda de rutas comerciales a Asia, espíritu renacentista, competencia entre reinos, evangelización",
              "Explica los avances tecnológicos que hicieron posibles los viajes: carabela, brújula, astrolabio, portulanos, mejoras en cartografía",
              "Describe la búsqueda de especias asiáticas y el deseo de evitar intermediarios musulmanes como motivos económicos principales"
            ]
          },
          {
            "key": "exploraciones_portuguesas",
            "name": "Exploraciones portuguesas",
            "short_description": "Enrique el Navegante, bordeo de África y ruta a la India.",
            "example_tasks": [
              "Describe el papel de Enrique el Navegante en impulsar las exploraciones portuguesas por la costa africana en el siglo XV",
              "Explica el viaje de Bartolomé Díaz que dobló el Cabo de Buena Esperanza en 1488, abriendo la ruta marítima hacia el océano Índico",
              "Analiza el viaje de Vasco da Gama a la India (1497-1499) estableciendo la ruta marítima portuguesa a Asia",
              "Describe el imperio comercial portugués en África, Asia y Brasil durante los siglos XVI-XVII"
            ]
          },
          {
            "key": "viajes_colon",
            "name": "Los viajes de Cristóbal Colón",
            "short_description": "Proyecto colombino, llegada a América y consecuencias del encuentro.",
            "example_tasks": [
              "Explica el proyecto de Cristóbal Colón de llegar a Asia navegando hacia el oeste y su error en el cálculo de la circunferencia terrestre",
              "Describe el primer viaje de Colón (1492): apoyo de los Reyes Católicos, ruta por las Canarias, llegada a las Antillas el 12 de octubre",
              "Analiza los cuatro viajes de Colón (1492, 1493, 1498, 1502) y los territorios explorados en el Caribe y costa continental",
              "Explica por qué América lleva el nombre de Américo Vespucio y no de Cristóbal Colón, quien murió creyendo haber llegado a Asia"
            ]
          },
          {
            "key": "otras_exploraciones",
            "name": "Otras exploraciones",
            "short_description": "Tratado de Tordesillas, Magallanes-Elcano y exploración de nuevos territorios.",
            "example_tasks": [
              "Explica el Tratado de Tordesillas (1494) entre España y Portugal que dividió el mundo en dos zonas de influencia",
              "Describe la expedición de Magallanes-Elcano (1519-1522) que dio la primera vuelta al mundo, confirmando la esfericidad de la Tierra",
              "Analiza las exploraciones del continente americano: Balboa (océano Pacífico), Cortés (México), Pizarro (Perú), Caboto (Río de la Plata)"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "conquista_colonizacion_america",
    "name": "Conquista y Colonización de América",
    "short_description": "Proceso de conquista española de América, caída de los imperios mesoamericanos y andinos, establecimiento del sistema colonial.",
    "sub_topics": [
      {
        "key": "conquista_mesoamerica",
        "name": "Conquista de Mesoamérica",
        "short_description": "Expediciones españolas, conquista del imperio mexica y sometimiento de otros pueblos.",
        "sub_topics": [
          {
            "key": "antecedentes_conquista",
            "name": "Antecedentes de la conquista",
            "short_description": "Primeras expediciones españolas al territorio mexicano antes de Cortés.",
            "example_tasks": [
              "Describe las expediciones previas a Cortés: Francisco Hernández de Córdoba (1517) en Yucatán y Juan de Grijalva (1518) en Veracruz",
              "Explica el establecimiento de españoles en Cuba y Santo Domingo como base para las expediciones de exploración y conquista",
              "Analiza la información que los españoles obtuvieron sobre las riquezas del imperio mexica antes de la expedición de Cortés"
            ]
          },
          {
            "key": "conquista_tenochtitlan",
            "name": "Conquista de Tenochtitlán",
            "short_description": "Expedición de Hernán Cortés, alianzas indígenas, resistencia mexica y caída del imperio.",
            "example_tasks": [
              "Describe la expedición de Hernán Cortés desde Cuba en 1519: desembarco en Veracruz, fundación de la Villa Rica de la Vera Cruz, quema de naves",
              "Explica las alianzas de Cortés con pueblos enemigos de los mexicas: totonacas de Cempoala, tlaxcaltecas y otros señoríos mesoamericanos",
              "Analiza el papel de Malintzin (La Malinche) como intérprete y mediadora cultural entre españoles e indígenas",
              "Narra la Noche Triste (30 de junio de 1520): expulsión de españoles de Tenochtitlán, muerte de Moctezuma II y pérdidas españolas",
              "Describe el sitio y conquista de Tenochtitlán (1521): bloqueo, hambre, epidemia de viruela, resistencia de Cuauhtémoc y caída final el 13 de agosto"
            ]
          },
          {
            "key": "factores_conquista",
            "name": "Factores que favorecieron la conquista",
            "short_description": "Elementos militares, políticos, biológicos y culturales que facilitaron el triunfo español.",
            "example_tasks": [
              "Analiza las ventajas tecnológicas españolas: armas de fuego, caballos, armaduras de metal, perros de guerra y barcos",
              "Explica cómo las divisiones políticas entre pueblos mesoamericanos y el resentimiento contra los mexicas favorecieron a los españoles",
              "Describe el impacto devastador de las enfermedades europeas (viruela, sarampión, tifus) en la población indígena sin defensas inmunológicas",
              "Analiza factores culturales: interpretación de presagios, confusión inicial con el retorno de Quetzalcóatl, estrategias de guerra diferentes"
            ]
          },
          {
            "key": "conquista_otros_pueblos",
            "name": "Conquista de otros pueblos de Mesoamérica",
            "short_description": "Sometimiento de mayas, mixtecos, zapotecos y resistencia de algunos pueblos.",
            "example_tasks": [
              "Describe la conquista de los pueblos mayas en Yucatán, Guatemala y Chiapas entre 1527-1546, destacando la resistencia prolongada",
              "Explica la conquista de Michoacán y el sometimiento del señorío tarasco bajo Nuño de Guzmán",
              "Analiza la Guerra del Mixtón (1540-1542) como ejemplo de resistencia indígena al dominio español en el occidente de México",
              "Describe la resistencia de pueblos nómadas del norte (chichimecas) que retrasó la colonización durante décadas"
            ]
          }
        ]
      },
      {
        "key": "conquista_sudamerica",
        "name": "Conquista de Sudamérica",
        "short_description": "Conquista del imperio inca y colonización del resto del continente.",
        "sub_topics": [
          {
            "key": "imperio_inca",
            "name": "El imperio inca antes de la conquista",
            "short_description": "Organización política, social y económica del Tahuantinsuyo.",
            "example_tasks": [
              "Describe la organización del imperio inca o Tahuantinsuyo: gobierno del Sapa Inca, división en cuatro suyos, sistema de caminos",
              "Explica el sistema económico inca basado en la reciprocidad, la mita (trabajo obligatorio) y la redistribución de recursos",
              "Analiza la expansión inca bajo Pachacútec y otros gobernantes hasta formar el imperio más grande de América precolombina"
            ]
          },
          {
            "key": "pizarro_conquista_peru",
            "name": "Pizarro y la conquista del Perú",
            "short_description": "Expediciones de Pizarro, guerra civil inca, captura de Atahualpa y caída del imperio.",
            "example_tasks": [
              "Describe las expediciones de Francisco Pizarro desde Panamá (1524-1532) en busca del rico imperio del sur",
              "Explica cómo la guerra civil entre Huáscar y Atahualpa debilitó al imperio inca facilitando la conquista española",
              "Narra la captura de Atahualpa en Cajamarca (1532): emboscada española, rescate en oro y plata, ejecución del Sapa Inca",
              "Analiza la conquista de Cuzco (1533) y el establecimiento del dominio español sobre el territorio inca",
              "Describe la resistencia inca en Vilcabamba (1536-1572) como último reducto de resistencia hasta la captura de Túpac Amaru"
            ]
          }
        ]
      },
      {
        "key": "consecuencias_conquista",
        "name": "Consecuencias de la conquista",
        "short_description": "Impacto demográfico, cultural, económico y social en América y Europa.",
        "sub_topics": [
          {
            "key": "catastrofe_demografica",
            "name": "Catástrofe demográfica",
            "short_description": "Drástica disminución de la población indígena por enfermedades, guerras y explotación.",
            "example_tasks": [
              "Analiza el colapso demográfico indígena en el siglo XVI: de aproximadamente 25 millones a menos de 2 millones en la Nueva España",
              "Explica las causas de la mortandad: epidemias (viruela, sarampión, tifus), guerras, trabajos forzados, destrucción de sistemas productivos",
              "Describe las congregaciones de indios como política de concentración poblacional y su impacto en comunidades indígenas"
            ]
          },
          {
            "key": "sincretismo_cultural",
            "name": "Sincretismo cultural",
            "short_description": "Fusión de elementos culturales europeos, indígenas y posteriormente africanos.",
            "example_tasks": [
              "Define el sincretismo cultural como fusión de elementos de diferentes culturas: religión, lengua, gastronomía, arquitectura",
              "Explica el sincretismo religioso mediante ejemplos como la Virgen de Guadalupe que incorpora elementos de la diosa Tonantzin",
              "Describe cómo festividades católicas se mezclaron con tradiciones prehispánicas, como el Día de Muertos"
            ]
          },
          {
            "key": "intercambio_colombino",
            "name": "Intercambio colombino",
            "short_description": "Transferencia de plantas, animales, tecnologías y enfermedades entre América y el Viejo Mundo.",
            "example_tasks": [
              "Identifica productos americanos que llegaron a Europa: maíz, papa, tomate, cacao, tabaco, chile, calabaza y su impacto en la dieta mundial",
              "Describe productos y animales que llegaron a América: trigo, vid, caña de azúcar, ganado (caballos, vacas, cerdos, ovejas), hierro",
              "Analiza cómo la papa americana ayudó a combatir el hambre en Europa y cómo el caballo transformó la vida de pueblos americanos",
              "Evalúa el intercambio colombino como proceso de consecuencias mixtas: enriquecimiento alimentario pero también transmisión de enfermedades"
            ]
          }
        ]
      },
      {
        "key": "sistema_colonial",
        "name": "Establecimiento del sistema colonial",
        "short_description": "Organización política, económica y social de las colonias españolas en América.",
        "sub_topics": [
          {
            "key": "administracion_colonial",
            "name": "Administración colonial española",
            "short_description": "Virreinatos, audiencias, cabildos y autoridades coloniales.",
            "example_tasks": [
              "Describe la organización administrativa del imperio español: Consejo de Indias (en España), virreinatos, audiencias, gobernaciones, cabildos",
              "Explica la creación del virreinato de Nueva España en 1535 con capital en la Ciudad de México sobre las ruinas de Tenochtitlán",
              "Identifica otros virreinatos americanos: Perú (1542), Nueva Granada (1717), Río de la Plata (1776) y sus territorios",
              "Describe las funciones de virreyes, oidores, corregidores y alcaldes en la administración colonial"
            ]
          },
          {
            "key": "economia_colonial",
            "name": "Economía colonial",
            "short_description": "Minería, agricultura, ganadería, comercio monopolístico y explotación de mano de obra.",
            "example_tasks": [
              "Explica la importancia de la minería de plata (Zacatecas, Guanajuato, Potosí) como base de la economía colonial y fuente de riqueza para España",
              "Describe las haciendas como unidades productivas agrícolas y ganaderas trabajadas por indígenas y mestizos",
              "Analiza el sistema de flotas y galeones que monopolizaba el comercio entre España y América",
              "Explica el mercantilismo como política económica que consideraba las colonias como fuentes de materias primas y mercados para productos españoles"
            ]
          },
          {
            "key": "trabajo_indigena",
            "name": "Sistemas de trabajo indígena",
            "short_description": "Encomienda, repartimiento, esclavitud y debates sobre el trato a los indios.",
            "example_tasks": [
              "Describe la encomienda como sistema donde españoles recibían grupos de indígenas para extraer tributo y trabajo a cambio de evangelizarlos",
              "Explica el repartimiento o cuatequil como trabajo forzado rotativo de indígenas en obras públicas, minas y haciendas",
              "Analiza la esclavitud de africanos traídos para trabajar en plantaciones, minas y trabajos pesados",
              "Describe el debate entre Bartolomé de las Casas y Ginés de Sepúlveda sobre la humanidad de los indios y su derecho al buen trato"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "colonia_nueva_espana",
    "name": "La Colonia en Nueva España",
    "short_description": "Desarrollo de la sociedad, economía, cultura y vida cotidiana en la Nueva España durante los tres siglos de dominio español (1521-1821).",
    "sub_topics": [
      {
        "key": "sociedad_colonial",
        "name": "Sociedad colonial",
        "short_description": "Estructura social estratificada basada en origen étnico y lugar de nacimiento.",
        "sub_topics": [
          {
            "key": "castas_coloniales",
            "name": "Sistema de castas",
            "short_description": "Clasificación social según mezcla racial: peninsulares, criollos, mestizos, indígenas, negros.",
            "example_tasks": [
              "Elabora una pirámide social de la Nueva España mostrando la jerarquía: peninsulares, criollos, mestizos, indígenas, negros y castas mixtas",
              "Explica las diferencias entre peninsulares (nacidos en España) y criollos (españoles nacidos en América) y las tensiones entre ambos grupos",
              "Describe el complejo sistema de castas que clasificaba las mezclas raciales: mestizo, mulato, zambo, castizo, morisco, coyote, etc.",
              "Analiza las pinturas de castas del siglo XVIII como documentos que representan la diversidad étnica y las jerarquías sociales coloniales"
            ]
          },
          {
            "key": "pueblos_indios",
            "name": "Los pueblos de indios",
            "short_description": "Organización, república de indios, tributo y pérdida de tierras.",
            "example_tasks": [
              "Describe la república de indios como sistema de gobierno separado de la república de españoles en la organización colonial",
              "Explica las obligaciones de los pueblos de indios: tributo en especie o dinero, trabajo en repartimiento, servicio en obras públicas",
              "Analiza el proceso de despojo de tierras comunales indígenas mediante composiciones, mercedes y expansión de haciendas",
              "Describe la pervivencia de autoridades tradicionales indígenas bajo el control colonial: caciques, gobernadores, principales"
            ]
          },
          {
            "key": "afrodescendientes",
            "name": "Población afrodescendiente",
            "short_description": "Esclavitud africana, cimarrones, aportaciones culturales afromexicanas.",
            "example_tasks": [
              "Explica las causas de la introducción de esclavos africanos en Nueva España: colapso demográfico indígena, trabajo en plantaciones y minas",
              "Describe las condiciones de vida de los esclavos africanos y sus descendientes en haciendas, minas, ingenios azucareros y centros urbanos",
              "Analiza la resistencia de cimarrones: esclavos fugitivos que formaron palenques o pueblos libres como el de Yanga en Veracruz",
              "Identifica aportaciones culturales afromexicanas en música, danza, gastronomía y tradiciones que persisten en regiones como Veracruz, Guerrero y Oaxaca"
            ]
          }
        ]
      },
      {
        "key": "economia_novohispana",
        "name": "Economía novohispana",
        "short_description": "Actividades productivas, comercio y desarrollo económico de la Nueva España.",
        "sub_topics": [
          {
            "key": "mineria_colonial",
            "name": "La minería colonial",
            "short_description": "Explotación de plata, método de patio, reales de minas y acuñación de moneda.",
            "example_tasks": [
              "Explica la importancia de la minería de plata en la economía novohispana mediante ejemplos de centros mineros como Zacatecas, Guanajuato y Taxco",
              "Describe el método de patio o de amalgama con mercurio inventado por Bartolomé de Medina para extraer plata del mineral",
              "Analiza cómo los reales de minas generaron ciudades, demandaron alimentos, estimularon el comercio y articularon la economía regional",
              "Explica la importancia de la Casa de Moneda de México que acuñaba reales de a ocho circulados internacionalmente"
            ]
          },
          {
            "key": "haciendas_obrajes",
            "name": "Haciendas y obrajes",
            "short_description": "Producción agrícola, ganadera y manufacturas textiles.",
            "example_tasks": [
              "Describe la hacienda como unidad productiva agrícola-ganadera: tierras, trabajadores, tienda de raya, sistema de endeudamiento",
              "Explica la producción de las haciendas: cereales (trigo, maíz), caña de azúcar, ganado, pulque y productos para mercado interno",
              "Analiza los obrajes como talleres textiles donde trabajadores producían telas de lana en condiciones precarias",
              "Compara haciendas (extensivas, ganaderas) con ranchos (menores, familiares) en la estructura productiva colonial"
            ]
          },
          {
            "key": "comercio_colonial",
            "name": "Comercio colonial",
            "short_description": "Galeón de Manila, comercio triangular, monopolio español y contrabando.",
            "example_tasks": [
              "Explica el sistema de flotas que conectaba Veracruz con España una vez al año llevando plata y trayendo productos europeos",
              "Describe el Galeón de Manila o Nao de China que conectaba Acapulco con Filipinas intercambiando plata por sedas, porcelanas y especias asiáticas",
              "Analiza el monopolio comercial español y sus consecuencias: altos precios, escasez, estímulo al contrabando",
              "Explica cómo el comercio internacional estimuló ferias como la de Xalapa y desarrolló ciudades como Veracruz, Acapulco y la Ciudad de México"
            ]
          }
        ]
      },
      {
        "key": "iglesia_educacion",
        "name": "Iglesia y educación",
        "short_description": "Papel de la Iglesia católica, evangelización, órdenes religiosas y desarrollo educativo.",
        "sub_topics": [
          {
            "key": "evangelizacion",
            "name": "La evangelización",
            "short_description": "Métodos de conversión, destrucción de ídolos, construcción de templos.",
            "example_tasks": [
              "Describe los métodos de evangelización: aprendizaje de lenguas indígenas, destrucción de templos, construcción de iglesias sobre sitios sagrados",
              "Explica el papel de las órdenes religiosas en la evangelización: franciscanos (1524), dominicos (1526), agustinos (1533), jesuitas (1572)",
              "Analiza los conventos del siglo XVI como centros de evangelización: atriales amplios para reunir multitudes, capillas abiertas, decoración didáctica",
              "Describe el teatro misionero y otras estrategias culturales para transmitir el cristianismo adaptándolo a formas indígenas de expresión"
            ]
          },
          {
            "key": "inquisicion",
            "name": "La Inquisición",
            "short_description": "Tribunal del Santo Oficio, persecución de herejías y control ideológico.",
            "example_tasks": [
              "Explica el establecimiento del Tribunal del Santo Oficio en Nueva España (1571) para combatir herejías, brujería y desvíos doctrinales",
              "Describe los procedimientos inquisitoriales: denuncias, investigaciones secretas, tortura, autos de fe públicos",
              "Analiza casos famosos de la Inquisición novohispana: persecución de judaizantes, procesos contra bígamos, censura de libros",
              "Explica que los indígenas quedaron excluidos de la jurisdicción inquisitorial por considerarse 'neófitos' en la fe"
            ]
          },
          {
            "key": "educacion_colonial",
            "name": "Educación en la Colonia",
            "short_description": "Escuelas, colegios, universidad y acceso diferenciado según clase social.",
            "example_tasks": [
              "Describe la fundación de la Real y Pontificia Universidad de México en 1551, tercera universidad de América, y sus facultades",
              "Explica la educación diferenciada: escuelas de primeras letras para niños españoles y criollos, colegios religiosos para élites",
              "Analiza los colegios jesuitas como centros de educación secundaria y superior de gran prestigio hasta la expulsión de 1767",
              "Describe la educación de indígenas en doctrina cristiana, artes y oficios en conventos y escuelas separadas"
            ]
          }
        ]
      },
      {
        "key": "arte_cultura_barroca",
        "name": "Arte y cultura barroca",
        "short_description": "Expresiones artísticas, literarias y arquitectónicas del barroco novohispano.",
        "sub_topics": [
          {
            "key": "arquitectura_barroca",
            "name": "Arquitectura barroca",
            "short_description": "Catedrales, iglesias, retablos churriguerescos y estilo ultrabarroco.",
            "example_tasks": [
              "Describe características de la arquitectura barroca novohispana: exuberancia decorativa, estípites, uso de oro, relieves elaborados",
              "Analiza ejemplos arquitectónicos: Catedral Metropolitana, iglesia de Santa Prisca en Taxco, Templo de Santo Domingo en Oaxaca",
              "Explica el estilo churrigueresco o ultrabarroco con profusa ornamentación dorada en retablos y fachadas",
              "Describe cómo indígenas y mestizos adaptaron el barroco incorporando elementos de su tradición artística"
            ]
          },
          {
            "key": "literatura_colonial",
            "name": "Literatura colonial",
            "short_description": "Crónicas, teatro, poesía barroca y Sor Juana Inés de la Cruz.",
            "example_tasks": [
              "Analiza las crónicas coloniales como fuentes históricas: Bernal Díaz del Castillo (Historia verdadera), Sahagún (Historia general)",
              "Explica el desarrollo del teatro novohispano: autos sacramentales, comedias, teatro evangelizador",
              "Describe la obra de Sor Juana Inés de la Cruz: poesía barroca, defensa del derecho de las mujeres al conocimiento, obras teatrales",
              "Analiza poemas famosos de Sor Juana como 'Hombres necios' o su 'Respuesta a Sor Filotea' como textos de proto-feminismo"
            ]
          },
          {
            "key": "pintura_escultura_colonial",
            "name": "Pintura y escultura colonial",
            "short_description": "Arte sacro, retratos, biombo, pinturas de castas.",
            "example_tasks": [
              "Describe la pintura religiosa novohispana: vírgenes, santos, vidas de Cristo, arcángeles, y su función didáctica",
              "Analiza obras de pintores como Cristóbal de Villalpando, Juan Correa y Miguel Cabrera",
              "Explica las pinturas de castas como género único novohispano que retrataba las mezclas raciales",
              "Describe la escultura religiosa en madera policromada: cristos, vírgenes dolorosas, imágenes procesionales"
            ]
          }
        ]
      },
      {
        "key": "reformas_borbonicas",
        "name": "Reformas borbónicas",
        "short_description": "Cambios administrativos, económicos y políticos del siglo XVIII bajo la dinastía Borbón.",
        "sub_topics": [
          {
            "key": "objetivos_reformas",
            "name": "Objetivos de las reformas borbónicas",
            "short_description": "Modernización administrativa, aumento de ingresos fiscales y control centralizado.",
            "example_tasks": [
              "Explica los objetivos de las reformas borbónicas: modernizar la administración, aumentar ingresos fiscales, recuperar control sobre colonias",
              "Describe el contexto de las reformas: debilitamiento español, competencia con Inglaterra y Francia, ideas ilustradas",
              "Analiza el modelo de monarquía centralizada y eficiente que los Borbones querían imponer siguiendo el ejemplo francés"
            ]
          },
          {
            "key": "cambios_administrativos",
            "name": "Cambios administrativos",
            "short_description": "Intendencias, nuevo sistema fiscal, expulsión de jesuitas.",
            "example_tasks": [
              "Explica la creación del sistema de intendencias en 1786 que dividió la Nueva España en 12 jurisdicciones con mayor control central",
              "Describe la expulsión de los jesuitas en 1767: causas políticas, confiscación de bienes, impacto en educación y misiones",
              "Analiza el establecimiento de nuevos impuestos y la mejora en la recaudación fiscal que generó resentimiento criollo",
              "Explica la creación de monopolios estatales sobre tabaco, pólvora y otros productos para aumentar ingresos"
            ]
          },
          {
            "key": "impacto_reformas",
            "name": "Impacto de las reformas",
            "short_description": "Resentimiento criollo, crecimiento económico y tensiones sociales.",
            "example_tasks": [
              "Analiza cómo las reformas favorecieron a peninsulares sobre criollos en cargos administrativos, generando resentimiento",
              "Describe el crecimiento económico de finales del siglo XVIII: aumento de producción minera, comercio, agricultura",
              "Explica las tensiones sociales generadas por mayores impuestos, monopolios y concentración de tierras",
              "Evalúa las reformas borbónicas como causa indirecta de la independencia al aumentar el descontento criollo"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "revoluciones_siglo_xviii",
    "name": "Revoluciones del siglo XVIII",
    "short_description": "Ilustración, revoluciones atlánticas que transformaron el orden político: independencia de Estados Unidos, Revolución Francesa y su impacto en América.",
    "sub_topics": [
      {
        "key": "ilustracion",
        "name": "La Ilustración",
        "short_description": "Movimiento intelectual que promovió la razón, el progreso y la crítica al absolutismo.",
        "sub_topics": [
          {
            "key": "ideas_ilustradas",
            "name": "Ideas de la Ilustración",
            "short_description": "Racionalismo, empirismo, enciclopedismo, contrato social y división de poderes.",
            "example_tasks": [
              "Explica los principios fundamentales de la Ilustración: confianza en la razón, fe en el progreso, crítica a la tradición y la superstición",
              "Describe las contribuciones de pensadores ilustrados: Locke (derechos naturales), Montesquieu (división de poderes), Rousseau (soberanía popular), Voltaire (tolerancia)",
              "Analiza la Enciclopedia de Diderot y D'Alembert como proyecto para reunir y difundir el conocimiento humano",
              "Explica el concepto de contrato social en Rousseau: gobierno legítimo basado en la voluntad general del pueblo"
            ]
          },
          {
            "key": "despotismo_ilustrado",
            "name": "Despotismo ilustrado",
            "short_description": "Monarcas que aplicaron reformas ilustradas manteniendo el absolutismo.",
            "example_tasks": [
              "Define el despotismo ilustrado mediante la frase 'todo para el pueblo pero sin el pueblo' de monarcas reformistas",
              "Describe ejemplos de déspotas ilustrados: Federico II de Prusia, Catalina II de Rusia, Carlos III de España",
              "Analiza las contradicciones del despotismo ilustrado: reformas modernizadoras pero mantenimiento del poder absoluto",
              "Explica las reformas típicas: educación, economía, administración, pero sin limitar el poder real"
            ]
          }
        ]
      },
      {
        "key": "independencia_estados_unidos",
        "name": "Independencia de Estados Unidos",
        "short_description": "Revolución de las Trece Colonias contra Gran Bretaña y fundación de la república estadounidense.",
        "sub_topics": [
          {
            "key": "causas_independencia_eua",
            "name": "Causas de la independencia estadounidense",
            "short_description": "Impuestos sin representación, medidas británicas restrictivas y creciente autonomía colonial.",
            "example_tasks": [
              "Explica el conflicto sobre la representación: 'no taxation without representation' como rechazo a impuestos sin voz en el Parlamento británico",
              "Describe medidas británicas que irritaron a colonos: Ley del Timbre, impuesto al té, Leyes Intolerables tras el Motín del Té de Boston",
              "Analiza factores que favorecieron independentismo: distancia geográfica, autogobierno colonial previo, ideas ilustradas",
              "Explica el impacto de la Guerra de los Siete Años y la deuda británica que llevó a aumentar impuestos en colonias"
            ]
          },
          {
            "key": "guerra_independencia_eua",
            "name": "Guerra de Independencia",
            "short_description": "Conflicto armado, Declaración de Independencia y victoria estadounidense.",
            "example_tasks": [
              "Describe los eventos iniciales: batallas de Lexington y Concord (1775), Congreso Continental, formación del ejército continental bajo Washington",
              "Analiza la Declaración de Independencia (4 de julio de 1776) redactada por Jefferson: derechos naturales, soberanía popular, lista de agravios",
              "Explica el apoyo francés, español y holandés a los independentistas como forma de debilitar a Gran Bretaña",
              "Describe la victoria en Yorktown (1781) y el Tratado de París (1783) que reconoció la independencia estadounidense"
            ]
          },
          {
            "key": "constitucion_eua",
            "name": "Constitución de Estados Unidos",
            "short_description": "Primera constitución republicana escrita, federalismo y división de poderes.",
            "example_tasks": [
              "Explica la Constitución de 1787 como primera constitución republicana escrita que estableció un gobierno federal",
              "Describe el sistema de división de poderes: ejecutivo (presidente), legislativo (Congreso bicameral), judicial (Corte Suprema)",
              "Analiza el sistema de pesos y contrapesos diseñado para evitar la tiranía de cualquier poder",
              "Explica la Carta de Derechos (1791) que garantizó libertades individuales: expresión, religión, prensa, asamblea"
            ]
          }
        ]
      },
      {
        "key": "revolucion_francesa",
        "name": "Revolución Francesa",
        "short_description": "Proceso revolucionario que derrocó la monarquía absoluta, estableció la república y transformó Europa.",
        "sub_topics": [
          {
            "key": "causas_revolucion_francesa",
            "name": "Causas de la Revolución Francesa",
            "short_description": "Crisis fiscal, desigualdad social, ideas ilustradas y debilidad de Luis XVI.",
            "example_tasks": [
              "Describe la estructura social del Antiguo Régimen francés: privilegios del clero (Primer Estado) y nobleza (Segundo Estado), carga sobre el Tercer Estado",
              "Explica la crisis financiera francesa: guerras costosas, deuda pública, gastos de la corte, resistencia de privilegiados a pagar impuestos",
              "Analiza la influencia de ideas ilustradas y el ejemplo de la independencia estadounidense en el pensamiento revolucionario francés",
              "Describe la convocatoria de los Estados Generales en 1789 como intento fallido de resolver la crisis que desencadenó la revolución"
            ]
          },
          {
            "key": "etapas_revolucion",
            "name": "Etapas de la Revolución",
            "short_description": "Asamblea Nacional, monarquía constitucional, república, Terror, Directorio.",
            "example_tasks": [
              "Describe la formación de la Asamblea Nacional Constituyente (1789): Juramento del Juego de Pelota, Toma de la Bastilla (14 de julio)",
              "Analiza la Declaración de los Derechos del Hombre y del Ciudadano (1789): libertad, igualdad, propiedad, soberanía nacional",
              "Explica la monarquía constitucional (1791-1792): Constitución de 1791, intento de fuga del rey, guerra contra Austria y Prusia",
              "Describe la República (1792): ejecución de Luis XVI, gobierno jacobino, Robespierre y el Reino del Terror (1793-1794)",
              "Analiza el Directorio (1795-1799) como gobierno moderado y corrupto que preparó el camino para Napoleón"
            ]
          },
          {
            "key": "napoleon_imperio",
            "name": "Napoleón y el Imperio",
            "short_description": "Consulado, Imperio napoleónico, conquistas europeas y legado de la Revolución.",
            "example_tasks": [
              "Describe el golpe de Estado del 18 Brumario (1799) y el establecimiento del Consulado con Napoleón como primer cónsul",
              "Explica la transformación de Napoleón de cónsul a emperador en 1804 y su coronación en Notre-Dame",
              "Analiza las conquistas napoleónicas que dominaron gran parte de Europa y difundieron ideas revolucionarias",
              "Describe reformas napoleónicas duraderas: Código Civil o Código Napoleónico, sistema educativo, concordato con la Iglesia",
              "Explica la caída de Napoleón: campaña de Rusia (1812), batalla de Leipzig, derrota en Waterloo (1815), Congreso de Viena"
            ]
          }
        ]
      },
      {
        "key": "impacto_revoluciones_america",
        "name": "Impacto de las revoluciones en América",
        "short_description": "Influencia de las revoluciones atlánticas en los movimientos independentistas americanos.",
        "sub_topics": [
          {
            "key": "difusion_ideas",
            "name": "Difusión de ideas revolucionarias",
            "short_description": "Circulación de ideas ilustradas y republicanas en las colonias americanas.",
            "example_tasks": [
              "Explica cómo las ideas ilustradas llegaron a América a través de libros, periódicos, viajeros y criollos educados en Europa",
              "Describe el impacto de la Declaración de Independencia estadounidense y de los Derechos del Hombre francés en pensadores americanos",
              "Analiza la censura y prohibición de textos revolucionarios por las autoridades coloniales españolas",
              "Explica el papel de logias masónicas y sociedades secretas en difundir ideas independentistas"
            ]
          },
          {
            "key": "ejemplos_revolucionarios",
            "name": "Ejemplos revolucionarios para América",
            "short_description": "Modelos de independencia y organización republicana para colonias hispanoamericanas.",
            "example_tasks": [
              "Analiza cómo el éxito de Estados Unidos demostró que colonias podían independizarse y gobernarse republicanamente",
              "Explica la influencia de la Revolución Francesa en legitimar la rebelión contra tiranos y establecer repúblicas",
              "Describe la Revolución Haitiana (1791-1804) como primera independencia latinoamericana y única revolución esclava exitosa",
              "Evalúa el impacto de la invasión napoleónica a España (1808) que debilitó el control colonial y abrió oportunidad para independencias"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "independencia_mexico",
    "name": "Independencia de México",
    "short_description": "Proceso de emancipación de la Nueva España del dominio español (1810-1821): etapas, personajes, ideologías y consumación.",
    "sub_topics": [
      {
        "key": "antecedentes_independencia",
        "name": "Antecedentes de la Independencia",
        "short_description": "Factores internos y externos que propiciaron el movimiento independentista.",
        "sub_topics": [
          {
            "key": "causas_internas",
            "name": "Causas internas",
            "short_description": "Desigualdad social, resentimiento criollo, explotación de castas populares.",
            "example_tasks": [
              "Explica el resentimiento criollo por la exclusión de cargos importantes reservados a peninsulares pese a ser educados y ricos",
              "Describe las condiciones de explotación de indígenas, mestizos y castas: tributos, trabajos forzados, despojos de tierras",
              "Analiza la desigualdad económica: concentración de riqueza en peninsulares y criollos versus pobreza de las mayorías",
              "Explica el impacto de las reformas borbónicas que aumentaron el control español y los impuestos, generando descontento"
            ]
          },
          {
            "key": "causas_externas",
            "name": "Causas externas",
            "short_description": "Ilustración, revoluciones atlánticas, invasión napoleónica a España.",
            "example_tasks": [
              "Describe la influencia de las ideas ilustradas sobre libertad, igualdad, soberanía popular y derechos naturales",
              "Explica el impacto de la independencia estadounidense (1776) y la Revolución Francesa (1789) como ejemplos de rebelión exitosa",
              "Analiza la crisis monárquica española de 1808: invasión napoleónica, abdicaciones de Bayona, vacío de poder legítimo",
              "Explica cómo la crisis española abrió el debate sobre quién debía gobernar en ausencia del rey: ¿virrey? ¿cabildo? ¿pueblo?"
            ]
          },
          {
            "key": "conspiraciones",
            "name": "Conspiraciones criollas",
            "short_description": "Intentos de organizar movimientos independentistas antes de 1810.",
            "example_tasks": [
              "Describe la conspiración de Valladolid (1809) liderada por José María García Obeso y otros criollos michoacanos",
              "Explica la conspiración de Querétaro (1810) donde participaron Hidalgo, Allende, Aldama, los Domínguez y otros",
              "Analiza por qué las conspiraciones criollas inicialmente buscaban autonomía más que independencia total",
              "Describe cómo la denuncia de la conspiración de Querétaro precipitó el inicio de la insurgencia"
            ]
          }
        ]
      },
      {
        "key": "etapa_hidalgo",
        "name": "Etapa de Hidalgo (1810-1811)",
        "short_description": "Inicio de la insurrección, Grito de Dolores, avance insurgente y derrota.",
        "sub_topics": [
          {
            "key": "grito_dolores",
            "name": "El Grito de Dolores",
            "short_description": "Inicio del movimiento independentista el 16 de septiembre de 1810.",
            "example_tasks": [
              "Narra el Grito de Dolores: madrugada del 16 de septiembre de 1810, llamado de Hidalgo a tomar las armas contra el mal gobierno",
              "Explica los motivos del llamado de Hidalgo: defensa de la religión, el rey Fernando VII, abolición de tributos y castas",
              "Describe la composición mayoritariamente popular del ejército insurgente: indígenas, mestizos, campesinos, mineros",
              "Analiza el uso del estandarte de la Virgen de Guadalupe como símbolo unificador del movimiento"
            ]
          },
          {
            "key": "campana_hidalgo",
            "name": "Campaña militar de Hidalgo",
            "short_description": "Avances insurgentes, toma de ciudades, batalla del Monte de las Cruces.",
            "example_tasks": [
              "Describe el avance insurgente: toma de Celaya, Guanajuato (Alhóndiga de Granaditas con gran violencia), Valladolid, Guadalajara",
              "Analiza la victoria insurgente en el Monte de las Cruces (30 de octubre de 1810) y la decisión de Hidalgo de no atacar la Ciudad de México",
              "Explica las razones del retroceso: falta de disciplina, escasez de armas, terror de las élites criollas ante violencia popular",
              "Describe decretos de Hidalgo en Guadalajara: abolición de la esclavitud, de tributos, de castas, reparto de tierras"
            ]
          },
          {
            "key": "derrota_hidalgo",
            "name": "Derrota y muerte de Hidalgo",
            "short_description": "Batalla de Puente de Calderón, captura y fusilamiento de los líderes.",
            "example_tasks": [
              "Describe la derrota insurgente en Puente de Calderón (17 de enero de 1811) que obligó la retirada hacia el norte",
              "Narra la captura de Hidalgo, Allende, Aldama y Jiménez en Acatita de Baján (21 de marzo de 1811) tras ser traicionados",
              "Explica los juicios y ejecuciones: fusilamiento de Allende, Aldama y Jiménez en junio; de Hidalgo en julio de 1811",
              "Describe la exposición de las cabezas de los insurgentes en las esquinas de la Alhóndiga de Guanajuato como advertencia"
            ]
          }
        ]
      },
      {
        "key": "etapa_morelos",
        "name": "Etapa de Morelos (1811-1815)",
        "short_description": "Organización política y militar, Sentimientos de la Nación, Constitución de Apatzingán.",
        "sub_topics": [
          {
            "key": "campanas_morelos",
            "name": "Campañas militares de Morelos",
            "short_description": "Estrategia militar, sitio de Cuautla, control del sur.",
            "example_tasks": [
              "Describe el liderazgo de José María Morelos: párroco de Carácuaro, organizador militar, estratega político",
              "Analiza la estrategia de Morelos: guerra de guerrillas, ejércitos disciplinados, control del sur (Oaxaca, Guerrero, Michoacán)",
              "Explica el sitio de Cuautla (1812): resistencia de Morelos durante 72 días contra fuerzas realistas superiores",
              "Describe las victorias insurgentes bajo Morelos: Acapulco, Oaxaca, Veracruz, consolidando el dominio del sur"
            ]
          },
          {
            "key": "sentimientos_nacion",
            "name": "Sentimientos de la Nación",
            "short_description": "Programa político de Morelos para México independiente.",
            "example_tasks": [
              "Analiza el documento 'Sentimientos de la Nación' presentado por Morelos en el Congreso de Chilpancingo (1813)",
              "Explica propuestas fundamentales: independencia total de España, soberanía popular, república, división de poderes",
              "Describe reformas sociales propuestas: abolición de esclavitud y castas, igualdad ante la ley, reparto de tierras",
              "Compara los Sentimientos con las ideas ilustradas y constitucionalismo moderno de la época"
            ]
          },
          {
            "key": "constitucion_apatzingan",
            "name": "Constitución de Apatzingán",
            "short_description": "Primera constitución mexicana promulgada en 1814.",
            "example_tasks": [
              "Describe la Constitución de Apatzingán (22 de octubre de 1814) como primera carta magna mexicana",
              "Explica principios constitucionales: soberanía popular, república, división de poderes, derechos individuales, catolicismo como religión única",
              "Analiza limitaciones de la constitución: nunca entró en vigor por la guerra, gobierno itinerante, eventual derrota insurgente",
              "Compara la Constitución de Apatzingán con la Constitución de Cádiz española de 1812"
            ]
          },
          {
            "key": "derrota_morelos",
            "name": "Derrota y muerte de Morelos",
            "short_description": "Debilitamiento insurgente, captura y fusilamiento de Morelos.",
            "example_tasks": [
              "Explica el debilitamiento insurgente: ofensiva realista de Félix María Calleja, pérdida de territorios, división entre insurgentes",
              "Describe la captura de Morelos en Tezmalaca (5 de noviembre de 1815) cuando escoltaba al Congreso",
              "Narra el juicio eclesiástico y civil de Morelos: degradación sacerdotal, condena por traición",
              "Explica el fusilamiento de Morelos en San Cristóbal Ecatepec (22 de diciembre de 1815) y su impacto en el movimiento"
            ]
          }
        ]
      },
      {
        "key": "resistencia_1815_1820",
        "name": "Resistencia (1815-1820)",
        "short_description": "Guerra de guerrillas, líderes regionales y debilitamiento insurgente.",
        "sub_topics": [
          {
            "key": "guerrillas_insurgentes",
            "name": "Guerrillas insurgentes",
            "short_description": "Vicente Guerrero, Guadalupe Victoria y otros jefes regionales mantienen la lucha.",
            "example_tasks": [
              "Describe la resistencia de Vicente Guerrero en las montañas del sur rechazando ofertas de indulto",
              "Explica la actividad de Guadalupe Victoria en Veracruz manteniendo focos insurgentes activos",
              "Analiza la estrategia de guerra de guerrillas: ataques sorpresa, conocimiento del terreno, apoyo campesino",
              "Describe otros líderes insurgentes regionales: Pedro Moreno, Albino García, Manuel Mier y Terán"
            ]
          },
          {
            "key": "dominio_realista",
            "name": "Dominio realista",
            "short_description": "Control español del territorio, indultos, pacificación.",
            "example_tasks": [
              "Explica el dominio realista sobre las principales ciudades y regiones económicas de Nueva España",
              "Describe la política de indultos ofrecida a insurgentes para lograr la pacificación",
              "Analiza la división entre insurgentes: algunos aceptaron indultos, otros continuaron la lucha",
              "Explica el desgaste de ambos bandos tras una década de guerra civil"
            ]
          }
        ]
      },
      {
        "key": "consumacion_independencia",
        "name": "Consumación de la Independencia (1820-1821)",
        "short_description": "Plan de Iguala, alianza Iturbide-Guerrero, entrada del Ejército Trigarante.",
        "sub_topics": [
          {
            "key": "restablecimiento_constitucion_cadiz",
            "name": "Constitución de Cádiz restablecida",
            "short_description": "Levantamiento de Riego en España y su impacto en Nueva España.",
            "example_tasks": [
              "Explica el levantamiento liberal de Rafael de Riego en España (1820) que obligó a Fernando VII a restablecer la Constitución de Cádiz",
              "Describe el temor de criollos conservadores y el clero ante las reformas liberales españolas",
              "Analiza cómo la Constitución de Cádiz amenazaba privilegios del clero y élites novohispanas",
              "Explica el cambio de estrategia conservadora: mejor independizarse para preservar privilegios"
            ]
          },
          {
            "key": "plan_iguala",
            "name": "Plan de Iguala",
            "short_description": "Programa político de Iturbide para lograr la independencia.",
            "example_tasks": [
              "Describe el Plan de Iguala o de las Tres Garantías proclamado por Agustín de Iturbide (24 de febrero de 1821)",
              "Explica las Tres Garantías: Religión (católica única), Independencia (de España), Unión (entre españoles y americanos)",
              "Analiza cómo el Plan concilió intereses conservadores: monarquía constitucional, respeto a privilegios, orden social",
              "Compara el proyecto conservador de Iturbide con el proyecto liberal de Hidalgo y Morelos"
            ]
          },
          {
            "key": "alianza_iturbide_guerrero",
            "name": "Abrazo de Acatempan",
            "short_description": "Alianza entre el realista Iturbide y el insurgente Guerrero.",
            "example_tasks": [
              "Narra el encuentro entre Iturbide y Guerrero que selló la alianza independentista (10 de marzo de 1821)",
              "Explica las razones de Guerrero para aceptar el Plan de Iguala pese a ser menos radical que los ideales de Morelos",
              "Describe la formación del Ejército Trigarante uniendo fuerzas realistas e insurgentes",
              "Analiza cómo la alianza permitió una transición relativamente pacífica hacia la independencia"
            ]
          },
          {
            "key": "tratados_cordoba",
            "name": "Tratados de Córdoba y entrada triunfal",
            "short_description": "Reconocimiento de independencia y entrada del Ejército Trigarante.",
            "example_tasks": [
              "Describe los Tratados de Córdoba (24 de agosto de 1821) firmados entre Iturbide y el último virrey Juan O'Donojú",
              "Explica el reconocimiento de la independencia mexicana y el acuerdo sobre el establecimiento de una monarquía constitucional",
              "Narra la entrada triunfal del Ejército Trigarante a la Ciudad de México (27 de septiembre de 1821)",
              "Analiza el Acta de Independencia del Imperio Mexicano (28 de septiembre de 1821) que formalizó la separación de España"
            ]
          }
        ]
      },
      {
        "key": "significado_independencia",
        "name": "Significado de la Independencia",
        "short_description": "Logros, limitaciones y legado del proceso independentista.",
        "sub_topics": [
          {
            "key": "logros_independencia",
            "name": "Logros de la Independencia",
            "short_description": "Soberanía nacional, fin del dominio colonial, inicio de vida independiente.",
            "example_tasks": [
              "Explica el logro fundamental: soberanía política de México como nación independiente",
              "Describe el fin del dominio colonial español tras 300 años de virreinato",
              "Analiza la formación de identidad nacional mexicana surgida del proceso independentista",
              "Evalúa la independencia como parte del proceso de descolonización de América Latina"
            ]
          },
          {
            "key": "limitaciones_independencia",
            "name": "Limitaciones de la Independencia",
            "short_description": "Continuidades coloniales, desigualdad social, debilidad económica.",
            "example_tasks": [
              "Analiza continuidades del orden colonial: desigualdad social, concentración de tierras, poder de la Iglesia",
              "Explica cómo la independencia fue lograda por élites que preservaron sus privilegios",
              "Describe la devastación económica tras 11 años de guerra: minas inundadas, campos abandonados, comercio paralizado",
              "Evalúa la independencia como proceso inconcluso: soberanía política lograda, justicia social pendiente"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "mexico_independiente_1821_1854",
    "name": "México Independiente (1821-1854)",
    "short_description": "Primeras décadas de vida independiente: inestabilidad política, conflictos entre federalistas y centralistas, pérdida de territorio, búsqueda de un proyecto nacional.",
    "sub_topics": [
      {
        "key": "primer_imperio",
        "name": "Primer Imperio Mexicano",
        "short_description": "Imperio de Agustín de Iturbide, coronación, crisis y caída (1821-1823).",
        "sub_topics": [
          {
            "key": "iturbide_emperador",
            "name": "Iturbide como emperador",
            "short_description": "Coronación, gobierno imperial y oposición republicana.",
            "example_tasks": [
              "Describe cómo Agustín de Iturbide fue proclamado emperador como Agustín I el 18 de mayo de 1822",
              "Explica las causas de su coronación: ausencia de príncipe europeo, popularidad de Iturbide, presión de sus partidarios",
              "Analiza la oposición al imperio: republicanos como Guadalupe Victoria, Vicente Guerrero, federalistas que querían república",
              "Describe el gobierno imperial: Congreso Constituyente disuelto, represión a opositores, crisis económica y militar"
            ]
          },
          {
            "key": "plan_casa_mata",
            "name": "Plan de Casa Mata y caída del Imperio",
            "short_description": "Levantamiento republicano y abdicación de Iturbide.",
            "example_tasks": [
              "Explica el Plan de Casa Mata (1 de febrero de 1823) proclamado por Antonio López de Santa Anna y Guadalupe Victoria",
              "Describe cómo el plan pedía la reinstalación del Congreso y el establecimiento de una república federal",
              "Narra la abdicación de Iturbide (19 de marzo de 1823) y su exilio a Europa",
              "Explica el regreso y fusilamiento de Iturbide en Tamaulipas (19 de julio de 1824) cuando intentó volver al país"
            ]
          }
        ]
      },
      {
        "key": "primera_republica_federal",
        "name": "Primera República Federal",
        "short_description": "Constitución de 1824, presidencias de Guadalupe Victoria y Vicente Guerrero.",
        "sub_topics": [
          {
            "key": "constitucion_1824",
            "name": "Constitución de 1824",
            "short_description": "Primera constitución republicana: federalismo, división de poderes, religión católica.",
            "example_tasks": [
              "Describe la Constitución Federal de 1824 promulgada el 4 de octubre: república federal, representativa, popular",
              "Explica la estructura federal: 19 estados libres y soberanos, 5 territorios, división de poderes (ejecutivo, legislativo, judicial)",
              "Analiza disposiciones: presidente elegido cada 4 años, Congreso bicameral, catolicismo como religión oficial única",
              "Compara la Constitución de 1824 con la estadounidense de 1787, identificando influencias y diferencias"
            ]
          },
          {
            "key": "guadalupe_victoria",
            "name": "Gobierno de Guadalupe Victoria",
            "short_description": "Primera presidencia constitucional (1824-1829).",
            "example_tasks": [
              "Describe el gobierno de Guadalupe Victoria como primer presidente constitucional de México",
              "Explica logros: estabilidad relativa, reconocimiento internacional, abolición de la esclavitud (1829)",
              "Analiza los problemas: economía débil, deuda externa, surgimiento de logias masónicas (yorkinos y escoceses) como grupos políticos",
              "Describe la expulsión de españoles decretada en 1827 y sus consecuencias económicas"
            ]
          },
          {
            "key": "vicente_guerrero",
            "name": "Presidencia de Vicente Guerrero",
            "short_description": "Gobierno breve, amenaza de reconquista española, golpe de Estado.",
            "example_tasks": [
              "Describe la elección disputada de 1828 y cómo Guerrero llegó a la presidencia mediante el levantamiento de la Acordada",
              "Explica la expedición de reconquista española de Isidro Barradas en Tampico (1829) y su derrota",
              "Analiza el golpe de Estado de Anastasio Bustamante (diciembre 1829) y la caída de Guerrero",
              "Narra la captura y fusilamiento de Vicente Guerrero en Cuilápam, Oaxaca (14 de febrero de 1831)"
            ]
          }
        ]
      },
      {
        "key": "lucha_centralistas_federalistas",
        "name": "Lucha entre centralistas y federalistas",
        "short_description": "Conflicto político entre dos proyectos de nación (1830-1846).",
        "sub_topics": [
          {
            "key": "centralismo",
            "name": "Proyectos centralistas",
            "short_description": "República central, Siete Leyes, Santa Anna y conservadores.",
            "example_tasks": [
              "Explica el proyecto centralista: gobierno central fuerte, estados convertidos en departamentos, restricción al voto",
              "Describe las Siete Leyes Constitucionales de 1836 que establecieron la república centralista",
              "Analiza el papel de Antonio López de Santa Anna como figura dominante que alternaba entre liberalismo y conservadurismo",
              "Explica la creación del Supremo Poder Conservador como cuarto poder que podía anular decisiones de los otros tres"
            ]
          },
          {
            "key": "federalismo",
            "name": "Proyectos federalistas",
            "short_description": "Defensa de la Constitución de 1824, autonomía estatal, liberales.",
            "example_tasks": [
              "Describe el proyecto federalista: estados soberanos, división de poderes, constitución de 1824",
              "Explica levantamientos federalistas contra el centralismo: Zacatecas (1835), Texas (1835-1836)",
              "Analiza las bases federalistas: clases medias urbanas, caciques regionales, antiguos insurgentes",
              "Compara los proyectos centralista (orden, unidad, tradición) y federalista (libertad, autonomía, modernización)"
            ]
          }
        ]
      },
      {
        "key": "separacion_texas",
        "name": "Separación de Texas",
        "short_description": "Colonización angloamericana, rebelión texana, independencia de Texas (1836).",
        "sub_topics": [
          {
            "key": "colonizacion_texas",
            "name": "Colonización de Texas",
            "short_description": "Concesiones a colonos estadounidenses y tensiones culturales.",
            "example_tasks": [
              "Explica la política mexicana de colonización de Texas: concesiones a Moses Austin y Stephen Austin desde 1821",
              "Describe las condiciones para colonos: convertirse al catolicismo, respetar leyes mexicanas, no introducir esclavos",
              "Analiza el incumplimiento sistemático: colonos mantuvieron esclavitud, no se integraron, superaron en número a mexicanos",
              "Explica la Ley de Colonización de 1830 que prohibió nueva inmigración estadounidense y aumentó tensiones"
            ]
          },
          {
            "key": "guerra_texas",
            "name": "Guerra de Independencia de Texas",
            "short_description": "Conflicto armado, batallas del Álamo y San Jacinto, pérdida de Texas.",
            "example_tasks": [
              "Describe el inicio de la rebelión texana en 1835 contra el gobierno centralista de México",
              "Narra la batalla del Álamo (6 de marzo de 1836): sitio de Santa Anna, resistencia texana, muerte de todos los defensores",
              "Explica la batalla de San Jacinto (21 de abril de 1836): sorpresa texana, captura de Santa Anna, derrota mexicana",
              "Describe los Tratados de Velasco firmados por Santa Anna cautivo reconociendo la independencia de Texas",
              "Analiza la negativa del Congreso mexicano a reconocer los tratados y el conflicto pendiente con Texas"
            ]
          }
        ]
      },
      {
        "key": "guerra_mexico_estados_unidos",
        "name": "Guerra México-Estados Unidos",
        "short_description": "Invasión estadounidense, resistencia mexicana, Tratado de Guadalupe Hidalgo (1846-1848).",
        "sub_topics": [
          {
            "key": "causas_guerra",
            "name": "Causas de la guerra",
            "short_description": "Anexión de Texas, disputa fronteriza, expansionismo estadounidense.",
            "example_tasks": [
              "Explica la anexión de Texas a Estados Unidos (1845) como causa inmediata del conflicto",
              "Describe la disputa fronteriza: México sostenía que el límite era el río Nueces, EUA reclamaba hasta el río Bravo",
              "Analiza el Destino Manifiesto como ideología expansionista estadounidense que justificaba la conquista territorial",
              "Explica provocaciones estadounidenses: tropas en zona disputada, negativa a negociar, interés en California y Nuevo México"
            ]
          },
          {
            "key": "desarrollo_guerra",
            "name": "Desarrollo del conflicto",
            "short_description": "Invasión por el norte y por Veracruz, batallas principales.",
            "example_tasks": [
              "Describe la invasión estadounidense por el norte: Zachary Taylor toma Monterrey, batalla de La Angostura (Buena Vista)",
              "Explica la invasión por Veracruz: desembarco de Winfield Scott, sitio del puerto, avance hacia la capital",
              "Narra batallas durante el avance a México: Cerro Gordo, Padierna, Churubusco, Molino del Rey",
              "Describe la batalla de Chapultepec (13 de septiembre de 1847) y la defensa heroica de los Niños Héroes"
            ]
          },
          {
            "key": "tratado_guadalupe_hidalgo",
            "name": "Tratado de Guadalupe Hidalgo",
            "short_description": "Fin de la guerra, pérdida de más de la mitad del territorio nacional.",
            "example_tasks": [
              "Describe el Tratado de Guadalupe Hidalgo firmado el 2 de febrero de 1848 que puso fin a la guerra",
              "Explica las condiciones: México cedió Texas, California, Nuevo México, Arizona, Nevada, Utah, parte de Colorado y Wyoming",
              "Analiza la magnitud de la pérdida: más de 2 millones de km², más de la mitad del territorio mexicano",
              "Describe la indemnización de 15 millones de pesos que EUA pagó a México por el territorio anexado",
              "Evalúa las consecuencias: trauma nacional, cuestionamiento del gobierno, búsqueda de explicaciones y reformas"
            ]
          }
        ]
      },
      {
        "key": "economia_sociedad_temprana_republica",
        "name": "Economía y sociedad en la primera república",
        "short_description": "Condiciones económicas, estructura social, vida cotidiana en las primeras décadas independientes.",
        "sub_topics": [
          {
            "key": "crisis_economica",
            "name": "Crisis económica posindependiente",
            "short_description": "Devastación productiva, deuda externa, inestabilidad fiscal.",
            "example_tasks": [
              "Describe el estado de la economía tras la independencia: minas abandonadas, haciendas destruidas, comercio interrumpido",
              "Explica la crisis fiscal: gastos militares constantes, ingresos insuficientes, préstamos forzosos, deuda externa",
              "Analiza la dependencia de préstamos ingleses y la imposibilidad de pagarlos generando más deuda",
              "Describe cómo la inestabilidad política impedía el desarrollo económico: inversión escasa, inseguridad en caminos"
            ]
          },
          {
            "key": "continuidad_social",
            "name": "Continuidades sociales",
            "short_description": "Permanencia de estructuras coloniales de desigualdad.",
            "example_tasks": [
              "Analiza la permanencia de desigualdades sociales coloniales tras la independencia",
              "Describe la persistencia de grandes haciendas, poder de la Iglesia, marginación indígena",
              "Explica cómo las élites criollas ocuparon los espacios de poder dejados por peninsulares",
              "Evalúa el contraste entre las promesas igualitarias de independencia y las realidades de exclusión social"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "la_reforma",
    "name": "La Reforma",
    "short_description": "Movimiento liberal que transformó México: Constitución de 1857, Leyes de Reforma, Guerra de Reforma, secularización del Estado (1854-1861).",
    "sub_topics": [
      {
        "key": "revolucion_ayutla",
        "name": "Revolución de Ayutla",
        "short_description": "Levantamiento contra la dictadura de Santa Anna, triunfo liberal.",
        "sub_topics": [
          {
            "key": "dictadura_santa_anna",
            "name": "Última dictadura de Santa Anna",
            "short_description": "Su Alteza Serenísima, centralismo extremo, venta de La Mesilla.",
            "example_tasks": [
              "Describe la última dictadura de Santa Anna (1853-1855): título de 'Su Alteza Serenísima', ceremonial monárquico, represión",
              "Explica la venta de La Mesilla a Estados Unidos (1853-1854) por 10 millones de pesos y el descontento que generó",
              "Analiza medidas impopulares: impuestos excesivos, censura, represión a opositores, centralismo extremo",
              "Describe la oposición liberal creciente ante los excesos de la dictadura santannista"
            ]
          },
          {
            "key": "plan_ayutla",
            "name": "Plan de Ayutla y triunfo liberal",
            "short_description": "Levantamiento de Florencio Villarreal, Juan Álvarez e Ignacio Comonfort.",
            "example_tasks": [
              "Describe el Plan de Ayutla proclamado el 1 de marzo de 1854 por Florencio Villarreal en Guerrero",
              "Explica los objetivos del plan: derrocar a Santa Anna, convocar Congreso Constituyente, establecer gobierno liberal",
              "Narra el desarrollo del levantamiento: adhesiones en varios estados, campaña militar, huida de Santa Anna (agosto 1855)",
              "Describe la presidencia interina de Juan Álvarez y el ascenso de liberales jóvenes como Benito Juárez, Melchor Ocampo, Guillermo Prieto"
            ]
          }
        ]
      },
      {
        "key": "leyes_reforma_tempranas",
        "name": "Primeras leyes de Reforma",
        "short_description": "Ley Juárez, Ley Lerdo, Ley Iglesias: golpes al poder conservador.",
        "sub_topics": [
          {
            "key": "ley_juarez",
            "name": "Ley Juárez",
            "short_description": "Supresión de fueros eclesiásticos y militares en asuntos civiles (1855).",
            "example_tasks": [
              "Explica la Ley Juárez (23 de noviembre de 1855) que suprimió fueros especiales del clero y el ejército en casos civiles",
              "Describe qué eran los fueros: privilegios de ser juzgado por tribunales propios en lugar de tribunales civiles",
              "Analiza la importancia de la ley: principio de igualdad ante la ley, debilitamiento del poder corporativo",
              "Explica la reacción conservadora: oposición del clero, resistencia militar, inicio de tensiones que llevarían a guerra civil"
            ]
          },
          {
            "key": "ley_lerdo",
            "name": "Ley Lerdo",
            "short_description": "Desamortización de bienes corporativos (1856).",
            "example_tasks": [
              "Describe la Ley Lerdo (25 de junio de 1856) que obligaba a corporaciones civiles y religiosas a vender sus propiedades",
              "Explica objetivos liberales: crear pequeña propiedad, aumentar circulación de bienes, debilitar poder económico de la Iglesia",
              "Analiza consecuencias no previstas: concentración de tierras en pocas manos, despojo de comunidades indígenas",
              "Evalúa el impacto contradictorio: debilitó a la Iglesia pero no creó clase de pequeños propietarios como se esperaba"
            ]
          },
          {
            "key": "ley_iglesias",
            "name": "Ley Iglesias",
            "short_description": "Regulación de obvenciones parroquiales (1857).",
            "example_tasks": [
              "Explica la Ley Iglesias (11 de abril de 1857) que prohibía cobrar por servicios religiosos a pobres: bautizos, bodas, funerales",
              "Describe cómo la ley buscaba limitar los abusos del clero que cobraba cantidades excesivas a personas humildes",
              "Analiza la reacción del clero que vio esta ley como intervención indebida del Estado en asuntos eclesiásticos"
            ]
          }
        ]
      },
      {
        "key": "constitucion_1857",
        "name": "Constitución de 1857",
        "short_description": "Nueva carta magna liberal: derechos individuales, federalismo, separación Iglesia-Estado.",
        "sub_topics": [
          {
            "key": "principios_constitucion_1857",
            "name": "Principios de la Constitución",
            "short_description": "Libertades individuales, soberanía popular, república federal.",
            "example_tasks": [
              "Describe la Constitución promulgada el 5 de febrero de 1857: república federal, representativa, democrática",
              "Explica derechos garantizados: libertad de expresión, prensa, asociación, enseñanza, trabajo",
              "Analiza innovaciones: división de poderes, Congreso unicameral, presidente electo cada 4 años sin reelección inmediata",
              "Describe el Acta Constitutiva y de Reformas que precedió la constitución"
            ]
          },
          {
            "key": "polemica_religiosa",
            "name": "Polémica religiosa",
            "short_description": "Debates sobre libertad religiosa y relación Iglesia-Estado.",
            "example_tasks": [
              "Explica el debate en el Congreso Constituyente sobre si incluir libertad de cultos o mantener catolicismo oficial",
              "Describe la decisión final: no se estableció libertad religiosa pero se omitió declarar religión oficial",
              "Analiza la reacción de la jerarquía católica: condena de la constitución, amenaza de excomunión a quien la jurara",
              "Explica el juramento constitucional obligatorio para funcionarios y la resistencia conservadora a prestarlo"
            ]
          }
        ]
      },
      {
        "key": "guerra_reforma",
        "name": "Guerra de Reforma (1858-1861)",
        "short_description": "Guerra civil entre liberales y conservadores, dos gobiernos, victoria liberal.",
        "sub_topics": [
          {
            "key": "inicio_guerra_tres_anos",
            "name": "Inicio de la Guerra de los Tres Años",
            "short_description": "Plan de Tacubaya, golpe conservador, dos gobiernos paralelos.",
            "example_tasks": [
              "Describe el Plan de Tacubaya (17 de diciembre de 1857) proclamado por Félix Zuloaga desconociendo la Constitución de 1857",
              "Explica el golpe de Estado conservador: prisión de Juárez, renuncia forzada de Comonfort, control de Ciudad de México",
              "Narra cómo Benito Juárez, como presidente de la Suprema Corte, asumió constitucionalmente la presidencia",
              "Describe la situación: dos gobiernos, conservador en México con Zuloaga/Miramón, liberal itinerante con Juárez"
            ]
          },
          {
            "key": "desarrollo_guerra_reforma",
            "name": "Desarrollo de la guerra",
            "short_description": "Batallas principales, dominio territorial cambiante, papel del clero.",
            "example_tasks": [
              "Describe batallas importantes: Salamanca, Ahualulco, Calpulalpan (victoria liberal decisiva)",
              "Explica cómo Juárez estableció gobierno en Veracruz mientras conservadores controlaban el centro",
              "Analiza el financiamiento de la guerra: liberales con aduanas de Veracruz, conservadores con bienes de la Iglesia",
              "Describe el papel del alto clero apoyando activamente a conservadores con dinero y legitimación religiosa"
            ]
          },
          {
            "key": "leyes_reforma_1859",
            "name": "Leyes de Reforma de 1859",
            "short_description": "Radicalización liberal: nacionalización de bienes del clero, separación Iglesia-Estado.",
            "example_tasks": [
              "Describe la Ley de Nacionalización de Bienes Eclesiásticos (12 de julio de 1859): confiscación sin indemnización",
              "Explica otras leyes: matrimonio civil, registro civil, secularización de cementerios, libertad de cultos",
              "Analiza la Ley de Libertad de Cultos (4 de diciembre de 1860) que finalmente estableció tolerancia religiosa",
              "Evalúa cómo estas leyes radicalizaron el conflicto y establecieron separación total Iglesia-Estado"
            ]
          },
          {
            "key": "victoria_liberal",
            "name": "Victoria liberal",
            "short_description": "Batalla de Calpulalpan, entrada de Juárez a México, triunfo del proyecto liberal.",
            "example_tasks": [
              "Narra la batalla de Calpulalpan (22 de diciembre de 1860) donde Jesús González Ortega derrotó a Miguel Miramón",
              "Describe la entrada triunfal de Benito Juárez a la Ciudad de México (11 de enero de 1861)",
              "Explica la consolidación del triunfo liberal: constitución vigente, leyes de reforma aplicadas",
              "Analiza las consecuencias: derrota conservadora, pero país devastado y endeudado, preparando intervención extranjera"
            ]
          }
        ]
      },
      {
        "key": "significado_reforma",
        "name": "Significado de la Reforma",
        "short_description": "Transformación del Estado mexicano hacia la modernidad liberal.",
        "sub_topics": [
          {
            "key": "logros_reforma",
            "name": "Logros de la Reforma",
            "short_description": "Estado laico, derechos individuales, debilitamiento de corporaciones.",
            "example_tasks": [
              "Explica el establecimiento del Estado laico: separación Iglesia-Estado, registro civil, matrimonio civil",
              "Describe la secularización de la sociedad: educación laica, hospitales civiles, cementerios públicos",
              "Analiza el debilitamiento de corporaciones: pérdida de bienes eclesiásticos, supresión de fueros",
              "Evalúa el fortalecimiento de derechos individuales frente a privilegios corporativos"
            ]
          },
          {
            "key": "limites_reforma",
            "name": "Límites de la Reforma",
            "short_description": "Persistencia de desigualdad, despojo indígena, concentración de tierras.",
            "example_tasks": [
              "Analiza cómo la desamortización afectó negativamente a comunidades indígenas que perdieron tierras comunales",
              "Explica la concentración de propiedades en manos de hacendados en lugar de crear pequeña propiedad",
              "Describe la persistencia de desigualdades sociales pese a leyes igualitarias",
              "Evalúa la Reforma como proyecto modernizador exitoso políticamente pero limitado socialmente"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "segundo_imperio",
    "name": "El Segundo Imperio",
    "short_description": "Intervención francesa, imperio de Maximiliano de Habsburgo, resistencia republicana y restauración de la República (1862-1867).",
    "sub_topics": [
      {
        "key": "intervencion_francesa",
        "name": "Intervención francesa",
        "short_description": "Suspensión de pagos, intervención tripartita, invasión francesa.",
        "sub_topics": [
          {
            "key": "convencion_londres",
            "name": "Convención de Londres",
            "short_description": "Deuda externa, intervención tripartita de Francia, Inglaterra y España.",
            "example_tasks": [
              "Explica la suspensión de pagos de deuda externa decretada por Juárez (17 de julio de 1861) por dos años",
              "Describe la Convención de Londres (31 de octubre de 1861) donde Francia, Inglaterra y España acordaron intervenir",
              "Narra el desembarco de fuerzas tripartitas en Veracruz (diciembre 1861-enero 1862)",
              "Explica cómo Inglaterra y España se retiraron al descubrir las ambiciones imperialistas francesas de Napoleón III"
            ]
          },
          {
            "key": "cinco_mayo",
            "name": "Batalla de Puebla",
            "short_description": "Victoria mexicana del 5 de mayo de 1862.",
            "example_tasks": [
              "Narra la batalla del 5 de mayo de 1862 en Puebla: ejército mexicano de Ignacio Zaragoza derrota al francés",
              "Describe la importancia simbólica de la victoria: primera derrota del ejército francés considerado invencible",
              "Explica por qué la victoria fue temporal: franceses reagruparon con refuerzos y siguieron avanzando",
              "Analiza el significado del 5 de mayo como símbolo de resistencia nacional ante invasión extranjera"
            ]
          },
          {
            "key": "ocupacion_francesa",
            "name": "Ocupación francesa del territorio",
            "short_description": "Sitio de Puebla, toma de la capital, gobierno itinerante de Juárez.",
            "example_tasks": [
              "Describe el sitio de Puebla (marzo-mayo 1863): 62 días de resistencia, caída de la ciudad, prisioneros mexicanos",
              "Narra la entrada del ejército francés a la Ciudad de México (10 de junio de 1863)",
              "Explica cómo Juárez estableció gobierno itinerante retirándose hacia el norte manteniendo legitimidad republicana",
              "Describe el peregrinaje de Juárez: San Luis Potosí, Saltillo, Monterrey, Chihuahua, siempre con el archivo nacional"
            ]
          }
        ]
      },
      {
        "key": "imperio_maximiliano",
        "name": "Imperio de Maximiliano",
        "short_description": "Monarquía impuesta, gobierno de Maximiliano, conflictos con conservadores.",
        "sub_topics": [
          {
            "key": "establecimiento_imperio",
            "name": "Establecimiento del Imperio",
            "short_description": "Regencia conservadora, llegada de Maximiliano y Carlota.",
            "example_tasks": [
              "Describe la Junta de Notables conservadora que ofreció la corona a un príncipe europeo",
              "Explica la aceptación de Maximiliano de Habsburgo, archiduque de Austria, y su esposa Carlota de Bélgica",
              "Narra la llegada de Maximiliano a México (28 de mayo de 1864) y su coronación como emperador",
              "Describe el apoyo inicial: conservadores mexicanos, ejército francés, sectores urbanos cansados de guerra"
            ]
          },
          {
            "key": "gobierno_maximiliano",
            "name": "Gobierno de Maximiliano",
            "short_description": "Políticas liberales moderadas, conflictos con conservadores, reformas.",
            "example_tasks": [
              "Analiza las ideas liberales moderadas de Maximiliano que decepcionaron a conservadores que lo apoyaron",
              "Describe políticas imperiales: ratificación de leyes de Reforma, protección a indígenas, impulso cultural",
              "Explica los conflictos con conservadores y el clero que esperaban reversión de reformas liberales",
              "Describe proyectos culturales: Academia Imperial de Ciencias, legislación social, protección de monumentos prehispánicos"
            ]
          },
          {
            "key": "resistencia_republicana",
            "name": "Resistencia republicana",
            "short_description": "Guerrillas liberales, gobierno de Juárez en el exilio interno.",
            "example_tasks": [
              "Describe la resistencia republicana mediante guerrillas: Porfirio Díaz en Oaxaca, Mariano Escobedo en el norte",
              "Explica cómo Juárez mantuvo gobierno legítimo desde el norte, preservando continuidad constitucional",
              "Analiza el apoyo popular a republicanos en zonas rurales frente al imperio sostenido por ocupación extranjera",
              "Describe el papel de Estados Unidos: simpatía hacia republicanos tras Guerra Civil (1865), presión diplomática a Francia"
            ]
          }
        ]
      },
      {
        "key": "caida_imperio",
        "name": "Caída del Imperio",
        "short_description": "Retiro francés, sitio de Querétaro, fusilamiento de Maximiliano.",
        "sub_topics": [
          {
            "key": "retiro_frances",
            "name": "Retiro de tropas francesas",
            "short_description": "Presión estadounidense, problemas europeos de Napoleón III.",
            "example_tasks": [
              "Explica las causas del retiro francés: presión de EUA (Doctrina Monroe), amenaza prusiana en Europa, costos de ocupación",
              "Describe el retiro gradual de tropas francesas (1866-1867) dejando a Maximiliano sin apoyo militar efectivo",
              "Narra el viaje de Carlota a Europa (1866) buscando apoyo de Napoleón III y el Papa, ambos sin éxito",
              "Explica el deterioro mental de Carlota en Europa tras el fracaso de su misión"
            ]
          },
          {
            "key": "sitio_queretaro",
            "name": "Sitio de Querétaro",
            "short_description": "Cerco republicano, traición, captura de Maximiliano.",
            "example_tasks": [
              "Describe el sitio de Querétaro (marzo-mayo 1867): ejército republicano cerca a Maximiliano y sus generales",
              "Narra la traición del coronel Miguel López que facilitó la entrada republicana a la ciudad",
              "Explica la captura de Maximiliano, Miramón y Mejía (15 de mayo de 1867)",
              "Describe el juicio militar sumario y la condena a muerte pese a peticiones internacionales de clemencia"
            ]
          },
          {
            "key": "fusilamiento_restauracion",
            "name": "Fusilamiento y Restauración de la República",
            "short_description": "Ejecución de Maximiliano, retorno triunfal de Juárez.",
            "example_tasks": [
              "Narra el fusilamiento de Maximiliano, Miramón y Mejía en el Cerro de las Campanas, Querétaro (19 de junio de 1867)",
              "Explica las razones de Juárez para no indultar a Maximiliano: establecer precedente contra intervenciones extranjeras",
              "Describe la entrada triunfal de Benito Juárez a la Ciudad de México (15 de julio de 1867) restaurando la República",
              "Analiza el significado de la Restauración: triunfo del nacionalismo, legitimidad republicana, soberanía nacional",
              "Evalúa el legado del Segundo Imperio: fracaso del proyecto monárquico, consolidación definitiva del republicanismo"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "porfiriato",
    "name": "El Porfiriato",
    "short_description": "Dictadura de Porfirio Díaz (1876-1911): modernización económica, represión política, crecimiento de desigualdades y gestación de la Revolución.",
    "sub_topics": [
      {
        "key": "ascenso_porfirio_diaz",
        "name": "Ascenso de Porfirio Díaz",
        "short_description": "Plan de Tuxtepec, llegada al poder, consolidación del régimen.",
        "sub_topics": [
          {
            "key": "republica_restaurada",
            "name": "La República Restaurada (1867-1876)",
            "short_description": "Gobiernos de Juárez y Lerdo, reformas, tensiones políticas.",
            "example_tasks": [
              "Describe el periodo de la República Restaurada tras la derrota del Imperio: gobiernos de Juárez (1867-1872) y Lerdo (1872-1876)",
              "Explica logros del periodo: pacificación, impulso educativo, ferrocarriles, colonización, reorganización financiera",
              "Analiza tensiones: reelección de Juárez en 1871, levantamiento de Porfirio Díaz (Plan de la Noria, fracasado)",
              "Describe la muerte de Juárez (18 de julio de 1872) y la presidencia de Sebastián Lerdo de Tejada"
            ]
          },
          {
            "key": "plan_tuxtepec",
            "name": "Plan de Tuxtepec y rebelión",
            "short_description": "Levantamiento contra Lerdo, principio de no reelección.",
            "example_tasks": [
              "Explica el Plan de Tuxtepec (10 de enero de 1876) proclamado por Porfirio Díaz contra la reelección de Lerdo",
              "Describe la ironía: Díaz se rebeló contra la reelección con el lema 'Sufragio efectivo, no reelección', pero luego se reeligió décadas",
              "Narra el triunfo militar de Díaz: batalla de Tecoac (16 de noviembre de 1876), huida de Lerdo",
              "Explica la llegada de Díaz a la presidencia (1876) inicialmente prometiendo no reelección"
            ]
          }
        ]
      },
      {
        "key": "consolidacion_dictadura",
        "name": "Consolidación de la dictadura",
        "short_description": "Métodos de control político, eliminación de oposición, reelecciones sucesivas.",
        "sub_topics": [
          {
            "key": "control_politico",
            "name": "Métodos de control político",
            "short_description": "Pan o palo, gobernadores leales, represión de oposición.",
            "example_tasks": [
              "Explica la política de 'pan o palo': beneficios para quienes cooperaran, represión para opositores",
              "Describe el control sobre gobernadores: Díaz nombraba y destituía, rotaba para evitar bases de poder regional",
              "Analiza la manipulación electoral: fraude sistemático, imposición de candidatos oficiales",
              "Explica la represión de la oposición: persecución, cárcel, destierro, asesinatos políticos"
            ]
          },
          {
            "key": "reelecciones",
            "name": "Reelecciones y continuismo",
            "short_description": "Reforma constitucional, presidencias de 4 a 6 años, reelección indefinida.",
            "example_tasks": [
              "Describe cómo Díaz reformó la Constitución para permitir una reelección, luego varias, finalmente indefinidas",
              "Explica el interregno de Manuel González (1880-1884) como presidente títere mientras Díaz preparaba retorno",
              "Analiza el periodo de 1884-1911: 27 años continuos de Díaz en el poder con reelecciones sucesivas",
              "Evalúa cómo el lema 'Sufragio efectivo, no reelección' fue traicionado por quien lo proclamó"
            ]
          },
          {
            "key": "cientificos",
            "name": "Los científicos",
            "short_description": "Grupo tecnocrático positivista, influencia en política económica.",
            "example_tasks": [
              "Describe al grupo de 'Los Científicos': tecnócratas educados, influenciados por positivismo de Auguste Comte",
              "Explica su ideología: 'orden y progreso', gobierno de los más aptos, desprecio por democracia popular",
              "Identifica figuras principales: José Yves Limantour (Hacienda), Justo Sierra (Educación), Rosendo Pineda",
              "Analiza su influencia en políticas: modernización económica, ferrocarriles, inversión extranjera, ortodoxia fiscal"
            ]
          }
        ]
      },
      {
        "key": "modernizacion_economica",
        "name": "Modernización económica",
        "short_description": "Ferrocarriles, industria, minería, inversión extranjera, crecimiento desigual.",
        "sub_topics": [
          {
            "key": "ferrocarriles",
            "name": "Expansión ferroviaria",
            "short_description": "Red ferrocarrilera, integración del mercado, capital extranjero.",
            "example_tasks": [
              "Describe la expansión dramática de ferrocarriles: de 600 km en 1876 a más de 19,000 km en 1910",
              "Explica el impacto económico: integración de mercados, reducción de costos de transporte, movilidad de bienes y personas",
              "Analiza la inversión extranjera en ferrocarriles: capital estadounidense e inglés predominante",
              "Evalúa efectos políticos: mayor control central sobre regiones, movilidad de tropas para reprimir rebeliones"
            ]
          },
          {
            "key": "industria_mineria",
            "name": "Industria y minería",
            "short_description": "Industria textil, siderurgia, explotación minera, capital extranjero.",
            "example_tasks": [
              "Describe el desarrollo industrial: textiles (Puebla, Veracruz), siderurgia (Monterrey), tabaco, cerveza",
              "Explica la reactivación minera: plata, cobre, oro, zinc con tecnología moderna y capital extranjero",
              "Analiza la inversión extranjera: estadounidense en minería y petróleo, europea en banca y comercio",
              "Evalúa la dependencia económica: sectores clave controlados por extranjeros, economía orientada a exportación"
            ]
          },
          {
            "key": "agricultura_porfiriana",
            "name": "Agricultura y concentración de tierras",
            "short_description": "Expansión de haciendas, despojo de comunidades, monocultivos de exportación.",
            "example_tasks": [
              "Describe la expansión de haciendas mediante deslindes, compañías deslindadoras, despojo de tierras comunales",
              "Explica el impacto de la Ley de Terrenos Baldíos: concentración de tierras, creación de latifundios inmensos",
              "Analiza cultivos de exportación: henequén en Yucatán, café en Chiapas, azúcar en Morelos",
              "Evalúa consecuencias sociales: proletarización campesina, peones acasillados, deuda perpetua en tiendas de raya"
            ]
          }
        ]
      },
      {
        "key": "sociedad_porfiriana",
        "name": "Sociedad porfiriana",
        "short_description": "Desigualdad social, condiciones obreras y campesinas, cultura y educación.",
        "sub_topics": [
          {
            "key": "desigualdad_social",
            "name": "Desigualdad y estratificación",
            "short_description": "Élite afrancesada, clases medias limitadas, pobreza de mayorías.",
            "example_tasks": [
              "Describe la élite porfiriana: terratenientes, empresarios, políticos, imitación de costumbres francesas",
              "Analiza el crecimiento limitado de clases medias urbanas: profesionistas, pequeños comerciantes, empleados",
              "Explica las condiciones de las mayorías: campesinos sin tierra, obreros explotados, indígenas marginados",
              "Evalúa la brecha creciente entre ricos y pobres durante el Porfiriato"
            ]
          },
          {
            "key": "condiciones_obreras",
            "name": "Condiciones de trabajadores",
            "short_description": "Jornadas extensas, salarios bajos, represión sindical.",
            "example_tasks": [
              "Describe condiciones laborales: jornadas de 12-15 horas, salarios miserables, ausencia de derechos laborales",
              "Explica la represión de movimientos obreros: huelgas de Cananea (1906) y Río Blanco (1907) sofocadas violentamente",
              "Analiza la huelga de Cananea: mineros exigiendo mejores salarios e igualdad con trabajadores estadounidenses",
              "Describe la matanza de Río Blanco: obreros textiles reprimidos por ejército, decenas de muertos"
            ]
          },
          {
            "key": "cultura_educacion",
            "name": "Cultura y educación",
            "short_description": "Positivismo, modernismo, educación limitada, analfabetismo masivo.",
            "example_tasks": [
              "Describe el positivismo como filosofía oficial: influencia en educación, creación de Escuela Nacional Preparatoria",
              "Explica el movimiento modernista en literatura: Manuel Gutiérrez Nájera, Amado Nervo, influencia francesa",
              "Analiza la educación porfiriana: expansión limitada, concentrada en ciudades, rural casi inexistente",
              "Evalúa el analfabetismo: más del 80% de la población sin educación básica al final del Porfiriato"
            ]
          }
        ]
      },
      {
        "key": "oposicion_porfiriato",
        "name": "Oposición al Porfiriato",
        "short_description": "Movimientos políticos, intelectuales críticos, precursores de la Revolución.",
        "sub_topics": [
          {
            "key": "oposicion_politica",
            "name": "Oposición política",
            "short_description": "Partido Liberal Mexicano, hermanos Flores Magón, anarquismo.",
            "example_tasks": [
              "Describe el Partido Liberal Mexicano (PLM) fundado por los hermanos Flores Magón en 1906",
              "Explica el Programa del PLM (1906): reformas laborales, agrarias, políticas, educativas radicales",
              "Analiza la influencia anarquista en el PLM: crítica al capitalismo y al Estado, ideal de comunas libres",
              "Describe la represión contra el PLM: persecución, encarcelamiento, exilio de dirigentes"
            ]
          },
          {
            "key": "intelectuales_criticos",
            "name": "Intelectuales críticos",
            "short_description": "Periodismo opositor, sátira política, denuncia social.",
            "example_tasks": [
              "Describe el periodismo crítico: 'Regeneración' de Flores Magón, 'El Hijo del Ahuizote' con caricaturas",
              "Explica la censura y represión contra periodistas opositores",
              "Analiza el papel de intelectuales como críticos del régimen",
              "Evalúa la circulación clandestina de publicaciones prohibidas"
            ]
          },
          {
            "key": "crisis_sucesoria",
            "name": "Crisis sucesoria",
            "short_description": "Envejecimiento de Díaz, entrevista Creelman, movimiento antirreeleccionista.",
            "example_tasks": [
              "Explica la entrevista Díaz-Creelman (1908): Díaz declara que México está listo para la democracia y no se reelegirá",
              "Describe el surgimiento de movimientos políticos que tomaron en serio la declaración de Díaz",
              "Analiza la formación del Partido Antirreeleccionista con Francisco I. Madero como candidato",
              "Explica cómo Díaz finalmente decidió reelegirse una vez más, traicionando su palabra y desencadenando la Revolución"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "revoluciones_industriales_siglo_xix",
    "name": "Revoluciones industriales y movimientos sociales del siglo XIX",
    "short_description": "Transformaciones económicas, sociales y políticas producto de la industrialización: capitalismo, movimiento obrero, imperialismo, nacionalismos.",
    "sub_topics": [
      {
        "key": "revolucion_industrial",
        "name": "Revolución Industrial",
        "short_description": "Transformación económica desde agricultura a industria: máquinas, fábricas, capitalismo.",
        "sub_topics": [
          {
            "key": "primera_revolucion_industrial",
            "name": "Primera Revolución Industrial",
            "short_description": "Inglaterra 1760-1840: máquina de vapor, textiles, carbón.",
            "example_tasks": [
              "Explica las causas de la Revolución Industrial en Inglaterra: capital disponible, recursos (carbón, hierro), mercados coloniales, innovación",
              "Describe inventos clave: máquina de vapor de Watt, hiladora mecánica, telar mecánico, locomotora de Stephenson",
              "Analiza la transición de producción artesanal a manufactura fabril: concentración de trabajadores, división del trabajo, mecanización",
              "Explica la importancia del carbón como fuente de energía y el hierro como material de construcción"
            ]
          },
          {
            "key": "segunda_revolucion_industrial",
            "name": "Segunda Revolución Industrial",
            "short_description": "1870-1914: electricidad, petróleo, química, acero, producción en masa.",
            "example_tasks": [
              "Describe nuevas fuentes de energía: electricidad, petróleo, nuevos materiales: acero, aluminio, plásticos",
              "Explica innovaciones: motor de combustión interna, teléfono, telégrafo, bombilla eléctrica",
              "Analiza nuevas industrias: química (fertilizantes, explosivos), farmacéutica, automotriz",
              "Describe la producción en masa y línea de ensamblaje de Henry Ford como símbolo de la nueva era industrial"
            ]
          },
          {
            "key": "consecuencias_industrializacion",
            "name": "Consecuencias de la industrialización",
            "short_description": "Urbanización, nuevas clases sociales, transformación del paisaje.",
            "example_tasks": [
              "Explica la urbanización acelerada: migración del campo a ciudades industriales, crecimiento de Manchester, Liverpool, Birmingham",
              "Describe el surgimiento de nuevas clases: burguesía industrial (propietarios de fábricas) y proletariado industrial (trabajadores asalariados)",
              "Analiza cambios en el paisaje: fábricas, vías férreas, puentes, túneles, contaminación industrial",
              "Evalúa el impacto ambiental: contaminación de aire y agua, deforestación, explotación intensiva de recursos"
            ]
          }
        ]
      },
      {
        "key": "capitalismo_liberalismo",
        "name": "Capitalismo y liberalismo económico",
        "short_description": "Sistema económico basado en propiedad privada, libre mercado, búsqueda de ganancia.",
        "sub_topics": [
          {
            "key": "ideas_economicas_liberales",
            "name": "Ideas económicas liberales",
            "short_description": "Adam Smith, libre mercado, división del trabajo, mano invisible.",
            "example_tasks": [
              "Explica las ideas de Adam Smith en 'La riqueza de las naciones': división del trabajo, especialización, libre comercio",
              "Describe el concepto de 'mano invisible': mercado se autorregula sin intervención estatal",
              "Analiza principios del liberalismo económico: propiedad privada, libre competencia, mínima intervención del Estado",
              "Evalúa críticas al liberalismo: desigualdad, explotación, ciclos de crisis económica"
            ]
          }
        ]
      },
      {
        "key": "movimiento_obrero",
        "name": "Movimiento obrero y socialismo",
        "short_description": "Organización de trabajadores, sindicatos, ideologías socialistas y anarquistas.",
        "sub_topics": [
          {
            "key": "condiciones_obreras_siglo_xix",
            "name": "Condiciones de la clase obrera",
            "short_description": "Explotación, jornadas extensas, trabajo infantil, salarios bajos.",
            "example_tasks": [
              "Describe las condiciones laborales en fábricas: jornadas de 14-16 horas, trabajo infantil, salarios miserables, peligros constantes",
              "Explica las viviendas obreras: hacinamiento, insalubridad, barrios marginales cerca de fábricas",
              "Analiza la explotación de mujeres y niños: salarios menores que hombres, trabajos peligrosos",
              "Evalúa el impacto social: desintegración familiar, alcoholismo, enfermedades, mortalidad infantil alta"
            ]
          },
          {
            "key": "sindicalismo",
            "name": "Sindicalismo y huelgas",
            "short_description": "Organización obrera, lucha por derechos laborales, huelgas.",
            "example_tasks": [
              "Explica el surgimiento de sindicatos: asociaciones de trabajadores para negociar colectivamente mejores condiciones",
              "Describe las primeras luchas obreras: huelgas por jornada de 8 horas, aumentos salariales, seguridad laboral",
              "Analiza la represión inicial contra sindicatos: prohibiciones legales, represión policial, despidos masivos",
              "Evalúa logros del movimiento obrero: reducción de jornada, seguro social, prohibición de trabajo infantil (gradual)"
            ]
          },
          {
            "key": "socialismo_marxismo",
            "name": "Socialismo y marxismo",
            "short_description": "Karl Marx, lucha de clases, materialismo histórico, revolución proletaria.",
            "example_tasks": [
              "Explica las ideas de Karl Marx y Friedrich Engels en el 'Manifiesto Comunista' (1848): lucha de clases como motor de la historia",
              "Describe el materialismo histórico: modos de producción determinan estructura social y política",
              "Analiza el concepto de plusvalía: explotación del trabajador por el capitalista que se apropia del trabajo no pagado",
              "Explica la predicción marxista: revolución proletaria derrocaría al capitalismo e instauraría socialismo y luego comunismo"
            ]
          },
          {
            "key": "anarquismo",
            "name": "Anarquismo",
            "short_description": "Bakunin, Kropotkin, abolición del Estado, autogestión.",
            "example_tasks": [
              "Describe ideas anarquistas de Bakunin y Kropotkin: abolición del Estado, propiedad colectiva, federaciones libres",
              "Explica la diferencia con marxismo: rechazo de dictadura del proletariado, desconfianza en autoridad estatal",
              "Analiza métodos anarquistas: acción directa, huelgas generales, propaganda por el hecho",
              "Evalúa influencia anarquista en movimientos obreros europeos y latinoamericanos"
            ]
          }
        ]
      },
      {
        "key": "imperialismo_siglo_xix",
        "name": "Imperialismo del siglo XIX",
        "short_description": "Expansión colonial europea en África y Asia, causas y consecuencias.",
        "sub_topics": [
          {
            "key": "causas_imperialismo",
            "name": "Causas del imperialismo",
            "short_description": "Búsqueda de materias primas, mercados, inversiones, prestigio nacional.",
            "example_tasks": [
              "Explica causas económicas: necesidad de materias primas, mercados para productos industriales, inversión de capitales excedentes",
              "Describe causas políticas: competencia entre potencias europeas, prestigio nacional, bases militares estratégicas",
              "Analiza causas ideológicas: 'misión civilizadora', darwinismo social, superioridad racial europea (racismo)",
              "Evalúa causas tecnológicas: superioridad militar (ametralladoras, barcos de vapor), medicamentos (quinina contra malaria)"
            ]
          },
          {
            "key": "reparto_africa",
            "name": "Reparto de África",
            "short_description": "Conferencia de Berlín, colonización del continente africano.",
            "example_tasks": [
              "Describe la Conferencia de Berlín (1884-1885): potencias europeas se reparten África sin consultar a africanos",
              "Explica principios del reparto: ocupación efectiva, libre navegación en ríos, trazado arbitrario de fronteras",
              "Analiza ejemplos de colonización: Congo belga (explotación brutal), África del Sur británica (apartheid), Argelia francesa",
              "Evalúa consecuencias: destrucción de sociedades tradicionales, explotación de recursos, fronteras artificiales que generaron conflictos posteriores"
            ]
          },
          {
            "key": "imperialismo_asia",
            "name": "Imperialismo en Asia",
            "short_description": "Colonización de India, sudeste asiático, China semicolonial.",
            "example_tasks": [
              "Describe el dominio británico de India: Compañía de las Indias Orientales, rebelión de 1857, Raj británico",
              "Explica la colonización del sudeste asiático: Indochina francesa, Indonesia holandesa, Filipinas española luego estadounidense",
              "Analiza la situación de China: Guerras del Opio, tratados desiguales, esferas de influencia, Rebelión Bóxer",
              "Evalúa el caso de Japón: único país asiático que se industrializó e imperializó (Corea, Taiwán)"
            ]
          }
        ]
      },
      {
        "key": "nacionalismos_unificaciones",
        "name": "Nacionalismos y unificaciones",
        "short_description": "Movimientos nacionales en Europa: unificación de Italia y Alemania.",
        "sub_topics": [
          {
            "key": "unificacion_italiana",
            "name": "Unificación de Italia",
            "short_description": "Resurgimiento, Cavour, Garibaldi, reino unificado (1861-1870).",
            "example_tasks": [
              "Explica el contexto: Italia dividida en varios estados, dominación austriaca, movimiento del Risorgimento",
              "Describe el papel de Cavour (Piamonte): diplomacia, alianzas con Francia, guerras contra Austria",
              "Narra las expediciones de Garibaldi: conquista del sur con 'Los Mil Camisas Rojas', entrega a Víctor Manuel II",
              "Explica la proclamación del Reino de Italia (1861) y la incorporación de Roma (1870) completando la unificación"
            ]
          },
          {
            "key": "unificacion_alemana",
            "name": "Unificación de Alemania",
            "short_description": "Bismarck, guerras de unificación, Segundo Reich (1871).",
            "example_tasks": [
              "Describe el contexto: Confederación Germánica de 39 estados, rivalidad Prusia-Austria",
              "Explica la política de Bismarck: 'Realpolitik', 'política de sangre y hierro', tres guerras de unificación",
              "Narra las guerras: contra Dinamarca (1864), Austria (1866), Francia (1870-71), cada una uniendo más estados alemanes",
              "Describe la proclamación del Imperio Alemán en Versalles (1871) con Guillermo I como Kaiser"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "revolucion_mexicana",
    "name": "La Revolución Mexicana",
    "short_description": "Movimiento armado que derrocó la dictadura porfirista y transformó México (1910-1920): etapas, líderes, ideologías, Constitución de 1917.",
    "sub_topics": [
      {
        "key": "maderismo",
        "name": "Etapa maderista (1910-1913)",
        "short_description": "Movimiento antirreeleccionista, caída de Díaz, presidencia y asesinato de Madero.",
        "sub_topics": [
          {
            "key": "plan_san_luis",
            "name": "Plan de San Luis y levantamiento armado",
            "short_description": "Llamado a la revolución, inicio del movimiento armado.",
            "example_tasks": [
              "Describe la campaña electoral de Francisco I. Madero (1910): giras, discursos, entusiasmo popular, lema 'Sufragio efectivo, no reelección'",
              "Explica la represión porfirista: encarcelamiento de Madero en San Luis Potosí, fraude electoral masivo, reelección de Díaz",
              "Narra el Plan de San Luis Potosí (5 de octubre de 1910): llamado a tomar armas el 20 de noviembre, desconocimiento de Díaz",
              "Describe los levantamientos del 20 de noviembre: Aquiles Serdán en Puebla (18 de noviembre), Pascual Orozco y Villa en Chihuahua, Zapata en Morelos"
            ]
          },
          {
            "key": "caida_diaz",
            "name": "Caída de Porfirio Díaz",
            "short_description": "Toma de Ciudad Juárez, Tratados de Ciudad Juárez, renuncia de Díaz.",
            "example_tasks": [
              "Describe la expansión del movimiento revolucionario en el norte y sur del país durante 1910-1911",
              "Narra la batalla de Ciudad Juárez (8-10 de mayo de 1911): victoria revolucionaria decisiva de Villa y Orozco",
              "Explica los Tratados de Ciudad Juárez (21 de mayo de 1911): renuncia de Díaz, gobierno interino de León de la Barra",
              "Describe la salida de Porfirio Díaz al exilio en Francia (26 de mayo de 1911) tras 35 años en el poder"
            ]
          },
          {
            "key": "gobierno_madero",
            "name": "Gobierno de Madero",
            "short_description": "Elecciones democráticas, reformas políticas, oposición múltiple.",
            "example_tasks": [
              "Explica las elecciones de 1911: triunfo de Madero con 98% de votos, primera elección democrática en décadas",
              "Describe el gobierno de Madero (noviembre 1911-febrero 1913): libertad de prensa, respeto a división de poderes, reformas graduales",
              "Analiza la oposición a Madero desde múltiples frentes: porfiristas resentidos, revolucionarios radicales decepcionados, conservadores temerosos",
              "Explica rebeliones contra Madero: Emiliano Zapata (Plan de Ayala, 1911 exigiendo reforma agraria inmediata), Pascual Orozco (1912), Félix Díaz (1912)"
            ]
          },
          {
            "key": "decena_tragica",
            "name": "Decena Trágica y asesinato de Madero",
            "short_description": "Golpe de Estado de Huerta, traición, asesinatos de Madero y Pino Suárez.",
            "example_tasks": [
              "Describe la Decena Trágica (9-18 de febrero de 1913): levantamiento militar en la Ciudad de México, bombardeos, combates urbanos",
              "Explica el Pacto de la Embajada o Ciudadela: conspiración entre Victoriano Huerta, Félix Díaz y embajador estadounidense Henry Lane Wilson",
              "Narra la traición de Huerta: arrestó a Madero y Pino Suárez (18 de febrero), asumió presidencia ilegalmente",
              "Describe el asesinato de Madero y Pino Suárez (22 de febrero de 1913) simulando un intento de fuga"
            ]
          }
        ]
      },
      {
        "key": "lucha_constitucionalista",
        "name": "Lucha constitucionalista (1913-1914)",
        "short_description": "Oposición armada a Huerta, alianza Carranza-Villa-Obregón-Zapata, caída de Huerta.",
        "sub_topics": [
          {
            "key": "plan_guadalupe",
            "name": "Plan de Guadalupe",
            "short_description": "Desconocimiento de Huerta, movimiento constitucionalista de Carranza.",
            "example_tasks": [
              "Explica el Plan de Guadalupe (26 de marzo de 1913) proclamado por Venustiano Carranza en Coahuila",
              "Describe objetivos del plan: desconocer a Huerta, restaurar el orden constitucional, Carranza como Primer Jefe",
              "Analiza la formación del Ejército Constitucionalista: División del Norte (Villa), Cuerpo de Ejército del Noroeste (Obregón), Ejército del Sur (Zapata)",
              "Explica por qué diversos líderes con ideologías diferentes se unieron temporalmente contra Huerta"
            ]
          },
          {
            "key": "campanas_1913_1914",
            "name": "Campañas militares contra Huerta",
            "short_description": "Avances de Villa, Obregón y Zapata contra fuerzas federales.",
            "example_tasks": [
              "Describe las victorias de Pancho Villa en el norte: toma de Torreón, Zacatecas, avance hacia la capital",
              "Explica las campañas de Álvaro Obregón en el noroeste: dominio de Sonora, Sinaloa, Jalisco, hacia el Bajío",
              "Narra la resistencia de Zapata en Morelos manteniendo control del sur y cercando la capital",
              "Analiza la intervención estadounidense: ocupación de Veracruz (abril 1914), bloqueo de armas a Huerta"
            ]
          },
          {
            "key": "caida_huerta",
            "name": "Caída de Huerta",
            "short_description": "Derrotas militares, renuncia, exilio del usurpador.",
            "example_tasks": [
              "Describe la batalla de Zacatecas (23 de junio de 1914): victoria decisiva de Villa que abrió camino a la capital",
              "Explica el aislamiento de Huerta: derrotas militares, falta de apoyo internacional, pérdida de control territorial",
              "Narra la renuncia de Huerta (15 de julio de 1914) y su huida a Europa",
              "Describe la entrada de fuerzas constitucionalistas a la Ciudad de México en agosto de 1914"
            ]
          }
        ]
      },
      {
        "key": "convencion_lucha_facciones",
        "name": "Convención y lucha entre facciones (1914-1917)",
        "short_description": "División revolucionaria, guerra civil entre constitucionalistas y convencionalistas.",
        "sub_topics": [
          {
            "key": "convencion_aguascalientes",
            "name": "Convención de Aguascalientes",
            "short_description": "Intento de unificar revolucionarios, ruptura entre facciones.",
            "example_tasks": [
              "Explica la Convención de Aguascalientes (octubre-noviembre 1914): reunión de jefes revolucionarios para pacificar y organizar el país",
              "Describe las dos facciones: Convencionalistas (Villa-Zapata) vs. Constitucionalistas (Carranza-Obregón)",
              "Analiza diferencias ideológicas: Convencionalistas querían reforma agraria inmediata y radical, Constitucionalistas querían orden legal primero",
              "Narra el nombramiento de Eulalio Gutiérrez como presidente provisional y el rechazo de Carranza"
            ]
          },
          {
            "key": "alianza_villa_zapata",
            "name": "Alianza Villa-Zapata",
            "short_description": "Pacto de Xochimilco, control temporal de la capital, diferencias.",
            "example_tasks": [
              "Describe el encuentro Villa-Zapata en Xochimilco (4 de diciembre de 1914): acuerdo de alianza contra Carranza",
              "Explica el Pacto de Xochimilco: compromiso de realizar reforma agraria y redistribuir tierras",
              "Narra la entrada triunfal de Villa y Zapata a la Ciudad de México (6 de diciembre de 1914)",
              "Analiza las diferencias entre ambos líderes: Villa militar del norte, Zapata agrarista del sur, poca coordinación efectiva"
            ]
          },
          {
            "key": "triunfo_carranza_obregon",
            "name": "Triunfo de Carranza y Obregón",
            "short_description": "Batallas del Bajío, derrota de Villa, retirada de Zapata.",
            "example_tasks": [
              "Describe las batallas de Celaya (abril 1915): Obregón derrota a Villa usando tácticas modernas, trincheras, ametralladoras",
              "Explica otras victorias de Obregón: León, Aguascalientes, que destruyeron el poder militar de Villa",
              "Narra la retirada de Villa al norte, convertido en guerrillero, y de Zapata a Morelos",
              "Describe el reconocimiento de facto del gobierno de Carranza por Estados Unidos (octubre 1915)"
            ]
          },
          {
            "key": "expedicion_punitiva",
            "name": "Expedición Punitiva",
            "short_description": "Ataque de Villa a Columbus, invasión estadounidense, nacionalismo.",
            "example_tasks": [
              "Explica el ataque de Villa a Columbus, Nuevo México (9 de marzo de 1916): represalia contra apoyo estadounidense a Carranza",
              "Describe la Expedición Punitiva de Pershing: invasión de 10,000 soldados estadounidenses buscando a Villa sin éxito",
              "Analiza la reacción mexicana: indignación nacional, escaramuzas entre tropas mexicanas y estadounidenses (Carrizal)",
              "Narra el retiro estadounidense (febrero 1917) sin haber capturado a Villa pero aumentando tensión bilateral"
            ]
          }
        ]
      },
      {
        "key": "constitucion_1917",
        "name": "Constitución de 1917",
        "short_description": "Congreso Constituyente, nueva carta magna con avances sociales sin precedente.",
        "sub_topics": [
          {
            "key": "congreso_constituyente",
            "name": "Congreso Constituyente de Querétaro",
            "short_description": "Convocatoria, debates, corrientes ideológicas.",
            "example_tasks": [
              "Explica la convocatoria de Carranza al Congreso Constituyente (octubre 1916) para reformar la Constitución de 1857",
              "Describe las dos corrientes: moderados (querían reformas limitadas) y radicales o jacobinos (reformas sociales profundas)",
              "Analiza líderes radicales: Francisco J. Múgica, Heriberto Jara, Pastor Rouaix que impulsaron artículos sociales avanzados",
              "Explica debates principales: sobre educación, propiedad, trabajo, relación Iglesia-Estado"
            ]
          },
          {
            "key": "articulos_constitucionales",
            "name": "Artículos principales",
            "short_description": "Artículos 3°, 27, 123 y otros: educación, tierra, trabajo.",
            "example_tasks": [
              "Explica el Artículo 3°: educación laica, gratuita y obligatoria, prohibición al clero de impartir educación primaria",
              "Describe el Artículo 27: propiedad originaria de la nación sobre tierras y aguas, facultad de expropiar, reforma agraria, límites a extranjeros",
              "Analiza el Artículo 123: derechos laborales revolucionarios (jornada 8 horas, salario mínimo, derecho a huelga, seguridad social, protección a mujeres y menores)",
              "Explica otros artículos: 130 (restricciones a la Iglesia), 82 (requisitos para ser presidente), 115 (municipio libre)"
            ]
          },
          {
            "key": "promulgacion_legado",
            "name": "Promulgación y legado",
            "short_description": "Constitución de 1917 como síntesis de la Revolución.",
            "example_tasks": [
              "Describe la promulgación de la Constitución (5 de febrero de 1917) en Querétaro",
              "Analiza la Constitución de 1917 como una de las más avanzadas socialmente de su época",
              "Explica cómo sintetizó demandas revolucionarias: tierra (Zapata), trabajo (Casa del Obrero Mundial), nacionalismo (Carranza)",
              "Evalúa su vigencia: es la constitución vigente en México (con múltiples reformas) hasta la actualidad"
            ]
          }
        ]
      },
      {
        "key": "final_revolucion",
        "name": "Fase final de la Revolución (1917-1920)",
        "short_description": "Gobierno de Carranza, asesinatos de Zapata y Carranza, Plan de Agua Prieta.",
        "sub_topics": [
          {
            "key": "gobierno_carranza",
            "name": "Gobierno de Carranza",
            "short_description": "Aplicación limitada de reformas, conflictos laborales, resistencias.",
            "example_tasks": [
              "Describe el gobierno constitucional de Carranza (1917-1920): orden y reconstrucción, aplicación gradual de reformas",
              "Explica conflictos con obreros: represión de huelgas pese a derechos constitucionales",
              "Analiza la lenta aplicación de reforma agraria que decepcionó a zapatistas",
              "Describe tensiones con Obregón y caudillos militares sobre sucesión presidencial"
            ]
          },
          {
            "key": "muerte_zapata",
            "name": "Asesinato de Emiliano Zapata",
            "short_description": "Emboscada en Chinameca, fin del zapatismo radical.",
            "example_tasks": [
              "Describe la resistencia zapatista en Morelos contra Carranza que no cumplía promesas agrarias",
              "Explica la emboscada de Chinameca (10 de abril de 1919): coronel Jesús Guajardo fingió desertar y tendió trampa a Zapata",
              "Narra el asesinato de Zapata: acribillado al entrar a la hacienda de Chinameca",
              "Analiza el impacto: fin de la resistencia zapatista organizada pero su legado agrario perduró"
            ]
          },
          {
            "key": "plan_agua_prieta",
            "name": "Plan de Agua Prieta y muerte de Carranza",
            "short_description": "Rebelión de Obregón, huida y asesinato de Carranza.",
            "example_tasks": [
              "Explica el Plan de Agua Prieta (23 de abril de 1920): Obregón y otros generales se rebelan contra Carranza",
              "Describe las causas: Carranza intentó imponer a Ignacio Bonillas como sucesor en lugar de Obregón",
              "Narra la huida de Carranza hacia Veracruz llevando el tesoro nacional y archivo",
              "Describe el asesinato de Carranza en Tlaxcalantongo, Puebla (21 de mayo de 1920) durante su huida"
            ]
          }
        ]
      },
      {
        "key": "balance_revolucion",
        "name": "Balance de la Revolución",
        "short_description": "Logros, costos humanos y materiales, transformación de México.",
        "sub_topics": [
          {
            "key": "logros_revolucion",
            "name": "Logros de la Revolución",
            "short_description": "Constitución social, fin del porfiriato, bases del México moderno.",
            "example_tasks": [
              "Enumera logros políticos: fin de la dictadura, Constitución de 1917, bases del Estado moderno",
              "Describe logros sociales: reconocimiento de derechos laborales, reforma agraria (aunque lenta), educación pública",
              "Analiza logros culturales: afirmación de identidad nacional, valoración de lo indígena y mestizo",
              "Evalúa cómo la Revolución sentó bases del México del siglo XX"
            ]
          },
          {
            "key": "costos_revolucion",
            "name": "Costos de la Revolución",
            "short_description": "Muertos, destrucción, divisiones, aplicación limitada de reformas.",
            "example_tasks": [
              "Describe el costo humano: estimaciones de 1-2 millones de muertos, 10% de la población",
              "Explica la destrucción económica: haciendas, minas, fábricas, vías férreas, campos abandonados",
              "Analiza las divisiones persistentes: entre facciones, asesinatos de líderes revolucionarios entre sí",
              "Evalúa la brecha entre promesas constitucionales y realidad: reformas aplicadas gradualmente durante décadas"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "mexico_posrevolucionario",
    "name": "México Posrevolucionario",
    "short_description": "Reconstrucción e institucionalización de la Revolución (1920-1970): caudillismo, formación del PRI, presidencialismo, desarrollo económico.",
    "sub_topics": [
      {
        "key": "gobiernos_sonorenses",
        "name": "Gobiernos de la dinastía sonorense (1920-1934)",
        "short_description": "Obregón, Calles, Maximato: reconstrucción, conflicto religioso, institucionalización.",
        "sub_topics": [
          {
            "key": "obregon_presidente",
            "name": "Gobierno de Álvaro Obregón (1920-1924)",
            "short_description": "Reconstrucción, educación con Vasconcelos, pacificación.",
            "example_tasks": [
              "Describe logros del gobierno de Obregón: pacificación del país, reconocimiento internacional, recuperación económica gradual",
              "Explica la labor educativa de José Vasconcelos: campaña de alfabetización, bibliotecas, misiones culturales, apoyo a muralismo",
              "Analiza el inicio de la reforma agraria: reparto limitado de tierras, creación de ejidos",
              "Describe el Tratado de Bucareli (1923) con EUA: reconocimiento diplomático a cambio de garantías a propiedades estadounidenses"
            ]
          },
          {
            "key": "guerra_cristera",
            "name": "Guerra Cristera (1926-1929)",
            "short_description": "Conflicto religioso entre gobierno y católicos.",
            "example_tasks": [
              "Explica las causas de la Guerra Cristera: aplicación estricta de artículos anticlericales de la Constitución por Calles",
              "Describe medidas gubernamentales: cierre de iglesias, expulsión de sacerdotes extranjeros, registro obligatorio de clérigos",
              "Narra la resistencia católica: suspensión de cultos, levantamiento armado de cristeros en el Bajío, apoyo de Liga Nacional Defensora",
              "Explica los Arreglos de 1929: negociación mediada por EUA, reapertura de cultos, amnistía, pero tensión persistente"
            ]
          },
          {
            "key": "maximato",
            "name": "El Maximato (1928-1934)",
            "short_description": "Control de Calles como Jefe Máximo sobre presidentes títeres.",
            "example_tasks": [
              "Explica el asesinato de Obregón (17 de julio de 1928) por José de León Toral, católico, tras reelección",
              "Describe el Maximato: Calles como 'Jefe Máximo de la Revolución' controlando presidentes: Portes Gil, Ortiz Rubio, Abelardo Rodríguez",
              "Analiza la fundación del Partido Nacional Revolucionario (PNR, 1929): antecedente del PRI, institucionalización del poder",
              "Evalúa el Maximato como forma de perpetuación del poder sin dictadura personal abierta"
            ]
          }
        ]
      },
      {
        "key": "cardenismo",
        "name": "Cardenismo (1934-1940)",
        "short_description": "Gobierno de Lázaro Cárdenas: reforma agraria radical, nacionalización del petróleo, educación socialista.",
        "sub_topics": [
          {
            "key": "ruptura_calles",
            "name": "Ruptura con Calles",
            "short_description": "Cárdenas se independiza del Jefe Máximo.",
            "example_tasks": [
              "Describe cómo Cárdenas, elegido por Calles como presidente dócil, pronto mostró independencia",
              "Explica el conflicto: Cárdenas apoyó huelgas obreras que Calles quería reprimir",
              "Narra la expulsión de Calles del país (1936): fin del Maximato, consolidación de presidencialismo",
              "Analiza la transformación del PNR en PRM (1938): incorporación de sectores obrero, campesino, popular, militar"
            ]
          },
          {
            "key": "reforma_agraria_cardenista",
            "name": "Reforma agraria cardenista",
            "short_description": "Reparto masivo de tierras, creación de ejidos.",
            "example_tasks": [
              "Describe la reforma agraria cardenista: reparto de 18 millones de hectáreas, más que todos los gobiernos anteriores juntos",
              "Explica el apoyo a ejidos colectivos: especialmente en La Laguna (algodón) y Yucatán (henequén)",
              "Analiza la formación de la CNC (Confederación Nacional Campesina, 1938) como organización corporativa",
              "Evalúa resultados: cumplimiento parcial de promesas zapatistas, base de apoyo campesino al régimen"
            ]
          },
          {
            "key": "expropiacion_petrolera",
            "name": "Expropiación petrolera",
            "short_description": "Nacionalización de la industria del petróleo (18 de marzo de 1938).",
            "example_tasks": [
              "Explica las causas de la expropiación: conflicto laboral, negativa de compañías extranjeras a acatar laudo, desafío a soberanía",
              "Describe el decreto de expropiación (18 de marzo de 1938): nacionalización de 17 compañías petroleras extranjeras",
              "Narra la respuesta popular: apoyo masivo, campaña de recolección de fondos para pagar indemnización",
              "Analiza consecuencias: boicot internacional, creación de PEMEX, símbolo de nacionalismo económico"
            ]
          },
          {
            "key": "educacion_socialista",
            "name": "Educación socialista",
            "short_description": "Reforma al Artículo 3°, educación basada en socialismo científico.",
            "example_tasks": [
              "Explica la reforma al Artículo 3° (1934): educación socialista que combatiría fanatismos y prejuicios",
              "Describe la oposición de sectores conservadores y católicos a la educación socialista",
              "Analiza la expansión de escuelas rurales, normales rurales, educación indígena",
              "Evalúa la aplicación: más retórica que práctica, abandonada después de Cárdenas"
            ]
          },
          {
            "key": "asilo_republicanos",
            "name": "Asilo a republicanos españoles",
            "short_description": "Refugio a exiliados de la Guerra Civil Española.",
            "example_tasks": [
              "Explica la política exterior de Cárdenas: apoyo a República Española contra Franco",
              "Describe la llegada de miles de refugiados republicanos españoles a México (1939-1942)",
              "Analiza el impacto cultural e intelectual de los exiliados españoles en México",
              "Evalúa la generosidad de la política de asilo de Cárdenas"
            ]
          }
        ]
      },
      {
        "key": "unidad_nacional",
        "name": "Unidad Nacional (1940-1952)",
        "short_description": "Gobiernos de Ávila Camacho y Alemán: industrialización, moderación, Guerra Fría.",
        "sub_topics": [
          {
            "key": "avila_camacho",
            "name": "Gobierno de Manuel Ávila Camacho (1940-1946)",
            "short_description": "Moderación, Segunda Guerra Mundial, inicio de industrialización.",
            "example_tasks": [
              "Describe el giro conservador: 'Soy creyente', fin de educación socialista, moderación de reforma agraria",
              "Explica la participación de México en la Segunda Guerra Mundial: Escuadrón 201, declaración de guerra a Eje (1942)",
              "Analiza el inicio de industrialización por sustitución de importaciones aprovechando la guerra",
              "Describe la unidad nacional: pacto obrero-empresarial, CTM apoya producción, crecimiento económico"
            ]
          },
          {
            "key": "miguel_aleman",
            "name": "Gobierno de Miguel Alemán (1946-1952)",
            "short_description": "Primer presidente civil, industrialización acelerada, corrupción.",
            "example_tasks": [
              "Explica que Alemán fue el primer presidente civil (no militar) desde la Revolución",
              "Describe la industrialización acelerada: inversión en infraestructura, protección a industria nacional, urbanización",
              "Analiza la transformación del PRM en PRI (1946): eliminación del sector militar, consolidación del partido hegemónico",
              "Evalúa problemas: corrupción creciente, abandono del campo, desigualdad, represión a movimientos obreros y campesinos independientes"
            ]
          }
        ]
      },
      {
        "key": "desarrollo_estabilizador",
        "name": "Desarrollo Estabilizador (1952-1970)",
        "short_description": "Milagro mexicano: crecimiento económico sostenido con estabilidad de precios.",
        "sub_topics": [
          {
            "key": "milagro_mexicano",
            "name": "El milagro mexicano",
            "short_description": "Crecimiento promedio 6% anual, estabilidad, urbanización.",
            "example_tasks": [
              "Describe el crecimiento económico: promedio 6% anual, estabilidad cambiaria, inflación controlada",
              "Explica el modelo: sustitución de importaciones, proteccionismo, inversión estatal, tipo de cambio fijo",
              "Analiza sectores dinámicos: industria manufacturera, petroquímica, construcción, turismo",
              "Evalúa logros: clase media creciente, urbanización, modernización, pero también desigualdad y abandono rural"
            ]
          },
          {
            "key": "movimientos_sociales_1950_1960",
            "name": "Movimientos sociales",
            "short_description": "Movimiento ferrocarrilero, médicos, maestros, represión gubernamental.",
            "example_tasks": [
              "Describe el movimiento ferrocarrilero (1958-1959): huelgas por mejoras salariales, liderado por Demetrio Vallejo",
              "Explica la represión: encarcelamiento de líderes, intervención militar, acusaciones de comunismo en contexto de Guerra Fría",
              "Analiza otros movimientos: médicos (1964-1965), maestros, demandando autonomía sindical del control priista",
              "Evalúa la contradicción: crecimiento económico pero represión política, corporativismo autoritario"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "primera_guerra_mundial",
    "name": "Primera Guerra Mundial",
    "short_description": "Gran Guerra (1914-1918): causas, desarrollo, nuevas armas, tratados de paz y reconfiguración del mapa europeo.",
    "sub_topics": [
      {
        "key": "causas_primera_guerra",
        "name": "Causas de la Primera Guerra Mundial",
        "short_description": "Rivalidades imperialistas, nacionalismos, alianzas militares, carrera armamentista.",
        "sub_topics": [
          {
            "key": "tensiones_europeas",
            "name": "Tensiones en Europa",
            "short_description": "Imperialismo, competencia económica, nacionalismos exaltados.",
            "example_tasks": [
              "Explica las rivalidades imperialistas: competencia por colonias entre Alemania, Francia, Gran Bretaña",
              "Describe la carrera armamentista: construcción de acorazados (Gran Bretaña vs Alemania), ejércitos masivos",
              "Analiza los nacionalismos: paneslavismo ruso, pangermanismo, irredentismo italiano, nacionalismos balcánicos",
              "Explica la cuestión de los Balcanes: 'polvorín de Europa', rivalidad austro-rusa, debilitamiento otomano"
            ]
          },
          {
            "key": "sistema_alianzas",
            "name": "Sistema de alianzas",
            "short_description": "Triple Alianza vs Triple Entente.",
            "example_tasks": [
              "Describe la Triple Alianza (1882): Alemania, Austria-Hungría, Italia (luego cambiaría de bando)",
              "Explica la Triple Entente: Francia, Rusia, Gran Bretaña (acuerdos desde 1904-1907)",
              "Analiza cómo el sistema de alianzas convirtió un conflicto local en guerra general",
              "Evalúa el papel de Bismarck en crear alianzas y el Kaiser Guillermo II en romper equilibrios"
            ]
          },
          {
            "key": "detonante_sarajevo",
            "name": "Asesinato de Sarajevo",
            "short_description": "Atentado contra archiduque Francisco Fernando, ultimátum, declaraciones de guerra.",
            "example_tasks": [
              "Narra el asesinato del archiduque Francisco Fernando de Austria en Sarajevo (28 de junio de 1914) por Gavrilo Princip",
              "Explica el ultimátum austro-húngaro a Serbia: demandas humillantes, rechazo parcial serbio",
              "Describe la cascada de declaraciones de guerra: Austria a Serbia, Rusia moviliza, Alemania a Rusia y Francia, invasión de Bélgica, Gran Bretaña entra",
              "Analiza por qué un asesinato local desencadenó guerra continental"
            ]
          }
        ]
      },
      {
        "key": "desarrollo_gran_guerra",
        "name": "Desarrollo de la guerra",
        "short_description": "Guerra de movimientos, guerra de trincheras, frentes, nuevas armas.",
        "sub_topics": [
          {
            "key": "frente_occidental",
            "name": "Frente Occidental",
            "short_description": "Francia y Bélgica: trincheras, desgaste, batallas sangrientas.",
            "example_tasks": [
              "Describe el Plan Schlieffen alemán: invadir Francia por Bélgica, rápida victoria, fracasó en el Marne (1914)",
              "Explica la guerra de trincheras: estancamiento, líneas fortificadas desde el Canal de la Mancha hasta Suiza",
              "Analiza batallas devastadoras: Verdún (1916, 700,000 bajas), Somme (1916, 1 millón de bajas) con avances mínimos",
              "Describe el uso de armas nuevas: ametralladoras, artillería pesada, gases venenosos, tanques, aviones"
            ]
          },
          {
            "key": "otros_frentes",
            "name": "Otros frentes",
            "short_description": "Frente Oriental, italiano, Medio Oriente, colonias.",
            "example_tasks": [
              "Explica el Frente Oriental: más móvil, victorias alemanas, retirada rusa, colapso tras Revolución de 1917",
              "Describe el frente italiano: guerra alpina, batalla de Caporetto, resistencia en el Piave",
              "Analiza campañas en Medio Oriente: Lawrence de Arabia apoyando revuelta árabe, caída del Imperio Otomano",
              "Explica combates en colonias africanas y Asia: guerra global aunque centrada en Europa"
            ]
          },
          {
            "key": "guerra_total",
            "name": "Guerra total",
            "short_description": "Movilización de sociedades enteras, economía de guerra, propaganda.",
            "example_tasks": [
              "Explica el concepto de guerra total: movilización de toda la sociedad, no solo ejércitos",
              "Describe la economía de guerra: fábricas produciendo armamento, racionamiento, mujeres en industrias",
              "Analiza el uso de propaganda: deshumanización del enemigo, censura, carteles de reclutamiento",
              "Evalúa el impacto en población civil: bombardeos, bloqueos navales, hambrunas"
            ]
          }
        ]
      },
      {
        "key": "fin_primera_guerra",
        "name": "Fin de la guerra",
        "short_description": "Entrada de EUA, colapso de imperios centrales, armisticios.",
        "sub_topics": [
          {
            "key": "intervencion_estadounidense",
            "name": "Intervención estadounidense",
            "short_description": "Guerra submarina, Zimmermann, tropas frescas, victoria aliada.",
            "example_tasks": [
              "Explica causas de entrada de EUA (abril 1917): guerra submarina alemana, hundimiento del Lusitania, telegrama Zimmermann",
              "Describe el telegrama Zimmermann: propuesta alemana de alianza con México contra EUA",
              "Analiza el impacto estadounidense: tropas frescas, recursos económicos, equilibrio a favor de Aliados",
              "Explica los 14 puntos de Wilson: programa para paz duradera, autodeterminación, Sociedad de Naciones"
            ]
          },
          {
            "key": "colapso_imperios_centrales",
            "name": "Colapso de los Imperios Centrales",
            "short_description": "Revoluciones, armisticios, abdicaciones.",
            "example_tasks": [
              "Describe el colapso otomano: armisticio de Mudros (octubre 1918), desmembramiento del imperio",
              "Explica la desintegración de Austria-Hungría: independencia de checos, eslavos del sur, húngaros",
              "Narra la Revolución alemana (noviembre 1918): motín naval en Kiel, abdicación del Kaiser, proclamación de república",
              "Describe el Armisticio del 11 de noviembre de 1918: fin de combates, Alemania acepta derrota"
            ]
          }
        ]
      },
      {
        "key": "tratados_paz",
        "name": "Tratados de paz y consecuencias",
        "short_description": "Tratado de Versalles, nuevo mapa europeo, Sociedad de Naciones.",
        "sub_topics": [
          {
            "key": "tratado_versalles",
            "name": "Tratado de Versalles",
            "short_description": "Paz impuesta a Alemania, reparaciones, desmilitarización.",
            "example_tasks": [
              "Describe el Tratado de Versalles (28 de junio de 1919): paz dictada por vencedores a Alemania",
              "Explica cláusulas territoriales: pérdida de colonias, Alsacia-Lorena a Francia, corredor polaco",
              "Analiza cláusulas militares: ejército limitado a 100,000, prohibición de aviación militar, desmilitarización de Renania",
              "Explica la cláusula de culpabilidad (Artículo 231): responsabilidad exclusiva alemana, reparaciones de guerra enormes",
              "Evalúa críticas: Keynes advirtió que era demasiado duro, sembraría resentimiento y nueva guerra"
            ]
          },
          {
            "key": "nuevo_mapa_europa",
            "name": "Nuevo mapa de Europa",
            "short_description": "Desaparición de imperios, nuevos estados, principio de autodeterminación.",
            "example_tasks": [
              "Describe nuevos estados surgidos: Polonia, Checoslovaquia, Yugoslavia, Finlandia, Estonia, Letonia, Lituania",
              "Explica la aplicación selectiva de autodeterminación: aprobada para antiguos imperios centrales, negada en colonias",
              "Analiza problemas del nuevo mapa: minorías nacionales insatisfechas, fronteras arbitrarias, tensiones futuras",
              "Evalúa la desaparición de imperios multinacionales (Otomano, Austro-Húngaro, Ruso en parte, Alemán)"
            ]
          },
          {
            "key": "sociedad_naciones",
            "name": "Sociedad de Naciones",
            "short_description": "Primer organismo internacional para mantener la paz.",
            "example_tasks": [
              "Explica la creación de la Sociedad de Naciones (1920): propuesta de Wilson para prevenir futuras guerras",
              "Describe su estructura: Asamblea, Consejo, Secretaría, Corte Internacional de Justicia",
              "Analiza debilidades: EUA no se unió (Senado rechazó), falta de poder coercitivo, grandes potencias la ignoraron",
              "Evalúa su legado: fracasó en prevenir Segunda Guerra Mundial pero fue precedente de la ONU"
            ]
          },
          {
            "key": "consecuencias_gran_guerra",
            "name": "Consecuencias de la Gran Guerra",
            "short_description": "Balance humano, económico, político y social.",
            "example_tasks": [
              "Describe el costo humano: 10 millones de muertos militares, 7 millones de civiles, generación perdida, millones de heridos y mutilados",
              "Explica consecuencias económicas: destrucción masiva en Europa, deudas enormes, inflación, EUA emerge como potencia económica",
              "Analiza cambios políticos: caída de monarquías, democracias frágiles, totalitarismos emergentes, decadencia europea",
              "Evalúa cambios sociales: mujeres en fuerza laboral, voto femenino, cuestionamiento de valores tradicionales, trauma colectivo"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "periodo_entreguerras",
    "name": "Periodo de Entreguerras",
    "short_description": "Décadas entre las dos guerras mundiales (1918-1939): Revolución Rusa, fascismos, Gran Depresión, totalitarismos.",
    "sub_topics": [
      {
        "key": "revolucion_rusa",
        "name": "Revolución Rusa",
        "short_description": "Caída del zarismo, revolución bolchevique, guerra civil, formación de la URSS.",
        "sub_topics": [
          {
            "key": "revolucion_febrero",
            "name": "Revolución de Febrero de 1917",
            "short_description": "Abdicación del zar, gobierno provisional, doble poder.",
            "example_tasks": [
              "Explica las causas: desastres militares en la guerra, escasez de alimentos, represión zarista, descontento popular",
              "Describe la Revolución de Febrero: huelgas, motines militares, formación de soviets (consejos de obreros y soldados)",
              "Narra la abdicación del zar Nicolás II (15 de marzo de 1917): fin de la dinastía Romanov y el zarismo",
              "Explica el doble poder: Gobierno Provisional liberal vs. Soviet de Petrogrado, tensión entre ambos"
            ]
          },
          {
            "key": "revolucion_octubre",
            "name": "Revolución de Octubre de 1917",
            "short_description": "Toma del poder por bolcheviques, Lenin, inicio del comunismo.",
            "example_tasks": [
              "Describe el retorno de Lenin a Rusia: Tesis de Abril ('Todo el poder a los soviets', paz, pan, tierra)",
              "Explica el debilitamiento del Gobierno Provisional: continuación de la guerra, no reforma agraria, crisis política",
              "Narra la Revolución de Octubre (7 de noviembre calendario gregoriano): asalto al Palacio de Invierno, toma bolchevique del poder",
              "Describe primeras medidas: Decreto de Paz (salida de la guerra), Decreto de Tierra (expropiación), creación de la Cheka (policía política)"
            ]
          },
          {
            "key": "guerra_civil_rusa",
            "name": "Guerra Civil (1918-1921)",
            "short_description": "Rojos vs Blancos, intervención extranjera, victoria bolchevique.",
            "example_tasks": [
              "Explica el conflicto: Ejército Rojo (bolcheviques) vs. Ejército Blanco (zaristas, liberales, conservadores)",
              "Describe la intervención extranjera: tropas de 14 países (incluyendo Francia, Gran Bretaña, Japón, EUA) apoyando a Blancos",
              "Analiza el comunismo de guerra: nacionalización total, requisa de granos, terror rojo",
              "Narra la victoria bolchevique (1921): Ejército Rojo bajo Trotsky derrotó a enemigos divididos"
            ]
          },
          {
            "key": "formacion_urss",
            "name": "Formación de la URSS",
            "short_description": "NEP, muerte de Lenin, ascenso de Stalin.",
            "example_tasks": [
              "Explica la Nueva Política Económica (NEP, 1921): concesiones al capitalismo limitado para recuperar economía",
              "Describe la formación de la URSS (1922): Unión de Repúblicas Socialistas Soviéticas uniendo Rusia, Ucrania, Bielorrusia, Transcaucasia",
              "Narra la muerte de Lenin (1924) y la lucha por sucesión entre Stalin y Trotsky",
              "Explica el triunfo de Stalin: expulsión de Trotsky, control del partido, fin de la NEP, inicio de colectivización forzada"
            ]
          }
        ]
      },
      {
        "key": "fascismo_nazismo",
        "name": "Fascismo y nazismo",
        "short_description": "Regímenes totalitarios de extrema derecha en Italia y Alemania.",
        "sub_topics": [
          {
            "key": "fascismo_italia",
            "name": "Fascismo en Italia",
            "short_description": "Mussolini, Marcha sobre Roma, Estado totalitario.",
            "example_tasks": [
              "Explica el contexto posguerra en Italia: frustración por 'victoria mutilada', crisis económica, miedo al comunismo",
              "Describe el ascenso de Benito Mussolini y sus 'camisas negras' (squadristi) que atacaban socialistas y sindicalistas",
              "Narra la Marcha sobre Roma (octubre 1922): Mussolini amenaza con tomar poder, rey le entrega gobierno",
              "Analiza el Estado fascista: partido único, represión, corporativismo, culto al Duce, propaganda, militarismo, imperialismo"
            ]
          },
          {
            "key": "nazismo_alemania",
            "name": "Nazismo en Alemania",
            "short_description": "Hitler, crisis de Weimar, Tercer Reich, antisemitismo.",
            "example_tasks": [
              "Explica el contexto: humillación de Versalles, hiperinflación de 1923, Gran Depresión, debilidad de Weimar",
              "Describe el ascenso de Adolf Hitler y el Partido Nazi: propaganda, culto al Führer, paramilitares SA",
              "Narra la llegada al poder (1933): Hitler nombrado canciller legalmente, incendio del Reichstag, leyes de emergencia, dictadura",
              "Analiza el nazismo: totalitarismo extremo, racismo, antisemitismo, Lebensraum, rearme, preparación para guerra"
            ]
          },
          {
            "key": "otros_autoritarismos",
            "name": "Otros regímenes autoritarios",
            "short_description": "España, Portugal, Europa del Este: dictaduras de entreguerras.",
            "example_tasks": [
              "Describe la dictadura de Primo de Rivera en España (1923-1930) y luego Franco tras Guerra Civil (1936-1939)",
              "Explica el Estado Novo de Salazar en Portugal (1932-1968): corporativismo, catolicismo, autoritarismo",
              "Analiza regímenes autoritarios en Europa del Este: Pilsudski (Polonia), Horthy (Hungría), Carlos II (Rumania)",
              "Evalúa factores comunes: miedo al comunismo, nacionalismo exaltado, crisis económicas, debilidad democrática"
            ]
          }
        ]
      },
      {
        "key": "gran_depresion",
        "name": "Gran Depresión",
        "short_description": "Crisis económica mundial de 1929, causas, desarrollo, respuestas.",
        "sub_topics": [
          {
            "key": "crack_1929",
            "name": "Crack de 1929",
            "short_description": "Colapso de Wall Street, pánico financiero, crisis bancaria.",
            "example_tasks": [
              "Explica causas: especulación bursátil, sobreproducción, desigualdad, debilidad sistema financiero",
              "Describe el Jueves Negro (24 de octubre de 1929) y Martes Negro (29 de octubre): caída de la bolsa de Nueva York",
              "Analiza la propagación: quiebras bancarias, contracción crediticia, pánico, crisis se extiende de EUA al mundo",
              "Evalúa el impacto: desempleo masivo (25% en EUA), caída de producción industrial, deflación, pobreza"
            ]
          },
          {
            "key": "new_deal",
            "name": "New Deal de Roosevelt",
            "short_description": "Programa de recuperación económica mediante intervención estatal.",
            "example_tasks": [
              "Explica la elección de Franklin D. Roosevelt (1932) prometiendo 'New Deal' para estadounidenses",
              "Describe medidas del New Deal: regulación bancaria, obras públicas, subsidios agrícolas, seguridad social",
              "Analiza agencias creadas: TVA (desarrollo regional), CCC (empleo juvenil), WPA (obras públicas)",
              "Evalúa resultados: recuperación parcial, no solución completa (la guerra terminó la depresión), pero sentó bases del Estado de bienestar"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "segunda_guerra_mundial",
    "name": "Segunda Guerra Mundial",
    "short_description": "Conflicto global más devastador (1939-1945): expansión del Eje, holocausto, guerra total, bombas atómicas, victoria aliada.",
    "sub_topics": [
      {
        "key": "causas_segunda_guerra",
        "name": "Causas de la Segunda Guerra Mundial",
        "short_description": "Tratado de Versalles, expansionismo fascista, apaciguamiento, pacto nazi-soviético.",
        "sub_topics": [
          {
            "key": "expansion_nazi",
            "name": "Expansión nazi",
            "short_description": "Remilitarización, Anschluss, Sudetes, invasión de Polonia.",
            "example_tasks": [
              "Describe la política expansionista de Hitler: Lebensraum (espacio vital), reunificación de alemanes, revisión de Versalles",
              "Explica la remilitarización de Renania (1936), anexión de Austria o Anschluss (1938)",
              "Narra la crisis de los Sudetes: Conferencia de Múnich (1938), apaciguamiento de Chamberlain, desmembramiento de Checoslovaquia",
              "Describe la invasión de Polonia (1 de septiembre de 1939): inicio oficial de la Segunda Guerra Mundial"
            ]
          },
          {
            "key": "pacto_molotov_ribbentrop",
            "name": "Pacto Molotov-Ribbentrop",
            "short_description": "Pacto de no agresión nazi-soviético que permitió invasión de Polonia.",
            "example_tasks": [
              "Explica el Pacto de no agresión entre Alemania y URSS (23 de agosto de 1939)",
              "Describe cláusulas secretas: división de Europa del Este en esferas de influencia",
              "Analiza el impacto: permitió a Hitler invadir Polonia sin guerra en dos frentes, Stalin ganó tiempo y territorio",
              "Evalúa la sorpresa mundial ante alianza entre enemigos ideológicos"
            ]
          }
        ]
      },
      {
        "key": "desarrollo_guerra_europa",
        "name": "Desarrollo de la guerra en Europa",
        "short_description": "Blitzkrieg, Batalla de Inglaterra, invasión de URSS, frentes.",
        "sub_topics": [
          {
            "key": "blitzkrieg",
            "name": "Guerra relámpago",
            "short_description": "Conquistas nazis 1939-1941: Polonia, Francia, Balcanes.",
            "example_tasks": [
              "Explica la táctica de Blitzkrieg: guerra relámpago con tanques, aviación, infantería motorizada coordinadas",
              "Describe conquistas de 1939-1940: Polonia, Dinamarca, Noruega, Países Bajos, Bélgica, Francia en 6 semanas",
              "Narra la evacuación de Dunkerque (mayo-junio 1940): rescate de tropas británicas",
              "Explica la batalla de Inglaterra (1940): bombardeos de la Luftwaffe, resistencia de RAF, Hitler pospone invasión"
            ]
          },
          {
            "key": "operacion_barbarroja",
            "name": "Operación Barbarroja",
            "short_description": "Invasión nazi de la URSS, guerra de exterminio, resistencia soviética.",
            "example_tasks": [
              "Describe la invasión de la URSS (22 de junio de 1941): 3 millones de soldados alemanes, mayor invasión de la historia",
              "Explica la guerra de exterminio: ideología nazi, Plan Hambre, asesinatos masivos de civiles, prisioneros, judíos",
              "Narra el sitio de Leningrado (872 días): 1 millón de muertos por hambre y bombardeos",
              "Describe la batalla de Stalingrado (1942-1943): victoria soviética decisiva, punto de inflexión de la guerra"
            ]
          },
          {
            "key": "contraofensiva_aliada_europa",
            "name": "Contraofensiva aliada",
            "short_description": "Día D, liberación de Europa, caída del Reich.",
            "example_tasks": [
              "Explica el Día D (6 de junio de 1944): desembarco aliado en Normandía, apertura de segundo frente",
              "Describe la liberación de Francia y Benelux, avance hacia Alemania desde oeste",
              "Narra el avance soviético desde el este: liberación de Europa Oriental, asedio de Berlín",
              "Describe el suicidio de Hitler (30 de abril de 1945) y la rendición alemana (8 de mayo de 1945)"
            ]
          }
        ]
      },
      {
        "key": "holocausto",
        "name": "El Holocausto",
        "short_description": "Genocidio sistemático de judíos y otros grupos por los nazis.",
        "sub_topics": [
          {
            "key": "persecucion_judios",
            "name": "Persecución y Solución Final",
            "short_description": "De la discriminación al exterminio industrial.",
            "example_tasks": [
              "Describe la escalada de persecución: Leyes de Núremberg (1935), Noche de los Cristales Rotos (1938), guetos",
              "Explica la 'Solución Final' decidida en Conferencia de Wannsee (1942): exterminio sistemático de judíos europeos",
              "Describe los campos de exterminio: Auschwitz, Treblinka, Sobibor, cámaras de gas, crematorios",
              "Analiza el balance: 6 millones de judíos asesinados, más millones de gitanos, eslavos, homosexuales, discapacitados, opositores políticos"
            ]
          }
        ]
      },
      {
        "key": "guerra_pacifico",
        "name": "Guerra en el Pacífico",
        "short_description": "Expansión japonesa, Pearl Harbor, guerra insular, bombas atómicas.",
        "sub_topics": [
          {
            "key": "expansion_japonesa",
            "name": "Expansión japonesa",
            "short_description": "Invasión de China, Gran Esfera de Coprosperidad, Pearl Harbor.",
            "example_tasks": [
              "Explica el militarismo japonés: invasión de Manchuria (1931), guerra con China (1937), masacre de Nankín",
              "Describe la Gran Esfera de Coprosperidad de Asia Oriental: expansión imperial japonesa presentada como anticolonialismo",
              "Narra el ataque a Pearl Harbor (7 de diciembre de 1941): entrada de EUA en la guerra",
              "Explica expansión japonesa: Filipinas, Malasia, Indonesia, Birmania, amenaza a India y Australia"
            ]
          },
          {
            "key": "contraofensiva_pacifico",
            "name": "Contraofensiva estadounidense",
            "short_description": "Midway, salto de isla en isla, kamikaze, bombas atómicas.",
            "example_tasks": [
              "Describe la batalla de Midway (junio 1942): victoria estadounidense decisiva, equilibrio naval cambia",
              "Explica estrategia de 'salto de isla en isla': conquista selectiva hacia Japón (Guadalcanal, Iwo Jima, Okinawa)",
              "Analiza batallas sangrientas: resistencia fanática japonesa, ataques kamikaze, altas bajas en ambos bandos",
              "Narra el uso de bombas atómicas: Hiroshima (6 de agosto), Nagasaki (9 de agosto de 1945)",
              "Describe la rendición de Japón (2 de septiembre de 1945): fin de la Segunda Guerra Mundial"
            ]
          }
        ]
      },
      {
        "key": "mexico_segunda_guerra",
        "name": "México en la Segunda Guerra Mundial",
        "short_description": "Participación mexicana en el conflicto global.",
        "sub_topics": [
          {
            "key": "participacion_mexicana",
            "name": "Participación de México",
            "short_description": "Declaración de guerra, Escuadrón 201, impacto económico.",
            "example_tasks": [
              "Explica las causas de participación: hundimiento de buques petroleros mexicanos por submarinos alemanes (Potrero del Llano, Faja de Oro)",
              "Describe la declaración de guerra de México al Eje (mayo de 1942)",
              "Narra la participación del Escuadrón 201: unidad de aviación mexicana que combatió en Filipinas (1945)",
              "Analiza el impacto económico: exportación de materias primas a EUA, industrialización acelerada, braceros"
            ]
          }
        ]
      },
      {
        "key": "consecuencias_segunda_guerra",
        "name": "Consecuencias de la Segunda Guerra Mundial",
        "short_description": "Balance, ONU, bipolaridad, descolonización.",
        "sub_topics": [
          {
            "key": "balance_guerra",
            "name": "Balance de la guerra",
            "short_description": "Costo humano, material, moral sin precedentes.",
            "example_tasks": [
              "Describe el costo humano: 60-70 millones de muertos, 35 millones de heridos, mayoría civiles",
              "Explica la destrucción material: ciudades arrasadas, infraestructura destruida, hambruna",
              "Analiza el costo moral: Holocausto, bombas atómicas, crímenes de guerra, trauma colectivo",
              "Evalúa el impacto: Europa en ruinas, ascenso de EUA y URSS como superpotencias"
            ]
          },
          {
            "key": "onu",
            "name": "Organización de las Naciones Unidas",
            "short_description": "Creación de la ONU para mantener paz y seguridad internacionales.",
            "example_tasks": [
              "Explica la creación de la ONU (24 de octubre de 1945) en San Francisco",
              "Describe estructura: Asamblea General, Consejo de Seguridad (5 miembros permanentes con veto), Secretaría",
              "Analiza objetivos: mantener paz, proteger derechos humanos, cooperación internacional",
              "Evalúa logros y límites: mejor que Sociedad de Naciones pero paralizada por vetos en Guerra Fría"
            ]
          },
          {
            "key": "nuevo_orden",
            "name": "Nuevo orden mundial",
            "short_description": "Bipolaridad, división de Alemania, Cortina de Hierro.",
            "example_tasks": [
              "Explica la división del mundo en dos bloques: capitalista (EUA) vs. comunista (URSS)",
              "Describe la división de Alemania en cuatro zonas, luego RFA (occidental) y RDA (oriental)",
              "Analiza el discurso de Churchill sobre la 'Cortina de Hierro' (1946) dividiendo Europa",
              "Evalúa el inicio de la descolonización: debilitamiento de potencias europeas, movimientos independentistas en Asia y África"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "guerra_fria",
    "name": "Guerra Fría",
    "short_description": "Confrontación global entre bloques capitalista y comunista (1947-1991): conflictos indirectos, carrera armamentista, descolonización, distensión y colapso soviético.",
    "sub_topics": [
      {
        "key": "origenes_bloques",
        "name": "Orígenes y formación de bloques",
        "short_description": "Doctrina Truman, Plan Marshall, OTAN, Pacto de Varsovia, bipolaridad.",
        "sub_topics": [
          {
            "key": "doctrina_truman_containment",
            "name": "Doctrina Truman y contención",
            "short_description": "Política estadounidense de contención del comunismo.",
            "example_tasks": [
              "Explica la Doctrina Truman (1947): compromiso estadounidense de contener expansión del comunismo",
              "Describe el Plan Marshall (1948-1952): ayuda económica masiva para reconstruir Europa Occidental y evitar comunismo",
              "Analiza la división ideológica: capitalismo, democracia liberal, libre mercado vs. comunismo, planificación central, partido único",
              "Evalúa el impacto: recuperación de Europa Occidental, dependencia de EUA, consolidación del bloque occidental"
            ]
          },
          {
            "key": "alianzas_militares",
            "name": "Alianzas militares",
            "short_description": "OTAN, Pacto de Varsovia, bloques militares enfrentados.",
            "example_tasks": [
              "Describe la formación de la OTAN (1949): alianza militar del Atlántico Norte liderada por EUA",
              "Explica el Pacto de Varsovia (1955): alianza militar del bloque soviético en respuesta a OTAN",
              "Analiza la lógica de bloques: defensa colectiva, ataque a uno es ataque a todos",
              "Evalúa la militarización: bases estadounidenses en Europa y Asia, tropas soviéticas en Europa del Este"
            ]
          },
          {
            "key": "carrera_armamentista",
            "name": "Carrera armamentista nuclear",
            "short_description": "Proliferación de armas nucleares, equilibrio del terror.",
            "example_tasks": [
              "Describe el monopolio nuclear estadounidense (1945-1949) y la primera bomba soviética (1949)",
              "Explica la escalada: bomba de hidrógeno, misiles balísticos intercontinentales, submarinos nucleares",
              "Analiza la Destrucción Mutua Asegurada (MAD): ninguno podría ganar guerra nuclear, disuasión mutua",
              "Evalúa el impacto: recursos masivos en armas, tensión permanente, peligro de aniquilación global"
            ]
          }
        ]
      },
      {
        "key": "conflictos_guerra_fria",
        "name": "Principales conflictos",
        "short_description": "Guerras indirectas entre superpotencias: Corea, Vietnam, crisis de misiles.",
        "sub_topics": [
          {
            "key": "guerra_corea",
            "name": "Guerra de Corea (1950-1953)",
            "short_description": "Primera guerra caliente de la Guerra Fría, división de Corea.",
            "example_tasks": [
              "Explica la división de Corea en 1945: Norte (comunista apoyado por URSS y China) y Sur (capitalista apoyado por EUA)",
              "Describe la invasión norcoreana del Sur (junio 1950) y respuesta de ONU liderada por EUA",
              "Narra el desarrollo: avances y retrocesos, intervención de China, estancamiento en el paralelo 38",
              "Explica el armisticio de 1953: división permanente, Corea sigue dividida hasta hoy"
            ]
          },
          {
            "key": "crisis_misiles_cuba",
            "name": "Crisis de los Misiles de Cuba (1962)",
            "short_description": "Momento de mayor tensión, mundo al borde de guerra nuclear.",
            "example_tasks": [
              "Explica el contexto: Revolución Cubana (1959), Fidel Castro se alía con URSS, invasión fallida de Bahía de Cochinos (1961)",
              "Describe la crisis (octubre 1962): misiles nucleares soviéticos en Cuba detectados por aviones espías estadounidenses",
              "Narra el desarrollo: bloqueo naval de Kennedy, confrontación, 13 días de tensión extrema",
              "Explica la resolución: Jrushchov retira misiles a cambio de promesa de no invadir Cuba y retirada de misiles de Turquía",
              "Evalúa consecuencias: teléfono rojo Moscú-Washington, tratados de limitación de armas, distensión"
            ]
          },
          {
            "key": "guerra_vietnam",
            "name": "Guerra de Vietnam (1955-1975)",
            "short_description": "Derrota estadounidense, impacto en política y sociedad.",
            "example_tasks": [
              "Explica orígenes: división de Vietnam (1954) tras derrota francesa, Norte comunista vs. Sur apoyado por EUA",
              "Describe la escalada estadounidense: asesores militares, Incidente del Golfo de Tonkín (1964), bombardeos masivos",
              "Analiza la guerra: tácticas de guerrilla del Vietcong, ofensiva del Tet (1968), protestas en EUA",
              "Narra el retiro estadounidense (1973) y caída de Saigón (1975): victoria comunista, reunificación bajo el Norte",
              "Evalúa consecuencias: trauma estadounidense, Síndrome de Vietnam, límites del poder militar"
            ]
          },
          {
            "key": "conflictos_regionales",
            "name": "Otros conflictos regionales",
            "short_description": "Guerras por procuración en África, Asia, América Latina.",
            "example_tasks": [
              "Describe conflictos africanos: Angola, Mozambique, Etiopía con intervención de superpotencias",
              "Explica guerras en Medio Oriente: guerra árabe-israelí como escenario de rivalidad EUA-URSS",
              "Analiza intervención soviética en Afganistán (1979-1989): 'Vietnam soviético', apoyo estadounidense a mujahidines",
              "Evalúa dictaduras en América Latina apoyadas por EUA bajo pretexto anticomunista: Chile (Pinochet), Argentina (junta militar)"
            ]
          }
        ]
      },
      {
        "key": "descolonizacion",
        "name": "Descolonización",
        "short_description": "Independencia de colonias asiáticas y africanas, Movimiento de No Alineados.",
        "sub_topics": [
          {
            "key": "independencia_asia",
            "name": "Independencia de Asia",
            "short_description": "India, Indonesia, Indochina: fin de imperios coloniales.",
            "example_tasks": [
              "Describe la independencia de India y Pakistán (1947): fin del Raj británico, partición, violencia religiosa",
              "Explica el papel de líderes: Gandhi (resistencia no violenta), Nehru (primer ministro), Jinnah (Pakistán)",
              "Narra la independencia de Indonesia de Holanda (1949) tras lucha de Sukarno",
              "Describe la descolonización francesa en Indochina: guerra de independencia, derrota en Dien Bien Phu (1954)"
            ]
          },
          {
            "key": "independencia_africa",
            "name": "Independencia de África",
            "short_description": "Año africano 1960, guerras de independencia, neocolonialismo.",
            "example_tasks": [
              "Explica el 'año africano' 1960: 17 países africanos logran independencia",
              "Describe casos: Ghana (1957, Nkrumah), Congo (1960, caos y asesinato de Lumumba), Kenia (1963, tras rebelión Mau Mau)",
              "Analiza guerras prolongadas: Argelia contra Francia (1954-1962), colonias portuguesas (Angola, Mozambique hasta 1975)",
              "Evalúa problemas: fronteras coloniales arbitrarias, guerras civiles, neocolonialismo económico, Guerra Fría en África"
            ]
          },
          {
            "key": "no_alineados",
            "name": "Movimiento de Países No Alineados",
            "short_description": "Tercer Mundo, neutralidad en Guerra Fría.",
            "example_tasks": [
              "Explica la Conferencia de Bandung (1955): países afroasiáticos rechazan someterse a bloques",
              "Describe líderes: Nehru (India), Nasser (Egipto), Tito (Yugoslavia), Sukarno (Indonesia)",
              "Analiza objetivos: independencia política, desarrollo económico, paz mundial",
              "Evalúa límites: presiones de superpotencias, divisiones internas, dificultades económicas"
            ]
          }
        ]
      },
      {
        "key": "distension_fin_guerra_fria",
        "name": "Distensión y fin de la Guerra Fría",
        "short_description": "Coexistencia pacífica, perestroika, caída del Muro, colapso de URSS.",
        "sub_topics": [
          {
            "key": "distension",
            "name": "Distensión (Détente)",
            "short_description": "Relajamiento de tensiones en 1970s.",
            "example_tasks": [
              "Explica la política de distensión: diálogo entre superpotencias, tratados de limitación de armas",
              "Describe tratados SALT I y II: limitación de armas estratégicas",
              "Analiza la visita de Nixon a China (1972): apertura diplomática",
              "Evalúa límites: distensión terminó con invasión soviética de Afganistán (1979)"
            ]
          },
          {
            "key": "gorbachev_reformas",
            "name": "Gorbachev y las reformas",
            "short_description": "Perestroika, glasnost, fin de Guerra Fría.",
            "example_tasks": [
              "Explica el ascenso de Mijaíl Gorbachev (1985): reconocimiento de crisis soviética",
              "Describe la Perestroika (reestructuración económica) y Glasnost (transparencia política)",
              "Analiza consecuencias no previstas: críticas al sistema, nacionalismos, descontento",
              "Explica el fin de Guerra Fría: Tratado INF (1987), cumbre de Malta (1989), retiro de Afganistán"
            ]
          },
          {
            "key": "caida_muro_berlin",
            "name": "Caída del Muro de Berlín",
            "short_description": "Símbolo del fin de la división de Europa (1989).",
            "example_tasks": [
              "Describe el Muro de Berlín (1961-1989): símbolo de la división de Europa, 'telón de acero' físico",
              "Explica la apertura inesperada (9 de noviembre de 1989): error en anuncio, multitudes cruzan, muro es derribado",
              "Narra la reunificación alemana (1990): absorción de RDA por RFA",
              "Evalúa el simbolismo: fin de Guerra Fría, triunfo occidental, esperanza de paz"
            ]
          },
          {
            "key": "colapso_urss",
            "name": "Colapso de la Unión Soviética",
            "short_description": "Desintegración del bloque soviético (1989-1991).",
            "example_tasks": [
              "Describe las revoluciones de 1989: caída de regímenes comunistas en Polonia, Hungría, Checoslovaquia, Rumania",
              "Explica el intento de golpe de Estado contra Gorbachev (agosto 1991) y su fracaso",
              "Narra la disolución de la URSS (diciembre 1991): 15 repúblicas independientes, fin del comunismo soviético",
              "Analiza el ascenso de Boris Yeltsin y la Rusia postsoviética",
              "Evalúa el fin de Guerra Fría: triunfo de EUA como única superpotencia, nuevo orden mundial"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "mexico_segunda_mitad_siglo_xx",
    "name": "México en la segunda mitad del siglo XX",
    "short_description": "Desarrollo estabilizador, movimientos sociales, crisis económicas, transición democrática (1952-2000).",
    "sub_topics": [
      {
        "key": "movimiento_1968",
        "name": "Movimiento estudiantil de 1968",
        "short_description": "Protesta estudiantil, represión, matanza de Tlatelolco.",
        "sub_topics": [
          {
            "key": "contexto_1968",
            "name": "Contexto del movimiento",
            "short_description": "Autoritarismo priista, inquietud juvenil, olimpiadas.",
            "example_tasks": [
              "Explica el contexto: autoritarismo del PRI, falta de democracia, represión a movimientos sociales",
              "Describe la influencia internacional: Mayo francés, Primavera de Praga, movimientos contraculturales",
              "Analiza la situación específica: México sede de Olimpiadas 1968, gobierno de Díaz Ordaz obsesionado con 'orden'",
              "Explica las demandas estudiantiles: libertad de presos políticos, destitución de jefes policiacos, diálogo con gobierno"
            ]
          },
          {
            "key": "desarrollo_movimiento",
            "name": "Desarrollo del movimiento",
            "short_description": "Marchas multitudinarias, ocupación de la UNAM, Consejo Nacional de Huelga.",
            "example_tasks": [
              "Describe el inicio: represión policiaca a riña estudiantil (julio 1968), solidaridad entre escuelas",
              "Narra las marchas masivas: Marcha del Silencio (13 de septiembre), cientos de miles de participantes",
              "Explica la formación del CNH (Consejo Nacional de Huelga): coordinación de escuelas, pliego petitorio",
              "Describe la ocupación militar de la UNAM y el IPN: violación de autonomía universitaria"
            ]
          },
          {
            "key": "tlatelolco",
            "name": "Matanza de Tlatelolco",
            "short_description": "Represión violenta el 2 de octubre de 1968.",
            "example_tasks": [
              "Narra los eventos del 2 de octubre de 1968 en la Plaza de las Tres Culturas, Tlatelolco",
              "Describe la operación militar: francotiradores del Batallón Olimpia, ejército rodeando plaza, masacre",
              "Analiza la censura y mentiras oficiales: gobierno minimizó muertos (4), estimaciones reales (300-400)",
              "Evalúa el impacto: trauma nacional, fin del 'milagro mexicano', cuestionamiento del régimen priista",
              "Explica el legado: símbolo de represión, memoria histórica, movimientos democráticos posteriores"
            ]
          }
        ]
      },
      {
        "key": "crisis_1970s_1980s",
        "name": "Crisis económicas (1970s-1980s)",
        "short_description": "Fin del desarrollo estabilizador, auge petrolero, crisis de deuda.",
        "sub_topics": [
          {
            "key": "echeverria_populismo",
            "name": "Echeverría y desarrollo compartido",
            "short_description": "Populismo, gasto público, guerrilla, matanza del Jueves de Corpus.",
            "example_tasks": [
              "Describe el gobierno de Luis Echeverría (1970-1976): intento de recuperar legitimidad tras 1968",
              "Explica la política de 'desarrollo compartido': gasto público expansivo, retórica tercermundista",
              "Narra la matanza del Jueves de Corpus o Halconazo (10 de junio de 1971): represión a estudiantes por grupo paramilitar",
              "Analiza la guerra sucia: represión de guerrillas rurales y urbanas, desapariciones forzadas",
              "Evalúa resultados: inflación, devaluación (1976), crisis económica"
            ]
          },
          {
            "key": "lopez_portillo_petroleo",
            "name": "López Portillo y el auge petrolero",
            "short_description": "Bonanza petrolera, endeudamiento, crisis de 1982.",
            "example_tasks": [
              "Explica el auge petrolero: descubrimiento de yacimientos, altos precios del petróleo, optimismo ('administrar la abundancia')",
              "Describe el endeudamiento masivo: préstamos internacionales basados en futuras exportaciones petroleras",
              "Narra la caída de precios del petróleo (1981) y crisis de deuda (1982)",
              "Explica la nacionalización de la banca (1 de septiembre de 1982): medida desesperada, fuga de capitales",
              "Evalúa consecuencias: inflación, devaluación, moratoria de pagos, 'década perdida' inicia"
            ]
          },
          {
            "key": "decada_perdida",
            "name": "Década perdida (1980s)",
            "short_description": "Crisis de deuda, ajuste estructural, neoliberalismo.",
            "example_tasks": [
              "Explica la crisis de deuda latinoamericana: México declaró moratoria (1982), efecto dominó regional",
              "Describe el ajuste estructural: recetas del FMI, austeridad, privatizaciones, apertura comercial",
              "Analiza el gobierno de De la Madrid (1982-1988): ortodoxia neoliberal, caída de salarios, inflación",
              "Evalúa el impacto social: empobrecimiento de clases medias y populares, emigración a EUA, informalidad"
            ]
          }
        ]
      },
      {
        "key": "neoliberalismo_transicion",
        "name": "Neoliberalismo y transición democrática",
        "short_description": "Salinas, TLCAN, levantamiento zapatista, crisis política (1988-2000).",
        "sub_topics": [
          {
            "key": "eleccion_1988",
            "name": "Elección de 1988",
            "short_description": "Fraude electoral, Cuauhtémoc Cárdenas, 'se cayó el sistema'.",
            "example_tasks": [
              "Describe la división del PRI: Corriente Democrática de Cuauhtémoc Cárdenas y Porfirio Muñoz Ledo exigiendo democratización",
              "Explica la candidatura de Cárdenas con amplia coalición de izquierda (FDN): movilización masiva, amenaza al PRI",
              "Narra la elección del 6 de julio de 1988: caída del sistema de cómputo, triunfo declarado de Salinas",
              "Analiza el fraude electoral: quema de boletas, imposición de Salinas, ilegitimidad",
              "Evalúa consecuencias: cuestionamiento del sistema, presión democratizadora, formación del PRD"
            ]
          },
          {
            "key": "salinismo",
            "name": "Gobierno de Salinas (1988-1994)",
            "short_description": "Neoliberalismo radical, TLCAN, privatizaciones.",
            "example_tasks": [
              "Describe el programa neoliberal de Salinas: privatización de empresas estatales (TELMEX, bancos, siderúrgicas)",
              "Explica la negociación del TLCAN (TLC): Tratado de Libre Comercio con EUA y Canadá (vigente desde 1994)",
              "Analiza reformas: al ejido (permitir venta de tierras comunales), relaciones con Iglesia",
              "Evalúa el programa PRONASOL: asistencialismo clientelar para compensar efectos de neoliberalismo"
            ]
          },
          {
            "key": "ezln",
            "name": "Levantamiento zapatista (1994)",
            "short_description": "EZLN en Chiapas, demandas indígenas, impacto nacional.",
            "example_tasks": [
              "Explica el contexto: pobreza en Chiapas, despojo de tierras indígenas, efectos de reforma al artículo 27",
              "Describe el levantamiento del EZLN (1 de enero de 1994): coincide con entrada en vigor del TLCAN",
              "Analiza las demandas: tierra, trabajo, techo, salud, educación, democracia, justicia, paz, independencia, libertad",
              "Narra el desarrollo: conflicto armado breve, negociaciones, Acuerdos de San Andrés sobre derechos indígenas (incumplidos)",
              "Evalúa el impacto: cuestionamiento del modelo neoliberal, visibilización de pueblos indígenas, influencia global"
            ]
          },
          {
            "key": "crisis_1994_1995",
            "name": "Crisis de 1994-1995",
            "short_description": "Error de diciembre, devaluación, asesinatos políticos.",
            "example_tasks": [
              "Describe el año de 1994: levantamiento zapatista, asesinato de Colosio (candidato del PRI), de Ruiz Massieu",
              "Explica el 'error de diciembre': devaluación súbita del peso (diciembre 1994), pánico financiero",
              "Narra la crisis económica: fuga de capitales, quiebras, rescate bancario (FOBAPROA), desempleo",
              "Analiza el rescate de EUA: paquete de 50 mil millones de dólares, condicionalidades",
              "Evalúa consecuencias políticas: desprestigio del PRI, ascenso de oposición"
            ]
          },
          {
            "key": "alternancia_2000",
            "name": "Alternancia democrática (2000)",
            "short_description": "Victoria de Vicente Fox, fin de hegemonía priista.",
            "example_tasks": [
              "Explica el proceso de democratización: reformas electorales (1996), autonomía del IFE, transparencia",
              "Describe la candidatura de Vicente Fox (PAN): empresario, campaña mediática, 'voto útil' contra PRI",
              "Narra la elección del 2 de julio de 2000: victoria clara de Fox, reconocimiento de Labastida (PRI)",
              "Analiza la alternancia: fin de 71 años de hegemonía priista, transición pacífica",
              "Evalúa el significado: consolidación democrática, pero persistencia de problemas estructurales"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "america_latina_siglo_xx",
    "name": "América Latina en el siglo XX",
    "short_description": "Procesos políticos, económicos y sociales en América Latina: populismos, dictaduras, revoluciones, transiciones democráticas.",
    "sub_topics": [
      {
        "key": "populismos_latinoamericanos",
        "name": "Populismos latinoamericanos",
        "short_description": "Perón, Vargas, Cárdenas: movilización popular, nacionalismo económico.",
        "sub_topics": [
          {
            "key": "peronismo_argentina",
            "name": "Peronismo en Argentina",
            "short_description": "Juan Domingo Perón, Eva Perón, justicia social, nacionalismo.",
            "example_tasks": [
              "Describe el ascenso de Perón: militar, secretario de Trabajo, apoyo obrero, 17 de octubre de 1945",
              "Explica el peronismo: justicia social, independencia económica, soberanía política, tercera posición",
              "Analiza el papel de Eva Perón (Evita): conexión con descamisados, fundación Eva Perón, voto femenino",
              "Evalúa legado: movimiento político duradero, división persistente en Argentina (peronistas vs. antiperonistas)"
            ]
          },
          {
            "key": "vargas_brasil",
            "name": "Varguismo en Brasil",
            "short_description": "Getúlio Vargas, Estado Novo, industrialización.",
            "example_tasks": [
              "Explica la Revolución de 1930 que llevó a Vargas al poder",
              "Describe el Estado Novo (1937-1945): dictadura modernizadora, nacionalismo, corporativismo",
              "Analiza políticas: industrialización, legislación laboral, nacionalización de recursos",
              "Evalúa retorno democrático de Vargas (1951-1954) y su suicidio tras crisis política"
            ]
          }
        ]
      },
      {
        "key": "revolucion_cubana",
        "name": "Revolución Cubana",
        "short_description": "Fidel Castro, Che Guevara, socialismo en Cuba, impacto continental.",
        "sub_topics": [
          {
            "key": "triunfo_revolucion",
            "name": "Triunfo de la Revolución (1959)",
            "short_description": "Guerrilla, caída de Batista, transformación socialista.",
            "example_tasks": [
              "Describe la dictadura de Fulgencio Batista: corrupción, represión, dependencia de EUA",
              "Narra la guerrilla del Movimiento 26 de Julio: asalto al Moncada (1953), Sierra Maestra, Che Guevara",
              "Explica la entrada triunfal a La Habana (1 de enero de 1959): caída de Batista, Fidel al poder",
              "Describe la radicalización: reforma agraria, nacionalizaciones, ruptura con EUA, acercamiento a URSS"
            ]
          },
          {
            "key": "cuba_socialista",
            "name": "Cuba socialista",
            "short_description": "Bloqueo estadounidense, alianza soviética, exportación revolucionaria.",
            "example_tasks": [
              "Explica el bloqueo económico estadounidense (1962-presente): aislamiento, presión económica",
              "Describe logros: alfabetización universal, sistema de salud, educación gratuita",
              "Analiza limitaciones: economía planificada ineficiente, represión política, dependencia soviética",
              "Evalúa la influencia: inspiración para movimientos guerrilleros en América Latina, tensión con EUA"
            ]
          }
        ]
      },
      {
        "key": "dictaduras_cono_sur",
        "name": "Dictaduras del Cono Sur",
        "short_description": "Regímenes militares represivos en Argentina, Chile, Uruguay, Brasil.",
        "sub_topics": [
          {
            "key": "golpe_chile",
            "name": "Golpe en Chile (1973)",
            "short_description": "Derrocamiento de Allende, dictadura de Pinochet.",
            "example_tasks": [
              "Explica el gobierno de Salvador Allende (1970-1973): primer presidente marxista elegido democráticamente",
              "Describe reformas: nacionalización del cobre, reforma agraria, Vía chilena al socialismo",
              "Narra el golpe de Estado (11 de septiembre de 1973): bombardeo de La Moneda, muerte de Allende",
              "Analiza la dictadura de Augusto Pinochet (1973-1990): represión masiva, desaparecidos, modelo neoliberal",
              "Evalúa el papel de EUA: apoyo al golpe, documentado en archivos desclasificados"
            ]
          },
          {
            "key": "dictadura_argentina",
            "name": "Dictadura argentina (1976-1983)",
            "short_description": "Proceso de Reorganización Nacional, desapariciones, Madres de Plaza de Mayo.",
            "example_tasks": [
              "Describe el golpe de 1976: junta militar, 'Proceso de Reorganización Nacional'",
              "Explica la represión: 30,000 desaparecidos, centros clandestinos de detención, vuelos de la muerte",
              "Narra la resistencia: Madres y Abuelas de Plaza de Mayo, búsqueda de desaparecidos",
              "Analiza la caída: derrota en Guerra de Malvinas (1982), crisis económica, transición democrática (1983)"
            ]
          },
          {
            "key": "operacion_condor",
            "name": "Operación Cóndor",
            "short_description": "Coordinación represiva entre dictaduras del Cono Sur.",
            "example_tasks": [
              "Explica la Operación Cóndor: coordinación de inteligencia y represión entre dictaduras de Argentina, Chile, Uruguay, Paraguay, Brasil, Bolivia",
              "Describe métodos: intercambio de prisioneros, asesinatos transfronterizos, persecución de exiliados",
              "Analiza casos: asesinato de Prats en Argentina, Letelier en Washington",
              "Evalúa el apoyo estadounidense: entrenamiento, financiamiento, Escuela de las Américas"
            ]
          }
        ]
      },
      {
        "key": "guerrillas_centroamerica",
        "name": "Guerrillas y conflictos en Centroamérica",
        "short_description": "Nicaragua, El Salvador, Guatemala: revoluciones y contrarrevoluciones.",
        "sub_topics": [
          {
            "key": "revolucion_sandinista",
            "name": "Revolución Sandinista (Nicaragua)",
            "short_description": "Caída de Somoza, gobierno sandinista, Contras.",
            "example_tasks": [
              "Explica la dictadura de Somoza: dinastía familiar, represión, corrupción, dependencia de EUA",
              "Describe la revolución sandinista (1979): FSLN derroca a Somoza, gobierno de izquierda",
              "Narra la guerra de los Contras: guerrilla apoyada por EUA de Reagan, sabotajes, minado de puertos",
              "Analiza resultados: derrota electoral sandinista (1990), fin de guerra, pero país devastado"
            ]
          },
          {
            "key": "guerras_civiles",
            "name": "Guerras civiles (El Salvador, Guatemala)",
            "short_description": "Conflictos prolongados, masacres, acuerdos de paz.",
            "example_tasks": [
              "Describe guerra civil en El Salvador (1979-1992): FMLN vs. gobierno, 75,000 muertos, masacres",
              "Explica conflicto en Guatemala (1960-1996): el más largo de América Latina, genocidio de población maya",
              "Analiza papel de EUA: apoyo militar a gobiernos anticomunistas, Escuela de las Américas",
              "Evalúa acuerdos de paz: fin de conflictos armados pero impunidad, desigualdad persisten"
            ]
          }
        ]
      },
      {
        "key": "transiciones_democraticas",
        "name": "Transiciones democráticas",
        "short_description": "Retorno a la democracia en los 1980s-1990s.",
        "sub_topics": [
          {
            "key": "redemocratizacion",
            "name": "Procesos de redemocratización",
            "short_description": "Elecciones, justicia transicional, consolidación democrática.",
            "example_tasks": [
              "Describe la ola democratizadora: Argentina (1983), Brasil (1985), Chile (1990), Paraguay (1989)",
              "Explica mecanismos: comisiones de verdad, juicios (Argentina), amnistías (Chile, Brasil)",
              "Analiza desafíos: justicia vs. impunidad, memoria histórica, poderes fácticos militares",
              "Evalúa resultados: democracias consolidadas pero con límites, desigualdad, violencia"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "caida_bloque_sovietico_nuevo_orden",
    "name": "Caída del bloque soviético y nuevo orden mundial",
    "short_description": "Fin de la Guerra Fría, globalización, hegemonía estadounidense, nuevos conflictos (1989-2000).",
    "sub_topics": [
      {
        "key": "globalizacion",
        "name": "Globalización",
        "short_description": "Integración económica mundial, neoliberalismo, tecnología.",
        "sub_topics": [
          {
            "key": "integracion_economica",
            "name": "Integración económica",
            "short_description": "Bloques comerciales, libre comercio, corporaciones transnacionales.",
            "example_tasks": [
              "Explica la globalización económica: libre circulación de capitales, mercancías, inversiones",
              "Describe bloques comerciales: Unión Europea (Maastricht 1992, euro 1999), TLCAN (1994), MERCOSUR",
              "Analiza el papel de organismos: OMC (Organización Mundial del Comercio), FMI, Banco Mundial",
              "Evalúa efectos: crecimiento económico pero desigualdad, crisis financieras globales"
            ]
          },
          {
            "key": "revolucion_tecnologica",
            "name": "Revolución tecnológica",
            "short_description": "Internet, comunicaciones, era digital.",
            "example_tasks": [
              "Describe la revolución de las comunicaciones: Internet, telefonía celular, fibra óptica",
              "Explica el impacto de Internet: World Wide Web (1991), correo electrónico, comercio electrónico",
              "Analiza transformaciones: sociedad de la información, trabajo a distancia, redes sociales emergentes",
              "Evalúa la brecha digital: acceso desigual entre países desarrollados y en desarrollo"
            ]
          }
        ]
      },
      {
        "key": "hegemonia_estadounidense",
        "name": "Hegemonía estadounidense",
        "short_description": "EUA como única superpotencia, intervenciones militares.",
        "sub_topics": [
          {
            "key": "nuevo_orden_mundial",
            "name": "Nuevo orden mundial",
            "short_description": "Momento unipolar, expansión de democracia liberal.",
            "example_tasks": [
              "Explica el concepto de 'nuevo orden mundial' de Bush padre tras Guerra Fría",
              "Describe la Guerra del Golfo (1991): coalición contra invasión iraquí de Kuwait",
              "Analiza la expansión de la OTAN hacia el este: incorporación de antiguos países del Pacto de Varsovia",
              "Evalúa el 'fin de la historia' de Fukuyama: triunfo supuesto de democracia liberal y capitalismo"
            ]
          },
          {
            "key": "guerras_yugoslavia",
            "name": "Guerras de Yugoslavia",
            "short_description": "Desintegración de Yugoslavia, guerras étnicas, genocidio.",
            "example_tasks": [
              "Explica la desintegración de Yugoslavia (1991-1992): independencias de Eslovenia, Croacia, Bosnia, Macedonia",
              "Describe las guerras: limpieza étnica, sitio de Sarajevo, masacre de Srebrenica (1995)",
              "Narra la intervención de OTAN en Kosovo (1999): bombardeos contra Serbia",
              "Analiza el Tribunal Penal Internacional para Yugoslavia: juicios por crímenes de guerra, genocidio"
            ]
          }
        ]
      },
      {
        "key": "rusia_postsoviética",
        "name": "Rusia postsoviética",
        "short_description": "Transición caótica, capitalismo salvaje, ascenso de Putin.",
        "sub_topics": [
          {
            "key": "era_yeltsin",
            "name": "Era de Yeltsin (1991-1999)",
            "short_description": "Terapia de choque, oligarcas, crisis económica.",
            "example_tasks": [
              "Describe la transición al capitalismo: 'terapia de choque', privatizaciones masivas, hiperinflación",
              "Explica el surgimiento de oligarcas: concentración de riqueza en pocas manos, corrupción",
              "Narra crisis: default de 1998, empobrecimiento, nostalgia soviética",
              "Analiza guerras de Chechenia: separatismo, represión brutal, inestabilidad"
            ]
          },
          {
            "key": "ascenso_putin",
            "name": "Ascenso de Putin",
            "short_description": "Estabilización autoritaria, recentralización del poder.",
            "example_tasks": [
              "Explica la llegada de Vladimir Putin al poder (2000): ex-KGB, sucesor de Yeltsin",
              "Describe políticas: control de oligarcas, centralización, renacionalización de sectores estratégicos",
              "Analiza el autoritarismo: restricción de libertades, control de medios, represión de oposición",
              "Evalúa la recuperación económica basada en altos precios del petróleo y gas"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "mexico_contemporaneo",
    "name": "México contemporáneo",
    "short_description": "México en el siglo XXI: desafíos democráticos, violencia, economía, transformaciones sociales (2000-presente).",
    "sub_topics": [
      {
        "key": "gobiernos_pan",
        "name": "Gobiernos del PAN (2000-2012)",
        "short_description": "Fox y Calderón: democracia limitada, guerra contra el narco.",
        "sub_topics": [
          {
            "key": "sexenio_fox",
            "name": "Sexenio de Vicente Fox (2000-2006)",
            "short_description": "Expectativas, gobierno dividido, reformas limitadas.",
            "example_tasks": [
              "Describe expectativas iniciales: esperanza de cambio tras alternancia",
              "Explica limitaciones: gobierno dividido (PRI mayoritario en Congreso), falta de consensos",
              "Analiza logros limitados: transparencia (IFAI), algunos programas sociales",
              "Evalúa fracasos: reforma energética, fiscal, laboral bloqueadas, desencanto"
            ]
          },
          {
            "key": "guerra_narcotrafico",
            "name": "Guerra contra el narcotráfico (2006-2012)",
            "short_description": "Calderón, militarización, violencia extrema.",
            "example_tasks": [
              "Explica la decisión de Calderón de combatir frontalmente al narcotráfico con fuerzas armadas (2006)",
              "Describe la escalada de violencia: más de 120,000 muertos en 6 años, decapitaciones, narcomantas",
              "Analiza la fragmentación de cárteles: multiplicación de grupos, disputa de territorios, violencia contra población civil",
              "Evalúa resultados: capturas de capos pero violencia sin control, militarización, violaciones a derechos humanos"
            ]
          }
        ]
      },
      {
        "key": "regreso_pri",
        "name": "Regreso del PRI (2012-2018)",
        "short_description": "Peña Nieto, reformas estructurales, corrupción, Ayotzinapa.",
        "sub_topics": [
          {
            "key": "reformas_estructurales",
            "name": "Reformas estructurales",
            "short_description": "Educativa, energética, telecomunicaciones, resultados mixtos.",
            "example_tasks": [
              "Describe el 'Pacto por México': acuerdo de partidos para aprobar reformas estructurales",
              "Explica reformas principales: educativa, energética (fin de monopolio de PEMEX), telecomunicaciones, competencia",
              "Analiza oposición: maestros (CNTE), nacionalistas (contra privatización petrolera)",
              "Evalúa resultados: implementación deficiente, corrupción, beneficios limitados"
            ]
          },
          {
            "key": "ayotzinapa",
            "name": "Caso Ayotzinapa",
            "short_description": "Desaparición de 43 normalistas, crisis de derechos humanos.",
            "example_tasks": [
              "Narra los hechos: desaparición de 43 estudiantes de Ayotzinapa en Iguala, Guerrero (26 de septiembre de 2014)",
              "Describe la 'verdad histórica' del gobierno: rechazada por expertos independientes, familias",
              "Analiza el movimiento social: 'Fue el Estado', marchas masivas, cuestionamiento del régimen",
              "Evalúa el impacto: evidencia de colusión autoridades-crimen organizado, crisis de legitimidad"
            ]
          },
          {
            "key": "corrupcion_pri",
            "name": "Escándalos de corrupción",
            "short_description": "Casa Blanca, Odebrecht, Estafa Maestra.",
            "example_tasks": [
              "Describe casos: Casa Blanca de Peña Nieto (conflicto de interés), Odebrecht (sobornos), Estafa Maestra (desvío de recursos)",
              "Explica el hartazgo social ante impunidad de políticos",
              "Analiza el debilitamiento del PRI",
              "Evalúa el contexto para la elección de 2018"
            ]
          }
        ]
      },
      {
        "key": "cuarta_transformacion",
        "name": "Cuarta Transformación (2018-presente)",
        "short_description": "AMLO, cambio de régimen, pandemia, continuidades y rupturas.",
        "sub_topics": [
          {
            "key": "triunfo_amlo",
            "name": "Triunfo de AMLO",
            "short_description": "Victoria de Morena, expectativas de cambio.",
            "example_tasks": [
              "Explica la elección de 2018: victoria contundente de Andrés Manuel López Obrador (53%)",
              "Describe el proyecto de 'Cuarta Transformación': después de Independencia, Reforma, Revolución",
              "Analiza promesas: combate a corrupción, austeridad republicana, programas sociales, 'primero los pobres'",
              "Evalúa formación de nueva mayoría política: Morena desplaza al PRI como partido hegemónico"
            ]
          },
          {
            "key": "politicas_amlo",
            "name": "Políticas del gobierno",
            "short_description": "Austeridad, programas sociales, megaproyectos.",
            "example_tasks": [
              "Describe la austeridad: reducción de salarios de altos funcionarios, cancelación de gastos 'superfluos'",
              "Explica programas sociales: becas, pensión a adultos mayores, Sembrando Vida, Jóvenes Construyendo el Futuro",
              "Analiza megaproyectos: Tren Maya, Dos Bocas, AIFA (Aeropuerto Felipe Ángeles), críticas ambientales",
              "Evalúa estrategia de seguridad: 'abrazos no balazos', Guardia Nacional, resultados ambiguos"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "mundo_actual_metodos_historicos",
    "name": "Mundo actual y métodos históricos",
    "short_description": "Desafíos del siglo XXI, historiografía, análisis de fuentes, construcción del conocimiento histórico.",
    "sub_topics": [
      {
        "key": "desafios_siglo_xxi",
        "name": "Desafíos del siglo XXI",
        "short_description": "Cambio climático, terrorismo, migraciones, desigualdad.",
        "sub_topics": [
          {
            "key": "cambio_climatico",
            "name": "Cambio climático",
            "short_description": "Calentamiento global, crisis ambiental, Acuerdos de París.",
            "example_tasks": [
              "Explica el consenso científico sobre cambio climático antropogénico: emisiones de CO2, efecto invernadero",
              "Describe evidencias: aumento de temperatura global, derretimiento de glaciares, eventos extremos",
              "Analiza acuerdos internacionales: Protocolo de Kyoto (1997), Acuerdos de París (2015)",
              "Evalúa desafíos: tensión desarrollo económico vs. sustentabilidad, negacionismo, acción insuficiente"
            ]
          },
          {
            "key": "terrorismo_global",
            "name": "Terrorismo y seguridad",
            "short_description": "11-S, guerra contra el terror, Estado Islámico.",
            "example_tasks": [
              "Describe los atentados del 11 de septiembre de 2001: impacto en política global",
              "Explica la 'guerra contra el terror': invasiones de Afganistán (2001) e Irak (2003)",
              "Analiza el surgimiento del Estado Islámico (ISIS): califato, territorios, atentados globales",
              "Evalúa consecuencias: restricciones a libertades, islamofobia, inestabilidad en Medio Oriente"
            ]
          },
          {
            "key": "migraciones",
            "name": "Crisis migratorias",
            "short_description": "Refugiados, migrantes, xenofobia, derechos humanos.",
            "example_tasks": [
              "Explica causas de migraciones: guerras, persecución, pobreza, cambio climático",
              "Describe crisis: sirios huyendo de guerra, centroamericanos hacia EUA, africanos hacia Europa",
              "Analiza respuestas: muros, detenciones, campos de refugiados, políticas de asilo restrictivas",
              "Evalúa el debate: derechos humanos vs. soberanía nacional, xenofobia vs. solidaridad"
            ]
          }
        ]
      },
      {
        "key": "metodo_historico",
        "name": "Método histórico",
        "short_description": "Cómo se construye el conocimiento histórico, tipos de fuentes, interpretación.",
        "sub_topics": [
          {
            "key": "fuentes_historicas",
            "name": "Fuentes históricas",
            "short_description": "Primarias y secundarias, análisis crítico.",
            "example_tasks": [
              "Define fuentes primarias: documentos de época (cartas, leyes, periódicos, testimonios, objetos, imágenes)",
              "Explica fuentes secundarias: interpretaciones posteriores (libros de historia, artículos académicos)",
              "Describe el análisis de fuentes: contextualización, identificación de autor, intención, audiencia, sesgos",
              "Ejemplifica con documentos de la historia de México: códices prehispánicos, crónicas de conquista, constituciones"
            ]
          },
          {
            "key": "interpretacion_historica",
            "name": "Interpretación histórica",
            "short_description": "Historiografía, perspectivas múltiples, debate histórico.",
            "example_tasks": [
              "Explica que la historia no es neutral: historiadores interpretan desde su contexto, valores, métodos",
              "Describe diferentes escuelas: positivista, marxista, Annales, historia social, microhistoria",
              "Analiza cómo un mismo evento se interpreta diferente: Conquista como 'encuentro de dos mundos' vs. invasión y genocidio",
              "Evalúa la importancia de múltiples perspectivas: historia oficial vs. historia desde abajo, voces marginadas"
            ]
          },
          {
            "key": "historiografia_mexicana",
            "name": "Historiografía mexicana",
            "short_description": "Corrientes de interpretación de la historia de México.",
            "example_tasks": [
              "Describe la historia patria del siglo XIX: construcción de mitos nacionales, héroes, narrativa liberal",
              "Explica la historiografía post-revolucionaria: énfasis en mestizaje, movimientos populares",
              "Analiza revisiones recientes: crítica a mitos, historia desde perspectivas indígenas, de género, regionales",
              "Evalúa debates actuales: memoria histórica, reparación, resignificación de símbolos"
            ]
          },
          {
            "key": "historia_presente",
            "name": "Historia del tiempo presente",
            "short_description": "Desafíos de estudiar historia reciente.",
            "example_tasks": [
              "Explica peculiaridades: cercanía temporal, protagonistas vivos, pasiones contemporáneas",
              "Describe ventajas: acceso a testimonios directos, archivos digitales, múltiples fuentes",
              "Analiza desafíos: falta de perspectiva, documentos clasificados, memoria vs. historia",
              "Ejemplifica con eventos recientes de México: movimiento estudiantil 1968, transición democrática, guerra contra narco"
            ]
          }
        ]
      }
    ]
  }
]
