[
  {
    "key": "narrativa_cuento_novela",
    "name": "Narrativa: Cuento y Novela",
    "short_description": "Estudio de las formas narrativas breves y extensas, sus características estructurales, elementos constitutivos y tipos según temática y estilo.",
    "sub_topics": [
      {
        "key": "estructura_narrativa",
        "name": "Estructura Narrativa",
        "short_description": "Análisis de las partes fundamentales del relato: planteamiento, nudo, clímax y desenlace.",
        "sub_topics": [
          {
            "key": "planteamiento_exposicion",
            "name": "Planteamiento y Exposición",
            "short_description": "Identificación del inicio de la narración donde se presentan personajes, ambiente y situación inicial.",
            "example_tasks": [
              "Identifica el planteamiento en el cuento 'El principito' de Saint-Exupéry y describe qué personajes y conflictos se presentan",
              "Escribe el planteamiento de un cuento original que ocurra en tu comunidad, presentando al menos dos personajes y el contexto",
              "Compara el planteamiento de 'Macario' de Juan Rulfo con el de 'El hijo' de Horacio Quiroga, señalando similitudes y diferencias"
            ]
          },
          {
            "key": "desarrollo_nudo",
            "name": "Desarrollo y Nudo",
            "short_description": "Análisis del conflicto central y las acciones que incrementan la tensión narrativa.",
            "example_tasks": [
              "Identifica el conflicto principal en 'Diles que no me maten' de Juan Rulfo y explica cómo se desarrolla",
              "Describe tres momentos del nudo en una novela que hayas leído y explica cómo aumenta la tensión",
              "Crea un esquema visual del desarrollo del conflicto en 'El almohadón de plumas' de Horacio Quiroga"
            ]
          },
          {
            "key": "climax_momento_culminante",
            "name": "Clímax: Momento Culminante",
            "short_description": "Identificación del punto de máxima tensión donde se decide el conflicto principal de la narración.",
            "example_tasks": [
              "Localiza el clímax en 'La noche boca arriba' de Julio Cortázar y explica por qué es el momento de mayor tensión",
              "Compara el clímax de dos cuentos mexicanos y analiza las técnicas narrativas empleadas en cada uno",
              "Escribe un párrafo describiendo el clímax de tu cuento favorito y justifica por qué ese es el momento culminante"
            ]
          },
          {
            "key": "desenlace_resolucion",
            "name": "Desenlace y Resolución",
            "short_description": "Análisis del cierre de la narración y la resolución del conflicto planteado.",
            "example_tasks": [
              "Explica cómo se resuelve el conflicto en 'No oyes ladrar los perros' de Juan Rulfo y qué efecto produce en el lector",
              "Compara el desenlace cerrado de un cuento tradicional con el desenlace abierto de un cuento contemporáneo",
              "Propón un desenlace alternativo para 'La migala' de Juan José Arreola y justifica tu elección"
            ]
          }
        ]
      },
      {
        "key": "elementos_narrativos_basicos",
        "name": "Elementos Narrativos Básicos",
        "short_description": "Estudio de los componentes esenciales de la narración: personajes, espacio, tiempo y acción.",
        "sub_topics": [
          {
            "key": "personajes_tipos",
            "name": "Personajes y Tipos",
            "short_description": "Identificación y clasificación de personajes según su función en la narración.",
            "example_tasks": [
              "Identifica el protagonista, antagonista y personajes secundarios en 'Pedro Páramo' de Juan Rulfo",
              "Clasifica los personajes de un cuento en redondos y planos, justificando tu respuesta con ejemplos del texto",
              "Crea una ficha de personaje para el protagonista de una novela que incluya características físicas, psicológicas y su evolución"
            ]
          },
          {
            "key": "espacio_narrativo",
            "name": "Espacio Narrativo",
            "short_description": "Análisis de los lugares físicos y ambientes donde se desarrolla la acción narrativa.",
            "example_tasks": [
              "Describe el espacio en 'Luvina' de Juan Rulfo y explica cómo contribuye al ambiente del relato",
              "Compara el espacio urbano en una novela contemporánea con el espacio rural en un cuento de la Revolución Mexicana",
              "Dibuja un mapa del espacio narrativo de tu novela favorita incluyendo los lugares más importantes"
            ]
          },
          {
            "key": "tiempo_narrativo",
            "name": "Tiempo Narrativo",
            "short_description": "Estudio del manejo temporal en la narración: tiempo cronológico, histórico y psicológico.",
            "example_tasks": [
              "Identifica anacronías (retrospecciones y anticipaciones) en 'Aura' de Carlos Fuentes",
              "Elabora una línea de tiempo con los acontecimientos de 'Crónica de una muerte anunciada' de García Márquez en orden cronológico",
              "Explica la diferencia entre tiempo de la historia y tiempo del relato en un cuento que utilice flashbacks"
            ]
          }
        ]
      },
      {
        "key": "tipos_cuento",
        "name": "Tipos de Cuento",
        "short_description": "Clasificación de los cuentos según su temática: realista, fantástico, policiaco, ciencia ficción, terror.",
        "sub_topics": [
          {
            "key": "cuento_realista",
            "name": "Cuento Realista",
            "short_description": "Análisis de narraciones que presentan situaciones verosímiles y personajes creíbles en contextos cotidianos.",
            "example_tasks": [
              "Lee 'El niño junto al cielo' de Juan Rulfo e identifica tres elementos que lo caracterizan como cuento realista",
              "Compara el tratamiento de la realidad en un cuento realista mexicano con uno latinoamericano",
              "Escribe un cuento realista breve (una página) sobre un conflicto familiar contemporáneo en México"
            ]
          },
          {
            "key": "cuento_fantastico",
            "name": "Cuento Fantástico",
            "short_description": "Estudio de relatos que presentan elementos sobrenaturales o inexplicables que rompen las leyes naturales.",
            "example_tasks": [
              "Identifica los elementos fantásticos en 'La noche boca arriba' de Julio Cortázar y explica su función",
              "Analiza cómo se crea la ambigüedad entre lo real y lo fantástico en 'Tlactocatzine, del jardín de Flandes' de Carlos Fuentes",
              "Escribe el inicio de un cuento fantástico donde un objeto cotidiano adquiere propiedades mágicas"
            ]
          },
          {
            "key": "cuento_policiaco_terror",
            "name": "Cuento Policiaco y de Terror",
            "short_description": "Análisis de narraciones de suspenso, misterio e investigación, así como relatos que provocan miedo.",
            "example_tasks": [
              "Identifica los elementos del género policiaco en un cuento de detectives y describe el proceso de investigación",
              "Analiza los recursos narrativos que crean terror en 'El almohadón de plumas' de Horacio Quiroga",
              "Compara la estructura de un cuento policiaco clásico con una narración policiaca contemporánea mexicana"
            ]
          }
        ]
      },
      {
        "key": "caracteristicas_novela",
        "name": "Características de la Novela",
        "short_description": "Estudio de la forma narrativa extensa: estructura compleja, múltiples tramas, desarrollo amplio de personajes.",
        "sub_topics": [
          {
            "key": "extension_complejidad",
            "name": "Extensión y Complejidad Narrativa",
            "short_description": "Análisis de la estructura amplia de la novela que permite desarrollar múltiples historias y personajes.",
            "example_tasks": [
              "Identifica las tramas principales y secundarias en una novela juvenil que hayas leído",
              "Compara la extensión y complejidad de un cuento con la de una novela corta, señalando diferencias estructurales",
              "Elabora un esquema de la estructura de capítulos de 'Pedro Páramo' de Juan Rulfo"
            ]
          },
          {
            "key": "tipos_novela",
            "name": "Tipos de Novela",
            "short_description": "Clasificación de novelas según temática: histórica, aventuras, formación, ciencia ficción, realista.",
            "example_tasks": [
              "Identifica las características de la novela histórica en 'Noticias del Imperio' de Fernando del Paso",
              "Lee una novela de formación juvenil y describe el proceso de maduración del protagonista",
              "Compara una novela de aventuras clásica con una contemporánea, identificando elementos comunes y diferencias"
            ]
          },
          {
            "key": "novela_mexicana_representativa",
            "name": "Novela Mexicana Representativa",
            "short_description": "Lectura y análisis de obras fundamentales de la narrativa mexicana del siglo XX.",
            "example_tasks": [
              "Analiza los temas principales de 'Pedro Páramo' de Juan Rulfo: muerte, soledad, caciquismo",
              "Describe la técnica narrativa fragmentada en 'La región más transparente' de Carlos Fuentes",
              "Investiga el contexto histórico de 'Los de abajo' de Mariano Azuela y explica cómo se refleja en la novela"
            ]
          }
        ]
      },
      {
        "key": "tecnicas_narrativas",
        "name": "Técnicas Narrativas",
        "short_description": "Estudio de los recursos técnicos empleados por los narradores para construir el relato.",
        "sub_topics": [
          {
            "key": "punto_vista_narrativo",
            "name": "Punto de Vista Narrativo",
            "short_description": "Análisis de la perspectiva desde la cual se cuenta la historia: primera, segunda o tercera persona.",
            "example_tasks": [
              "Identifica el tipo de narrador en tres cuentos diferentes y explica cómo afecta a la historia",
              "Reescribe un párrafo de un cuento cambiando el punto de vista narrativo de primera a tercera persona",
              "Analiza las ventajas del narrador en primera persona en 'Aura' de Carlos Fuentes"
            ]
          },
          {
            "key": "dialogos_monologos",
            "name": "Diálogos y Monólogos",
            "short_description": "Estudio de las formas de representar el habla de los personajes en la narración.",
            "example_tasks": [
              "Identifica ejemplos de diálogo directo e indirecto en un cuento y explica la diferencia",
              "Analiza el uso del monólogo interior en 'El llano en llamas' de Juan Rulfo",
              "Escribe un diálogo entre dos personajes que revele sus personalidades sin descripciones explícitas"
            ]
          },
          {
            "key": "descripciones_narrativas",
            "name": "Descripciones Narrativas",
            "short_description": "Análisis de las técnicas descriptivas de personajes, ambientes y objetos en la narración.",
            "example_tasks": [
              "Identifica una descripción física y una psicológica de personajes en una novela",
              "Analiza cómo la descripción del ambiente crea atmósfera en 'Luvina' de Juan Rulfo",
              "Escribe una descripción sensorial (vista, oído, olfato) de un lugar de tu comunidad"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "poesia",
    "name": "Poesía",
    "short_description": "Estudio del género lírico: formas poéticas, métrica, rima, recursos literarios y análisis de poesía mexicana y universal.",
    "sub_topics": [
      {
        "key": "elementos_poesia",
        "name": "Elementos de la Poesía",
        "short_description": "Análisis de los componentes fundamentales del texto poético: verso, estrofa, métrica y rima.",
        "sub_topics": [
          {
            "key": "verso_estrofa",
            "name": "Verso y Estrofa",
            "short_description": "Identificación de las unidades básicas del poema y sus tipos de organización.",
            "example_tasks": [
              "Cuenta los versos y estrofas en 'Muerte sin fin' de José Gorostiza e identifica su estructura",
              "Identifica ejemplos de cuartetos, tercetos y sonetos en poemas mexicanos del siglo XX",
              "Escribe una estrofa de cuatro versos sobre la naturaleza siguiendo un esquema de rima específico"
            ]
          },
          {
            "key": "metrica_silabas",
            "name": "Métrica y Conteo Silábico",
            "short_description": "Estudio del ritmo poético mediante el conteo de sílabas métricas y las reglas de acentuación.",
            "example_tasks": [
              "Realiza el conteo silábico de un soneto de Sor Juana Inés de la Cruz aplicando sinalefa y las reglas de acentuación",
              "Identifica versos octosílabos en un corrido mexicano y explica su importancia en este género",
              "Clasifica versos según su medida: arte menor (menos de 9 sílabas) y arte mayor (9 o más sílabas)"
            ]
          },
          {
            "key": "rima_tipos",
            "name": "Rima y sus Tipos",
            "short_description": "Análisis de la repetición de sonidos al final de los versos: rima consonante, asonante y verso libre.",
            "example_tasks": [
              "Identifica el esquema de rima en un soneto de Amado Nervo (ABBA ABBA CDC DCD)",
              "Diferencia entre rima consonante y asonante en poemas de Ramón López Velarde",
              "Escribe un poema de cuatro versos con rima consonante y otro con rima asonante"
            ]
          },
          {
            "key": "ritmo_musicalidad",
            "name": "Ritmo y Musicalidad",
            "short_description": "Estudio de la cadencia y armonía del poema creada por la métrica, rima y repeticiones.",
            "example_tasks": [
              "Analiza el ritmo en 'Suave Patria' de Ramón López Velarde identificando repeticiones y aliteraciones",
              "Lee en voz alta un poema marcando las sílabas tónicas para identificar su ritmo",
              "Compara el ritmo regular de un soneto clásico con el ritmo libre de un poema vanguardista"
            ]
          }
        ]
      },
      {
        "key": "figuras_retoricas_poesia",
        "name": "Figuras Retóricas en Poesía",
        "short_description": "Identificación y análisis de recursos estilísticos que embellecen y dan expresividad al lenguaje poético.",
        "sub_topics": [
          {
            "key": "metafora_comparacion",
            "name": "Metáfora y Comparación",
            "short_description": "Estudio de la relación de semejanza entre dos elementos: comparación explícita y metáfora implícita.",
            "example_tasks": [
              "Identifica cinco metáforas en 'Nocturno a Rosario' de Manuel Acuña y explica su significado",
              "Diferencia entre comparación y metáfora en poemas de Octavio Paz",
              "Crea tres metáforas originales sobre el amor, la naturaleza y el tiempo"
            ]
          },
          {
            "key": "personificacion_hiperbole",
            "name": "Personificación e Hipérbole",
            "short_description": "Análisis de la atribución de cualidades humanas a objetos y la exageración expresiva.",
            "example_tasks": [
              "Localiza ejemplos de personificación en 'Primavera' de Sor Juana Inés de la Cruz",
              "Identifica hipérboles en poemas de amor del Modernismo mexicano",
              "Escribe un poema breve personificando elementos de la naturaleza de tu región"
            ]
          },
          {
            "key": "imagenes_sensoriales",
            "name": "Imágenes Sensoriales",
            "short_description": "Identificación de descripciones que apelan a los cinco sentidos en el texto poético.",
            "example_tasks": [
              "Clasifica las imágenes sensoriales en un poema de José Juan Tablada según el sentido al que apelan",
              "Analiza las imágenes visuales y auditivas en 'Piedra de sol' de Octavio Paz",
              "Escribe un haiku que incluya al menos dos tipos de imágenes sensoriales"
            ]
          },
          {
            "key": "simbolos_alegoria",
            "name": "Símbolos y Alegoría",
            "short_description": "Estudio de elementos que representan conceptos abstractos y narraciones con significado figurado.",
            "example_tasks": [
              "Interpreta el simbolismo de la muerte en poemas de Xavier Villaurrutia",
              "Analiza el uso de símbolos nacionales en 'Suave Patria' de Ramón López Velarde",
              "Identifica la alegoría en un poema y explica su significado profundo"
            ]
          }
        ]
      },
      {
        "key": "formas_poeticas",
        "name": "Formas Poéticas",
        "short_description": "Estudio de las estructuras tradicionales y contemporáneas de la poesía: soneto, romance, haiku, verso libre.",
        "sub_topics": [
          {
            "key": "soneto",
            "name": "Soneto",
            "short_description": "Análisis de la forma clásica de 14 versos endecasílabos distribuidos en dos cuartetos y dos tercetos.",
            "example_tasks": [
              "Identifica la estructura del soneto en 'Este que ves, engaño colorido' de Sor Juana Inés de la Cruz",
              "Analiza el tema y la estructura de un soneto de Amado Nervo",
              "Escribe un cuarteto de un soneto sobre un tema de tu elección manteniendo métrica y rima"
            ]
          },
          {
            "key": "romance_corrido",
            "name": "Romance y Corrido",
            "short_description": "Estudio de formas narrativas en verso: romance español y corrido mexicano.",
            "example_tasks": [
              "Identifica las características del romance en versos octosílabos con rima asonante en versos pares",
              "Analiza la estructura narrativa de 'La Adelita' u otro corrido de la Revolución Mexicana",
              "Investiga el origen del corrido mexicano y compáralo con el romance español tradicional"
            ]
          },
          {
            "key": "haiku_poesia_breve",
            "name": "Haiku y Poesía Breve",
            "short_description": "Estudio de formas poéticas concisas: haiku japonés y su adaptación en México por José Juan Tablada.",
            "example_tasks": [
              "Analiza haikus de José Juan Tablada identificando la estructura de 5-7-5 sílabas",
              "Escribe tres haikus sobre la naturaleza siguiendo la estructura tradicional",
              "Compara el haiku japonés con adaptaciones mexicanas contemporáneas"
            ]
          },
          {
            "key": "verso_libre",
            "name": "Verso Libre",
            "short_description": "Análisis de la poesía moderna sin métrica ni rima fijas, enfocada en el ritmo interno y las imágenes.",
            "example_tasks": [
              "Identifica las características del verso libre en poemas de Octavio Paz",
              "Compara un soneto clásico con un poema en verso libre señalando diferencias formales",
              "Escribe un poema en verso libre sobre la ciudad de México utilizando imágenes urbanas"
            ]
          }
        ]
      },
      {
        "key": "temas_poesia",
        "name": "Temas en la Poesía",
        "short_description": "Análisis de los temas recurrentes en la lírica: amor, muerte, naturaleza, identidad, sociedad.",
        "sub_topics": [
          {
            "key": "poesia_amor",
            "name": "Poesía de Amor",
            "short_description": "Estudio de la expresión lírica del sentimiento amoroso en sus diversas manifestaciones.",
            "example_tasks": [
              "Analiza el tratamiento del amor en 'Nocturno a Rosario' de Manuel Acuña",
              "Compara la visión del amor en un poema romántico con uno contemporáneo",
              "Identifica figuras retóricas utilizadas para expresar el amor en poemas de Sor Juana Inés de la Cruz"
            ]
          },
          {
            "key": "poesia_muerte",
            "name": "Poesía de la Muerte",
            "short_description": "Análisis de la reflexión poética sobre la muerte, especialmente en la tradición mexicana.",
            "example_tasks": [
              "Analiza el tema de la muerte en 'Nostalgia de la muerte' de Xavier Villaurrutia",
              "Compara la visión de la muerte en la poesía prehispánica náhuatl con la poesía mexicana contemporánea",
              "Identifica símbolos asociados a la muerte en poemas de José Gorostiza"
            ]
          },
          {
            "key": "poesia_naturaleza",
            "name": "Poesía de la Naturaleza",
            "short_description": "Estudio de la representación lírica del paisaje, elementos naturales y su simbolismo.",
            "example_tasks": [
              "Analiza la descripción de la naturaleza en poemas de Amado Nervo",
              "Identifica imágenes naturales en haikus de José Juan Tablada y su significado",
              "Escribe un poema sobre un elemento de la naturaleza mexicana utilizando personificación"
            ]
          },
          {
            "key": "poesia_identidad_patria",
            "name": "Poesía de Identidad y Patria",
            "short_description": "Análisis de poemas que exploran la identidad nacional, el amor a la patria y temas sociales.",
            "example_tasks": [
              "Analiza los símbolos nacionales en 'Suave Patria' de Ramón López Velarde",
              "Compara la visión de México en poemas de Octavio Paz con los de poetas contemporáneos",
              "Investiga el contexto histórico de poemas patrióticos de la Independencia o la Revolución"
            ]
          }
        ]
      },
      {
        "key": "poesia_mexicana",
        "name": "Poesía Mexicana",
        "short_description": "Estudio de autores y movimientos fundamentales de la lírica mexicana desde la época colonial hasta la actualidad.",
        "sub_topics": [
          {
            "key": "sor_juana_ines_cruz",
            "name": "Sor Juana Inés de la Cruz",
            "short_description": "Análisis de la obra de la poetisa novohispana más importante del Siglo de Oro mexicano.",
            "example_tasks": [
              "Analiza 'Hombres necios que acusáis' de Sor Juana identificando la crítica social",
              "Estudia la estructura de un soneto de Sor Juana y sus recursos barrocos",
              "Investiga el contexto biográfico de Sor Juana y cómo influyó en su poesía"
            ]
          },
          {
            "key": "modernismo_mexicano",
            "name": "Modernismo Mexicano",
            "short_description": "Estudio del movimiento modernista en México: Manuel Gutiérrez Nájera, Amado Nervo.",
            "example_tasks": [
              "Identifica características modernistas (musicalidad, exotismo, símbolos) en poemas de Amado Nervo",
              "Analiza el uso del color y las imágenes en poesía de Manuel Gutiérrez Nájera",
              "Compara el Modernismo mexicano con el hispanoamericano de Rubén Darío"
            ]
          },
          {
            "key": "vanguardia_contemporaneos",
            "name": "Vanguardia y Contemporáneos",
            "short_description": "Análisis del grupo Contemporáneos: Xavier Villaurrutia, José Gorostiza, Carlos Pellicer.",
            "example_tasks": [
              "Analiza la experimentación formal en poemas de Xavier Villaurrutia",
              "Estudia el hermetismo poético en 'Muerte sin fin' de José Gorostiza",
              "Identifica influencias vanguardistas europeas en poetas mexicanos de los años 20-30"
            ]
          },
          {
            "key": "octavio_paz",
            "name": "Octavio Paz y la Poesía Contemporánea",
            "short_description": "Estudio de la obra del premio Nobel mexicano y otros poetas contemporáneos.",
            "example_tasks": [
              "Analiza el tema del tiempo y la identidad en 'Piedra de sol' de Octavio Paz",
              "Identifica recursos surrealistas en la poesía de Paz",
              "Lee poemas de poetas mexicanos contemporáneos (Coral Bracho, David Huerta) y compáralos con la tradición"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "teatro_drama",
    "name": "Teatro y Drama",
    "short_description": "Estudio del género dramático: estructura teatral, elementos de la representación, diálogo dramático y teatro mexicano.",
    "sub_topics": [
      {
        "key": "elementos_texto_dramatico",
        "name": "Elementos del Texto Dramático",
        "short_description": "Análisis de los componentes fundamentales de la obra teatral: diálogo, acotaciones, personajes.",
        "sub_topics": [
          {
            "key": "dialogo_dramatico",
            "name": "Diálogo Dramático",
            "short_description": "Estudio de la conversación entre personajes como forma principal de desarrollar la acción teatral.",
            "example_tasks": [
              "Identifica los diálogos principales en un fragmento de 'Corona de sombra' de Rodolfo Usigli",
              "Analiza cómo el diálogo revela el carácter de los personajes en una obra mexicana",
              "Escribe un diálogo breve entre dos personajes que refleje un conflicto cotidiano"
            ]
          },
          {
            "key": "acotaciones_escenograficas",
            "name": "Acotaciones y Didascalias",
            "short_description": "Análisis de las indicaciones del autor sobre escenografía, movimientos y acciones de los personajes.",
            "example_tasks": [
              "Identifica las acotaciones en un fragmento teatral y explica su función",
              "Diseña la escenografía de una escena basándote en las acotaciones del autor",
              "Compara las acotaciones detalladas del teatro realista con las mínimas del teatro contemporáneo"
            ]
          },
          {
            "key": "conflicto_dramatico",
            "name": "Conflicto Dramático",
            "short_description": "Identificación del enfrentamiento de fuerzas opuestas que genera la tensión teatral.",
            "example_tasks": [
              "Identifica el conflicto principal en 'Los signos del zodiaco' de Sergio Magaña",
              "Analiza cómo se desarrolla y resuelve el conflicto en una obra de un acto",
              "Clasifica el conflicto de una obra como externo (personaje vs. personaje) o interno (personaje consigo mismo)"
            ]
          },
          {
            "key": "personajes_dramaticos",
            "name": "Personajes Dramáticos",
            "short_description": "Estudio de los caracteres teatrales y su revelación a través del diálogo y las acciones.",
            "example_tasks": [
              "Elabora una caracterización de los personajes principales de 'El gesticulador' de Rodolfo Usigli",
              "Analiza cómo se revelan las motivaciones de un personaje a través de sus diálogos y acciones",
              "Compara el protagonista y antagonista de una obra identificando sus conflictos"
            ]
          }
        ]
      },
      {
        "key": "estructura_obra_teatral",
        "name": "Estructura de la Obra Teatral",
        "short_description": "Análisis de la organización en actos, cuadros y escenas, y el desarrollo dramático.",
        "sub_topics": [
          {
            "key": "actos_cuadros_escenas",
            "name": "Actos, Cuadros y Escenas",
            "short_description": "Identificación de las divisiones estructurales de la obra teatral.",
            "example_tasks": [
              "Identifica los actos y escenas en una obra de teatro clásica",
              "Explica la función de cada acto en la estructura de 'Corona de luz' de Rodolfo Usigli",
              "Compara la estructura de una obra en tres actos con una obra contemporánea sin divisiones"
            ]
          },
          {
            "key": "exposicion_desarrollo_desenlace",
            "name": "Exposición, Desarrollo y Desenlace",
            "short_description": "Análisis de la estructura dramática clásica: presentación, nudo y resolución del conflicto.",
            "example_tasks": [
              "Identifica las tres partes de la estructura dramática en una obra mexicana",
              "Analiza el clímax de 'El gesticulador' y explica cómo se resuelve el conflicto",
              "Compara el desenlace trágico de una obra con el desenlace cómico de otra"
            ]
          },
          {
            "key": "unidades_dramaticas",
            "name": "Unidades Dramáticas Clásicas",
            "short_description": "Estudio de las unidades de acción, tiempo y lugar en el teatro clásico.",
            "example_tasks": [
              "Identifica si una obra respeta las tres unidades aristotélicas",
              "Analiza cómo el teatro contemporáneo rompe con las unidades clásicas",
              "Compara una obra que respeta la unidad de tiempo con una que abarca varios periodos"
            ]
          }
        ]
      },
      {
        "key": "generos_dramaticos",
        "name": "Géneros Dramáticos",
        "short_description": "Clasificación de las obras teatrales: tragedia, comedia, drama, tragicomedia.",
        "sub_topics": [
          {
            "key": "tragedia",
            "name": "Tragedia",
            "short_description": "Estudio de obras con final funesto que presentan conflictos humanos profundos y destino inexorable.",
            "example_tasks": [
              "Identifica elementos trágicos en 'Corona de sombra' de Rodolfo Usigli",
              "Analiza el concepto de destino trágico en una obra clásica",
              "Compara una tragedia griega con una tragedia moderna mexicana"
            ]
          },
          {
            "key": "comedia",
            "name": "Comedia",
            "short_description": "Análisis de obras que presentan situaciones cómicas, crítica social con humor y final feliz.",
            "example_tasks": [
              "Identifica recursos humorísticos en comedias de Emilio Carballido",
              "Analiza la crítica social en una comedia mexicana contemporánea",
              "Compara el humor en una comedia de enredos con el de una comedia de caracteres"
            ]
          },
          {
            "key": "drama",
            "name": "Drama",
            "short_description": "Estudio de obras que mezclan elementos trágicos y cómicos presentando conflictos realistas.",
            "example_tasks": [
              "Analiza la mezcla de elementos serios y ligeros en 'El gesticulador' de Rodolfo Usigli",
              "Identifica los conflictos sociales en un drama mexicano contemporáneo",
              "Compara el tratamiento de temas sociales en el drama con el de la tragedia"
            ]
          },
          {
            "key": "teatro_experimental",
            "name": "Teatro Experimental y Contemporáneo",
            "short_description": "Análisis de formas teatrales innovadoras que rompen con las convenciones tradicionales.",
            "example_tasks": [
              "Identifica técnicas experimentales en obras de teatro mexicano contemporáneo",
              "Analiza el uso de elementos no tradicionales (multimedia, participación del público) en una obra actual",
              "Investiga el teatro del absurdo y compáralo con el teatro realista mexicano"
            ]
          }
        ]
      },
      {
        "key": "representacion_teatral",
        "name": "Representación Teatral",
        "short_description": "Estudio de los elementos de la puesta en escena: actuación, escenografía, vestuario, iluminación.",
        "sub_topics": [
          {
            "key": "escenografia_espacio",
            "name": "Escenografía y Espacio Escénico",
            "short_description": "Análisis del diseño del espacio donde se desarrolla la acción y su significado.",
            "example_tasks": [
              "Diseña una propuesta de escenografía para una escena específica de una obra",
              "Analiza cómo el espacio escénico refleja el ambiente y época en una obra de teatro histórico",
              "Compara la escenografía realista con la minimalista en diferentes producciones"
            ]
          },
          {
            "key": "actuacion_interpretacion",
            "name": "Actuación e Interpretación",
            "short_description": "Estudio del trabajo del actor para dar vida al personaje mediante voz, gestos y movimiento.",
            "example_tasks": [
              "Analiza cómo las acotaciones guían la interpretación del actor",
              "Interpreta un monólogo breve de una obra mexicana prestando atención a entonación y gestos",
              "Compara diferentes estilos de actuación: naturalista, expresionista, gestual"
            ]
          },
          {
            "key": "vestuario_caracterizacion",
            "name": "Vestuario y Caracterización",
            "short_description": "Análisis del diseño de vestuario y maquillaje para crear la apariencia de los personajes.",
            "example_tasks": [
              "Diseña el vestuario de un personaje basándote en su caracterización y época histórica",
              "Analiza cómo el vestuario ayuda a identificar la clase social o personalidad de los personajes",
              "Investiga el vestuario tradicional mexicano usado en obras de teatro folklórico"
            ]
          },
          {
            "key": "iluminacion_sonido",
            "name": "Iluminación y Sonido",
            "short_description": "Estudio del uso de luz y efectos sonoros para crear atmósfera y dirigir la atención.",
            "example_tasks": [
              "Propón un diseño de iluminación para una escena dramática específica",
              "Analiza cómo la música y efectos de sonido crean atmósfera en una obra",
              "Explica la función de la iluminación para indicar cambios de tiempo o lugar"
            ]
          }
        ]
      },
      {
        "key": "teatro_mexicano",
        "name": "Teatro Mexicano",
        "short_description": "Estudio de autores y obras fundamentales del teatro mexicano desde la colonia hasta la actualidad.",
        "sub_topics": [
          {
            "key": "teatro_colonial",
            "name": "Teatro Colonial y del Siglo XIX",
            "short_description": "Análisis del teatro evangelizador novohispano y el teatro romántico y costumbrista mexicano.",
            "example_tasks": [
              "Investiga las características del teatro misionero en la Nueva España",
              "Analiza una obra costumbrista del siglo XIX mexicano identificando elementos de crítica social",
              "Compara el teatro religioso colonial con el teatro secular del México independiente"
            ]
          },
          {
            "key": "rodolfo_usigli",
            "name": "Rodolfo Usigli",
            "short_description": "Estudio del padre del teatro mexicano moderno y sus obras históricas y políticas.",
            "example_tasks": [
              "Analiza el tema de la identidad nacional en 'El gesticulador' de Rodolfo Usigli",
              "Estudia la trilogía de Coronas: 'Corona de sombra', 'Corona de fuego', 'Corona de luz'",
              "Investiga el contexto histórico de Maximiliano y Carlota en 'Corona de sombra'"
            ]
          },
          {
            "key": "emilio_carballido",
            "name": "Emilio Carballido y Teatro Contemporáneo",
            "short_description": "Análisis de obras del dramaturgo veracruzano y otros autores mexicanos contemporáneos.",
            "example_tasks": [
              "Analiza los personajes femeninos en 'Las flores del durazno' de Emilio Carballido",
              "Identifica elementos realistas y fantásticos en obras de Carballido",
              "Lee una obra de teatro mexicano contemporáneo (Hugo Argüelles, Vicente Leñero) y analiza su temática"
            ]
          },
          {
            "key": "teatro_experimental_mexicano",
            "name": "Teatro Experimental Mexicano",
            "short_description": "Estudio de corrientes innovadoras en el teatro mexicano: teatro campesino, teatro callejero.",
            "example_tasks": [
              "Investiga el movimiento de teatro comunitario en México",
              "Analiza una obra de teatro experimental mexicano identificando técnicas no convencionales",
              "Compara el teatro comercial con el teatro independiente en México"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "ensayo_literatura_no_ficcion",
    "name": "Ensayo y Literatura de No Ficción",
    "short_description": "Estudio del género ensayístico y otras formas de no ficción: tipos de ensayo, estructura argumentativa, crónica y biografía.",
    "sub_topics": [
      {
        "key": "caracteristicas_ensayo",
        "name": "Características del Ensayo",
        "short_description": "Análisis del ensayo como género de opinión fundamentada que combina rigor intelectual y estilo personal.",
        "sub_topics": [
          {
            "key": "subjetividad_reflexion",
            "name": "Subjetividad y Reflexión Personal",
            "short_description": "Estudio de la perspectiva personal del autor y su reflexión crítica sobre un tema.",
            "example_tasks": [
              "Identifica marcas de subjetividad (opiniones, juicios) en un ensayo de Octavio Paz",
              "Analiza cómo el autor de un ensayo presenta su punto de vista personal",
              "Escribe un párrafo de ensayo expresando tu opinión sobre un problema social actual"
            ]
          },
          {
            "key": "estructura_ensayo",
            "name": "Estructura del Ensayo",
            "short_description": "Análisis de la organización típica: introducción, desarrollo argumentativo y conclusión.",
            "example_tasks": [
              "Identifica las tres partes del ensayo en 'El laberinto de la soledad' de Octavio Paz",
              "Elabora un esquema de la estructura argumentativa de un ensayo breve",
              "Escribe la introducción de un ensayo sobre un tema literario presentando la tesis principal"
            ]
          },
          {
            "key": "estilo_ensayistico",
            "name": "Estilo Ensayístico",
            "short_description": "Estudio del lenguaje del ensayo: claridad, precisión, uso de recursos retóricos y tono.",
            "example_tasks": [
              "Analiza el estilo personal de Alfonso Reyes en sus ensayos literarios",
              "Identifica recursos retóricos (metáforas, comparaciones) en un ensayo de José Vasconcelos",
              "Compara el tono formal de un ensayo académico con el tono personal de un ensayo literario"
            ]
          }
        ]
      },
      {
        "key": "tipos_ensayo",
        "name": "Tipos de Ensayo",
        "short_description": "Clasificación del ensayo según su propósito: argumentativo, expositivo, descriptivo, crítico.",
        "sub_topics": [
          {
            "key": "ensayo_argumentativo",
            "name": "Ensayo Argumentativo",
            "short_description": "Análisis de textos que defienden una tesis mediante argumentos lógicos y evidencias.",
            "example_tasks": [
              "Identifica la tesis y los argumentos principales en un ensayo argumentativo sobre educación",
              "Evalúa la solidez de los argumentos presentados en un ensayo de opinión",
              "Escribe un ensayo breve argumentando a favor o en contra de la lectura digital vs. impresa"
            ]
          },
          {
            "key": "ensayo_expositivo",
            "name": "Ensayo Expositivo",
            "short_description": "Estudio de textos que explican o informan sobre un tema sin necesariamente argumentar una postura.",
            "example_tasks": [
              "Identifica las características expositivas en un ensayo sobre historia de México",
              "Analiza cómo se organiza la información en un ensayo divulgativo científico",
              "Escribe un ensayo expositivo breve explicando un movimiento literario mexicano"
            ]
          },
          {
            "key": "ensayo_critico_literario",
            "name": "Ensayo Crítico Literario",
            "short_description": "Análisis de textos que interpretan y valoran obras literarias.",
            "example_tasks": [
              "Lee un ensayo de Alfonso Reyes sobre literatura mexicana y analiza su enfoque crítico",
              "Identifica los criterios de valoración literaria en una reseña crítica",
              "Escribe un ensayo breve analizando un poema de Octavio Paz"
            ]
          },
          {
            "key": "ensayo_filosofico_social",
            "name": "Ensayo Filosófico y Social",
            "short_description": "Estudio de reflexiones sobre temas filosóficos, éticos, políticos o sociales.",
            "example_tasks": [
              "Analiza las ideas principales sobre identidad mexicana en 'El laberinto de la soledad' de Octavio Paz",
              "Identifica argumentos filosóficos en ensayos de José Vasconcelos sobre educación",
              "Compara las visiones de México en ensayos de diferentes autores mexicanos"
            ]
          }
        ]
      },
      {
        "key": "estructura_argumentativa",
        "name": "Estructura Argumentativa",
        "short_description": "Estudio de los elementos que componen la argumentación: tesis, argumentos, evidencias, contraargumentos.",
        "sub_topics": [
          {
            "key": "tesis_postura",
            "name": "Tesis y Postura",
            "short_description": "Identificación de la idea central que el autor defiende en el ensayo.",
            "example_tasks": [
              "Identifica la tesis principal en la introducción de un ensayo argumentativo",
              "Reformula la tesis de un ensayo con tus propias palabras",
              "Escribe tres posibles tesis sobre un tema controversial para desarrollar en un ensayo"
            ]
          },
          {
            "key": "argumentos_evidencias",
            "name": "Argumentos y Evidencias",
            "short_description": "Análisis de las razones y pruebas que sustentan la tesis del ensayo.",
            "example_tasks": [
              "Clasifica los tipos de argumentos usados en un ensayo: lógicos, de autoridad, ejemplos",
              "Evalúa si las evidencias presentadas son suficientes y pertinentes para apoyar la tesis",
              "Proporciona tres evidencias diferentes (datos, ejemplos, citas) para apoyar una tesis sobre lectura juvenil"
            ]
          },
          {
            "key": "contraargumentos_refutacion",
            "name": "Contraargumentos y Refutación",
            "short_description": "Estudio de cómo el ensayista anticipa objeciones y las responde.",
            "example_tasks": [
              "Identifica contraargumentos considerados y refutados en un ensayo",
              "Propón un posible contraargumento a la tesis de un ensayo y cómo podría refutarse",
              "Analiza la efectividad de la refutación en un debate escrito sobre un tema actual"
            ]
          }
        ]
      },
      {
        "key": "cronica",
        "name": "Crónica",
        "short_description": "Estudio del género periodístico-literario que narra acontecimientos reales con estilo personal.",
        "sub_topics": [
          {
            "key": "cronica_historica",
            "name": "Crónica Histórica",
            "short_description": "Análisis de relatos testimoniales de hechos históricos: crónicas de Indias, crónicas de la Conquista.",
            "example_tasks": [
              "Lee fragmentos de 'Historia verdadera de la conquista de la Nueva España' de Bernal Díaz del Castillo",
              "Analiza el punto de vista del cronista en relatos de la Conquista de México",
              "Compara la crónica española de la Conquista con la visión indígena en el Códice Florentino"
            ]
          },
          {
            "key": "cronica_periodistica",
            "name": "Crónica Periodística",
            "short_description": "Estudio de la crónica contemporánea que combina información con narración y estilo literario.",
            "example_tasks": [
              "Identifica elementos narrativos y periodísticos en una crónica de Elena Poniatowska",
              "Analiza el estilo personal del cronista en relatos sobre acontecimientos actuales",
              "Escribe una crónica breve sobre un evento de tu comunidad combinando hechos y descripciones"
            ]
          },
          {
            "key": "caracteristicas_cronica",
            "name": "Características de la Crónica",
            "short_description": "Análisis de elementos distintivos: veracidad, testimonio, narración cronológica, estilo personal.",
            "example_tasks": [
              "Compara una crónica con una noticia identificando diferencias de estilo y enfoque",
              "Identifica marcas de subjetividad en la crónica de un autor mexicano contemporáneo",
              "Analiza cómo el cronista organiza temporalmente los acontecimientos narrados"
            ]
          }
        ]
      },
      {
        "key": "biografia_autobiografia",
        "name": "Biografía y Autobiografía",
        "short_description": "Estudio de géneros que narran la vida de personas reales: biografía (tercera persona) y autobiografía (primera persona).",
        "sub_topics": [
          {
            "key": "biografia",
            "name": "Biografía",
            "short_description": "Análisis de relatos de vidas ajenas que combinan investigación histórica y narración.",
            "example_tasks": [
              "Lee una biografía de un autor mexicano y analiza cómo su vida influyó en su obra",
              "Identifica las fuentes de información usadas en una biografía histórica",
              "Investiga y escribe una biografía breve de un escritor mexicano del siglo XX"
            ]
          },
          {
            "key": "autobiografia_memorias",
            "name": "Autobiografía y Memorias",
            "short_description": "Estudio de relatos en primera persona donde el autor narra su propia vida.",
            "example_tasks": [
              "Analiza fragmentos de 'La noche de Tlatelolco' de Elena Poniatowska como testimonio autobiográfico colectivo",
              "Compara el tono y perspectiva de una autobiografía con una biografía del mismo personaje",
              "Escribe un fragmento autobiográfico narrando un episodio significativo de tu vida escolar"
            ]
          },
          {
            "key": "diario_epistola",
            "name": "Diario y Epístola",
            "short_description": "Análisis de formas íntimas de escritura: diarios personales y cartas.",
            "example_tasks": [
              "Lee fragmentos del diario de Frida Kahlo y analiza su valor como documento personal",
              "Compara el estilo de una carta personal con el de una carta formal o abierta",
              "Escribe una entrada de diario reflexionando sobre un libro que hayas leído recientemente"
            ]
          }
        ]
      },
      {
        "key": "ensayistas_mexicanos",
        "name": "Ensayistas Mexicanos",
        "short_description": "Estudio de autores fundamentales del ensayo mexicano y sus contribuciones al pensamiento nacional.",
        "sub_topics": [
          {
            "key": "octavio_paz_ensayista",
            "name": "Octavio Paz",
            "short_description": "Análisis de ensayos sobre identidad mexicana, literatura y arte del premio Nobel.",
            "example_tasks": [
              "Lee capítulos de 'El laberinto de la soledad' y analiza la visión de Paz sobre el mexicano",
              "Identifica temas recurrentes en los ensayos de Paz: soledad, identidad, máscaras",
              "Analiza el estilo ensayístico de Paz: uso de metáforas, referencias culturales, estructura"
            ]
          },
          {
            "key": "alfonso_reyes",
            "name": "Alfonso Reyes",
            "short_description": "Estudio del humanista mexicano y sus ensayos sobre literatura y cultura universal.",
            "example_tasks": [
              "Lee un ensayo de Alfonso Reyes sobre teoría literaria o literatura clásica",
              "Analiza la erudición y el estilo elegante en la prosa ensayística de Reyes",
              "Investiga las contribuciones de Alfonso Reyes a la crítica literaria en México"
            ]
          },
          {
            "key": "jose_vasconcelos",
            "name": "José Vasconcelos",
            "short_description": "Análisis de ensayos sobre educación, filosofía y la raza cósmica.",
            "example_tasks": [
              "Lee fragmentos de 'La raza cósmica' y analiza las ideas de Vasconcelos sobre mestizaje",
              "Investiga el papel de Vasconcelos como Secretario de Educación y su visión educativa",
              "Compara las ideas filosóficas de Vasconcelos con las de otros pensadores mexicanos"
            ]
          },
          {
            "key": "ensayistas_contemporaneos",
            "name": "Ensayistas Contemporáneos",
            "short_description": "Lectura de ensayos actuales sobre cultura, sociedad y literatura en México.",
            "example_tasks": [
              "Lee un ensayo de Carlos Monsiváis sobre cultura popular mexicana",
              "Analiza la crítica social en ensayos de Elena Poniatowska",
              "Investiga ensayistas mexicanos contemporáneos y sus temas principales"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "tradicion_oral_literatura_popular",
    "name": "Tradición Oral y Literatura Popular",
    "short_description": "Estudio de expresiones literarias transmitidas oralmente: leyendas, mitos, corridos, refranes y su importancia cultural.",
    "sub_topics": [
      {
        "key": "caracteristicas_tradicion_oral",
        "name": "Características de la Tradición Oral",
        "short_description": "Análisis de la literatura transmitida de generación en generación sin registro escrito original.",
        "sub_topics": [
          {
            "key": "transmision_oral",
            "name": "Transmisión Oral",
            "short_description": "Estudio de la comunicación de historias y conocimientos de forma hablada.",
            "example_tasks": [
              "Entrevista a un familiar mayor y registra una historia o leyenda que recuerde de su niñez",
              "Analiza cómo la transmisión oral puede generar variaciones en una misma leyenda",
              "Compara una versión oral de un cuento tradicional con una versión escrita"
            ]
          },
          {
            "key": "anonimato_autoria_colectiva",
            "name": "Anonimato y Autoría Colectiva",
            "short_description": "Análisis de textos sin autor identificado que pertenecen a la comunidad.",
            "example_tasks": [
              "Investiga el origen de un corrido mexicano y explica por qué muchos son anónimos",
              "Compara la autoría individual de un poema escrito con la autoría colectiva de una leyenda popular",
              "Recopila tres refranes populares mexicanos y analiza su sabiduría comunitaria"
            ]
          },
          {
            "key": "variantes_regionales",
            "name": "Variantes Regionales",
            "short_description": "Estudio de las diferentes versiones de una misma historia según la región o comunidad.",
            "example_tasks": [
              "Compara dos versiones de 'La Llorona' de diferentes regiones de México",
              "Investiga leyendas específicas de tu estado o región",
              "Analiza cómo los elementos culturales locales modifican una leyenda nacional"
            ]
          }
        ]
      },
      {
        "key": "mitos_leyendas",
        "name": "Mitos y Leyendas",
        "short_description": "Estudio de relatos tradicionales que explican el origen de fenómenos naturales o narran hechos sobrenaturales.",
        "sub_topics": [
          {
            "key": "mitos_prehispanicos",
            "name": "Mitos Prehispánicos",
            "short_description": "Análisis de relatos cosmogónicos y religiosos de las culturas mesoamericanas.",
            "example_tasks": [
              "Lee el mito de la creación del Quinto Sol en la mitología mexica",
              "Analiza el mito de Quetzalcóatl y su importancia en la cultura mesoamericana",
              "Compara un mito de creación mexica con un mito de creación maya"
            ]
          },
          {
            "key": "leyendas_mexicanas",
            "name": "Leyendas Mexicanas",
            "short_description": "Estudio de relatos tradicionales mexicanos con elementos sobrenaturales basados en hechos o lugares reales.",
            "example_tasks": [
              "Analiza la leyenda de 'La Llorona' identificando sus elementos sobrenaturales y su moraleja",
              "Investiga la leyenda del 'Callejón del Beso' en Guanajuato y su base histórica",
              "Recopila una leyenda local de tu comunidad y preséntala por escrito"
            ]
          },
          {
            "key": "funcion_social_mitos",
            "name": "Función Social de Mitos y Leyendas",
            "short_description": "Análisis del papel de estos relatos en la transmisión de valores, explicación del mundo y cohesión social.",
            "example_tasks": [
              "Explica qué valores o enseñanzas transmite la leyenda de 'La Llorona'",
              "Analiza cómo los mitos prehispánicos explicaban fenómenos naturales como eclipses o terremotos",
              "Compara la función social de los mitos antiguos con la de las leyendas urbanas contemporáneas"
            ]
          }
        ]
      },
      {
        "key": "corrido_mexicano",
        "name": "Corrido Mexicano",
        "short_description": "Estudio de la forma narrativa popular en verso que relata acontecimientos históricos, hazañas y personajes.",
        "sub_topics": [
          {
            "key": "caracteristicas_corrido",
            "name": "Características del Corrido",
            "short_description": "Análisis de elementos formales: verso octosílabo, rima, estructura narrativa, acompañamiento musical.",
            "example_tasks": [
              "Identifica la estructura del corrido en 'La Adelita': presentación, desarrollo, despedida",
              "Analiza la métrica octosílaba y la rima en un corrido de la Revolución Mexicana",
              "Compara el corrido con el romance español identificando similitudes y diferencias"
            ]
          },
          {
            "key": "corridos_revolucionarios",
            "name": "Corridos Revolucionarios",
            "short_description": "Estudio de corridos que narran episodios de la Revolución Mexicana y sus personajes.",
            "example_tasks": [
              "Analiza 'La cucaracha' como testimonio popular de la Revolución Mexicana",
              "Investiga corridos sobre Pancho Villa o Emiliano Zapata y analiza cómo los representan",
              "Compara la versión histórica de un evento revolucionario con su versión en corrido"
            ]
          },
          {
            "key": "corrido_contemporaneo",
            "name": "Corrido Contemporáneo",
            "short_description": "Análisis de corridos actuales sobre temas sociales, migración, narcotráfico.",
            "example_tasks": [
              "Analiza la evolución del corrido tradicional al narcocorrido contemporáneo",
              "Identifica temas sociales en corridos contemporáneos sobre migración",
              "Compara la función social del corrido revolucionario con el corrido actual"
            ]
          }
        ]
      },
      {
        "key": "refranes_dichos",
        "name": "Refranes y Dichos Populares",
        "short_description": "Estudio de sentencias breves que expresan sabiduría popular, consejos y observaciones sobre la vida.",
        "sub_topics": [
          {
            "key": "estructura_refranes",
            "name": "Estructura de los Refranes",
            "short_description": "Análisis de las características formales: brevedad, ritmo, rima, recursos mnemotécnicos.",
            "example_tasks": [
              "Identifica la rima y el ritmo en refranes como 'Más vale pájaro en mano que ciento volando'",
              "Analiza recursos como la comparación, metáfora o paralelismo en refranes mexicanos",
              "Recopila diez refranes y clasifícalos según tengan rima o no"
            ]
          },
          {
            "key": "sabiduria_popular",
            "name": "Sabiduría y Valores Populares",
            "short_description": "Estudio del contenido moral, enseñanzas prácticas y visión del mundo en refranes.",
            "example_tasks": [
              "Explica la enseñanza o moraleja de cinco refranes mexicanos comunes",
              "Compara refranes mexicanos con refranes de otros países hispanohablantes",
              "Analiza qué valores culturales mexicanos se reflejan en refranes populares"
            ]
          },
          {
            "key": "uso_refranes",
            "name": "Uso de Refranes en el Lenguaje",
            "short_description": "Análisis de la función comunicativa de refranes en conversaciones y textos.",
            "example_tasks": [
              "Escribe tres situaciones cotidianas donde usarías un refrán específico",
              "Identifica refranes utilizados en obras literarias mexicanas y explica su función",
              "Crea un texto breve donde uses tres refranes de manera apropiada"
            ]
          }
        ]
      },
      {
        "key": "literatura_indigena",
        "name": "Literatura Indígena",
        "short_description": "Estudio de expresiones literarias de pueblos originarios: poesía náhuatl, literatura maya, tradiciones orales actuales.",
        "sub_topics": [
          {
            "key": "poesia_nahuatl",
            "name": "Poesía Náhuatl",
            "short_description": "Análisis de textos poéticos prehispánicos: cantos, himnos, poemas filosóficos.",
            "example_tasks": [
              "Lee poemas de Nezahualcóyotl y analiza temas como la fugacidad de la vida",
              "Identifica recursos poéticos en la poesía náhuatl: paralelismo, metáforas florales",
              "Compara la concepción de la vida y la muerte en poesía náhuatl con la poesía española"
            ]
          },
          {
            "key": "codices_literatura_maya",
            "name": "Códices y Literatura Maya",
            "short_description": "Estudio de textos como el Popol Vuh y otros documentos de la tradición maya.",
            "example_tasks": [
              "Lee fragmentos del Popol Vuh y analiza el mito de creación de los gemelos",
              "Investiga la función de los códices como registro histórico y religioso",
              "Compara la cosmogonía maya del Popol Vuh con mitos mexicas"
            ]
          },
          {
            "key": "literatura_indigena_actual",
            "name": "Literatura Indígena Actual",
            "short_description": "Análisis de producciones contemporáneas de autores indígenas en lenguas originarias y español.",
            "example_tasks": [
              "Lee poemas de Natalia Toledo (zapoteca) o Juan Gregorio Regino (mazateco)",
              "Investiga la situación de las lenguas indígenas en México y su literatura",
              "Analiza cómo autores indígenas contemporáneos mantienen tradiciones orales en forma escrita"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "literatura_prehispanica_colonial",
    "name": "Literatura Prehispánica y Colonial",
    "short_description": "Estudio de las expresiones literarias anteriores y posteriores a la Conquista: códices, crónicas, poesía náhuatl y autores del virreinato.",
    "sub_topics": [
      {
        "key": "codices_prehispanicos",
        "name": "Códices Prehispánicos",
        "short_description": "Análisis de documentos pictográficos que registran historia, religión y conocimientos de las culturas mesoamericanas.",
        "sub_topics": [
          {
            "key": "codice_boturini",
            "name": "Códice Boturini y Códices Mexicas",
            "short_description": "Estudio de registros históricos mexicas sobre la peregrinación desde Aztlán hasta la fundación de Tenochtitlan.",
            "example_tasks": [
              "Analiza la representación pictográfica de la peregrinación mexica en el Códice Boturini",
              "Identifica símbolos y glifos utilizados en códices mexicas para representar lugares y eventos",
              "Compara el Códice Mendoza con el Códice Boturini identificando similitudes en su sistema de escritura"
            ]
          },
          {
            "key": "codice_florentino",
            "name": "Códice Florentino",
            "short_description": "Análisis de la obra de Fray Bernardino de Sahagún que documenta la cultura náhuatl.",
            "example_tasks": [
              "Lee fragmentos del Códice Florentino sobre la Conquista desde la perspectiva indígena",
              "Analiza cómo el Códice Florentino preserva conocimientos sobre medicina, religión y costumbres nahuas",
              "Compara la visión de la Conquista en el Códice Florentino con las crónicas españolas"
            ]
          },
          {
            "key": "popol_vuh",
            "name": "Popol Vuh",
            "short_description": "Estudio del libro sagrado maya-quiché sobre la creación del mundo y los orígenes del pueblo maya.",
            "example_tasks": [
              "Analiza el mito de creación de los humanos en el Popol Vuh y sus intentos fallidos",
              "Identifica las hazañas de los gemelos Hunahpú e Ixbalanqué en el inframundo",
              "Compara la cosmogonía del Popol Vuh con otros mitos de creación mesoamericanos"
            ]
          }
        ]
      },
      {
        "key": "poesia_nahuatl_prehispanica",
        "name": "Poesía Náhuatl Prehispánica",
        "short_description": "Análisis de la lírica náhuatl: temas filosóficos, fugacidad de la vida, belleza y naturaleza.",
        "sub_topics": [
          {
            "key": "nezahualcoyotl",
            "name": "Nezahualcóyotl",
            "short_description": "Estudio del poeta-rey de Texcoco y sus reflexiones sobre la vida, la muerte y lo divino.",
            "example_tasks": [
              "Analiza el tema de la fugacidad de la vida en poemas de Nezahualcóyotl",
              "Identifica el uso de flores y cantos como símbolos de la poesía y la belleza",
              "Compara la filosofía sobre la muerte en Nezahualcóyotl con la poesía española medieval"
            ]
          },
          {
            "key": "temas_poesia_nahuatl",
            "name": "Temas de la Poesía Náhuatl",
            "short_description": "Análisis de temas recurrentes: temporalidad, amistad, guerra, naturaleza, divinidad.",
            "example_tasks": [
              "Identifica metáforas florales en la poesía náhuatl y su significado simbólico",
              "Analiza el concepto de 'flor y canto' como metáfora de la poesía y la verdad",
              "Compara el tratamiento de la guerra florida en poesía náhuatl con poesía épica europea"
            ]
          },
          {
            "key": "recursos_poeticos_nahuas",
            "name": "Recursos Poéticos Nahuas",
            "short_description": "Estudio de técnicas como el difrasismo y el paralelismo en la poesía náhuatl.",
            "example_tasks": [
              "Identifica ejemplos de difrasismo como 'in xóchitl in cuícatl' (flor y canto = poesía)",
              "Analiza el uso del paralelismo en poemas nahuas: repetición de estructuras sintácticas",
              "Compara recursos poéticos nahuas con recursos de la poesía española"
            ]
          }
        ]
      },
      {
        "key": "cronicas_conquista",
        "name": "Crónicas de la Conquista",
        "short_description": "Estudio de relatos testimoniales sobre la Conquista de México desde perspectivas española e indígena.",
        "sub_topics": [
          {
            "key": "bernal_diaz_castillo",
            "name": "Bernal Díaz del Castillo",
            "short_description": "Análisis de 'Historia verdadera de la conquista de la Nueva España' como testimonio directo.",
            "example_tasks": [
              "Lee fragmentos sobre el primer encuentro entre Cortés y Moctezuma en la obra de Bernal Díaz",
              "Analiza el estilo narrativo y testimonial de Bernal Díaz como soldado cronista",
              "Compara la descripción de Tenochtitlan en Bernal Díaz con otras fuentes"
            ]
          },
          {
            "key": "vision_vencidos",
            "name": "Visión de los Vencidos",
            "short_description": "Estudio de relatos indígenas sobre la Conquista compilados en códices y testimonios.",
            "example_tasks": [
              "Analiza fragmentos de 'Visión de los vencidos' compilados por Miguel León-Portilla",
              "Compara la perspectiva indígena de la Conquista con las crónicas españolas",
              "Identifica el tono emotivo en relatos nahuas sobre la caída de Tenochtitlan"
            ]
          },
          {
            "key": "bartolome_casas",
            "name": "Fray Bartolomé de las Casas",
            "short_description": "Análisis de la 'Brevísima relación de la destrucción de las Indias' y su defensa de los indígenas.",
            "example_tasks": [
              "Lee fragmentos de la obra de Las Casas sobre abusos contra indígenas",
              "Analiza el propósito crítico y denunciante de Las Casas",
              "Investiga el debate entre Las Casas y Sepúlveda sobre la naturaleza de los indígenas"
            ]
          }
        ]
      },
      {
        "key": "literatura_barroca_novohispana",
        "name": "Literatura Barroca Novohispana",
        "short_description": "Estudio de la producción literaria del virreinato en el siglo XVII, especialmente el barroco americano.",
        "sub_topics": [
          {
            "key": "sor_juana_ines_cruz",
            "name": "Sor Juana Inés de la Cruz",
            "short_description": "Análisis de la obra de la máxima figura de las letras novohispanas: poesía, teatro y prosa.",
            "example_tasks": [
              "Analiza 'Hombres necios que acusáis' identificando la crítica social de Sor Juana",
              "Estudia los sonetos filosóficos de Sor Juana sobre el conocimiento y la razón",
              "Lee 'Respuesta a Sor Filotea' y analiza la defensa de Sor Juana del derecho de la mujer a estudiar"
            ]
          },
          {
            "key": "teatro_novohispano",
            "name": "Teatro Novohispano",
            "short_description": "Estudio del teatro religioso y profano en la Nueva España.",
            "example_tasks": [
              "Analiza 'Los empeños de una casa' de Sor Juana Inés de la Cruz como comedia de enredo",
              "Investiga el teatro misionero utilizado para evangelización de indígenas",
              "Compara el teatro novohispano con el teatro del Siglo de Oro español"
            ]
          },
          {
            "key": "carlos_sigüenza_gongora",
            "name": "Carlos de Sigüenza y Góngora",
            "short_description": "Análisis de la obra del erudito novohispano: crónicas, relatos y ensayos.",
            "example_tasks": [
              "Lee 'Infortunios de Alonso Ramírez' como ejemplo de prosa narrativa novohispana",
              "Analiza el carácter enciclopédico y científico de la obra de Sigüenza y Góngora",
              "Compara la prosa de Sigüenza con la de Sor Juana Inés de la Cruz"
            ]
          }
        ]
      },
      {
        "key": "ilustracion_independencia",
        "name": "Ilustración e Independencia",
        "short_description": "Estudio de la producción literaria del siglo XVIII y principios del XIX asociada al pensamiento ilustrado e independentista.",
        "sub_topics": [
          {
            "key": "jose_joaquin_fernandez_lizardi",
            "name": "José Joaquín Fernández de Lizardi",
            "short_description": "Análisis del 'Pensador Mexicano' y la primera novela latinoamericana 'El Periquillo Sarniento'.",
            "example_tasks": [
              "Lee fragmentos de 'El Periquillo Sarniento' identificando la crítica social",
              "Analiza el carácter didáctico y moralizante de la novela picaresca de Lizardi",
              "Investiga el contexto de la Independencia en la producción periodística de Lizardi"
            ]
          },
          {
            "key": "fray_servando_teresa_mier",
            "name": "Fray Servando Teresa de Mier",
            "short_description": "Estudio de las memorias y escritos polémicos del fraile insurgente.",
            "example_tasks": [
              "Lee fragmentos de las 'Memorias' de Fray Servando sobre sus aventuras y persecuciones",
              "Analiza el estilo apasionado y controversial de los escritos de Fray Servando",
              "Investiga el papel de Fray Servando en el pensamiento independentista mexicano"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "literatura_siglo_xix_mexicano",
    "name": "Literatura del Siglo XIX Mexicano",
    "short_description": "Estudio de movimientos y autores del México independiente: Romanticismo, Realismo, Modernismo y literatura nacionalista.",
    "sub_topics": [
      {
        "key": "romanticismo_mexicano",
        "name": "Romanticismo Mexicano",
        "short_description": "Análisis del movimiento que enfatiza sentimientos, naturaleza, nacionalismo y temas históricos.",
        "sub_topics": [
          {
            "key": "ignacio_manuel_altamirano",
            "name": "Ignacio Manuel Altamirano",
            "short_description": "Estudio del escritor y promotor cultural que impulsó la literatura nacional mexicana.",
            "example_tasks": [
              "Lee 'El Zarco' de Altamirano y analiza la descripción del paisaje mexicano",
              "Identifica elementos románticos en 'Clemencia': amor, naturaleza, tragedia",
              "Investiga el papel de Altamirano en la creación de una literatura nacional mexicana"
            ]
          },
          {
            "key": "manuel_acuña",
            "name": "Manuel Acuña",
            "short_description": "Análisis de la poesía romántica del autor de 'Nocturno a Rosario'.",
            "example_tasks": [
              "Analiza 'Nocturno a Rosario' identificando temas de amor, muerte y desesperación",
              "Identifica recursos románticos en la poesía de Acuña: hipérboles, metáforas emotivas",
              "Compara la poesía de Acuña con la de otros poetas románticos hispanoamericanos"
            ]
          },
          {
            "key": "guillermo_prieto",
            "name": "Guillermo Prieto",
            "short_description": "Estudio de la poesía popular y costumbrista del poeta liberal.",
            "example_tasks": [
              "Lee poemas patrióticos de Guillermo Prieto y analiza su visión liberal de México",
              "Identifica elementos costumbristas en la poesía de Prieto sobre la vida mexicana",
              "Investiga el papel de Prieto en la literatura de la Reforma"
            ]
          }
        ]
      },
      {
        "key": "novela_historica_mexicana",
        "name": "Novela Histórica Mexicana",
        "short_description": "Estudio de narraciones que recrean episodios históricos de México: Conquista, Inquisición, Independencia.",
        "sub_topics": [
          {
            "key": "vicente_riva_palacio",
            "name": "Vicente Riva Palacio",
            "short_description": "Análisis de novelas históricas como 'Monja y casada, virgen y mártir' y 'Martín Garatuza'.",
            "example_tasks": [
              "Lee fragmentos de 'Monja y casada, virgen y mártir' sobre la Inquisición en México",
              "Analiza cómo Riva Palacio recrea el México colonial en sus novelas",
              "Investiga el propósito liberal y anticlerical en las novelas históricas de Riva Palacio"
            ]
          },
          {
            "key": "justo_sierra",
            "name": "Justo Sierra",
            "short_description": "Estudio de sus relatos históricos y ensayos sobre la evolución política de México.",
            "example_tasks": [
              "Lee ensayos de Justo Sierra sobre la historia de México",
              "Analiza la visión positivista de la historia en la obra de Sierra",
              "Investiga el papel de Sierra como educador y su influencia en la cultura mexicana"
            ]
          }
        ]
      },
      {
        "key": "modernismo_mexicano_siglo_xix",
        "name": "Modernismo Mexicano",
        "short_description": "Estudio del movimiento que renovó el lenguaje poético con musicalidad, símbolos y cosmopolitismo.",
        "sub_topics": [
          {
            "key": "manuel_gutierrez_najera",
            "name": "Manuel Gutiérrez Nájera",
            "short_description": "Análisis del precursor del Modernismo en México conocido como 'Duque Job'.",
            "example_tasks": [
              "Analiza 'Para entonces' de Gutiérrez Nájera identificando melancolía y musicalidad",
              "Identifica símbolos modernistas en su poesía: cisnes, princesas, ambientes exóticos",
              "Lee sus crónicas periodísticas y analiza su prosa modernista"
            ]
          },
          {
            "key": "amado_nervo",
            "name": "Amado Nervo",
            "short_description": "Estudio del poeta modernista que evolucionó hacia temas espirituales y filosóficos.",
            "example_tasks": [
              "Analiza 'En paz' de Amado Nervo identificando serenidad y aceptación de la muerte",
              "Identifica la evolución de Nervo del Modernismo sensorial al misticismo",
              "Compara la primera etapa modernista de Nervo con su poesía mística posterior"
            ]
          },
          {
            "key": "ramon_lopez_velarde",
            "name": "Ramón López Velarde",
            "short_description": "Análisis del poeta posmodernista que cantó a la provincia mexicana.",
            "example_tasks": [
              "Analiza 'Suave Patria' como poema fundacional de la identidad nacional",
              "Identifica imágenes de la provincia mexicana en 'Mi prima Águeda' y otros poemas",
              "Estudia el erotismo contenido y la religiosidad en la poesía de López Velarde"
            ]
          },
          {
            "key": "salvador_diaz_miron",
            "name": "Salvador Díaz Mirón",
            "short_description": "Estudio de su poesía de perfección formal y temas patrióticos.",
            "example_tasks": [
              "Analiza la precisión formal y el uso del lenguaje en poemas de Díaz Mirón",
              "Identifica temas de orgullo, honor y rebeldía en su obra",
              "Compara la poesía vigorosa de Díaz Mirón con la delicada de Gutiérrez Nájera"
            ]
          }
        ]
      },
      {
        "key": "realismo_naturalismo_mexico",
        "name": "Realismo y Naturalismo en México",
        "short_description": "Estudio de corrientes que representan la realidad social con objetividad y determinismo.",
        "sub_topics": [
          {
            "key": "emilio_rabasa",
            "name": "Emilio Rabasa",
            "short_description": "Análisis de novelas que critican la sociedad y política mexicana del Porfiriato.",
            "example_tasks": [
              "Lee 'La bola' de Emilio Rabasa y analiza la crítica a los cacicazgos rurales",
              "Identifica elementos realistas en la descripción de la sociedad porfiriana",
              "Analiza la técnica narrativa de Rabasa en su retrato de la provincia mexicana"
            ]
          },
          {
            "key": "federico_gamboa",
            "name": "Federico Gamboa",
            "short_description": "Estudio del principal representante del naturalismo mexicano.",
            "example_tasks": [
              "Lee 'Santa' de Federico Gamboa y analiza el determinismo social en la caída de la protagonista",
              "Identifica influencias de Émile Zola en la narrativa naturalista de Gamboa",
              "Analiza la descripción objetiva y detallada del ambiente urbano en 'Santa'"
            ]
          }
        ]
      },
      {
        "key": "costumbrismo_mexicano",
        "name": "Costumbrismo Mexicano",
        "short_description": "Estudio de obras que describen costumbres, tipos sociales y escenas de la vida cotidiana mexicana.",
        "sub_topics": [
          {
            "key": "articulos_costumbristas",
            "name": "Artículos de Costumbres",
            "short_description": "Análisis de cuadros breves que retratan tipos y escenas de la sociedad mexicana.",
            "example_tasks": [
              "Lee artículos costumbristas sobre tipos sociales mexicanos del siglo XIX",
              "Identifica la crítica social suave en descripciones de costumbres urbanas",
              "Compara el costumbrismo mexicano con el español (Larra, Mesonero Romanos)"
            ]
          },
          {
            "key": "tradiciones_leyendas",
            "name": "Tradiciones y Leyendas",
            "short_description": "Estudio de relatos que combinan historia, tradición popular y ficción.",
            "example_tasks": [
              "Lee tradiciones mexicanas inspiradas en Ricardo Palma",
              "Analiza cómo las tradiciones mezclan datos históricos con elementos legendarios",
              "Compara tradiciones mexicanas con 'Tradiciones peruanas' de Ricardo Palma"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "literatura_revolucion_mexicana",
    "name": "Literatura de la Revolución Mexicana",
    "short_description": "Estudio de la narrativa surgida del movimiento armado de 1910: novelas testimoniales, visiones críticas y personajes populares.",
    "sub_topics": [
      {
        "key": "novela_revolucion",
        "name": "Novela de la Revolución",
        "short_description": "Análisis de características del género: testimonio, crítica, violencia, desilusión.",
        "sub_topics": [
          {
            "key": "mariano_azuela",
            "name": "Mariano Azuela",
            "short_description": "Estudio del autor de 'Los de abajo', novela fundacional del ciclo revolucionario.",
            "example_tasks": [
              "Lee 'Los de abajo' y analiza la evolución de Demetrio Macías de campesino a jefe revolucionario",
              "Identifica la visión crítica y desilusionada de la Revolución en la novela de Azuela",
              "Analiza la estructura fragmentaria y el estilo directo en 'Los de abajo'"
            ]
          },
          {
            "key": "martin_luis_guzman",
            "name": "Martín Luis Guzmán",
            "short_description": "Análisis de sus novelas testimoniales sobre caudillos y episodios revolucionarios.",
            "example_tasks": [
              "Lee 'El águila y la serpiente' y analiza las memorias de Guzmán sobre la Revolución",
              "Estudia 'La sombra del caudillo' como crítica al caudillismo posrevolucionario",
              "Compara el testimonio directo de Guzmán con la ficción de Azuela"
            ]
          },
          {
            "key": "nellie_campobello",
            "name": "Nellie Campobello",
            "short_description": "Estudio de la perspectiva femenina e infantil de la Revolución en 'Cartucho'.",
            "example_tasks": [
              "Lee 'Cartucho' de Nellie Campobello y analiza la mirada infantil sobre la violencia",
              "Identifica la estructura fragmentaria de estampas y relatos breves",
              "Compara la visión de Campobello sobre villistas con otras representaciones de la Revolución"
            ]
          },
          {
            "key": "otros_novelistas_revolucion",
            "name": "Otros Novelistas de la Revolución",
            "short_description": "Análisis de autores que completaron el panorama narrativo del movimiento armado.",
            "example_tasks": [
              "Lee 'Tropa vieja' de Francisco L. Urquizo como testimonio de soldado revolucionario",
              "Analiza 'Vámonos con Pancho Villa' de Rafael F. Muñoz",
              "Compara diferentes visiones de la Revolución en novelas de distintos autores"
            ]
          }
        ]
      },
      {
        "key": "temas_literatura_revolucionaria",
        "name": "Temas de la Literatura Revolucionaria",
        "short_description": "Estudio de motivos recurrentes: violencia, traición, caudillismo, pueblo, desilusión.",
        "sub_topics": [
          {
            "key": "violencia_destruccion",
            "name": "Violencia y Destrucción",
            "short_description": "Análisis de la representación cruda de la guerra y sus consecuencias.",
            "example_tasks": [
              "Identifica escenas de violencia en 'Los de abajo' y analiza su función narrativa",
              "Analiza cómo 'Cartucho' presenta la muerte desde una perspectiva infantil",
              "Compara el tratamiento de la violencia en diferentes novelas de la Revolución"
            ]
          },
          {
            "key": "caudillismo_poder",
            "name": "Caudillismo y Lucha por el Poder",
            "short_description": "Estudio de la representación de líderes revolucionarios y ambiciones políticas.",
            "example_tasks": [
              "Analiza la figura del caudillo en 'La sombra del caudillo' de Martín Luis Guzmán",
              "Identifica las ambiciones personales que corrompen ideales revolucionarios",
              "Compara la representación de Villa, Zapata u Obregón en diferentes obras"
            ]
          },
          {
            "key": "pueblo_revolucion",
            "name": "El Pueblo en la Revolución",
            "short_description": "Análisis de la representación de campesinos, soldados rasos y clases populares.",
            "example_tasks": [
              "Analiza cómo 'Los de abajo' retrata a los soldados revolucionarios sin idealización",
              "Identifica la representación del pueblo en corridos y novelas de la Revolución",
              "Compara personajes populares heroicos con personajes desilusionados o corruptos"
            ]
          },
          {
            "key": "desencanto_revolucionario",
            "name": "Desencanto y Crítica",
            "short_description": "Estudio de la visión crítica sobre los resultados y traiciones a los ideales revolucionarios.",
            "example_tasks": [
              "Analiza la desilusión al final de 'Los de abajo': '¿Por qué pelean ya, Demetrio?'",
              "Identifica la crítica al régimen posrevolucionario en 'La sombra del caudillo'",
              "Compara la visión heroica de corridos con la visión crítica de novelas"
            ]
          }
        ]
      },
      {
        "key": "tecnicas_narrativas_revolucion",
        "name": "Técnicas Narrativas",
        "short_description": "Análisis de recursos empleados: fragmentación, testimonio, lenguaje popular, realismo.",
        "sub_topics": [
          {
            "key": "fragmentacion_estampas",
            "name": "Fragmentación y Estampas",
            "short_description": "Estudio de la estructura de cuadros breves que presentan escenas de la Revolución.",
            "example_tasks": [
              "Analiza la estructura fragmentaria de 'Cartucho' en viñetas independientes",
              "Identifica cómo 'Los de abajo' organiza la acción en episodios breves",
              "Compara la narración lineal tradicional con la fragmentación revolucionaria"
            ]
          },
          {
            "key": "lenguaje_popular",
            "name": "Lenguaje Popular y Regional",
            "short_description": "Análisis del uso de vocabulario, modismos y habla de campesinos y soldados.",
            "example_tasks": [
              "Identifica regionalismos y vocabulario popular en diálogos de 'Los de abajo'",
              "Analiza cómo el lenguaje caracteriza a personajes de diferentes clases sociales",
              "Compara el lenguaje literario culto con el habla popular en novelas revolucionarias"
            ]
          },
          {
            "key": "realismo_testimonio",
            "name": "Realismo y Testimonio",
            "short_description": "Estudio de la representación objetiva basada en experiencias vividas por los autores.",
            "example_tasks": [
              "Analiza elementos autobiográficos en 'El águila y la serpiente' de Martín Luis Guzmán",
              "Identifica la intención testimonial en novelas de autores que participaron en la Revolución",
              "Compara el realismo descriptivo con momentos de lirismo o idealización"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "literatura_mexicana_contemporanea",
    "name": "Literatura Mexicana Contemporánea",
    "short_description": "Estudio de autores y movimientos del siglo XX hasta la actualidad: vanguardias, narrativa experimental, boom latinoamericano.",
    "sub_topics": [
      {
        "key": "vanguardias_mexico",
        "name": "Vanguardias en México",
        "short_description": "Análisis de movimientos de renovación artística: Estridentismo, Contemporáneos.",
        "sub_topics": [
          {
            "key": "estridentismo",
            "name": "Estridentismo",
            "short_description": "Estudio del movimiento vanguardista que celebró la modernidad, la ciudad y la máquina.",
            "example_tasks": [
              "Lee poemas de Manuel Maples Arce y analiza imágenes urbanas y tecnológicas",
              "Identifica características vanguardistas: experimentación formal, rechazo al pasado",
              "Compara el Estridentismo mexicano con el Futurismo italiano"
            ]
          },
          {
            "key": "contemporaneos",
            "name": "Grupo Contemporáneos",
            "short_description": "Análisis del grupo intelectual que renovó la poesía mexicana con influencias europeas.",
            "example_tasks": [
              "Lee poemas de Xavier Villaurrutia, José Gorostiza o Carlos Pellicer",
              "Identifica influencias surrealistas y simbolistas en poetas Contemporáneos",
              "Analiza el hermetismo poético en 'Muerte sin fin' de José Gorostiza"
            ]
          }
        ]
      },
      {
        "key": "juan_rulfo",
        "name": "Juan Rulfo",
        "short_description": "Estudio del autor fundamental de la narrativa mexicana: 'Pedro Páramo' y 'El llano en llamas'.",
        "sub_topics": [
          {
            "key": "pedro_paramo",
            "name": "Pedro Páramo",
            "short_description": "Análisis de la novela sobre Comala, pueblo de muertos y memoria.",
            "example_tasks": [
              "Analiza la estructura fragmentada y no lineal de 'Pedro Páramo'",
              "Identifica la confusión entre vivos y muertos en la narrativa de Rulfo",
              "Estudia temas como caciquismo, muerte, soledad y búsqueda del padre"
            ]
          },
          {
            "key": "llano_llamas",
            "name": "El Llano en Llamas",
            "short_description": "Estudio de cuentos sobre el campo mexicano, violencia y personajes marginados.",
            "example_tasks": [
              "Analiza 'Nos han dado la tierra' y la crítica a la reforma agraria",
              "Lee 'Diles que no me maten' identificando violencia y ciclos de venganza",
              "Estudia el lenguaje contenido y sugerente en cuentos de Rulfo"
            ]
          },
          {
            "key": "estilo_rulfo",
            "name": "Estilo y Técnica Narrativa",
            "short_description": "Análisis de recursos: economía verbal, ambigüedad, monólogo interior, tiempo fragmentado.",
            "example_tasks": [
              "Identifica el uso del monólogo interior en 'Macario' o 'Luvina'",
              "Analiza la economía del lenguaje: cómo Rulfo dice mucho con pocas palabras",
              "Estudia el manejo del tiempo narrativo: flashbacks, anacronías, simultaneidad"
            ]
          }
        ]
      },
      {
        "key": "octavio_paz_obra",
        "name": "Octavio Paz",
        "short_description": "Estudio del premio Nobel mexicano: poesía, ensayo, reflexión sobre México y la literatura.",
        "sub_topics": [
          {
            "key": "poesia_octavio_paz",
            "name": "Poesía de Octavio Paz",
            "short_description": "Análisis de su obra lírica: 'Piedra de sol', 'Libertad bajo palabra', experimentación formal.",
            "example_tasks": [
              "Analiza 'Piedra de sol': estructura circular, tiempo, amor, identidad",
              "Identifica influencias surrealistas en la poesía temprana de Paz",
              "Estudia poemas concretos o visuales de Paz: experimentación tipográfica"
            ]
          },
          {
            "key": "ensayo_octavio_paz",
            "name": "Ensayística de Octavio Paz",
            "short_description": "Estudio de ensayos sobre identidad mexicana, crítica literaria y arte.",
            "example_tasks": [
              "Lee capítulos de 'El laberinto de la soledad' sobre el mexicano y la soledad",
              "Analiza ensayos de Paz sobre poesía: 'El arco y la lira'",
              "Estudia la reflexión de Paz sobre arte: 'Los privilegios de la vista'"
            ]
          }
        ]
      },
      {
        "key": "carlos_fuentes",
        "name": "Carlos Fuentes",
        "short_description": "Análisis de la narrativa experimental del autor de 'La región más transparente' y 'Aura'.",
        "sub_topics": [
          {
            "key": "region_mas_transparente",
            "name": "La Región Más Transparente",
            "short_description": "Estudio de la novela coral sobre la Ciudad de México y su transformación.",
            "example_tasks": [
              "Analiza la técnica de múltiples voces y perspectivas en la novela",
              "Identifica temas: modernización de México, clases sociales, Revolución traicionada",
              "Estudia personajes simbólicos como Ixca Cienfuegos"
            ]
          },
          {
            "key": "aura_muerte_artemio_cruz",
            "name": "Aura y La Muerte de Artemio Cruz",
            "short_description": "Análisis de novelas experimentales con tiempo, perspectiva y lenguaje.",
            "example_tasks": [
              "Analiza el uso de la segunda persona ('tú') en 'Aura' y su efecto en el lector",
              "Estudia las tres perspectivas narrativas en 'La muerte de Artemio Cruz'",
              "Identifica temas: tiempo, memoria, poder, corrupción"
            ]
          }
        ]
      },
      {
        "key": "elena_poniatowska",
        "name": "Elena Poniatowska",
        "short_description": "Estudio de su narrativa testimonial, crónica y defensa de voces marginadas.",
        "sub_topics": [
          {
            "key": "noche_tlatelolco",
            "name": "La Noche de Tlatelolco",
            "short_description": "Análisis del testimonio coral sobre la masacre estudiantil de 1968.",
            "example_tasks": [
              "Analiza la técnica de montaje de testimonios directos en la obra",
              "Identifica diferentes voces: estudiantes, madres, testigos, autoridades",
              "Estudia el valor documental y literario de la crónica testimonial"
            ]
          },
          {
            "key": "hasta_no_verte",
            "name": "Hasta no Verte Jesús Mío",
            "short_description": "Estudio de la novela testimonial basada en la vida de Jesusa Palancares.",
            "example_tasks": [
              "Analiza cómo Poniatowska recrea la voz de una mujer del pueblo",
              "Identifica episodios históricos: Revolución, vida urbana, pobreza",
              "Estudia la relación entre testimonio oral y elaboración literaria"
            ]
          }
        ]
      },
      {
        "key": "otros_autores_contemporaneos",
        "name": "Otros Autores Contemporáneos",
        "short_description": "Lectura de narrativa y poesía mexicana actual: diversidad de voces y temas.",
        "sub_topics": [
          {
            "key": "jose_emilio_pacheco",
            "name": "José Emilio Pacheco",
            "short_description": "Estudio de su poesía sobre el tiempo, la memoria y la ciudad, y narrativa breve.",
            "example_tasks": [
              "Lee poemas de 'Los elementos de la noche' o 'No me preguntes cómo pasa el tiempo'",
              "Analiza 'Las batallas en el desierto': memoria, infancia, ciudad cambiante",
              "Identifica temas: paso del tiempo, nostalgia, crítica social suave"
            ]
          },
          {
            "key": "autores_generaciones_recientes",
            "name": "Autores de Generaciones Recientes",
            "short_description": "Lectura de escritores mexicanos contemporáneos: variedad temática y estilística.",
            "example_tasks": [
              "Lee cuentos o novelas de autores actuales: Jorge Volpi, Guadalupe Nettel, Valeria Luiselli",
              "Identifica temas contemporáneos: globalización, violencia, género, migración",
              "Compara técnicas narrativas tradicionales con experimentación contemporánea"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "literatura_latinoamericana",
    "name": "Literatura Latinoamericana",
    "short_description": "Estudio de autores y movimientos fundamentales de América Latina: modernismo, vanguardias, boom, narrativa actual.",
    "sub_topics": [
      {
        "key": "modernismo_latinoamericano",
        "name": "Modernismo Latinoamericano",
        "short_description": "Análisis del primer movimiento literario original de América Latina liderado por Rubén Darío.",
        "sub_topics": [
          {
            "key": "ruben_dario",
            "name": "Rubén Darío",
            "short_description": "Estudio del poeta nicaragüense que renovó la poesía en español.",
            "example_tasks": [
              "Analiza 'Azul...' identificando innovaciones métricas y temáticas",
              "Lee 'Cantos de vida y esperanza' y estudia la evolución hacia temas americanos",
              "Identifica símbolos modernistas: cisnes, princesas, jardines versallescos"
            ]
          },
          {
            "key": "otros_modernistas",
            "name": "Otros Modernistas Latinoamericanos",
            "short_description": "Lectura de José Martí, José Asunción Silva, Leopoldo Lugones.",
            "example_tasks": [
              "Lee 'Nocturno III' de José Asunción Silva y analiza musicalidad y melancolía",
              "Estudia prosa modernista en crónicas de José Martí",
              "Compara el Modernismo hispanoamericano con el mexicano"
            ]
          }
        ]
      },
      {
        "key": "vanguardias_latinoamericanas",
        "name": "Vanguardias Latinoamericanas",
        "short_description": "Estudio de movimientos de ruptura: Creacionismo, Ultraísmo, poesía social.",
        "sub_topics": [
          {
            "key": "vicente_huidobro",
            "name": "Vicente Huidobro y Creacionismo",
            "short_description": "Análisis de la propuesta de crear realidades nuevas con el lenguaje poético.",
            "example_tasks": [
              "Lee 'Arte poética' de Huidobro: 'El poeta es un pequeño Dios'",
              "Analiza 'Altazor' identificando experimentación formal y vuelo metafísico",
              "Compara el Creacionismo con otras vanguardias europeas"
            ]
          },
          {
            "key": "cesar_vallejo",
            "name": "César Vallejo",
            "short_description": "Estudio del poeta peruano y su renovación del lenguaje poético.",
            "example_tasks": [
              "Analiza 'Los heraldos negros' identificando dolor existencial y recursos innovadores",
              "Lee 'Trilce' y estudia la experimentación radical con sintaxis y vocabulario",
              "Identifica compromiso social en 'Poemas humanos'"
            ]
          },
          {
            "key": "pablo_neruda",
            "name": "Pablo Neruda",
            "short_description": "Análisis de la evolución del poeta chileno: de vanguardia a poesía social.",
            "example_tasks": [
              "Lee 'Veinte poemas de amor y una canción desesperada' analizando sensualidad y naturaleza",
              "Estudia 'Residencia en la tierra': hermetismo, angustia, surrealismo",
              "Analiza el compromiso político en 'Canto general'"
            ]
          }
        ]
      },
      {
        "key": "narrativa_indigenista",
        "name": "Narrativa Indigenista",
        "short_description": "Estudio de obras que retratan la vida y problemas de comunidades indígenas.",
        "sub_topics": [
          {
            "key": "ciro_alegria",
            "name": "Ciro Alegría",
            "short_description": "Análisis de 'El mundo es ancho y ajeno' sobre comunidades andinas.",
            "example_tasks": [
              "Lee fragmentos de 'El mundo es ancho y ajeno' sobre el despojo de tierras",
              "Analiza la representación de la comunidad indígena y su lucha",
              "Identifica la denuncia social en la narrativa indigenista"
            ]
          },
          {
            "key": "jose_maria_arguedas",
            "name": "José María Arguedas",
            "short_description": "Estudio del autor peruano que integró cosmovisión andina en su narrativa.",
            "example_tasks": [
              "Lee 'Los ríos profundos' y analiza el conflicto entre mundo indígena y criollo",
              "Identifica el uso del quechua y la oralidad andina en la prosa de Arguedas",
              "Estudia la visión del mundo andino: relación con naturaleza, comunidad"
            ]
          }
        ]
      },
      {
        "key": "boom_latinoamericano",
        "name": "Boom Latinoamericano",
        "short_description": "Estudio del fenómeno editorial y literario de los años 60: realismo mágico, experimentación narrativa.",
        "sub_topics": [
          {
            "key": "gabriel_garcia_marquez",
            "name": "Gabriel García Márquez",
            "short_description": "Análisis del maestro del realismo mágico y 'Cien años de soledad'.",
            "example_tasks": [
              "Lee 'Cien años de soledad' y analiza la historia de la familia Buendía",
              "Identifica elementos de realismo mágico: lo fantástico presentado como normal",
              "Estudia temas: soledad, tiempo cíclico, historia latinoamericana, dictadura"
            ]
          },
          {
            "key": "julio_cortazar",
            "name": "Julio Cortázar",
            "short_description": "Estudio de cuentos fantásticos y novelas experimentales del autor argentino.",
            "example_tasks": [
              "Analiza 'Casa tomada' como cuento fantástico de invasión inexplicable",
              "Lee 'La noche boca arriba' identificando la ambigüedad entre realidad y sueño",
              "Estudia la estructura de 'Rayuela': lecturas múltiples, capítulos prescindibles"
            ]
          },
          {
            "key": "mario_vargas_llosa",
            "name": "Mario Vargas Llosa",
            "short_description": "Análisis de novelas totales con estructura compleja del autor peruano.",
            "example_tasks": [
              "Lee 'La ciudad y los perros' sobre la academia militar y violencia",
              "Identifica técnicas: vasos comunicantes, mudas de tiempo, perspectivas múltiples",
              "Analiza crítica social en novelas de Vargas Llosa"
            ]
          },
          {
            "key": "otros_autores_boom",
            "name": "Otros Autores del Boom",
            "short_description": "Lectura de Alejo Carpentier, José Donoso y su contribución al boom.",
            "example_tasks": [
              "Lee 'El reino de este mundo' de Carpentier y analiza lo real maravilloso",
              "Estudia 'El obsceno pájaro de la noche' de Donoso: experimentación narrativa",
              "Compara diferentes técnicas narrativas entre autores del boom"
            ]
          }
        ]
      },
      {
        "key": "posboom_literatura_actual",
        "name": "Posboom y Literatura Actual",
        "short_description": "Estudio de autores latinoamericanos contemporáneos: nuevas voces, temas urbanos, violencia.",
        "sub_topics": [
          {
            "key": "isabel_allende",
            "name": "Isabel Allende",
            "short_description": "Análisis de 'La casa de los espíritus' y saga familiar con elementos mágicos.",
            "example_tasks": [
              "Lee 'La casa de los espíritus' identificando realismo mágico y denuncia política",
              "Analiza personajes femeninos fuertes en la obra de Allende",
              "Compara 'La casa de los espíritus' con 'Cien años de soledad'"
            ]
          },
          {
            "key": "roberto_bolaño",
            "name": "Roberto Bolaño",
            "short_description": "Estudio del autor chileno de 'Los detectives salvajes' y narrativa experimental.",
            "example_tasks": [
              "Lee fragmentos de 'Los detectives salvajes' sobre poetas infrarrealistas",
              "Analiza la estructura fragmentada y múltiples voces en Bolaño",
              "Identifica temas: literatura, exilio, violencia, juventud"
            ]
          },
          {
            "key": "autores_contemporaneos_diversos",
            "name": "Autores Contemporáneos Diversos",
            "short_description": "Lectura de voces actuales de América Latina: diversidad de temas y estilos.",
            "example_tasks": [
              "Lee cuentos de Samanta Schweblin (Argentina) o Mariana Enríquez",
              "Explora narrativa actual sobre violencia, género, migración",
              "Compara literatura del boom con narrativa latinoamericana del siglo XXI"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "literatura_clasica_grecolatina",
    "name": "Literatura Clásica Grecolatina",
    "short_description": "Estudio de obras fundamentales de Grecia y Roma antiguas: épica, tragedia, comedia y su influencia en la literatura occidental.",
    "sub_topics": [
      {
        "key": "epica_griega",
        "name": "Épica Griega",
        "short_description": "Análisis de los poemas épicos fundacionales de la literatura occidental: Homero y la tradición oral.",
        "sub_topics": [
          {
            "key": "iliada",
            "name": "La Ilíada",
            "short_description": "Estudio del poema sobre la guerra de Troya: héroes, honor, cólera de Aquiles.",
            "example_tasks": [
              "Lee el canto I de la Ilíada sobre la cólera de Aquiles y analiza el conflicto con Agamenón",
              "Identifica valores heroicos griegos: honor, gloria, valentía en el combate",
              "Analiza la intervención de los dioses en los asuntos humanos en episodios clave"
            ]
          },
          {
            "key": "odisea",
            "name": "La Odisea",
            "short_description": "Análisis del poema sobre el viaje de regreso de Odiseo a Ítaca.",
            "example_tasks": [
              "Lee episodios de la Odisea: Polifemo, Circe, las sirenas, y analiza las pruebas de Odiseo",
              "Identifica características del héroe Odiseo: astucia, perseverancia, lealtad",
              "Compara la épica guerrera de la Ilíada con la épica aventurera de la Odisea"
            ]
          },
          {
            "key": "caracteristicas_epica",
            "name": "Características de la Épica",
            "short_description": "Estudio de elementos del género épico: héroe, hazañas, maravilloso, estilo elevado.",
            "example_tasks": [
              "Identifica el uso de epítetos homéricos: 'Aquiles de pies ligeros', 'Odiseo de muchos ardides'",
              "Analiza el estilo formular de Homero propio de la tradición oral",
              "Compara la épica griega con épicas de otras culturas (romana, medieval)"
            ]
          }
        ]
      },
      {
        "key": "tragedia_griega",
        "name": "Tragedia Griega",
        "short_description": "Análisis del género dramático que presenta conflictos inevitables entre el héroe y el destino.",
        "sub_topics": [
          {
            "key": "sofocles",
            "name": "Sófocles",
            "short_description": "Estudio de tragedias como 'Edipo Rey' y 'Antígona': destino, libre albedrío, dilemas morales.",
            "example_tasks": [
              "Lee 'Edipo Rey' y analiza la ironía trágica: el héroe que busca la verdad descubre su culpa",
              "Identifica el conflicto entre destino y libre albedrío en la tragedia de Edipo",
              "Analiza 'Antígona': conflicto entre ley divina y ley humana, deber familiar vs. autoridad"
            ]
          },
          {
            "key": "esquilo_euripides",
            "name": "Esquilo y Eurípides",
            "short_description": "Lectura de otros grandes trágicos griegos y su visión del conflicto humano.",
            "example_tasks": [
              "Lee 'Prometeo encadenado' de Esquilo sobre el titán que desafió a Zeus",
              "Analiza 'Medea' de Eurípides: venganza, pasión, condición de la mujer",
              "Compara el tratamiento de personajes femeninos en diferentes tragedias griegas"
            ]
          },
          {
            "key": "elementos_tragedia",
            "name": "Elementos de la Tragedia",
            "short_description": "Análisis de componentes según Aristóteles: catarsis, hamartía, peripecia, anagnórisis.",
            "example_tasks": [
              "Identifica la hamartía (error trágico) en 'Edipo Rey': soberbia, ignorancia",
              "Analiza la anagnórisis (reconocimiento) cuando Edipo descubre la verdad",
              "Explica el concepto de catarsis: purificación emocional del público mediante temor y compasión"
            ]
          }
        ]
      },
      {
        "key": "comedia_griega_romana",
        "name": "Comedia Griega y Romana",
        "short_description": "Estudio del género cómico que critica la sociedad con humor.",
        "sub_topics": [
          {
            "key": "aristofanes",
            "name": "Aristófanes",
            "short_description": "Análisis de comedias griegas que satirizan la política y la sociedad ateniense.",
            "example_tasks": [
              "Lee 'Las nubes' de Aristófanes y analiza la sátira de Sócrates y los sofistas",
              "Identifica la crítica social y política en comedias de Aristófanes",
              "Compara la comedia antigua griega (política) con la comedia nueva (costumbres)"
            ]
          },
          {
            "key": "plauto_terencio",
            "name": "Plauto y Terencio",
            "short_description": "Estudio de la comedia romana de enredos, tipos sociales y situaciones cómicas.",
            "example_tasks": [
              "Lee una comedia de Plauto identificando personajes tipo: esclavo astuto, joven enamorado, padre avaro",
              "Analiza situaciones de enredo: confusiones de identidad, engaños, disfraces",
              "Investiga la influencia de la comedia romana en el teatro renacentista y posterior"
            ]
          }
        ]
      },
      {
        "key": "lirica_latina",
        "name": "Lírica Latina",
        "short_description": "Análisis de la poesía romana: temas de amor, naturaleza, filosofía.",
        "sub_topics": [
          {
            "key": "ovidio",
            "name": "Ovidio",
            "short_description": "Estudio de 'Metamorfosis' y poesía amorosa del poeta romano.",
            "example_tasks": [
              "Lee mitos de 'Metamorfosis' de Ovidio: Apolo y Dafne, Narciso, Píramo y Tisbe",
              "Identifica el tema de la transformación como metáfora del cambio y el amor",
              "Analiza la influencia de Ovidio en literatura posterior: Renacimiento, Barroco"
            ]
          },
          {
            "key": "virgilio",
            "name": "Virgilio",
            "short_description": "Análisis de la 'Eneida': épica nacional romana sobre Eneas.",
            "example_tasks": [
              "Lee fragmentos de la 'Eneida' sobre la fundación mítica de Roma",
              "Compara la 'Eneida' de Virgilio con la 'Ilíada' y 'Odisea' de Homero",
              "Identifica valores romanos exaltados: piedad, deber, destino imperial"
            ]
          }
        ]
      },
      {
        "key": "influencia_clasica",
        "name": "Influencia de la Literatura Clásica",
        "short_description": "Estudio del legado grecolatino en la literatura occidental: temas, géneros, mitos.",
        "sub_topics": [
          {
            "key": "mitos_clasicos",
            "name": "Mitos Clásicos en la Literatura",
            "short_description": "Análisis de la pervivencia de mitos grecolatinos en obras posteriores.",
            "example_tasks": [
              "Identifica referencias a mitos griegos en literatura mexicana o latinoamericana",
              "Analiza reescrituras modernas de mitos clásicos (Edipo, Medea, Antígona)",
              "Investiga el uso de mitos clásicos como símbolos universales en literatura contemporánea"
            ]
          },
          {
            "key": "generos_clasicos",
            "name": "Géneros Clásicos",
            "short_description": "Estudio de cómo épica, tragedia y comedia influyeron en géneros posteriores.",
            "example_tasks": [
              "Compara la estructura de la tragedia griega con la del teatro del Siglo de Oro español",
              "Identifica elementos épicos en novelas modernas o poemas contemporáneos",
              "Analiza la evolución de la comedia desde Roma hasta el teatro contemporáneo"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "literatura_medieval_renacentista",
    "name": "Literatura Medieval y Renacentista",
    "short_description": "Estudio de obras fundamentales de la Edad Media y el Renacimiento: Dante, Cervantes, Shakespeare.",
    "sub_topics": [
      {
        "key": "edad_media_europea",
        "name": "Literatura Medieval Europea",
        "short_description": "Análisis de obras medievales: épica, lírica cortés, literatura alegórica y religiosa.",
        "sub_topics": [
          {
            "key": "dante_divina_comedia",
            "name": "Dante y la Divina Comedia",
            "short_description": "Estudio del viaje alegórico por Infierno, Purgatorio y Paraíso.",
            "example_tasks": [
              "Lee cantos del Infierno de Dante: Paolo y Francesca, Ugolino",
              "Identifica la estructura tripartita y el simbolismo numérico en la Divina Comedia",
              "Analiza la alegoría del viaje como búsqueda de salvación y conocimiento"
            ]
          },
          {
            "key": "epica_medieval",
            "name": "Épica Medieval",
            "short_description": "Estudio de cantares de gesta: héroes, batallas, valores feudales.",
            "example_tasks": [
              "Lee fragmentos del 'Cantar del Mío Cid' sobre el héroe castellano",
              "Compara la épica medieval con la épica clásica grecolatina",
              "Identifica valores medievales: lealtad al señor, honor, fe cristiana"
            ]
          },
          {
            "key": "lirica_cortesana",
            "name": "Lírica Cortesana y Amor Cortés",
            "short_description": "Análisis de la poesía trovadoresca y el concepto del amor idealizado.",
            "example_tasks": [
              "Identifica características del amor cortés en poesía medieval",
              "Analiza la idealización de la dama en la lírica cortesana",
              "Compara el amor cortés medieval con concepciones románticas posteriores"
            ]
          }
        ]
      },
      {
        "key": "renacimiento_italiano",
        "name": "Renacimiento Italiano",
        "short_description": "Estudio del humanismo renacentista: Petrarca, Boccaccio y la renovación cultural.",
        "sub_topics": [
          {
            "key": "petrarca",
            "name": "Petrarca",
            "short_description": "Análisis del 'Cancionero' y el modelo petrarquista de poesía amorosa.",
            "example_tasks": [
              "Lee sonetos de Petrarca dedicados a Laura",
              "Identifica características del petrarquismo: amor idealizado, antítesis, sufrimiento amoroso",
              "Analiza la influencia de Petrarca en la lírica española y europea"
            ]
          },
          {
            "key": "boccaccio",
            "name": "Boccaccio",
            "short_description": "Estudio del 'Decamerón': relatos enmarcados, realismo, variedad temática.",
            "example_tasks": [
              "Lee cuentos del 'Decamerón' identificando crítica social y humor",
              "Analiza la estructura de marco narrativo: diez narradores, cien cuentos",
              "Compara el realismo de Boccaccio con el idealismo cortesano medieval"
            ]
          }
        ]
      },
      {
        "key": "cervantes_quijote",
        "name": "Cervantes y el Quijote",
        "short_description": "Estudio de la obra cumbre de la literatura española y universal: parodia, realismo, humanidad.",
        "sub_topics": [
          {
            "key": "estructura_quijote",
            "name": "Estructura del Quijote",
            "short_description": "Análisis de la organización en dos partes, salidas, relatos intercalados.",
            "example_tasks": [
              "Identifica las tres salidas de Don Quijote y los episodios principales de cada una",
              "Analiza la diferencia entre la primera parte (1605) y la segunda (1615)",
              "Estudia relatos intercalados y su relación con la trama principal"
            ]
          },
          {
            "key": "don_quijote_sancho",
            "name": "Don Quijote y Sancho Panza",
            "short_description": "Estudio de los personajes principales: idealismo vs. realismo, transformación mutua.",
            "example_tasks": [
              "Analiza el contraste entre Don Quijote (idealista, loco-cuerdo) y Sancho (realista, simple-sabio)",
              "Identifica la evolución de ambos personajes: quijotización de Sancho, sanchificación de Quijote",
              "Estudia el diálogo entre Quijote y Sancho como centro de la novela"
            ]
          },
          {
            "key": "temas_quijote",
            "name": "Temas del Quijote",
            "short_description": "Análisis de realidad vs. ficción, locura-cordura, justicia, libertad, literatura.",
            "example_tasks": [
              "Analiza episodios donde Don Quijote confunde realidad con ficción (molinos de viento, rebaños)",
              "Identifica reflexiones metaliterarias: crítica a libros de caballerías, naturaleza de la ficción",
              "Estudia el tema de la libertad en el episodio de los galeotes"
            ]
          },
          {
            "key": "innovacion_cervantes",
            "name": "Innovación Narrativa",
            "short_description": "Estudio de técnicas cervantinas: perspectivismo, metaficción, parodia.",
            "example_tasks": [
              "Identifica el perspectivismo: múltiples narradores, diferentes versiones de los hechos",
              "Analiza elementos metaficcionales: personajes que leen la primera parte en la segunda",
              "Estudia la parodia de los libros de caballerías y su función crítica"
            ]
          }
        ]
      },
      {
        "key": "shakespeare",
        "name": "William Shakespeare",
        "short_description": "Estudio del dramaturgo inglés: tragedias, comedias, historias, poesía.",
        "sub_topics": [
          {
            "key": "tragedias_shakespeare",
            "name": "Tragedias de Shakespeare",
            "short_description": "Análisis de obras como 'Hamlet', 'Romeo y Julieta', 'Macbeth', 'Otelo'.",
            "example_tasks": [
              "Lee 'Romeo y Julieta' y analiza el amor trágico obstaculizado por el odio familiar",
              "Estudia 'Hamlet': duda, venganza, locura fingida, dilema existencial ('Ser o no ser')",
              "Analiza la ambición y la culpa en 'Macbeth': profecías, crimen, destino"
            ]
          },
          {
            "key": "comedias_shakespeare",
            "name": "Comedias de Shakespeare",
            "short_description": "Estudio de obras como 'Sueño de una noche de verano', 'Mucho ruido y pocas nueces'.",
            "example_tasks": [
              "Lee 'Sueño de una noche de verano' identificando enredos amorosos y magia",
              "Analiza el humor, los malentendidos y los finales felices en comedias shakespearianas",
              "Compara la comedia shakespeariana con la comedia española del Siglo de Oro"
            ]
          },
          {
            "key": "personajes_shakespeare",
            "name": "Personajes Shakespearianos",
            "short_description": "Análisis de la complejidad psicológica y profundidad de los personajes.",
            "example_tasks": [
              "Analiza la complejidad de Hamlet: pensador, dubitativo, vengador",
              "Estudia personajes femeninos fuertes: Lady Macbeth, Julieta, Ofelia",
              "Identifica arquetipos universales en personajes de Shakespeare"
            ]
          },
          {
            "key": "lenguaje_shakespeare",
            "name": "Lenguaje y Estilo",
            "short_description": "Estudio del verso blanco, metáforas, juegos de palabras, soliloquios.",
            "example_tasks": [
              "Analiza el soliloquio 'Ser o no ser' de Hamlet: reflexión sobre vida y muerte",
              "Identifica metáforas y recursos poéticos en diálogos shakespearianos",
              "Estudia el uso del verso y la prosa según personajes y situaciones"
            ]
          }
        ]
      },
      {
        "key": "renacimiento_español",
        "name": "Renacimiento Español",
        "short_description": "Estudio de la literatura del Siglo de Oro: lírica petrarquista, picaresca, mística.",
        "sub_topics": [
          {
            "key": "lirica_renacentista_española",
            "name": "Lírica Renacentista Española",
            "short_description": "Análisis de Garcilaso de la Vega y la introducción del soneto italiano.",
            "example_tasks": [
              "Lee sonetos de Garcilaso de la Vega sobre amor idealizado y naturaleza",
              "Identifica influencia petrarquista: amor no correspondido, naturaleza como confidente",
              "Analiza églogas de Garcilaso: pastores idealizados, naturaleza arcádica"
            ]
          },
          {
            "key": "novela_picaresca",
            "name": "Novela Picaresca",
            "short_description": "Estudio del 'Lazarillo de Tormes': antihéroe, crítica social, autobiografía.",
            "example_tasks": [
              "Lee 'Lazarillo de Tormes' y analiza la estructura de episodios con diferentes amos",
              "Identifica características del pícaro: origen humilde, astucia, supervivencia",
              "Analiza la crítica social y anticlerical en el 'Lazarillo'"
            ]
          },
          {
            "key": "poesia_mistica",
            "name": "Poesía Mística",
            "short_description": "Análisis de San Juan de la Cruz y Santa Teresa: experiencia religiosa, símbolos.",
            "example_tasks": [
              "Lee 'Noche oscura' de San Juan de la Cruz analizando símbolos místicos",
              "Identifica el uso del lenguaje amoroso para expresar experiencia religiosa",
              "Compara la poesía mística con la poesía amorosa profana"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "literatura_siglos_xviii_xix",
    "name": "Literatura de los Siglos XVIII y XIX",
    "short_description": "Estudio de movimientos literarios: Neoclasicismo, Romanticismo, Realismo y Naturalismo en la literatura universal.",
    "sub_topics": [
      {
        "key": "neoclasicismo_ilustracion",
        "name": "Neoclasicismo e Ilustración",
        "short_description": "Análisis de la literatura del siglo XVIII: razón, didactismo, imitación de clásicos.",
        "sub_topics": [
          {
            "key": "teatro_neoclasico",
            "name": "Teatro Neoclásico",
            "short_description": "Estudio de obras que respetan reglas clásicas: unidades, decoro, finalidad didáctica.",
            "example_tasks": [
              "Identifica el respeto a las tres unidades aristotélicas en teatro neoclásico",
              "Analiza la finalidad didáctica y moralizante del teatro ilustrado",
              "Compara el teatro neoclásico con el teatro barroco español (libertad vs. reglas)"
            ]
          },
          {
            "key": "fabula_ensayo",
            "name": "Fábula y Ensayo",
            "short_description": "Análisis de géneros didácticos: fábulas con moraleja, ensayos críticos.",
            "example_tasks": [
              "Lee fábulas neoclásicas identificando la enseñanza moral",
              "Analiza ensayos de la Ilustración sobre razón, progreso y educación",
              "Compara la literatura neoclásica (razón) con la romántica (sentimiento)"
            ]
          }
        ]
      },
      {
        "key": "romanticismo_europeo",
        "name": "Romanticismo Europeo",
        "short_description": "Estudio del movimiento que exalta sentimientos, naturaleza, libertad e individualismo.",
        "sub_topics": [
          {
            "key": "goethe",
            "name": "Goethe",
            "short_description": "Análisis de 'Las penas del joven Werther' y 'Fausto': pasión, genio, rebeldía.",
            "example_tasks": [
              "Lee 'Las penas del joven Werther' sobre amor imposible y melancolía romántica",
              "Identifica temas románticos: conflicto con la sociedad, suicidio por amor, naturaleza",
              "Analiza 'Fausto' como símbolo del ser humano que busca conocimiento y experiencia absolutos"
            ]
          },
          {
            "key": "victor_hugo",
            "name": "Victor Hugo",
            "short_description": "Estudio de novelas románticas: 'Los Miserables', 'Nuestra Señora de París'.",
            "example_tasks": [
              "Lee fragmentos de 'Los Miserables' sobre Jean Valjean y la redención",
              "Identifica temas románticos: injusticia social, amor, sacrificio, rebeldía",
              "Analiza personajes como símbolos: Quasimodo (lo grotesco), Esmeralda (la inocencia)"
            ]
          },
          {
            "key": "poesia_romantica",
            "name": "Poesía Romántica",
            "short_description": "Análisis de lírica que expresa sentimientos intensos, naturaleza sublime, melancolía.",
            "example_tasks": [
              "Lee poemas de Lord Byron, Shelley o Keats identificando temas románticos",
              "Analiza la naturaleza como reflejo del alma del poeta",
              "Identifica el concepto del poeta como genio incomprendido y rebelde"
            ]
          },
          {
            "key": "caracteristicas_romanticismo",
            "name": "Características del Romanticismo",
            "short_description": "Estudio de elementos: libertad creativa, subjetividad, nacionalismo, medievalismo.",
            "example_tasks": [
              "Identifica elementos románticos: noche, ruinas, cementerios, tormentas, pasiones",
              "Analiza el rechazo de las reglas neoclásicas y la exaltación de la libertad artística",
              "Compara el Romanticismo europeo con el Romanticismo hispanoamericano"
            ]
          }
        ]
      },
      {
        "key": "realismo_europeo",
        "name": "Realismo Europeo",
        "short_description": "Estudio de la literatura que representa la realidad social con objetividad y detalle.",
        "sub_topics": [
          {
            "key": "balzac_stendhal",
            "name": "Balzac y Stendhal",
            "short_description": "Análisis de la novela francesa realista: sociedad, ambición, análisis psicológico.",
            "example_tasks": [
              "Lee fragmentos de 'La comedia humana' de Balzac sobre diversos estratos sociales",
              "Analiza 'Rojo y negro' de Stendhal: ambición, hipocresía social, ascenso y caída",
              "Identifica la descripción detallada de ambientes y costumbres en novelas realistas"
            ]
          },
          {
            "key": "flaubert",
            "name": "Flaubert",
            "short_description": "Estudio de 'Madame Bovary': romanticismo frustrado, adulterio, crítica a la burguesía.",
            "example_tasks": [
              "Lee 'Madame Bovary' y analiza el conflicto entre fantasías románticas y realidad mediocre",
              "Identifica la técnica del estilo indirecto libre para presentar pensamientos de Emma",
              "Analiza la crítica a la sociedad burguesa y sus valores materialistas"
            ]
          },
          {
            "key": "dickens",
            "name": "Charles Dickens",
            "short_description": "Análisis del realismo social inglés: pobreza, injusticia, personajes memorables.",
            "example_tasks": [
              "Lee 'Oliver Twist' o 'Grandes esperanzas' identificando denuncia de injusticia social",
              "Analiza personajes dickensonianos: desde lo cómico a lo patético",
              "Identifica la crítica a la Revolución Industrial y sus consecuencias sociales"
            ]
          },
          {
            "key": "tolstoi_dostoievski",
            "name": "Tolstói y Dostoievski",
            "short_description": "Estudio del realismo psicológico ruso: complejidad humana, dilemas morales.",
            "example_tasks": [
              "Lee fragmentos de 'Ana Karenina' o 'Guerra y paz' de Tolstói",
              "Analiza 'Crimen y castigo' de Dostoievski: culpa, redención, conciencia moral",
              "Identifica la profundidad psicológica en la caracterización de personajes rusos"
            ]
          }
        ]
      },
      {
        "key": "naturalismo",
        "name": "Naturalismo",
        "short_description": "Estudio de la corriente que aplica determinismo científico a la literatura: herencia, ambiente.",
        "sub_topics": [
          {
            "key": "emile_zola",
            "name": "Émile Zola",
            "short_description": "Análisis del padre del Naturalismo: serie de los Rougon-Macquart, experimentación.",
            "example_tasks": [
              "Lee fragmentos de 'Germinal' sobre condiciones de mineros y lucha social",
              "Identifica el determinismo: influencia de herencia y ambiente en destino de personajes",
              "Analiza la descripción objetiva y casi científica de la realidad social"
            ]
          },
          {
            "key": "caracteristicas_naturalismo",
            "name": "Características del Naturalismo",
            "short_description": "Estudio de elementos: determinismo, objetividad, temas sórdidos, influencia darwinista.",
            "example_tasks": [
              "Identifica factores que determinan a los personajes: herencia biológica, medio social",
              "Analiza el tratamiento de temas antes considerados tabú: alcoholismo, prostitución, violencia",
              "Compara Realismo (descripción social) con Naturalismo (determinismo científico)"
            ]
          }
        ]
      },
      {
        "key": "simbolismo_parnasianismo",
        "name": "Simbolismo y Parnasianismo",
        "short_description": "Estudio de corrientes poéticas del siglo XIX: arte por el arte, símbolos, musicalidad.",
        "sub_topics": [
          {
            "key": "baudelaire",
            "name": "Baudelaire",
            "short_description": "Análisis de 'Las flores del mal': belleza extraída del mal, correspondencias, spleen.",
            "example_tasks": [
              "Lee poemas de 'Las flores del mal' identificando temas: spleen, ideal, decadencia",
              "Analiza la teoría de las correspondencias: sinestesia, símbolos",
              "Identifica la influencia de Baudelaire en Modernismo hispanoamericano"
            ]
          },
          {
            "key": "verlaine_rimbaud",
            "name": "Verlaine y Rimbaud",
            "short_description": "Estudio de poetas simbolistas: musicalidad, sinestesia, visión visionaria.",
            "example_tasks": [
              "Analiza la musicalidad en poemas de Verlaine: 'Arte poética'",
              "Lee 'El barco ebrio' de Rimbaud identificando imágenes visionarias",
              "Identifica el concepto del poeta como vidente que descifra significados ocultos"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "literatura_siglo_xx",
    "name": "Literatura del Siglo XX",
    "short_description": "Estudio de vanguardias, experimentación narrativa, literatura existencialista y postmoderna.",
    "sub_topics": [
      {
        "key": "vanguardias_europeas",
        "name": "Vanguardias Europeas",
        "short_description": "Análisis de movimientos de ruptura: Futurismo, Dadaísmo, Surrealismo, Expresionismo.",
        "sub_topics": [
          {
            "key": "surrealismo",
            "name": "Surrealismo",
            "short_description": "Estudio del movimiento que explora el inconsciente, lo onírico, la escritura automática.",
            "example_tasks": [
              "Lee poemas de André Breton o Paul Éluard identificando imágenes oníricas",
              "Identifica técnicas surrealistas: escritura automática, asociaciones libres, objetos imposibles",
              "Analiza la influencia del surrealismo en poetas hispanoamericanos"
            ]
          },
          {
            "key": "futurismo_expresionismo",
            "name": "Futurismo y Expresionismo",
            "short_description": "Análisis de vanguardias que celebran la modernidad o expresan angustia existencial.",
            "example_tasks": [
              "Identifica la exaltación de la velocidad, la máquina y la guerra en manifiestos futuristas",
              "Analiza el expresionismo: deformación de la realidad para expresar emociones intensas",
              "Compara diferentes vanguardias según su relación con la realidad y la tradición"
            ]
          }
        ]
      },
      {
        "key": "narrativa_experimental",
        "name": "Narrativa Experimental del Siglo XX",
        "short_description": "Estudio de técnicas innovadoras: monólogo interior, tiempo fragmentado, multiperspectivismo.",
        "sub_topics": [
          {
            "key": "james_joyce",
            "name": "James Joyce",
            "short_description": "Análisis de 'Ulises': monólogo interior, experimentación lingüística, mito moderno.",
            "example_tasks": [
              "Lee fragmentos de 'Ulises' identificando la técnica del monólogo interior",
              "Analiza la estructura basada en la 'Odisea': paralelismo entre Bloom y Odiseo",
              "Identifica la experimentación con lenguaje: juegos de palabras, múltiples registros"
            ]
          },
          {
            "key": "virginia_woolf",
            "name": "Virginia Woolf",
            "short_description": "Estudio del fluir de la conciencia: 'La señora Dalloway', 'Al faro'.",
            "example_tasks": [
              "Analiza el fluir de la conciencia en 'La señora Dalloway'",
              "Identifica cómo Woolf representa el tiempo psicológico vs. tiempo cronológico",
              "Estudia la técnica de presentar eventos externos a través de percepciones internas"
            ]
          },
          {
            "key": "franz_kafka",
            "name": "Franz Kafka",
            "short_description": "Análisis de lo absurdo, la alienación, la burocracia: 'La metamorfosis', 'El proceso'.",
            "example_tasks": [
              "Lee 'La metamorfosis' y analiza la transformación de Gregor como alegoría de alienación",
              "Identifica elementos kafkianos: situaciones absurdas, burocracia opresiva, culpa inexplicable",
              "Analiza 'El proceso': acusación sin cargo, sistema judicial incomprensible"
            ]
          },
          {
            "key": "proust",
            "name": "Marcel Proust",
            "short_description": "Estudio de 'En busca del tiempo perdido': memoria involuntaria, introspección.",
            "example_tasks": [
              "Analiza el episodio de la magdalena: memoria involuntaria que recupera el pasado",
              "Identifica la estructura de la obra: tiempo recuperado a través de la memoria",
              "Estudia la introspección psicológica y el análisis minucioso de sensaciones"
            ]
          }
        ]
      },
      {
        "key": "existencialismo",
        "name": "Literatura Existencialista",
        "short_description": "Estudio de obras que exploran libertad, responsabilidad, absurdo de la existencia.",
        "sub_topics": [
          {
            "key": "albert_camus",
            "name": "Albert Camus",
            "short_description": "Análisis de 'El extranjero' y 'La peste': absurdo, rebeldía, solidaridad.",
            "example_tasks": [
              "Lee 'El extranjero' y analiza la indiferencia de Meursault ante la vida",
              "Identifica el concepto del absurdo: falta de sentido inherente en la existencia",
              "Analiza 'La peste' como alegoría de la condición humana y la solidaridad"
            ]
          },
          {
            "key": "sartre",
            "name": "Jean-Paul Sartre",
            "short_description": "Estudio de 'La náusea' y teatro existencialista: libertad, angustia, compromiso.",
            "example_tasks": [
              "Analiza 'La náusea': conciencia de la contingencia y ausencia de esencia",
              "Lee 'A puerta cerrada': 'El infierno son los otros', libertad y responsabilidad",
              "Identifica temas existencialistas: libertad radical, angustia, mala fe"
            ]
          }
        ]
      },
      {
        "key": "teatro_absurdo",
        "name": "Teatro del Absurdo",
        "short_description": "Análisis de obras que presentan la falta de sentido mediante situaciones ilógicas.",
        "sub_topics": [
          {
            "key": "beckett",
            "name": "Samuel Beckett",
            "short_description": "Estudio de 'Esperando a Godot': espera sin sentido, diálogos circulares, inacción.",
            "example_tasks": [
              "Analiza 'Esperando a Godot': ausencia de trama, espera indefinida, repetición",
              "Identifica características del absurdo: diálogos sin comunicación real, situaciones ilógicas",
              "Estudia cómo la forma teatral refleja la falta de sentido del contenido"
            ]
          },
          {
            "key": "ionesco",
            "name": "Eugène Ionesco",
            "short_description": "Análisis de obras como 'La cantante calva': lenguaje vacío, anti-teatro.",
            "example_tasks": [
              "Lee 'La cantante calva' identificando el vaciamiento del lenguaje",
              "Analiza la crítica a la burguesía y la convencionalidad social",
              "Identifica recursos del absurdo: automatización, falta de lógica, personajes intercambiables"
            ]
          }
        ]
      },
      {
        "key": "postmodernismo_literatura",
        "name": "Literatura Postmoderna",
        "short_description": "Estudio de características postmodernas: metaficción, intertextualidad, fragmentación, ironía.",
        "sub_topics": [
          {
            "key": "metaficcion",
            "name": "Metaficción",
            "short_description": "Análisis de obras que reflexionan sobre su propia naturaleza ficcional.",
            "example_tasks": [
              "Identifica elementos metaficcionales: narrador que comenta sobre el acto de narrar",
              "Analiza obras que rompen la cuarta pared o cuestionan la distinción ficción/realidad",
              "Estudia la autorreferencialidad en narrativa contemporánea"
            ]
          },
          {
            "key": "intertextualidad_parodia",
            "name": "Intertextualidad y Parodia",
            "short_description": "Estudio del diálogo con textos previos, reescrituras, parodias postmodernas.",
            "example_tasks": [
              "Identifica referencias a otros textos en obras postmodernas",
              "Analiza reescrituras paródicas de mitos, cuentos de hadas o clásicos",
              "Estudia el uso lúdico e irónico de la tradición literaria"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "literatura_juvenil_contemporanea",
    "name": "Literatura Juvenil y Contemporánea",
    "short_description": "Estudio de obras dirigidas a público adolescente y joven: temas actuales, formación, distopías.",
    "sub_topics": [
      {
        "key": "novela_formacion_juvenil",
        "name": "Novela de Formación Juvenil",
        "short_description": "Análisis de obras sobre crecimiento, identidad, paso de adolescencia a adultez.",
        "sub_topics": [
          {
            "key": "temas_identidad",
            "name": "Temas de Identidad y Crecimiento",
            "short_description": "Estudio de búsqueda de identidad, primer amor, conflictos familiares, amistad.",
            "example_tasks": [
              "Lee una novela juvenil contemporánea identificando el proceso de maduración del protagonista",
              "Analiza cómo se representan conflictos típicos de la adolescencia",
              "Identifica temas: búsqueda de identidad, presión de grupo, primer amor, rebeldía"
            ]
          },
          {
            "key": "diversidad_representacion",
            "name": "Diversidad y Representación",
            "short_description": "Análisis de obras que representan diferentes identidades: género, orientación, etnia, cultura.",
            "example_tasks": [
              "Lee obras con protagonistas diversos que reflejan múltiples identidades",
              "Analiza la importancia de la representación en literatura juvenil",
              "Identifica cómo la literatura juvenil aborda temas de inclusión y aceptación"
            ]
          }
        ]
      },
      {
        "key": "literatura_distopica",
        "name": "Literatura Distópica",
        "short_description": "Estudio de sociedades futuras opresivas que critican tendencias actuales.",
        "sub_topics": [
          {
            "key": "caracteristicas_distopia",
            "name": "Características de la Distopía",
            "short_description": "Análisis de elementos: gobierno totalitario, vigilancia, control social, rebeldía.",
            "example_tasks": [
              "Lee una novela distópica juvenil ('Los juegos del hambre', 'Divergente') identificando elementos de control social",
              "Analiza la crítica social implícita en mundos distópicos",
              "Compara distopías clásicas ('1984', 'Un mundo feliz') con distopías juveniles"
            ]
          },
          {
            "key": "rebelion_esperanza",
            "name": "Rebelión y Esperanza",
            "short_description": "Estudio de protagonistas que se rebelan contra sistemas opresivos.",
            "example_tasks": [
              "Analiza el viaje del héroe en narrativa distópica: de conformidad a rebeldía",
              "Identifica símbolos de resistencia y esperanza en sociedades opresivas",
              "Compara diferentes formas de rebelión en distintas distopías juveniles"
            ]
          }
        ]
      },
      {
        "key": "fantasia_ciencia_ficcion_juvenil",
        "name": "Fantasía y Ciencia Ficción Juvenil",
        "short_description": "Análisis de mundos imaginarios, magia, tecnología futurista en literatura para jóvenes.",
        "sub_topics": [
          {
            "key": "fantasia_epica",
            "name": "Fantasía Épica",
            "short_description": "Estudio de mundos fantásticos, misiones heroicas, magia y criaturas míticas.",
            "example_tasks": [
              "Lee una saga de fantasía juvenil analizando la construcción del mundo fantástico",
              "Identifica arquetipos: héroe, mentor, compañeros de aventura, villano",
              "Analiza el viaje del héroe en narrativa fantástica contemporánea"
            ]
          },
          {
            "key": "ciencia_ficcion_tecnologia",
            "name": "Ciencia Ficción y Tecnología",
            "short_description": "Análisis de especulación sobre avances científicos y sus consecuencias sociales.",
            "example_tasks": [
              "Lee ciencia ficción juvenil sobre inteligencia artificial, realidad virtual, exploración espacial",
              "Analiza cómo la ciencia ficción reflexiona sobre dilemas éticos de la tecnología",
              "Identifica críticas sociales en narrativa de ciencia ficción"
            ]
          }
        ]
      },
      {
        "key": "temas_contemporaneos_juveniles",
        "name": "Temas Contemporáneos",
        "short_description": "Estudio de problemas actuales en literatura juvenil: salud mental, ecología, justicia social.",
        "sub_topics": [
          {
            "key": "salud_mental",
            "name": "Salud Mental",
            "short_description": "Análisis de obras que abordan depresión, ansiedad, trauma con sensibilidad.",
            "example_tasks": [
              "Lee una novela juvenil sobre salud mental analizando cómo se representa el tema",
              "Identifica el tratamiento responsable y desestigmatizador de problemas psicológicos",
              "Analiza cómo la literatura puede ayudar a comprender experiencias de salud mental"
            ]
          },
          {
            "key": "justicia_social",
            "name": "Justicia Social y Activismo",
            "short_description": "Estudio de obras sobre racismo, desigualdad, activismo juvenil.",
            "example_tasks": [
              "Lee literatura juvenil que aborde temas de justicia racial o social",
              "Analiza cómo se representa el activismo y la participación juvenil",
              "Identifica mensajes sobre responsabilidad social y cambio"
            ]
          },
          {
            "key": "crisis_climatica",
            "name": "Crisis Climática y Ecología",
            "short_description": "Análisis de narrativas sobre cambio climático y conciencia ambiental.",
            "example_tasks": [
              "Lee ficción climática (cli-fi) juvenil sobre futuros afectados por cambio climático",
              "Analiza cómo la literatura representa la crisis ecológica",
              "Identifica mensajes sobre responsabilidad ambiental y esperanza"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "elementos_narrativos",
    "name": "Elementos Narrativos",
    "short_description": "Estudio profundo de los componentes de la narración: narrador, personaje, trama, espacio y tiempo.",
    "sub_topics": [
      {
        "key": "tipos_narrador",
        "name": "Tipos de Narrador",
        "short_description": "Análisis de las diferentes perspectivas narrativas y su efecto en la historia.",
        "sub_topics": [
          {
            "key": "narrador_primera_persona",
            "name": "Narrador en Primera Persona",
            "short_description": "Estudio del narrador que cuenta su propia historia o la que presenció.",
            "example_tasks": [
              "Identifica narradores en primera persona en cuentos de Juan Rulfo y analiza su confiabilidad",
              "Compara un narrador protagonista (cuenta su historia) con un narrador testigo (cuenta la historia de otro)",
              "Analiza las ventajas y limitaciones de la primera persona: subjetividad, conocimiento limitado"
            ]
          },
          {
            "key": "narrador_tercera_persona",
            "name": "Narrador en Tercera Persona",
            "short_description": "Análisis de narradores externos: omnisciente, observador, con conocimiento limitado.",
            "example_tasks": [
              "Identifica un narrador omnisciente que conoce pensamientos de todos los personajes",
              "Compara narrador omnisciente con narrador observador que solo describe acciones externas",
              "Analiza cómo el narrador en tercera persona con focalización interna accede a la mente de un personaje"
            ]
          },
          {
            "key": "narrador_segunda_persona",
            "name": "Narrador en Segunda Persona",
            "short_description": "Estudio del narrador que se dirige al lector o a un personaje como 'tú'.",
            "example_tasks": [
              "Analiza el uso de la segunda persona en 'Aura' de Carlos Fuentes y su efecto",
              "Identifica cómo el 'tú' involucra al lector o crea distanciamiento del personaje consigo mismo",
              "Compara el efecto de la segunda persona con primera y tercera persona"
            ]
          },
          {
            "key": "narradores_multiples",
            "name": "Narradores Múltiples",
            "short_description": "Análisis de obras con varios narradores que ofrecen diferentes perspectivas.",
            "example_tasks": [
              "Identifica los diferentes narradores en 'Pedro Páramo' de Juan Rulfo",
              "Analiza cómo múltiples perspectivas enriquecen o complican la comprensión de la historia",
              "Compara una narración con un solo narrador vs. múltiples narradores"
            ]
          },
          {
            "key": "narrador_no_confiable",
            "name": "Narrador No Confiable",
            "short_description": "Estudio de narradores cuya versión de los hechos es cuestionable o parcial.",
            "example_tasks": [
              "Identifica señales de que un narrador puede ser no confiable: contradicciones, exageraciones, locura",
              "Analiza por qué un autor usaría un narrador no confiable y qué efecto crea",
              "Compara la versión del narrador con evidencias del texto que la contradicen"
            ]
          }
        ]
      },
      {
        "key": "personajes_profundidad",
        "name": "Personajes y Caracterización",
        "short_description": "Análisis de la construcción y función de personajes en la narrativa.",
        "sub_topics": [
          {
            "key": "personajes_redondos_planos",
            "name": "Personajes Redondos y Planos",
            "short_description": "Estudio de personajes complejos que evolucionan vs. personajes simples y estáticos.",
            "example_tasks": [
              "Identifica personajes redondos en 'Pedro Páramo' que muestran complejidad psicológica",
              "Compara personajes planos (una sola característica) con personajes redondos (multifacéticos)",
              "Analiza la evolución de un personaje redondo a lo largo de una novela"
            ]
          },
          {
            "key": "protagonista_antagonista",
            "name": "Protagonista y Antagonista",
            "short_description": "Análisis de personajes principales y sus oponentes en el conflicto narrativo.",
            "example_tasks": [
              "Identifica protagonista y antagonista en una obra y describe su conflicto central",
              "Analiza casos donde el antagonista no es una persona sino una fuerza (naturaleza, sociedad, destino)",
              "Compara un protagonista heroico tradicional con un antihéroe"
            ]
          },
          {
            "key": "metodos_caracterizacion",
            "name": "Métodos de Caracterización",
            "short_description": "Estudio de cómo se revelan los rasgos de los personajes: directa e indirecta.",
            "example_tasks": [
              "Identifica caracterización directa: narrador describe explícitamente rasgos del personaje",
              "Analiza caracterización indirecta: rasgos revelados por acciones, diálogos, pensamientos, reacciones de otros",
              "Compara la efectividad de mostrar vs. decir en la construcción de personajes"
            ]
          },
          {
            "key": "arquetipos_personajes",
            "name": "Arquetipos de Personajes",
            "short_description": "Análisis de tipos universales: héroe, mentor, sombra, embaucador.",
            "example_tasks": [
              "Identifica arquetipos en una narrativa: héroe, mentor sabio, guardián del umbral",
              "Analiza cómo autores contemporáneos subvierten arquetipos tradicionales",
              "Compara un arquetipo clásico con su versión moderna o mexicana"
            ]
          }
        ]
      },
      {
        "key": "trama_estructura",
        "name": "Trama y Estructura",
        "short_description": "Estudio de la organización de acontecimientos y la estructura narrativa.",
        "sub_topics": [
          {
            "key": "estructura_clasica",
            "name": "Estructura Clásica",
            "short_description": "Análisis de la organización tradicional: exposición, desarrollo, clímax, desenlace.",
            "example_tasks": [
              "Identifica las cinco partes de la estructura clásica en un cuento tradicional",
              "Dibuja un diagrama de la pirámide de Freytag para una obra narrativa",
              "Compara una estructura lineal clásica con una estructura experimental"
            ]
          },
          {
            "key": "in_medias_res",
            "name": "In Medias Res",
            "short_description": "Estudio de narraciones que comienzan en medio de la acción.",
            "example_tasks": [
              "Identifica obras que comienzan in medias res y analiza el efecto en el lector",
              "Reconstruye el orden cronológico de una historia que comienza en medio",
              "Compara el comienzo in medias res con el comienzo ab ovo (desde el principio)"
            ]
          },
          {
            "key": "estructura_circular",
            "name": "Estructura Circular",
            "short_description": "Análisis de narraciones que terminan donde comenzaron.",
            "example_tasks": [
              "Identifica la estructura circular en 'Pedro Páramo' o 'Piedra de sol' de Octavio Paz",
              "Analiza el significado simbólico de la circularidad: repetición, destino cíclico",
              "Compara estructura lineal con estructura circular en sus efectos narrativos"
            ]
          },
          {
            "key": "estructura_fragmentada",
            "name": "Estructura Fragmentada",
            "short_description": "Estudio de narraciones no lineales con saltos temporales y episodios dispersos.",
            "example_tasks": [
              "Analiza la estructura fragmentada de 'Cartucho' de Nellie Campobello",
              "Identifica flashbacks, flashforwards y analepsis en narrativas contemporáneas",
              "Reconstruye la cronología de una historia fragmentada y analiza por qué el autor la desordenó"
            ]
          },
          {
            "key": "tramas_multiples",
            "name": "Tramas Múltiples",
            "short_description": "Análisis de obras con varias historias paralelas que se entrelazan.",
            "example_tasks": [
              "Identifica las diferentes tramas en 'La región más transparente' de Carlos Fuentes",
              "Analiza cómo se entrelazan las tramas y qué temas comunes las conectan",
              "Compara una trama única con tramas múltiples en términos de complejidad"
            ]
          }
        ]
      },
      {
        "key": "espacio_narrativo_profundo",
        "name": "Espacio Narrativo",
        "short_description": "Análisis del papel del espacio físico y simbólico en la narración.",
        "sub_topics": [
          {
            "key": "espacio_fisico_geografico",
            "name": "Espacio Físico y Geográfico",
            "short_description": "Estudio de lugares concretos donde ocurre la acción y su función narrativa.",
            "example_tasks": [
              "Analiza la importancia de Comala en 'Pedro Páramo' como espacio físico y simbólico",
              "Identifica cómo la descripción del espacio crea atmósfera en 'Luvina' de Juan Rulfo",
              "Compara espacios rurales y urbanos en literatura mexicana y su significado"
            ]
          },
          {
            "key": "espacio_simbolico",
            "name": "Espacio Simbólico",
            "short_description": "Análisis de lugares como símbolos o representaciones de estados psicológicos.",
            "example_tasks": [
              "Analiza Macondo en 'Cien años de soledad' como espacio mítico y simbólico",
              "Identifica espacios cerrados (casa, habitación) como símbolos de opresión o aislamiento",
              "Compara espacios abiertos (campo, mar) con cerrados en su valor simbólico"
            ]
          },
          {
            "key": "cronotopo",
            "name": "Cronotopo",
            "short_description": "Estudio de la relación espacio-tiempo característica de géneros o épocas.",
            "example_tasks": [
              "Identifica el cronotopo del camino en narrativa de viaje o formación",
              "Analiza el cronotopo de la casa ancestral en novelas familiares",
              "Compara cronotopos diferentes en obras de distintos géneros"
            ]
          }
        ]
      },
      {
        "key": "tiempo_narrativo_profundo",
        "name": "Tiempo Narrativo",
        "short_description": "Análisis del manejo temporal en la narración: orden, duración, frecuencia.",
        "sub_topics": [
          {
            "key": "orden_temporal",
            "name": "Orden Temporal",
            "short_description": "Estudio de anacronías: retrospecciones (flashback) y anticipaciones (flashforward).",
            "example_tasks": [
              "Identifica analepsis (flashback) en 'Aura' de Carlos Fuentes y su función",
              "Analiza prolepsis (anticipación) y cómo crea suspense o ironía",
              "Reconstruye la línea temporal cronológica de una narración con anacronías"
            ]
          },
          {
            "key": "duracion_narrativa",
            "name": "Duración Narrativa",
            "short_description": "Análisis de la relación entre tiempo de la historia y tiempo del relato.",
            "example_tasks": [
              "Identifica escenas (tiempo relato = tiempo historia) en una narración",
              "Analiza sumarios: años resumidos en párrafos, aceleración temporal",
              "Identifica pausas descriptivas donde el tiempo de la historia se detiene"
            ]
          },
          {
            "key": "frecuencia_narrativa",
            "name": "Frecuencia Narrativa",
            "short_description": "Estudio de cuántas veces se narra un acontecimiento que ocurrió una o varias veces.",
            "example_tasks": [
              "Identifica narración singulativa: contar una vez lo que pasó una vez",
              "Analiza narración repetitiva: contar varias veces lo que pasó una vez (diferentes perspectivas)",
              "Identifica narración iterativa: contar una vez lo que pasó varias veces (rutinas)"
            ]
          },
          {
            "key": "tiempo_psicologico",
            "name": "Tiempo Psicológico",
            "short_description": "Análisis del tiempo subjetivo según la percepción de los personajes.",
            "example_tasks": [
              "Analiza cómo el tiempo se dilata en momentos de tensión o se contrae en momentos tediosos",
              "Identifica la representación del tiempo en la memoria: fragmentado, distorsionado",
              "Compara tiempo cronológico objetivo con tiempo psicológico subjetivo"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "figuras_retoricas_recursos_literarios",
    "name": "Figuras Retóricas y Recursos Literarios",
    "short_description": "Estudio de recursos estilísticos que embellecen el lenguaje y crean efectos expresivos.",
    "sub_topics": [
      {
        "key": "figuras_comparacion",
        "name": "Figuras de Comparación",
        "short_description": "Análisis de recursos que establecen semejanzas: símil, metáfora, alegoría.",
        "sub_topics": [
          {
            "key": "simil_comparacion",
            "name": "Símil o Comparación",
            "short_description": "Estudio de la comparación explícita entre dos elementos mediante nexos (como, cual, parece).",
            "example_tasks": [
              "Identifica símiles en poemas de Sor Juana Inés de la Cruz o Octavio Paz",
              "Analiza la función del símil: aclarar, embellecer, sorprender",
              "Crea cinco símiles originales usando diferentes nexos comparativos"
            ]
          },
          {
            "key": "metafora_identificacion",
            "name": "Metáfora",
            "short_description": "Análisis de la identificación implícita entre dos términos sin nexo comparativo.",
            "example_tasks": [
              "Identifica metáforas en poesía de Ramón López Velarde: 'sus ojos eran dos alacenas'",
              "Diferencia metáfora pura (solo imagen) de metáfora impura (término real + imagen)",
              "Interpreta metáforas complejas explicando la relación entre los términos"
            ]
          },
          {
            "key": "alegoria",
            "name": "Alegoría",
            "short_description": "Estudio de narraciones o textos con significado literal y significado simbólico.",
            "example_tasks": [
              "Analiza 'La Divina Comedia' de Dante como alegoría del viaje espiritual",
              "Identifica el nivel literal y el nivel alegórico en un texto",
              "Interpreta fábulas como alegorías con enseñanzas morales"
            ]
          }
        ]
      },
      {
        "key": "figuras_exageracion_atenuacion",
        "name": "Figuras de Exageración y Atenuación",
        "short_description": "Análisis de recursos que aumentan o disminuyen la realidad: hipérbole, lítote.",
        "sub_topics": [
          {
            "key": "hiperbole",
            "name": "Hipérbole",
            "short_description": "Estudio de la exageración desmedida para crear efecto expresivo.",
            "example_tasks": [
              "Identifica hipérboles en poesía de amor: 'lloré mares', 'esperé mil años'",
              "Analiza la función de la hipérbole: énfasis emotivo, humor, crítica",
              "Distingue hipérboles literarias de exageraciones cotidianas"
            ]
          },
          {
            "key": "litote",
            "name": "Lítote",
            "short_description": "Análisis de la atenuación que afirma algo negando lo contrario.",
            "example_tasks": [
              "Identifica lítotes: 'no es poco inteligente' (muy inteligente), 'no me disgusta' (me gusta)",
              "Analiza el efecto de suavizar o crear ironía mediante la lítote",
              "Compara lítote con eufemismo en su función atenuadora"
            ]
          }
        ]
      },
      {
        "key": "figuras_sustitucion",
        "name": "Figuras de Sustitución",
        "short_description": "Estudio de recursos que sustituyen términos: metonimia, sinécdoque, perífrasis.",
        "sub_topics": [
          {
            "key": "metonimia",
            "name": "Metonimia",
            "short_description": "Análisis de la sustitución de un término por otro con el que tiene relación de contigüidad.",
            "example_tasks": [
              "Identifica metonimias: 'leer a Cervantes' (sus obras), 'respetar las canas' (ancianos)",
              "Clasifica tipos de metonimia: autor por obra, continente por contenido, causa por efecto",
              "Analiza la función de la metonimia: economía expresiva, elegancia"
            ]
          },
          {
            "key": "sinecdoque",
            "name": "Sinécdoque",
            "short_description": "Estudio de la sustitución de la parte por el todo o viceversa.",
            "example_tasks": [
              "Identifica sinécdoques: 'diez cabezas de ganado', 'México ganó el partido'",
              "Diferencia sinécdoque (relación de inclusión) de metonimia (relación de contigüidad)",
              "Analiza sinécdoques en textos literarios y su efecto"
            ]
          },
          {
            "key": "perifrasis",
            "name": "Perífrasis o Circunlocución",
            "short_description": "Análisis de expresar con varias palabras lo que podría decirse con una.",
            "example_tasks": [
              "Identifica perífrasis: 'el ave de Júpiter' (águila), 'el astro rey' (sol)",
              "Analiza la función: embellecer, evitar repetición, crear misterio",
              "Compara perífrasis con expresión directa evaluando efectos estilísticos"
            ]
          }
        ]
      },
      {
        "key": "figuras_oposicion",
        "name": "Figuras de Oposición",
        "short_description": "Estudio de recursos que presentan contrarios: antítesis, paradoja, oxímoron.",
        "sub_topics": [
          {
            "key": "antitesis",
            "name": "Antítesis",
            "short_description": "Análisis de la oposición de ideas o palabras contrarias.",
            "example_tasks": [
              "Identifica antítesis en sonetos de Sor Juana: vida/muerte, amor/olvido",
              "Analiza cómo la antítesis crea tensión o enfatiza contrastes",
              "Crea antítesis sobre temas como amor, tiempo, naturaleza"
            ]
          },
          {
            "key": "paradoja",
            "name": "Paradoja",
            "short_description": "Estudio de afirmaciones aparentemente contradictorias que expresan verdad profunda.",
            "example_tasks": [
              "Identifica paradojas: 'vivo sin vivir en mí', 'moriré de no morir'",
              "Analiza la paradoja mística en poesía de San Juan de la Cruz",
              "Interpreta paradojas explicando la verdad que encierran"
            ]
          },
          {
            "key": "oximoron",
            "name": "Oxímoron",
            "short_description": "Análisis de la unión de términos contradictorios en una misma expresión.",
            "example_tasks": [
              "Identifica oxímoros: 'música callada', 'soledad sonora', 'dulce tormento'",
              "Analiza la función del oxímoron: crear sorpresa, expresar complejidad",
              "Diferencia oxímoron (unión de contrarios) de antítesis (oposición de contrarios)"
            ]
          }
        ]
      },
      {
        "key": "figuras_repeticion",
        "name": "Figuras de Repetición",
        "short_description": "Estudio de recursos que repiten elementos: anáfora, paralelismo, aliteración.",
        "sub_topics": [
          {
            "key": "anafora",
            "name": "Anáfora",
            "short_description": "Análisis de la repetición de palabras al inicio de versos o frases.",
            "example_tasks": [
              "Identifica anáforas en poesía de Octavio Paz o Pablo Neruda",
              "Analiza la función de la anáfora: énfasis, ritmo, estructura",
              "Crea un poema breve utilizando anáfora de forma efectiva"
            ]
          },
          {
            "key": "paralelismo",
            "name": "Paralelismo",
            "short_description": "Estudio de la repetición de estructuras sintácticas similares.",
            "example_tasks": [
              "Identifica paralelismos en poesía náhuatl: estructuras paralelas que expresan ideas relacionadas",
              "Analiza cómo el paralelismo crea ritmo y simetría",
              "Compara paralelismo sintáctico con paralelismo semántico"
            ]
          },
          {
            "key": "aliteracion",
            "name": "Aliteración",
            "short_description": "Análisis de la repetición de sonidos consonánticos para crear efectos sonoros.",
            "example_tasks": [
              "Identifica aliteraciones que imitan sonidos: 'el silbo de los aires amorosos'",
              "Analiza cómo la aliteración crea musicalidad o imita efectos naturales",
              "Crea versos con aliteración que evoquen diferentes sensaciones sonoras"
            ]
          },
          {
            "key": "polisindeton_asindeton",
            "name": "Polisíndeton y Asíndeton",
            "short_description": "Estudio de repetición abundante o eliminación de conjunciones.",
            "example_tasks": [
              "Identifica polisíndeton: uso abundante de 'y' para alargar, enfatizar",
              "Identifica asíndeton: eliminación de conjunciones para dinamismo, rapidez",
              "Compara el efecto de polisíndeton (lentitud) vs. asíndeton (velocidad)"
            ]
          }
        ]
      },
      {
        "key": "figuras_atribucion",
        "name": "Figuras de Atribución",
        "short_description": "Análisis de recursos que atribuyen cualidades: personificación, cosificación, sinestesia.",
        "sub_topics": [
          {
            "key": "personificacion_prosopopeya",
            "name": "Personificación o Prosopopeya",
            "short_description": "Estudio de la atribución de cualidades humanas a seres inanimados o abstractos.",
            "example_tasks": [
              "Identifica personificaciones en poesía romántica: 'la luna me sonríe', 'el viento susurra'",
              "Analiza la función de humanizar la naturaleza o conceptos abstractos",
              "Crea personificaciones de elementos naturales mexicanos"
            ]
          },
          {
            "key": "sinestesia",
            "name": "Sinestesia",
            "short_description": "Análisis de la mezcla de sensaciones de diferentes sentidos.",
            "example_tasks": [
              "Identifica sinestesias: 'colores chillones', 'dulce melodía', 'áspera voz'",
              "Analiza sinestesias en poesía modernista y simbolista",
              "Crea sinestesias combinando diferentes sentidos de forma original"
            ]
          },
          {
            "key": "apostrofe",
            "name": "Apóstrofe",
            "short_description": "Estudio de la invocación o llamado a seres ausentes, muertos, abstractos.",
            "example_tasks": [
              "Identifica apóstrofes: 'Oh muerte, ¿dónde está tu victoria?'",
              "Analiza la función emotiva del apóstrofe en poesía lírica",
              "Compara apóstrofe a seres personificados con invocación a personas ausentes"
            ]
          }
        ]
      },
      {
        "key": "ironia_sarcasmo",
        "name": "Ironía y Sarcasmo",
        "short_description": "Estudio de expresar lo contrario de lo que se quiere decir para criticar o crear humor.",
        "sub_topics": [
          {
            "key": "ironia_verbal",
            "name": "Ironía Verbal",
            "short_description": "Análisis de decir lo opuesto de lo que se piensa con intención crítica o humorística.",
            "example_tasks": [
              "Identifica ironía en textos satíricos o críticos: 'qué inteligente' (cuando alguien hace algo tonto)",
              "Analiza marcadores de ironía: contexto, tono, exageración",
              "Diferencia ironía suave (humorística) de sarcasmo (mordaz, cruel)"
            ]
          },
          {
            "key": "ironia_dramatica",
            "name": "Ironía Dramática",
            "short_description": "Estudio de la situación donde el público sabe algo que los personajes ignoran.",
            "example_tasks": [
              "Identifica ironía dramática en 'Edipo Rey': el público sabe la verdad que Edipo busca",
              "Analiza cómo la ironía dramática crea tensión o anticipación",
              "Compara ironía dramática con ironía verbal en sus efectos"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "analisis_lenguaje_estilo",
    "name": "Análisis del Lenguaje y Estilo",
    "short_description": "Estudio de niveles de lenguaje, registro, tono y características estilísticas de autores y épocas.",
    "sub_topics": [
      {
        "key": "niveles_lenguaje",
        "name": "Niveles de Lenguaje",
        "short_description": "Análisis de variedades del español según situación comunicativa y usuarios.",
        "sub_topics": [
          {
            "key": "lenguaje_culto_literario",
            "name": "Lenguaje Culto y Literario",
            "short_description": "Estudio del registro formal elevado con vocabulario rico y estructuras complejas.",
            "example_tasks": [
              "Identifica lenguaje culto en ensayos de Octavio Paz o Alfonso Reyes",
              "Analiza vocabulario especializado, cultismos, sintaxis elaborada",
              "Compara lenguaje literario elevado con lenguaje cotidiano"
            ]
          },
          {
            "key": "lenguaje_coloquial",
            "name": "Lenguaje Coloquial",
            "short_description": "Análisis del registro informal usado en conversaciones cotidianas.",
            "example_tasks": [
              "Identifica lenguaje coloquial en diálogos de narrativa contemporánea",
              "Analiza modismos, muletillas, expresiones familiares mexicanas",
              "Compara diálogos formales con coloquiales en una misma obra"
            ]
          },
          {
            "key": "lenguaje_vulgar_regionalismo",
            "name": "Lenguaje Vulgar y Regionalismos",
            "short_description": "Estudio de variedades dialectales, rurales o con desviaciones de la norma.",
            "example_tasks": [
              "Identifica regionalismos mexicanos en cuentos de Juan Rulfo",
              "Analiza la función de dialectos o hablas regionales en caracterización de personajes",
              "Compara el uso de lenguaje popular en literatura realista vs. costumbrista"
            ]
          }
        ]
      },
      {
        "key": "registro_tono",
        "name": "Registro y Tono",
        "short_description": "Análisis de la actitud del autor hacia el tema y el lector.",
        "sub_topics": [
          {
            "key": "tono_serio_solemne",
            "name": "Tono Serio y Solemne",
            "short_description": "Estudio de obras con tratamiento grave de temas importantes.",
            "example_tasks": [
              "Identifica tono solemne en poesía de Ramón López Velarde sobre la patria",
              "Analiza recursos que crean solemnidad: vocabulario elevado, referencias cultas",
              "Compara tono solemne en tragedia con tono ligero en comedia"
            ]
          },
          {
            "key": "tono_ironico_satirico",
            "name": "Tono Irónico y Satírico",
            "short_description": "Análisis de actitud crítica o burlona hacia el tema tratado.",
            "example_tasks": [
              "Identifica tono satírico en crónicas de Carlos Monsiváis sobre cultura popular",
              "Analiza recursos de la sátira: exageración, parodia, ironía",
              "Compara sátira social con crítica directa evaluando efectividad"
            ]
          },
          {
            "key": "tono_melancolico_nostalgico",
            "name": "Tono Melancólico y Nostálgico",
            "short_description": "Estudio de expresión de tristeza suave o añoranza del pasado.",
            "example_tasks": [
              "Identifica tono melancólico en poesía de Manuel Acuña o José Emilio Pacheco",
              "Analiza vocabulario y temas que crean melancolía: tiempo perdido, recuerdos, ausencia",
              "Compara melancolía romántica con melancolía contemporánea"
            ]
          },
          {
            "key": "tono_objetivo_subjetivo",
            "name": "Tono Objetivo vs. Subjetivo",
            "short_description": "Análisis de distancia emocional o implicación personal del autor.",
            "example_tasks": [
              "Compara tono objetivo en reportaje periodístico con subjetivo en crónica personal",
              "Identifica marcas de subjetividad: adjetivos valorativos, expresiones emotivas",
              "Analiza la función de la objetividad en narrativa realista"
            ]
          }
        ]
      },
      {
        "key": "sintaxis_narrativa",
        "name": "Sintaxis y Construcción de Frases",
        "short_description": "Estudio de la organización de oraciones y su efecto estilístico.",
        "sub_topics": [
          {
            "key": "oraciones_largas_cortas",
            "name": "Oraciones Largas vs. Cortas",
            "short_description": "Análisis del efecto de la extensión de las oraciones en el ritmo y claridad.",
            "example_tasks": [
              "Compara estilo de Juan Rulfo (frases cortas, secas) con Carlos Fuentes (frases largas, elaboradas)",
              "Analiza cómo oraciones cortas crean rapidez o tensión",
              "Identifica períodos largos en prosa barroca y su función retórica"
            ]
          },
          {
            "key": "orden_elementos",
            "name": "Orden de Elementos Sintácticos",
            "short_description": "Estudio de hipérbaton y otras alteraciones del orden lógico.",
            "example_tasks": [
              "Identifica hipérbatos en poesía de Sor Juana Inés de la Cruz",
              "Analiza la función del hipérbaton: énfasis, rima, elegancia",
              "Compara orden lógico (sujeto-verbo-objeto) con orden poético alterado"
            ]
          }
        ]
      },
      {
        "key": "vocabulario_semantica",
        "name": "Vocabulario y Semántica",
        "short_description": "Análisis del léxico empleado y significados en el texto literario.",
        "sub_topics": [
          {
            "key": "campos_semanticos",
            "name": "Campos Semánticos",
            "short_description": "Estudio de conjuntos de palabras relacionadas por significado.",
            "example_tasks": [
              "Identifica el campo semántico de la muerte en 'Pedro Páramo' de Juan Rulfo",
              "Analiza campos semánticos dominantes en un poema y su relación con el tema",
              "Compara campos semánticos en poesía de amor vs. poesía de muerte"
            ]
          },
          {
            "key": "connotacion_denotacion",
            "name": "Connotación y Denotación",
            "short_description": "Análisis de significados literales vs. significados sugeridos o emotivos.",
            "example_tasks": [
              "Diferencia denotación (significado literal) de connotación (significados asociados)",
              "Identifica connotaciones culturales mexicanas en símbolos: nopal, maíz, águila",
              "Analiza cómo las connotaciones enriquecen el significado poético"
            ]
          },
          {
            "key": "polisemia_ambiguedad",
            "name": "Polisemia y Ambigüedad",
            "short_description": "Estudio de palabras con múltiples significados y textos con varias interpretaciones.",
            "example_tasks": [
              "Identifica palabras polisémicas que permiten múltiples lecturas",
              "Analiza ambigüedad deliberada en poesía: varios significados posibles",
              "Compara textos unívocos (un significado claro) con ambiguos (varios significados)"
            ]
          }
        ]
      },
      {
        "key": "estilos_epocas_autores",
        "name": "Estilos de Épocas y Autores",
        "short_description": "Identificación de características estilísticas de movimientos literarios y autores individuales.",
        "sub_topics": [
          {
            "key": "estilo_barroco",
            "name": "Estilo Barroco",
            "short_description": "Análisis de complejidad, ornamentación, cultismos, hipérbaton.",
            "example_tasks": [
              "Identifica características barrocas en sonetos de Sor Juana Inés de la Cruz",
              "Analiza cultismos, hipérbatos, metáforas complejas del Barroco",
              "Compara estilo barroco (ornamentado) con estilo neoclásico (sencillo)"
            ]
          },
          {
            "key": "estilo_modernista",
            "name": "Estilo Modernista",
            "short_description": "Estudio de musicalidad, sinestesia, exotismo, símbolos.",
            "example_tasks": [
              "Identifica recursos modernistas en poemas de Rubén Darío o Amado Nervo",
              "Analiza vocabulario exótico, referencias a culturas lejanas, colores",
              "Compara estilo modernista con romántico y realista"
            ]
          },
          {
            "key": "estilo_personal_autores",
            "name": "Estilo Personal de Autores",
            "short_description": "Reconocimiento de rasgos distintivos de escritores individuales.",
            "example_tasks": [
              "Identifica el estilo conciso y elíptico de Juan Rulfo",
              "Analiza la prosa barroca y experimental de Carlos Fuentes",
              "Compara estilos de dos autores contemporáneos identificando diferencias"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "interpretacion_critica_literaria",
    "name": "Interpretación y Crítica Literaria",
    "short_description": "Estudio de métodos de análisis, interpretación de temas, símbolos y enfoques críticos.",
    "sub_topics": [
      {
        "key": "temas_literarios",
        "name": "Temas Literarios",
        "short_description": "Identificación y análisis de ideas centrales recurrentes en la literatura.",
        "sub_topics": [
          {
            "key": "amor_sus_formas",
            "name": "Amor y sus Formas",
            "short_description": "Estudio de representaciones del amor: romántico, pasional, platónico, trágico.",
            "example_tasks": [
              "Compara el amor cortés medieval con el amor romántico del siglo XIX",
              "Analiza el amor trágico en 'Romeo y Julieta' vs. amor frustrado en poesía mexicana",
              "Identifica diferentes concepciones del amor en literatura de distintas épocas"
            ]
          },
          {
            "key": "muerte_trascendencia",
            "name": "Muerte y Trascendencia",
            "short_description": "Análisis de reflexiones sobre mortalidad, más allá, sentido de la vida.",
            "example_tasks": [
              "Compara el tratamiento de la muerte en poesía náhuatl con poesía española",
              "Analiza la muerte como tema central en 'Pedro Páramo' de Juan Rulfo",
              "Identifica visiones de la muerte: trágica, serena, esperanzada, absurda"
            ]
          },
          {
            "key": "identidad_busqueda",
            "name": "Identidad y Búsqueda del Yo",
            "short_description": "Estudio de la exploración de quién se es: individual, nacional, cultural.",
            "example_tasks": [
              "Analiza la búsqueda de identidad nacional en 'El laberinto de la soledad' de Octavio Paz",
              "Identifica crisis de identidad en novelas de formación juvenil",
              "Compara búsqueda de identidad individual con identidad colectiva en literatura"
            ]
          },
          {
            "key": "poder_injusticia",
            "name": "Poder e Injusticia Social",
            "short_description": "Análisis de crítica a estructuras de poder, desigualdad, opresión.",
            "example_tasks": [
              "Identifica denuncia del caciquismo en 'Pedro Páramo' de Juan Rulfo",
              "Analiza crítica social en novelas de la Revolución Mexicana",
              "Compara representación de injusticia en literatura realista vs. fantástica"
            ]
          },
          {
            "key": "tiempo_memoria",
            "name": "Tiempo y Memoria",
            "short_description": "Estudio de reflexiones sobre fugacidad, nostalgia, recuperación del pasado.",
            "example_tasks": [
              "Analiza el tema del tiempo en poesía de Sor Juana o Octavio Paz",
              "Identifica la memoria como forma de recuperar el pasado en narrativa",
              "Compara tiempo cíclico (eterno retorno) con tiempo lineal (progreso) en literatura"
            ]
          }
        ]
      },
      {
        "key": "simbolos_literarios",
        "name": "Símbolos Literarios",
        "short_description": "Interpretación de elementos que representan conceptos abstractos o significados profundos.",
        "sub_topics": [
          {
            "key": "simbolos_universales",
            "name": "Símbolos Universales",
            "short_description": "Análisis de símbolos con significados similares en diversas culturas.",
            "example_tasks": [
              "Identifica símbolos universales: luz/oscuridad (conocimiento/ignorancia), agua (vida, purificación)",
              "Analiza el viaje como símbolo de búsqueda o transformación",
              "Compara significados de símbolos universales en diferentes obras"
            ]
          },
          {
            "key": "simbolos_culturales_mexicanos",
            "name": "Símbolos Culturales Mexicanos",
            "short_description": "Estudio de símbolos específicos de la cultura mexicana.",
            "example_tasks": [
              "Analiza el nopal, el maíz o la Virgen de Guadalupe como símbolos en literatura mexicana",
              "Identifica la función de símbolos prehispánicos en poesía contemporánea",
              "Compara símbolos mexicanos con símbolos de otras culturas hispanoamericanas"
            ]
          },
          {
            "key": "simbolos_personales_autores",
            "name": "Símbolos Personales de Autores",
            "short_description": "Identificación de símbolos recurrentes característicos de un escritor.",
            "example_tasks": [
              "Analiza símbolos recurrentes en Octavio Paz: espejo, piedra, palabra",
              "Identifica símbolos personales en Juan Rulfo: lluvia, camino, murmullos",
              "Compara evolución de símbolos a lo largo de la obra de un autor"
            ]
          }
        ]
      },
      {
        "key": "contextos_literarios",
        "name": "Contextos Literarios",
        "short_description": "Análisis de factores externos que influyen en la creación e interpretación literaria.",
        "sub_topics": [
          {
            "key": "contexto_historico",
            "name": "Contexto Histórico",
            "short_description": "Estudio de cómo eventos y épocas históricas influyen en la literatura.",
            "example_tasks": [
              "Relaciona 'Los de abajo' de Mariano Azuela con la Revolución Mexicana",
              "Analiza cómo la Conquista influyó en crónicas del siglo XVI",
              "Investiga el contexto de 1968 en 'La noche de Tlatelolco' de Elena Poniatowska"
            ]
          },
          {
            "key": "contexto_biografico",
            "name": "Contexto Biográfico",
            "short_description": "Análisis de cómo la vida del autor se refleja en su obra.",
            "example_tasks": [
              "Relaciona la vida de Sor Juana Inés de la Cruz con sus poemas feministas",
              "Investiga experiencias personales de Juan Rulfo en Jalisco reflejadas en su narrativa",
              "Analiza elementos autobiográficos en 'Las batallas en el desierto' de José Emilio Pacheco"
            ]
          },
          {
            "key": "contexto_cultural_social",
            "name": "Contexto Cultural y Social",
            "short_description": "Estudio de valores, creencias y estructura social reflejados en literatura.",
            "example_tasks": [
              "Analiza valores de la sociedad porfiriana en novelas realistas mexicanas",
              "Identifica crítica a la sociedad burguesa en teatro o narrativa",
              "Compara valores culturales en literatura de diferentes épocas o regiones"
            ]
          }
        ]
      },
      {
        "key": "enfoques_criticos",
        "name": "Enfoques Críticos",
        "short_description": "Introducción a diferentes métodos de análisis e interpretación literaria.",
        "sub_topics": [
          {
            "key": "analisis_formalista",
            "name": "Análisis Formalista",
            "short_description": "Enfoque en elementos internos del texto: estructura, lenguaje, recursos literarios.",
            "example_tasks": [
              "Analiza un poema enfocándote exclusivamente en su forma: métrica, rima, figuras",
              "Identifica estructura narrativa sin considerar contexto histórico o biográfico",
              "Compara análisis formalista con análisis contextual de una misma obra"
            ]
          },
          {
            "key": "critica_sociologica",
            "name": "Crítica Sociológica",
            "short_description": "Análisis de la literatura como reflejo y crítica de la sociedad.",
            "example_tasks": [
              "Analiza 'Santa' de Federico Gamboa como crítica a la sociedad porfiriana",
              "Identifica clases sociales representadas en novelas realistas",
              "Estudia la literatura como documento social de una época"
            ]
          },
          {
            "key": "critica_feminista",
            "name": "Crítica Feminista",
            "short_description": "Estudio de representación de género, voces femeninas, patriarcado en literatura.",
            "example_tasks": [
              "Analiza 'Respuesta a Sor Filotea' como defensa del derecho de la mujer al conocimiento",
              "Identifica estereotipos de género en literatura tradicional",
              "Compara personajes femeninos en literatura escrita por hombres vs. mujeres"
            ]
          },
          {
            "key": "interpretacion_personal",
            "name": "Interpretación Personal Fundamentada",
            "short_description": "Desarrollo de lecturas propias apoyadas en evidencias textuales.",
            "example_tasks": [
              "Propón tu interpretación de un símbolo en un poema, citando versos que la apoyen",
              "Argumenta tu lectura de un personaje ambiguo justificando con acciones y diálogos",
              "Defiende tu opinión sobre el tema central de una obra con evidencias del texto"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "intertextualidad_literatura_comparada",
    "name": "Intertextualidad y Literatura Comparada",
    "short_description": "Estudio de relaciones entre textos, influencias, adaptaciones y comparación de obras de diferentes tradiciones.",
    "sub_topics": [
      {
        "key": "intertextualidad",
        "name": "Intertextualidad",
        "short_description": "Análisis de referencias, citas y diálogos entre textos literarios.",
        "sub_topics": [
          {
            "key": "citas_alusiones",
            "name": "Citas y Alusiones",
            "short_description": "Identificación de referencias explícitas o implícitas a otros textos.",
            "example_tasks": [
              "Identifica citas de otros autores o textos en ensayos de Octavio Paz",
              "Analiza alusiones mitológicas en poesía modernista mexicana",
              "Investiga referencias culturales o literarias en una novela contemporánea"
            ]
          },
          {
            "key": "parodia_homenaje",
            "name": "Parodia y Homenaje",
            "short_description": "Estudio de reescrituras que imitan críticamente o rinden tributo a textos previos.",
            "example_tasks": [
              "Analiza 'Don Quijote' como parodia de libros de caballerías",
              "Identifica homenajes a autores o tradiciones en literatura contemporánea",
              "Compara un texto original con su parodia identificando elementos imitados"
            ]
          },
          {
            "key": "reescrituras_adaptaciones",
            "name": "Reescrituras y Adaptaciones",
            "short_description": "Análisis de versiones modernas de mitos, cuentos clásicos o obras literarias.",
            "example_tasks": [
              "Compara un mito griego original con su reescritura contemporánea",
              "Analiza adaptaciones de cuentos de hadas identificando cambios y su significado",
              "Estudia reescrituras de mitos prehispánicos en literatura mexicana actual"
            ]
          }
        ]
      },
      {
        "key": "influencias_literarias",
        "name": "Influencias Literarias",
        "short_description": "Estudio de cómo autores y movimientos influyen en otros.",
        "sub_topics": [
          {
            "key": "influencia_europea_america",
            "name": "Influencia Europea en América",
            "short_description": "Análisis de cómo movimientos europeos impactan literatura hispanoamericana.",
            "example_tasks": [
              "Identifica influencia del Simbolismo francés en Modernismo hispanoamericano",
              "Analiza influencia del Surrealismo europeo en poetas mexicanos",
              "Compara un movimiento europeo con su adaptación latinoamericana"
            ]
          },
          {
            "key": "tradiciones_nacionales",
            "name": "Tradiciones Nacionales",
            "short_description": "Estudio de cómo autores construyen sobre tradiciones literarias propias.",
            "example_tasks": [
              "Analiza cómo Octavio Paz se relaciona con la tradición de Sor Juana",
              "Identifica influencias de Juan Rulfo en narrativa mexicana posterior",
              "Rastrea evolución de temas nacionales a través de diferentes generaciones"
            ]
          }
        ]
      },
      {
        "key": "literatura_comparada_basica",
        "name": "Literatura Comparada",
        "short_description": "Comparación de obras, autores o tradiciones de diferentes culturas o épocas.",
        "sub_topics": [
          {
            "key": "comparacion_temas_universales",
            "name": "Temas Universales en Diferentes Literaturas",
            "short_description": "Análisis de cómo diferentes culturas tratan temas similares.",
            "example_tasks": [
              "Compara el tratamiento del amor en poesía española, mexicana y latinoamericana",
              "Analiza el tema del viaje en épica griega, medieval y contemporánea",
              "Identifica similitudes y diferencias en representación de la muerte en culturas diversas"
            ]
          },
          {
            "key": "comparacion_generos",
            "name": "Comparación de Géneros",
            "short_description": "Estudio de cómo un mismo tema se trata en diferentes géneros.",
            "example_tasks": [
              "Compara el tratamiento de la Revolución Mexicana en novela, poesía y corrido",
              "Analiza un mito en versión épica, dramática y lírica",
              "Identifica ventajas de cada género para expresar determinados contenidos"
            ]
          },
          {
            "key": "dialogo_literaturas",
            "name": "Diálogo entre Literaturas",
            "short_description": "Análisis de relaciones e intercambios entre tradiciones literarias.",
            "example_tasks": [
              "Identifica el diálogo entre literatura española y mexicana en diferentes épocas",
              "Analiza intercambios entre literatura mexicana y otras latinoamericanas",
              "Compara representaciones de conquista/colonización en literaturas colonizadora y colonizada"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "escritura_creativa",
    "name": "Escritura Creativa",
    "short_description": "Desarrollo de habilidades para crear textos literarios propios en diversos géneros: narrativa, poesía, teatro.",
    "sub_topics": [
      {
        "key": "proceso_escritura",
        "name": "Proceso de Escritura",
        "short_description": "Estudio de las etapas de creación literaria: planificación, escritura, revisión.",
        "sub_topics": [
          {
            "key": "generacion_ideas",
            "name": "Generación de Ideas",
            "short_description": "Técnicas para encontrar temas, situaciones y personajes para escribir.",
            "example_tasks": [
              "Practica lluvia de ideas sobre experiencias personales que podrían convertirse en cuentos",
              "Utiliza preguntas detonadoras: ¿Qué pasaría si...? para generar premisas narrativas",
              "Crea un banco de ideas observando tu entorno, leyendo noticias o escuchando conversaciones"
            ]
          },
          {
            "key": "planificacion_bosquejo",
            "name": "Planificación y Bosquejo",
            "short_description": "Organización de ideas antes de escribir: esquemas, mapas mentales, escaletas.",
            "example_tasks": [
              "Elabora un esquema de cinco puntos para un cuento: situación inicial, conflicto, desarrollo, clímax, desenlace",
              "Crea fichas de personajes con características físicas, psicológicas, motivaciones",
              "Diseña un mapa mental de tu poema o cuento conectando ideas y temas principales"
            ]
          },
          {
            "key": "primer_borrador",
            "name": "Escritura del Primer Borrador",
            "short_description": "Técnicas para escribir sin autocensura excesiva, dejando fluir las ideas.",
            "example_tasks": [
              "Escribe el primer borrador de un cuento breve en una sesión sin detenerte a corregir",
              "Practica escritura libre durante 10 minutos sobre un tema sin preocuparte por errores",
              "Completa un borrador siguiendo tu esquema pero permitiéndote desviaciones espontáneas"
            ]
          },
          {
            "key": "revision_reescritura",
            "name": "Revisión y Reescritura",
            "short_description": "Proceso de mejora del texto: corrección, clarificación, pulimiento del estilo.",
            "example_tasks": [
              "Revisa tu borrador eliminando repeticiones innecesarias y fortaleciendo verbos",
              "Reescribe un párrafo mejorando descripciones y diálogos basándote en comentarios de compañeros",
              "Compara tu primer borrador con la versión final identificando mejoras realizadas"
            ]
          },
          {
            "key": "edicion_final",
            "name": "Edición Final",
            "short_description": "Corrección de aspectos formales: ortografía, puntuación, formato.",
            "example_tasks": [
              "Revisa tu texto final corrigiendo errores de ortografía y puntuación",
              "Verifica consistencia de tiempos verbales y puntos de vista narrativos",
              "Lee tu texto en voz alta para detectar problemas de ritmo o claridad"
            ]
          }
        ]
      },
      {
        "key": "escritura_narrativa",
        "name": "Escritura Narrativa",
        "short_description": "Técnicas para crear cuentos y relatos: construcción de tramas, personajes, ambientes.",
        "sub_topics": [
          {
            "key": "crear_personajes",
            "name": "Creación de Personajes",
            "short_description": "Desarrollo de personajes creíbles con motivaciones, conflictos y evolución.",
            "example_tasks": [
              "Crea un personaje principal con objetivo claro, obstáculos y características distintivas",
              "Escribe un monólogo interior revelando pensamientos y emociones de tu personaje",
              "Desarrolla la relación entre dos personajes a través de un diálogo que revele sus personalidades"
            ]
          },
          {
            "key": "construir_tramas",
            "name": "Construcción de Tramas",
            "short_description": "Organización de acontecimientos en secuencias causales interesantes.",
            "example_tasks": [
              "Desarrolla una trama con conflicto claro: un personaje quiere algo pero enfrenta obstáculos",
              "Practica distintos tipos de conflicto: persona vs. persona, persona vs. sociedad, persona vs. naturaleza",
              "Escribe un cuento con estructura no lineal usando flashbacks para revelar información crucial"
            ]
          },
          {
            "key": "describir_ambientes",
            "name": "Descripción de Ambientes",
            "short_description": "Creación de espacios vívidos que contribuyen a la atmósfera narrativa.",
            "example_tasks": [
              "Describe un lugar de tu comunidad usando detalles sensoriales que creen atmósfera específica",
              "Crea un ambiente que refleje el estado emocional de tu personaje",
              "Practica mostrar (show) vs. decir (tell): describe un lugar amenazante sin usar la palabra 'amenazante'"
            ]
          },
          {
            "key": "dialogos_efectivos",
            "name": "Escritura de Diálogos",
            "short_description": "Técnicas para crear conversaciones naturales que revelen carácter y avancen la trama.",
            "example_tasks": [
              "Escribe un diálogo entre dos personajes con objetivos opuestos creando tensión",
              "Practica diálogo que revele información sobre personajes sin descripciones explícitas",
              "Revisa diálogos eliminando muletillas innecesarias y haciendo que cada línea tenga propósito"
            ]
          },
          {
            "key": "punto_vista_narrativo",
            "name": "Elección de Punto de Vista",
            "short_description": "Decisión sobre quién cuenta la historia y cómo afecta al relato.",
            "example_tasks": [
              "Escribe la misma escena en primera persona (protagonista) y tercera persona omnisciente",
              "Practica narrador no confiable escribiendo desde perspectiva de personaje con información limitada",
              "Experimenta con segunda persona narrando una acción cotidiana como 'tú haces...'"
            ]
          }
        ]
      },
      {
        "key": "escritura_poetica",
        "name": "Escritura Poética",
        "short_description": "Creación de poemas: trabajo con imágenes, ritmo, recursos literarios.",
        "sub_topics": [
          {
            "key": "imagenes_metaforas",
            "name": "Creación de Imágenes y Metáforas",
            "short_description": "Desarrollo de comparaciones y lenguaje figurado original.",
            "example_tasks": [
              "Crea cinco metáforas originales sobre emociones: amor, tristeza, miedo, alegría",
              "Escribe un poema usando solo imágenes sensoriales sin nombrar directamente la emoción",
              "Practica sinestesia combinando sensaciones de diferentes sentidos en tus imágenes"
            ]
          },
          {
            "key": "ritmo_musicalidad",
            "name": "Ritmo y Musicalidad",
            "short_description": "Trabajo con sonidos, repeticiones y cadencias en el verso.",
            "example_tasks": [
              "Escribe un poema con rima consonante siguiendo esquema ABBA",
              "Practica aliteración creando versos donde predomine un sonido consonántico",
              "Experimenta con verso libre enfocándote en ritmo interno sin métrica fija"
            ]
          },
          {
            "key": "formas_poeticas_practicas",
            "name": "Práctica de Formas Poéticas",
            "short_description": "Escritura en formas específicas: soneto, haiku, verso libre.",
            "example_tasks": [
              "Escribe un soneto de 14 versos endecasílabos sobre un tema de tu elección",
              "Crea tres haikus sobre naturaleza siguiendo estructura de 5-7-5 sílabas",
              "Escribe un poema en verso libre experimentando con longitud de versos y espacios en blanco"
            ]
          },
          {
            "key": "temas_voz_poetica",
            "name": "Temas y Voz Poética",
            "short_description": "Desarrollo de temas personales y voz poética propia.",
            "example_tasks": [
              "Escribe un poema sobre un objeto cotidiano descubriendo significados profundos",
              "Desarrolla tu voz poética escribiendo sobre experiencias personales auténticas",
              "Practica distintos tonos: melancólico, celebratorio, irónico, meditativo"
            ]
          }
        ]
      },
      {
        "key": "escritura_dramatica",
        "name": "Escritura Dramática",
        "short_description": "Creación de textos teatrales: diálogos, acotaciones, conflicto escénico.",
        "sub_topics": [
          {
            "key": "dialogo_teatral",
            "name": "Diálogo Teatral",
            "short_description": "Escritura de conversaciones que revelan carácter y avanzan la acción dramática.",
            "example_tasks": [
              "Escribe una escena de dos páginas con diálogo que revele conflicto entre personajes",
              "Practica subtexto: personajes dicen una cosa pero significan otra",
              "Crea diálogos con distintos registros de lenguaje según clase social o edad de personajes"
            ]
          },
          {
            "key": "acotaciones_escenograficas",
            "name": "Acotaciones Escénicas",
            "short_description": "Escritura de indicaciones sobre acciones, gestos, escenografía.",
            "example_tasks": [
              "Escribe acotaciones que indiquen movimientos y gestos específicos de los actores",
              "Describe el espacio escénico de tu obra incluyendo mobiliario y atmósfera",
              "Balancea acotaciones necesarias sin sobrecargar el texto con indicaciones excesivas"
            ]
          },
          {
            "key": "estructura_dramatica",
            "name": "Estructura Dramática",
            "short_description": "Organización de la obra en actos y escenas con progresión del conflicto.",
            "example_tasks": [
              "Estructura una obra breve de un acto con exposición, conflicto, clímax y resolución",
              "Escribe una escena inicial que presente personajes, situación y conflicto principal",
              "Desarrolla el clímax de tu obra en una escena de máxima tensión dramática"
            ]
          }
        ]
      },
      {
        "key": "taller_literario",
        "name": "Taller Literario",
        "short_description": "Prácticas de escritura colaborativa, retroalimentación y revisión entre pares.",
        "sub_topics": [
          {
            "key": "compartir_textos",
            "name": "Compartir Textos",
            "short_description": "Presentación de trabajos propios ante el grupo para recibir comentarios.",
            "example_tasks": [
              "Lee tu cuento en voz alta al grupo prestando atención a reacciones de los oyentes",
              "Presenta un poema explicando brevemente tu intención creativa",
              "Comparte un fragmento en proceso pidiendo retroalimentación específica sobre un aspecto"
            ]
          },
          {
            "key": "retroalimentacion_constructiva",
            "name": "Retroalimentación Constructiva",
            "short_description": "Dar y recibir comentarios útiles, respetuosos y específicos sobre textos.",
            "example_tasks": [
              "Proporciona comentarios señalando fortalezas antes de sugerir mejoras",
              "Ofrece crítica específica: 'el diálogo de la página 2 no suena natural' en vez de 'no me gustó'",
              "Recibe comentarios con apertura, agradeciendo y considerando sugerencias sin ponerte a la defensiva"
            ]
          },
          {
            "key": "revision_colaborativa",
            "name": "Revisión Colaborativa",
            "short_description": "Mejora de textos basándose en comentarios y sugerencias del grupo.",
            "example_tasks": [
              "Reescribe una escena incorporando sugerencias útiles de tus compañeros",
              "Identifica patrones en comentarios recibidos para mejorar aspectos recurrentes",
              "Experimenta con revisiones propuestas comparando versiones antes y después"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "lectura_critica_comprension",
    "name": "Lectura Crítica y Comprensión",
    "short_description": "Desarrollo de habilidades para leer, comprender, analizar y evaluar textos literarios.",
    "sub_topics": [
      {
        "key": "estrategias_lectura",
        "name": "Estrategias de Lectura",
        "short_description": "Técnicas para mejorar comprensión y aprovechamiento de la lectura literaria.",
        "sub_topics": [
          {
            "key": "lectura_previa",
            "name": "Pre-lectura",
            "short_description": "Actividades antes de leer: activación de conocimientos, predicciones, objetivos.",
            "example_tasks": [
              "Antes de leer una obra, investiga brevemente sobre el autor, época y contexto",
              "Observa título, portada y contraportada haciendo predicciones sobre contenido",
              "Establece propósitos de lectura: ¿qué esperas aprender o disfrutar de este texto?"
            ]
          },
          {
            "key": "lectura_activa",
            "name": "Lectura Activa",
            "short_description": "Durante la lectura: subrayado, anotaciones, preguntas, conexiones.",
            "example_tasks": [
              "Subraya pasajes importantes y anota preguntas o reacciones en los márgenes",
              "Identifica palabras desconocidas e intenta deducir significado por contexto",
              "Toma notas sobre personajes, temas y símbolos mientras lees"
            ]
          },
          {
            "key": "lectura_posterior",
            "name": "Post-lectura",
            "short_description": "Después de leer: reflexión, análisis, síntesis, evaluación.",
            "example_tasks": [
              "Resume la obra identificando acontecimientos principales y tema central",
              "Reflexiona sobre tu reacción personal: ¿qué sentiste?, ¿qué te sorprendió?, ¿qué cuestionaste?",
              "Conecta la obra con otras lecturas, tu vida o situaciones actuales"
            ]
          }
        ]
      },
      {
        "key": "comprension_literal",
        "name": "Comprensión Literal",
        "short_description": "Identificación de información explícita en el texto.",
        "sub_topics": [
          {
            "key": "identificar_hechos",
            "name": "Identificación de Hechos",
            "short_description": "Reconocimiento de acontecimientos, personajes, lugares mencionados explícitamente.",
            "example_tasks": [
              "Elabora una línea temporal de acontecimientos principales de la obra",
              "Lista los personajes principales y secundarios con sus características explícitas",
              "Identifica dónde y cuándo ocurre la acción basándote en datos del texto"
            ]
          },
          {
            "key": "secuencia_acontecimientos",
            "name": "Secuencia de Acontecimientos",
            "short_description": "Ordenamiento cronológico de eventos, especialmente en narraciones no lineales.",
            "example_tasks": [
              "Reconstruye el orden cronológico de 'Pedro Páramo' organizando los fragmentos",
              "Identifica flashbacks y ubícalos en la secuencia temporal correcta",
              "Crea un mapa de la trama distinguiendo entre orden del relato y orden de la historia"
            ]
          }
        ]
      },
      {
        "key": "comprension_inferencial",
        "name": "Comprensión Inferencial",
        "short_description": "Deducción de información implícita, lectura entre líneas.",
        "sub_topics": [
          {
            "key": "inferir_motivaciones",
            "name": "Inferir Motivaciones",
            "short_description": "Deducción de razones, intenciones y causas de acciones de personajes.",
            "example_tasks": [
              "Deduce por qué un personaje actúa de cierta manera aunque el texto no lo diga explícitamente",
              "Infiere relaciones entre personajes basándote en diálogos y comportamientos",
              "Identifica causas implícitas de conflictos o acontecimientos"
            ]
          },
          {
            "key": "interpretar_simbolos",
            "name": "Interpretar Símbolos",
            "short_description": "Identificación de significados más allá del literal.",
            "example_tasks": [
              "Interpreta símbolos recurrentes en la obra explicando su significado profundo",
              "Deduce el tema o mensaje de la obra aunque el autor no lo declare abiertamente",
              "Identifica ironía reconociendo contradicciones entre lo dicho y lo significado"
            ]
          },
          {
            "key": "hacer_predicciones",
            "name": "Hacer Predicciones",
            "short_description": "Anticipación de acontecimientos basándose en pistas textuales.",
            "example_tasks": [
              "Durante la lectura, predice qué ocurrirá basándote en indicios previos",
              "Identifica recursos de presagio (foreshadowing) que anticipan eventos futuros",
              "Evalúa tus predicciones al terminar: ¿fueron correctas?, ¿qué pistas te engañaron?"
            ]
          }
        ]
      },
      {
        "key": "comprension_critica",
        "name": "Comprensión Crítica",
        "short_description": "Evaluación, análisis y juicio sobre la obra literaria.",
        "sub_topics": [
          {
            "key": "evaluar_calidad",
            "name": "Evaluar Calidad Literaria",
            "short_description": "Análisis de méritos artísticos, originalidad, coherencia de la obra.",
            "example_tasks": [
              "Evalúa la efectividad de recursos literarios utilizados por el autor",
              "Analiza si los personajes están bien desarrollados y son creíbles",
              "Juzga la originalidad del tema o tratamiento comparando con otras obras"
            ]
          },
          {
            "key": "valorar_mensaje",
            "name": "Valorar Mensaje y Perspectiva",
            "short_description": "Evaluación de ideas, valores, visión del mundo presentada en la obra.",
            "example_tasks": [
              "Identifica la visión del mundo del autor: ¿qué valores promueve?, ¿qué critica?",
              "Evalúa si estás de acuerdo con el mensaje de la obra y por qué",
              "Detecta posibles sesgos o perspectivas limitadas en la representación de temas"
            ]
          },
          {
            "key": "relacionar_contexto",
            "name": "Relacionar con Contexto",
            "short_description": "Conexión de la obra con realidad histórica, social, personal.",
            "example_tasks": [
              "Relaciona temas de la obra con situaciones actuales de México o el mundo",
              "Conecta experiencias de personajes con experiencias propias o de tu comunidad",
              "Analiza cómo el contexto histórico de creación influyó en la obra"
            ]
          }
        ]
      },
      {
        "key": "lectura_comparativa",
        "name": "Lectura Comparativa",
        "short_description": "Comparación de textos para identificar similitudes, diferencias y relaciones.",
        "sub_topics": [
          {
            "key": "comparar_temas",
            "name": "Comparar Temas y Motivos",
            "short_description": "Análisis de cómo diferentes autores tratan temas similares.",
            "example_tasks": [
              "Compara el tratamiento del amor en dos poemas de diferentes épocas",
              "Analiza cómo dos autores representan la muerte de manera distinta",
              "Identifica motivos recurrentes en varias obras y sus variaciones"
            ]
          },
          {
            "key": "comparar_estilos",
            "name": "Comparar Estilos",
            "short_description": "Identificación de diferencias de técnica y lenguaje entre autores.",
            "example_tasks": [
              "Compara el estilo conciso de Juan Rulfo con el barroco de Carlos Fuentes",
              "Analiza diferencias de tono entre un cuento realista y uno fantástico",
              "Identifica características estilísticas que distinguen a dos poetas"
            ]
          },
          {
            "key": "comparar_generos",
            "name": "Comparar Géneros",
            "short_description": "Análisis de cómo un tema se trata en diferentes géneros literarios.",
            "example_tasks": [
              "Compara un poema sobre la Revolución con una novela sobre el mismo tema",
              "Analiza cómo un mito se narra en épica vs. drama",
              "Identifica ventajas específicas de cada género para ciertos temas"
            ]
          }
        ]
      },
      {
        "key": "apreciacion_estetica",
        "name": "Apreciación Estética",
        "short_description": "Desarrollo del gusto literario y capacidad de disfrutar la belleza del lenguaje.",
        "sub_topics": [
          {
            "key": "sensibilidad_lenguaje",
            "name": "Sensibilidad al Lenguaje",
            "short_description": "Reconocimiento y disfrute de la belleza de palabras, sonidos, imágenes.",
            "example_tasks": [
              "Identifica pasajes de especial belleza o impacto emocional en tus lecturas",
              "Analiza qué hace que ciertos versos o frases sean memorables",
              "Lee poesía en voz alta apreciando musicalidad y ritmo"
            ]
          },
          {
            "key": "desarrollo_gusto_personal",
            "name": "Desarrollo de Gusto Personal",
            "short_description": "Formación de preferencias literarias fundamentadas.",
            "example_tasks": [
              "Identifica qué géneros, temas o estilos prefieres y explica por qué",
              "Lleva un diario de lectura registrando reacciones a diferentes obras",
              "Recomienda obras a compañeros explicando qué las hace valiosas para ti"
            ]
          },
          {
            "key": "apertura_diversidad",
            "name": "Apertura a la Diversidad",
            "short_description": "Disposición para explorar diversos estilos, épocas, culturas literarias.",
            "example_tasks": [
              "Lee obras fuera de tu zona de confort: otros géneros, épocas, culturas",
              "Identifica qué puedes apreciar incluso en obras que inicialmente no te atraen",
              "Explora literatura de autores diversos: diferentes géneros, etnias, perspectivas"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "contextos_culturales_historicos",
    "name": "Contextos Culturales e Históricos",
    "short_description": "Estudio de la relación entre literatura y su contexto: época, sociedad, movimientos culturales.",
    "sub_topics": [
      {
        "key": "literatura_sociedad",
        "name": "Literatura y Sociedad",
        "short_description": "Análisis de cómo la literatura refleja, critica o influye en la sociedad.",
        "sub_topics": [
          {
            "key": "reflejo_realidad_social",
            "name": "Reflejo de la Realidad Social",
            "short_description": "Estudio de cómo las obras representan condiciones sociales de su época.",
            "example_tasks": [
              "Analiza cómo 'Los de abajo' refleja la realidad de la Revolución Mexicana",
              "Identifica clases sociales representadas en novelas realistas del siglo XIX",
              "Estudia cómo la literatura testimonial documenta acontecimientos históricos"
            ]
          },
          {
            "key": "critica_social",
            "name": "Crítica Social",
            "short_description": "Análisis de denuncia de injusticias, desigualdades y problemas sociales.",
            "example_tasks": [
              "Identifica la crítica al caciquismo en 'Pedro Páramo' de Juan Rulfo",
              "Analiza la denuncia de explotación en novelas indigenistas",
              "Estudia cómo la sátira critica vicios sociales mediante el humor"
            ]
          },
          {
            "key": "literatura_cambio_social",
            "name": "Literatura y Cambio Social",
            "short_description": "Estudio del impacto de la literatura en conciencia y transformación social.",
            "example_tasks": [
              "Analiza cómo 'La noche de Tlatelolco' contribuyó a preservar memoria histórica",
              "Investiga el papel de corridos en difusión de ideales revolucionarios",
              "Estudia obras que promovieron debates sobre derechos, justicia o identidad"
            ]
          }
        ]
      },
      {
        "key": "literatura_historia",
        "name": "Literatura e Historia",
        "short_description": "Relación entre acontecimientos históricos y producción literaria.",
        "sub_topics": [
          {
            "key": "contexto_produccion",
            "name": "Contexto de Producción",
            "short_description": "Circunstancias históricas en que se escribe una obra.",
            "example_tasks": [
              "Investiga el contexto de la Revolución Mexicana al leer novelas del ciclo revolucionario",
              "Analiza cómo la censura colonial influyó en literatura novohispana",
              "Estudia el impacto de movimientos estudiantiles en literatura de los 60-70"
            ]
          },
          {
            "key": "representacion_historia",
            "name": "Representación de la Historia",
            "short_description": "Cómo la literatura recrea, interpreta o cuestiona el pasado.",
            "example_tasks": [
              "Analiza la representación de la Conquista en crónicas españolas vs. indígenas",
              "Compara versión histórica con versión literaria de un acontecimiento",
              "Estudia cómo novelas históricas reinterpretan el pasado desde el presente"
            ]
          },
          {
            "key": "periodizacion_literaria",
            "name": "Periodización Literaria",
            "short_description": "Organización de la literatura en épocas según características compartidas.",
            "example_tasks": [
              "Identifica características de obras del Romanticismo, Realismo, Modernismo",
              "Ubica autores y obras en su periodo histórico-literario correspondiente",
              "Analiza transiciones entre periodos: cambios graduales vs. rupturas"
            ]
          }
        ]
      },
      {
        "key": "literatura_identidad",
        "name": "Literatura e Identidad",
        "short_description": "Exploración de identidad individual, nacional y cultural en la literatura.",
        "sub_topics": [
          {
            "key": "identidad_nacional",
            "name": "Identidad Nacional",
            "short_description": "Construcción literaria de lo mexicano, la mexicanidad.",
            "example_tasks": [
              "Analiza la reflexión sobre identidad mexicana en 'El laberinto de la soledad' de Octavio Paz",
              "Identifica símbolos nacionales en 'Suave Patria' de Ramón López Velarde",
              "Estudia cómo diferentes épocas conciben la identidad nacional mexicana"
            ]
          },
          {
            "key": "identidades_regionales",
            "name": "Identidades Regionales",
            "short_description": "Representación de culturas, dialectos y tradiciones de regiones específicas.",
            "example_tasks": [
              "Analiza la representación de Jalisco en obras de Juan Rulfo",
              "Identifica elementos culturales regionales en literatura costumbrista",
              "Compara identidades regionales en obras de diferentes estados mexicanos"
            ]
          },
          {
            "key": "identidades_multiples",
            "name": "Identidades Múltiples",
            "short_description": "Exploración de género, etnia, clase social, orientación en la literatura.",
            "example_tasks": [
              "Analiza la representación de identidad femenina en obras de escritoras mexicanas",
              "Estudia la representación de comunidades indígenas en literatura contemporánea",
              "Identifica exploración de identidades diversas en literatura juvenil actual"
            ]
          }
        ]
      },
      {
        "key": "movimientos_culturales",
        "name": "Movimientos Culturales",
        "short_description": "Estudio de corrientes artísticas e intelectuales que influyen en la literatura.",
        "sub_topics": [
          {
            "key": "vanguardias_artisticas",
            "name": "Vanguardias Artísticas",
            "short_description": "Relación entre literatura y movimientos de renovación artística.",
            "example_tasks": [
              "Investiga la relación entre muralismo mexicano y literatura de los años 20-30",
              "Analiza influencia del Surrealismo en poesía mexicana",
              "Estudia diálogo entre escritores y artistas plásticos en México"
            ]
          },
          {
            "key": "corrientes_pensamiento",
            "name": "Corrientes de Pensamiento",
            "short_description": "Influencia de filosofías, ideologías políticas en la literatura.",
            "example_tasks": [
              "Analiza influencia del Positivismo en literatura porfiriana",
              "Estudia impacto de ideologías revolucionarias en literatura mexicana",
              "Identifica influencia de pensamiento feminista en literatura contemporánea"
            ]
          },
          {
            "key": "globalizacion_literatura",
            "name": "Globalización y Literatura",
            "short_description": "Impacto de intercambios culturales globales en literatura mexicana actual.",
            "example_tasks": [
              "Analiza temas transnacionales en literatura mexicana contemporánea: migración, tecnología",
              "Estudia influencia de literatura mundial en autores mexicanos actuales",
              "Identifica diálogos entre literatura mexicana y literaturas de otros países"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "medios_comunicacion_nuevas_narrativas",
    "name": "Medios de Comunicación y Nuevas Narrativas",
    "short_description": "Estudio de formas literarias en medios de comunicación y narrativas digitales emergentes.",
    "sub_topics": [
      {
        "key": "periodismo_literario",
        "name": "Periodismo Literario",
        "short_description": "Análisis de formas periodísticas con valor literario: crónica, reportaje, entrevista.",
        "sub_topics": [
          {
            "key": "cronica_periodistica_literaria",
            "name": "Crónica Periodística Literaria",
            "short_description": "Estudio de textos que combinan información periodística con técnicas narrativas literarias.",
            "example_tasks": [
              "Lee crónicas de Elena Poniatowska, Carlos Monsiváis o Juan Villoro identificando recursos literarios",
              "Analiza cómo la crónica combina hechos verificables con estilo personal del autor",
              "Compara una noticia periodística con una crónica sobre el mismo acontecimiento"
            ]
          },
          {
            "key": "reportaje_narrativo",
            "name": "Reportaje Narrativo",
            "short_description": "Análisis de investigaciones periodísticas presentadas con estructura narrativa.",
            "example_tasks": [
              "Lee un reportaje de investigación identificando estructura narrativa: personajes, escenas, diálogos",
              "Analiza cómo el reportaje mantiene objetividad periodística mientras usa recursos literarios",
              "Identifica técnicas narrativas en periodismo: descripción, caracterización, suspenso"
            ]
          },
          {
            "key": "entrevista_perfil",
            "name": "Entrevista y Perfil",
            "short_description": "Estudio de retratos de personas mediante entrevistas con elaboración literaria.",
            "example_tasks": [
              "Analiza perfiles periodísticos identificando cómo se construye el retrato del personaje",
              "Lee entrevistas de Elena Poniatowska estudiando su técnica de dar voz a entrevistados",
              "Practica escribir un perfil breve de una persona combinando entrevista, observación y contexto"
            ]
          }
        ]
      },
      {
        "key": "ensayo_periodistico",
        "name": "Ensayo Periodístico y de Opinión",
        "short_description": "Análisis de columnas, artículos de opinión y ensayos en medios de comunicación.",
        "sub_topics": [
          {
            "key": "columna_opinion",
            "name": "Columna de Opinión",
            "short_description": "Estudio de textos breves con punto de vista personal sobre temas actuales.",
            "example_tasks": [
              "Lee columnas en periódicos identificando tesis, argumentos y estilo del autor",
              "Analiza cómo columnistas mexicanos abordan temas de actualidad",
              "Practica escribir una columna breve (500 palabras) sobre un tema escolar o social"
            ]
          },
          {
            "key": "ensayo_actual",
            "name": "Ensayo sobre Temas Actuales",
            "short_description": "Análisis de ensayos publicados en revistas y suplementos culturales.",
            "example_tasks": [
              "Lee ensayos en suplementos culturales sobre literatura, arte, sociedad",
              "Analiza cómo ensayistas combinan erudición con accesibilidad para público amplio",
              "Identifica diferencias entre ensayo académico y ensayo periodístico"
            ]
          }
        ]
      },
      {
        "key": "narrativas_digitales",
        "name": "Narrativas Digitales",
        "short_description": "Estudio de formas literarias emergentes en medios digitales e internet.",
        "sub_topics": [
          {
            "key": "literatura_blogs_redes",
            "name": "Literatura en Blogs y Redes Sociales",
            "short_description": "Análisis de expresión literaria en plataformas digitales.",
            "example_tasks": [
              "Lee poesía o microrrelatos publicados en redes sociales identificando características del formato",
              "Analiza cómo la brevedad de Twitter/X influye en creación de microrrelatos",
              "Identifica autores mexicanos que usan plataformas digitales para difundir su obra"
            ]
          },
          {
            "key": "hipertexto_narrativa_interactiva",
            "name": "Hipertexto y Narrativa Interactiva",
            "short_description": "Estudio de narrativas no lineales donde el lector elige caminos.",
            "example_tasks": [
              "Explora una narrativa interactiva digital identificando puntos de decisión",
              "Analiza cómo la estructura hipertextual cambia la experiencia de lectura",
              "Compara narrativa lineal tradicional con narrativa interactiva ramificada"
            ]
          },
          {
            "key": "narrativa_multimedia",
            "name": "Narrativa Multimedia",
            "short_description": "Análisis de historias que combinan texto, imagen, audio, video.",
            "example_tasks": [
              "Analiza un reportaje multimedia identificando cómo diferentes medios contribuyen a la narrativa",
              "Estudia cómo imagen, sonido y texto se complementan en narrativas digitales",
              "Compara narrativa puramente textual con narrativa multimedia"
            ]
          }
        ]
      },
      {
        "key": "literatura_medios_audiovisuales",
        "name": "Literatura y Medios Audiovisuales",
        "short_description": "Relación entre literatura y cine, televisión, teatro adaptado.",
        "sub_topics": [
          {
            "key": "adaptaciones_cinematograficas",
            "name": "Adaptaciones Cinematográficas",
            "short_description": "Estudio de obras literarias llevadas al cine o televisión.",
            "example_tasks": [
              "Compara una novela mexicana con su adaptación cinematográfica identificando cambios",
              "Analiza qué se pierde y qué se gana al adaptar literatura a cine",
              "Identifica diferencias entre lenguaje literario y lenguaje cinematográfico"
            ]
          },
          {
            "key": "guion_narrativa",
            "name": "Guion y Narrativa",
            "short_description": "Análisis de similitudes y diferencias entre escritura de guiones y narrativa literaria.",
            "example_tasks": [
              "Compara estructura de guion cinematográfico con estructura de cuento o novela",
              "Identifica técnicas narrativas compartidas: diálogo, descripción visual, conflicto",
              "Analiza cómo guionistas mexicanos adaptan técnicas literarias al cine"
            ]
          }
        ]
      },
      {
        "key": "consumo_produccion_cultural",
        "name": "Consumo y Producción Cultural",
        "short_description": "Reflexión sobre cómo se lee, circula y valora la literatura hoy.",
        "sub_topics": [
          {
            "key": "lectura_era_digital",
            "name": "Lectura en la Era Digital",
            "short_description": "Análisis de cambios en hábitos de lectura con tecnologías digitales.",
            "example_tasks": [
              "Reflexiona sobre diferencias entre lectura en papel y lectura digital",
              "Analiza ventajas y desventajas de libros electrónicos vs. libros físicos",
              "Investiga cómo plataformas digitales facilitan o dificultan acceso a literatura"
            ]
          },
          {
            "key": "industria_editorial",
            "name": "Industria Editorial",
            "short_description": "Comprensión básica de cómo se publica y distribuye literatura.",
            "example_tasks": [
              "Investiga el proceso de publicación: del manuscrito al libro",
              "Identifica editoriales mexicanas importantes y su catálogo",
              "Analiza diferencias entre publicación tradicional y autopublicación digital"
            ]
          },
          {
            "key": "comunidades_lectoras",
            "name": "Comunidades Lectoras",
            "short_description": "Participación en espacios de lectura compartida y discusión literaria.",
            "example_tasks": [
              "Participa en un club de lectura escolar o comunitario",
              "Comparte recomendaciones literarias con compañeros explicando por qué valen la pena",
              "Explora comunidades lectoras en línea: blogs, booktubers, podcasts literarios"
            ]
          },
          {
            "key": "valor_literatura_actualidad",
            "name": "Valor de la Literatura en la Actualidad",
            "short_description": "Reflexión sobre la importancia de la literatura en el mundo contemporáneo.",
            "example_tasks": [
              "Reflexiona sobre qué aporta la literatura que otros medios no ofrecen",
              "Analiza el papel de la literatura en desarrollo de empatía, pensamiento crítico, imaginación",
              "Defiende la importancia de la lectura literaria en la era de entretenimiento digital"
            ]
          }
        ]
      }
    ]
  }
]
