[
  {
    "key": "introduccion_fisica",
    "name": "Introducción a la Física",
    "short_description": "Comprensión de la naturaleza de la física como ciencia, el método científico y la importancia de las mediciones precisas utilizando el Sistema Internacional de Unidades.",
    "sub_topics": [
      {
        "key": "naturaleza_fisica",
        "name": "Naturaleza y Campo de la Física",
        "short_description": "Exploración de qué estudia la física, sus ramas principales y su relación con otras ciencias y la vida cotidiana.",
        "sub_topics": [
          {
            "key": "que_estudia_fisica",
            "name": "¿Qué Estudia la Física?",
            "short_description": "Identificación de los fenómenos naturales que estudia la física y sus aplicaciones en la vida diaria.",
            "example_tasks": [
              "Enumera cinco fenómenos naturales que estudia la física y explica cómo cada uno afecta tu vida cotidiana.",
              "Investiga y explica la diferencia entre física clásica y física moderna, dando dos ejemplos de cada una.",
              "Describe cómo la física se relaciona con otras ciencias como la química, la biología y las matemáticas, proporcionando ejemplos específicos.",
              "Analiza un dispositivo tecnológico que uses diariamente (celular, televisión, computadora) e identifica al menos tres principios físicos que permiten su funcionamiento."
            ]
          },
          {
            "key": "ramas_fisica",
            "name": "Ramas de la Física",
            "short_description": "Conocimiento de las principales áreas de estudio de la física: mecánica, termodinámica, electromagnetismo, óptica y física moderna.",
            "example_tasks": [
              "Elabora un mapa conceptual que muestre las cinco ramas principales de la física y un ejemplo de fenómeno que estudia cada una.",
              "Clasifica los siguientes fenómenos según la rama de la física correspondiente: el arcoíris, el movimiento de un automóvil, el funcionamiento de un imán, la ebullición del agua.",
              "Investiga una aplicación tecnológica mexicana (como los paneles solares en el desierto de Sonora) e identifica qué rama de la física es más relevante para su funcionamiento.",
              "Diseña un cartel educativo que explique cómo las diferentes ramas de la física trabajan juntas en un fenómeno complejo como el funcionamiento de una central hidroeléctrica."
            ]
          }
        ]
      },
      {
        "key": "metodo_cientifico",
        "name": "Método Científico en Física",
        "short_description": "Aplicación del método científico para investigar fenómenos físicos mediante observación, hipótesis, experimentación y conclusiones.",
        "sub_topics": [
          {
            "key": "pasos_metodo_cientifico",
            "name": "Pasos del Método Científico",
            "short_description": "Comprensión y aplicación de los pasos del método científico: observación, planteamiento del problema, hipótesis, experimentación, análisis y conclusión.",
            "example_tasks": [
              "Describe cada paso del método científico y da un ejemplo de cómo aplicarías cada uno para investigar por qué una pelota rebota más en algunas superficies que en otras.",
              "Diseña un experimento siguiendo el método científico para determinar qué factores afectan el tiempo que tarda en caer un objeto desde cierta altura.",
              "Analiza el siguiente experimento: 'Se dejó caer una pelota desde diferentes alturas y se midió el tiempo de caída'. Identifica qué pasos del método científico faltan y propón cómo completarlos.",
              "Elabora un reporte científico completo sobre un experimento sencillo que hayas realizado en casa, como medir la temperatura del agua al calentarse, siguiendo todos los pasos del método científico."
            ]
          },
          {
            "key": "variables_experimentales",
            "name": "Variables Experimentales",
            "short_description": "Identificación y control de variables independientes, dependientes y controladas en experimentos físicos.",
            "example_tasks": [
              "En un experimento para medir cómo afecta la temperatura al volumen de un globo, identifica la variable independiente, dependiente y dos variables controladas.",
              "Diseña un experimento para investigar si el ángulo de lanzamiento afecta la distancia que recorre un proyectil, especificando claramente todas las variables.",
              "Explica por qué es importante mantener algunas variables constantes (controladas) cuando se realiza un experimento científico.",
              "Analiza un experimento mal diseñado donde no se controlaron las variables apropiadamente y explica cómo esto afecta la validez de los resultados."
            ]
          }
        ]
      },
      {
        "key": "magnitudes_mediciones",
        "name": "Magnitudes y Mediciones",
        "short_description": "Comprensión de las magnitudes físicas fundamentales y derivadas, así como la importancia de las mediciones precisas en la física.",
        "sub_topics": [
          {
            "key": "magnitudes_fundamentales",
            "name": "Magnitudes Fundamentales",
            "short_description": "Identificación de las siete magnitudes fundamentales del Sistema Internacional: longitud, masa, tiempo, temperatura, corriente eléctrica, cantidad de sustancia e intensidad luminosa.",
            "example_tasks": [
              "Elabora una tabla con las siete magnitudes fundamentales del SI, su unidad y su símbolo correspondiente.",
              "Mide objetos en tu salón de clases y expresa las mediciones usando las unidades fundamentales apropiadas (longitud en metros, masa en kilogramos, etc.).",
              "Explica por qué la longitud, la masa y el tiempo se consideran magnitudes fundamentales mientras que la velocidad se considera derivada.",
              "Investiga y describe cómo se define actualmente el kilogramo en el Sistema Internacional desde 2019 y por qué cambió su definición."
            ]
          },
          {
            "key": "magnitudes_derivadas",
            "name": "Magnitudes Derivadas",
            "short_description": "Comprensión de las magnitudes derivadas obtenidas de combinaciones de magnitudes fundamentales como área, volumen, velocidad y densidad.",
            "example_tasks": [
              "Calcula el área de tu salón de clases en metros cuadrados y explica por qué el área es una magnitud derivada.",
              "Determina la densidad de un objeto irregular usando su masa y volumen, expresando el resultado en kg/m³.",
              "Explica cómo las unidades de velocidad (m/s) se derivan de las unidades fundamentales de longitud y tiempo.",
              "Resuelve: Una piscina rectangular tiene 10 m de largo, 5 m de ancho y 2 m de profundidad. Calcula su volumen en m³ y en litros (1 m³ = 1000 L)."
            ]
          },
          {
            "key": "sistema_internacional",
            "name": "Sistema Internacional de Unidades (SI)",
            "short_description": "Uso correcto del Sistema Internacional de Unidades y sus prefijos para expresar cantidades muy grandes o muy pequeñas.",
            "example_tasks": [
              "Convierte las siguientes medidas a la unidad base del SI: 5 km, 250 mm, 3.5 horas, 500 g.",
              "Expresa las siguientes cantidades usando prefijos apropiados del SI: 0.000005 m, 25000000 W, 0.003 kg.",
              "La distancia de la Ciudad de México a Guadalajara es aproximadamente 550 km. Expresa esta distancia en metros, centímetros y usando notación científica.",
              "Explica por qué es importante que los científicos de todo el mundo utilicen el mismo sistema de unidades al comunicar sus resultados."
            ]
          },
          {
            "key": "instrumentos_medicion",
            "name": "Instrumentos de Medición",
            "short_description": "Identificación y uso correcto de instrumentos de medición como regla, vernier, cronómetro, balanza y termómetro.",
            "example_tasks": [
              "Describe cuatro instrumentos de medición comunes en el laboratorio de física y explica qué magnitud mide cada uno.",
              "Mide el diámetro de una moneda mexicana de 10 pesos usando una regla milimétrica y expresa el resultado con la precisión apropiada.",
              "Explica la diferencia entre exactitud y precisión en las mediciones, dando un ejemplo de cada una.",
              "Investiga qué es un vernier (calibrador) y cómo permite realizar mediciones más precisas que una regla común, incluyendo su precisión típica."
            ]
          },
          {
            "key": "notacion_cientifica",
            "name": "Notación Científica",
            "short_description": "Uso de notación científica para expresar cantidades muy grandes o muy pequeñas de manera práctica.",
            "example_tasks": [
              "Expresa las siguientes cantidades en notación científica: distancia Tierra-Sol = 150,000,000 km; tamaño de un átomo = 0.0000000001 m.",
              "Realiza las siguientes operaciones en notación científica: (3 × 10⁵) × (2 × 10³) y (8 × 10⁶) ÷ (4 × 10²).",
              "El radio de la Tierra es aproximadamente 6.371 × 10⁶ m. Calcula su diámetro y circunferencia en notación científica.",
              "Convierte los siguientes números de notación científica a notación decimal: 4.5 × 10⁻³, 2.3 × 10⁴, 7.8 × 10⁰."
            ]
          },
          {
            "key": "cifras_significativas",
            "name": "Cifras Significativas y Error Experimental",
            "short_description": "Comprensión de las cifras significativas en mediciones y cálculo del error experimental y porcentual.",
            "example_tasks": [
              "Identifica el número de cifras significativas en las siguientes mediciones: 305.0 m, 0.00420 kg, 5.60 × 10³ s.",
              "Realiza la siguiente operación respetando las reglas de cifras significativas: 12.3 m + 4.56 m + 0.789 m.",
              "Si el valor real de la aceleración de la gravedad es 9.8 m/s² y tu medición experimental fue 9.5 m/s², calcula el error absoluto y el error porcentual.",
              "Explica por qué es importante reportar los resultados experimentales con el número correcto de cifras significativas y qué información nos dan sobre la precisión de la medición."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "movimiento_rectilineo",
    "name": "Movimiento Rectilíneo",
    "short_description": "Estudio del movimiento de objetos en línea recta, incluyendo conceptos de posición, desplazamiento, velocidad, rapidez y aceleración, con representaciones gráficas.",
    "sub_topics": [
      {
        "key": "conceptos_basicos_movimiento",
        "name": "Conceptos Básicos del Movimiento",
        "short_description": "Comprensión de los conceptos fundamentales necesarios para describir el movimiento: sistema de referencia, posición, trayectoria y desplazamiento.",
        "sub_topics": [
          {
            "key": "sistema_referencia",
            "name": "Sistema de Referencia",
            "short_description": "Comprensión de que el movimiento es relativo y depende del sistema de referencia desde el cual se observe.",
            "example_tasks": [
              "Explica por qué una persona sentada en un autobús en movimiento está en reposo respecto a otros pasajeros pero en movimiento respecto a un observador en la calle.",
              "Describe el movimiento de la Luna desde tres sistemas de referencia diferentes: la Tierra, el Sol y la propia Luna.",
              "Da un ejemplo cotidiano donde el mismo objeto pueda considerarse en reposo o en movimiento dependiendo del sistema de referencia elegido.",
              "Analiza la siguiente situación: Dos trenes viajan en vías paralelas con velocidades de 80 km/h y 100 km/h en la misma dirección. Describe el movimiento de un tren respecto al otro."
            ]
          },
          {
            "key": "posicion_trayectoria",
            "name": "Posición y Trayectoria",
            "short_description": "Definición de posición como la ubicación de un objeto respecto a un sistema de referencia y trayectoria como el camino seguido.",
            "example_tasks": [
              "En un sistema de coordenadas, marca la posición de un objeto que se encuentra 5 m al este y 3 m al norte del origen.",
              "Dibuja la trayectoria de una pelota lanzada horizontalmente desde una ventana hasta que toca el suelo.",
              "Explica la diferencia entre trayectoria recta y trayectoria curva, dando dos ejemplos de cada una.",
              "Un ciclista sale de su casa, recorre 2 km al norte, luego 3 km al este y finalmente 2 km al sur. Dibuja su trayectoria y calcula la distancia total recorrida."
            ]
          },
          {
            "key": "distancia_desplazamiento",
            "name": "Distancia y Desplazamiento",
            "short_description": "Distinción entre distancia recorrida (escalar) y desplazamiento (vector) desde la posición inicial hasta la final.",
            "example_tasks": [
              "Explica con tus propias palabras la diferencia entre distancia y desplazamiento, ilustrando con un ejemplo.",
              "Un estudiante camina 40 m hacia el norte desde su salón hasta la biblioteca, y luego 30 m hacia el este hasta la cafetería. Calcula: a) la distancia total recorrida, b) el desplazamiento.",
              "¿Es posible que un objeto tenga un desplazamiento de cero pero haya recorrido una distancia considerable? Explica y da un ejemplo.",
              "Una pista circular de atletismo tiene un perímetro de 400 m. Un corredor completa una vuelta completa. Determina su distancia recorrida y su desplazamiento."
            ]
          }
        ]
      },
      {
        "key": "rapidez_velocidad",
        "name": "Rapidez y Velocidad",
        "short_description": "Comprensión de rapidez como magnitud escalar y velocidad como magnitud vectorial que indica el cambio de posición en el tiempo.",
        "sub_topics": [
          {
            "key": "rapidez",
            "name": "Rapidez Media e Instantánea",
            "short_description": "Cálculo de la rapidez media como distancia recorrida entre tiempo transcurrido y concepto de rapidez instantánea.",
            "example_tasks": [
              "Un automóvil recorre 240 km en 3 horas. Calcula su rapidez media en km/h y en m/s.",
              "Explica la diferencia entre rapidez media y rapidez instantánea usando el ejemplo de un viaje en automóvil por carretera.",
              "Durante un maratón de 42 km, un corredor tarda 3.5 horas en completarlo. Calcula su rapidez media en m/s.",
              "El velocímetro de un automóvil marca 80 km/h en cierto instante. ¿Esta lectura representa rapidez media o instantánea? Justifica tu respuesta."
            ]
          },
          {
            "key": "velocidad",
            "name": "Velocidad Media e Instantánea",
            "short_description": "Cálculo de velocidad media como desplazamiento entre tiempo, reconociendo su carácter vectorial y el concepto de velocidad instantánea.",
            "example_tasks": [
              "Un ciclista se mueve 100 m hacia el este en 20 s. Calcula su velocidad media (incluye magnitud y dirección).",
              "Explica por qué la velocidad es una magnitud vectorial mientras que la rapidez es escalar, usando ejemplos.",
              "Un avión vuela de la Ciudad de México a Cancún (1500 km al este) en 2.5 horas. Calcula su velocidad media en km/h y en m/s.",
              "¿Puede un objeto tener rapidez constante pero velocidad variable? Explica tu respuesta con un ejemplo de movimiento circular."
            ]
          },
          {
            "key": "movimiento_uniforme",
            "name": "Movimiento Rectilíneo Uniforme (MRU)",
            "short_description": "Análisis del movimiento con velocidad constante, donde la distancia recorrida es proporcional al tiempo transcurrido.",
            "example_tasks": [
              "Un tren viaja a velocidad constante de 60 km/h. ¿Qué distancia recorrerá en 45 minutos?",
              "Grafica la posición vs. tiempo para un objeto que se mueve con MRU a 5 m/s, partiendo desde x = 0 durante 10 segundos.",
              "Dos automóviles parten del mismo punto en direcciones opuestas con velocidades de 80 km/h y 100 km/h. ¿A qué distancia se encontrarán después de 2 horas?",
              "Escribe la ecuación de movimiento para un ciclista que en t = 0 está en la posición x = 10 m y se mueve con velocidad constante de 8 m/s hacia la derecha."
            ]
          }
        ]
      },
      {
        "key": "aceleracion",
        "name": "Aceleración",
        "short_description": "Comprensión de la aceleración como el cambio de velocidad en el tiempo, incluyendo aceleración positiva, negativa y nula.",
        "sub_topics": [
          {
            "key": "concepto_aceleracion",
            "name": "Concepto de Aceleración",
            "short_description": "Definición de aceleración como la variación de velocidad por unidad de tiempo y su carácter vectorial.",
            "example_tasks": [
              "Define aceleración con tus propias palabras y explica sus unidades en el Sistema Internacional (m/s²).",
              "Un automóvil aumenta su velocidad de 20 m/s a 35 m/s en 5 segundos. Calcula su aceleración.",
              "Explica la diferencia entre acelerar (aumentar velocidad), desacelerar (disminuir velocidad) y mantener velocidad constante.",
              "Da tres ejemplos de situaciones cotidianas donde experimentes aceleración: una positiva, una negativa y una relacionada con cambio de dirección."
            ]
          },
          {
            "key": "movimiento_uniformemente_acelerado",
            "name": "Movimiento Rectilíneo Uniformemente Acelerado (MRUA)",
            "short_description": "Análisis del movimiento con aceleración constante usando las ecuaciones del MRUA.",
            "example_tasks": [
              "Un automóvil parte del reposo y acelera uniformemente a 3 m/s². ¿Qué velocidad alcanzará después de 8 segundos?",
              "Escribe las tres ecuaciones principales del MRUA y explica qué representa cada variable.",
              "Un objeto con velocidad inicial de 10 m/s acelera a 2 m/s² durante 5 segundos. Calcula: a) velocidad final, b) distancia recorrida.",
              "Un motociclista que viaja a 25 m/s frena con aceleración constante de -4 m/s². Calcula el tiempo y la distancia necesarios para detenerse completamente."
            ]
          },
          {
            "key": "frenado_distancia",
            "name": "Frenado y Distancia de Detención",
            "short_description": "Aplicación de conceptos de MRUA para calcular distancias de frenado y tiempo de reacción en situaciones de seguridad vial.",
            "example_tasks": [
              "Un automóvil viaja a 90 km/h y frena con aceleración de -8 m/s². Calcula la distancia de frenado hasta detenerse. (Primero convierte la velocidad a m/s).",
              "Explica por qué la distancia de frenado aumenta considerablemente cuando aumenta la velocidad inicial del vehículo.",
              "Investiga qué es el tiempo de reacción del conductor y cómo afecta la distancia total de detención de un vehículo.",
              "Compara las distancias de frenado de un vehículo que viaja a 60 km/h vs. 120 km/h, asumiendo la misma aceleración de frenado. ¿Cómo se relaciona esto con los límites de velocidad?"
            ]
          }
        ]
      },
      {
        "key": "graficas_movimiento",
        "name": "Representaciones Gráficas del Movimiento",
        "short_description": "Interpretación y construcción de gráficas de posición-tiempo, velocidad-tiempo y aceleración-tiempo para diferentes tipos de movimiento.",
        "sub_topics": [
          {
            "key": "grafica_posicion_tiempo",
            "name": "Gráfica Posición-Tiempo",
            "short_description": "Análisis e interpretación de gráficas x vs. t para determinar velocidad, dirección de movimiento y tipo de movimiento.",
            "example_tasks": [
              "Dibuja una gráfica posición vs. tiempo para un objeto que se mueve con velocidad constante de 5 m/s durante 10 segundos, partiendo del origen.",
              "Interpreta la siguiente gráfica x vs. t: una línea recta con pendiente positiva. ¿Qué tipo de movimiento representa? ¿Cómo calcularías la velocidad?",
              "Explica qué significa que la pendiente de una gráfica x vs. t sea: a) positiva, b) negativa, c) cero, d) variable.",
              "Dada una gráfica posición-tiempo con forma de parábola, explica qué tipo de movimiento representa y cómo podrías determinar si la aceleración es positiva o negativa."
            ]
          },
          {
            "key": "grafica_velocidad_tiempo",
            "name": "Gráfica Velocidad-Tiempo",
            "short_description": "Construcción e interpretación de gráficas v vs. t, relacionando la pendiente con la aceleración y el área bajo la curva con el desplazamiento.",
            "example_tasks": [
              "Dibuja una gráfica velocidad vs. tiempo para un objeto que acelera uniformemente desde 0 hasta 20 m/s en 5 segundos.",
              "En una gráfica v vs. t, ¿qué representa: a) la pendiente de la línea? b) el área bajo la curva?",
              "Un objeto tiene una gráfica v vs. t que es una línea horizontal. ¿Qué tipo de movimiento realiza? Explica.",
              "Calcula el desplazamiento de un objeto cuya gráfica v vs. t muestra velocidad constante de 8 m/s durante 6 segundos. Usa el método del área bajo la curva."
            ]
          },
          {
            "key": "interpretacion_graficas_combinadas",
            "name": "Interpretación de Gráficas Combinadas",
            "short_description": "Análisis de múltiples representaciones gráficas del mismo movimiento y conversión entre gráficas x-t, v-t y a-t.",
            "example_tasks": [
              "Dado un movimiento con aceleración constante positiva, dibuja sus tres gráficas: posición-tiempo, velocidad-tiempo y aceleración-tiempo.",
              "Analiza una gráfica v vs. t con tres segmentos: aceleración positiva, velocidad constante y aceleración negativa. Describe el movimiento completo.",
              "A partir de una gráfica v vs. t lineal, explica cómo determinarías: a) la aceleración, b) el desplazamiento total, c) la posición final si conoces la inicial.",
              "Compara las gráficas de posición-tiempo para MRU y MRUA. Explica las diferencias en sus formas y qué información puedes obtener de cada una."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "caida_libre_tiro_vertical",
    "name": "Caída Libre y Tiro Vertical",
    "short_description": "Análisis del movimiento vertical bajo la influencia de la gravedad, incluyendo caída libre y lanzamiento vertical, aplicando las ecuaciones del MRUA.",
    "sub_topics": [
      {
        "key": "concepto_caida_libre",
        "name": "Concepto de Caída Libre",
        "short_description": "Comprensión de la caída libre como movimiento vertical con aceleración constante debida a la gravedad, despreciando la resistencia del aire.",
        "sub_topics": [
          {
            "key": "aceleracion_gravedad",
            "name": "Aceleración de la Gravedad",
            "short_description": "Conocimiento del valor de la aceleración gravitacional (g ≈ 9.8 m/s²) y su aplicación en movimientos verticales.",
            "example_tasks": [
              "Explica qué significa que la aceleración de la gravedad en la Tierra sea aproximadamente 9.8 m/s².",
              "¿Por qué todos los objetos en caída libre, independientemente de su masa, tienen la misma aceleración? Relaciona esto con los experimentos de Galileo.",
              "Calcula cuánto aumenta la velocidad de un objeto en caída libre cada segundo durante los primeros 5 segundos de su caída.",
              "Investiga cómo varía el valor de g en diferentes lugares de la Tierra y en otros planetas. ¿Cuál sería el valor de g en la Luna (aproximadamente 1.6 m/s²)?"
            ]
          },
          {
            "key": "ecuaciones_caida_libre",
            "name": "Ecuaciones de Caída Libre",
            "short_description": "Aplicación de las ecuaciones del MRUA específicamente para movimiento vertical en caída libre.",
            "example_tasks": [
              "Un objeto se deja caer desde una altura de 45 m. Calcula: a) el tiempo que tarda en llegar al suelo, b) la velocidad con la que impacta.",
              "Escribe las ecuaciones de caída libre y explica por qué la velocidad inicial es cero cuando un objeto se deja caer (sin lanzarlo).",
              "Una piedra se deja caer desde un puente. Después de 3 segundos impacta el agua. Calcula la altura del puente.",
              "Compara el tiempo de caída de dos objetos soltados desde alturas de 20 m y 80 m respectivamente. ¿Cuál es la relación entre las alturas y los tiempos?"
            ]
          },
          {
            "key": "experimentos_caida_libre",
            "name": "Experimentos Históricos y Prácticos",
            "short_description": "Análisis de experimentos clásicos sobre caída libre y diseño de experimentos sencillos para verificar principios.",
            "example_tasks": [
              "Describe el experimento legendario de Galileo en la Torre de Pisa y explica qué principio demostró sobre la caída de objetos.",
              "Diseña un experimento sencillo para medir la aceleración de la gravedad dejando caer un objeto desde diferentes alturas y midiendo tiempos.",
              "Explica por qué una pluma y un martillo caen al mismo tiempo en el vacío (como demostró el astronauta David Scott en la Luna) pero no en la Tierra.",
              "Propón un método experimental para determinar la altura de un edificio usando únicamente un cronómetro y una piedra pequeña."
            ]
          }
        ]
      },
      {
        "key": "tiro_vertical",
        "name": "Tiro Vertical",
        "short_description": "Análisis del movimiento de objetos lanzados verticalmente hacia arriba, incluyendo subida, punto máximo y caída.",
        "sub_topics": [
          {
            "key": "lanzamiento_vertical_ascendente",
            "name": "Lanzamiento Vertical Ascendente",
            "short_description": "Estudio del movimiento ascendente de un objeto lanzado hacia arriba, donde la velocidad disminuye hasta llegar a cero.",
            "example_tasks": [
              "Una pelota se lanza verticalmente hacia arriba con velocidad inicial de 20 m/s. Calcula: a) el tiempo que tarda en alcanzar su altura máxima, b) la altura máxima alcanzada.",
              "Explica por qué la velocidad de un objeto lanzado hacia arriba disminuye mientras sube, hasta llegar a cero en el punto más alto.",
              "Un cohete de juguete se lanza verticalmente con v₀ = 30 m/s. ¿A qué altura estará después de 2 segundos? ¿Estará subiendo o bajando?",
              "Demuestra que el tiempo de subida de un proyectil lanzado verticalmente es igual al tiempo de bajada desde su altura máxima."
            ]
          },
          {
            "key": "altura_maxima",
            "name": "Altura Máxima y Tiempo de Vuelo",
            "short_description": "Cálculo de la altura máxima alcanzada y el tiempo total que un objeto permanece en el aire.",
            "example_tasks": [
              "Un balón se lanza verticalmente hacia arriba con v₀ = 25 m/s. Calcula la altura máxima que alcanza.",
              "Determina el tiempo total de vuelo (subida y bajada) de un objeto lanzado verticalmente hacia arriba con velocidad inicial de 15 m/s.",
              "En el punto más alto de su trayectoria, ¿cuál es la velocidad de un objeto? ¿Cuál es su aceleración? Explica ambas respuestas.",
              "Un jugador de básquetbol salta y alcanza una altura máxima de 0.8 m sobre el suelo. Calcula con qué velocidad inicial dejó el suelo."
            ]
          },
          {
            "key": "movimiento_completo_tiro_vertical",
            "name": "Análisis Completo del Tiro Vertical",
            "short_description": "Estudio del movimiento completo: subida, punto máximo y bajada, comparando velocidades y tiempos en posiciones simétricas.",
            "example_tasks": [
              "Una piedra se lanza hacia arriba con v₀ = 30 m/s desde el suelo. Calcula su velocidad cuando regresa al punto de lanzamiento. Compara con la velocidad inicial.",
              "Demuestra que la velocidad con la que un objeto pasa por un punto al subir es igual en magnitud (pero opuesta en dirección) a la velocidad al pasar por el mismo punto al bajar.",
              "Construye una tabla mostrando posición, velocidad y tiempo para un objeto lanzado con v₀ = 20 m/s en intervalos de 0.5 segundos hasta que regresa al suelo.",
              "Un objeto se lanza hacia arriba desde una altura de 10 m con v₀ = 15 m/s. Calcula: a) altura máxima sobre el suelo, b) velocidad al impactar el suelo, c) tiempo total en el aire."
            ]
          }
        ]
      },
      {
        "key": "graficas_movimiento_vertical",
        "name": "Representaciones Gráficas del Movimiento Vertical",
        "short_description": "Construcción e interpretación de gráficas para movimientos verticales, identificando características específicas de caída libre y tiro vertical.",
        "sub_topics": [
          {
            "key": "graficas_caida_libre",
            "name": "Gráficas de Caída Libre",
            "short_description": "Análisis de gráficas posición-tiempo y velocidad-tiempo específicas para objetos en caída libre.",
            "example_tasks": [
              "Dibuja las gráficas y vs. t y v vs. t para un objeto que se deja caer desde 80 m de altura durante los primeros 4 segundos.",
              "Explica por qué la gráfica y vs. t de un objeto en caída libre tiene forma de parábola mientras que la gráfica v vs. t es una línea recta.",
              "A partir de una gráfica v vs. t de caída libre, determina: a) la aceleración, b) la distancia caída en los primeros 3 segundos.",
              "Compara las gráficas de posición-tiempo para dos objetos: uno en caída libre y otro lanzado horizontalmente. ¿En qué se parecen sus componentes verticales?"
            ]
          },
          {
            "key": "graficas_tiro_vertical",
            "name": "Gráficas de Tiro Vertical",
            "short_description": "Interpretación de gráficas para movimiento de tiro vertical, identificando fases de subida, punto máximo y descenso.",
            "example_tasks": [
              "Dibuja la gráfica v vs. t para un objeto lanzado verticalmente hacia arriba con v₀ = 20 m/s hasta que regresa al punto de lanzamiento. Identifica el punto donde v = 0.",
              "En una gráfica y vs. t de tiro vertical, identifica: a) el punto de altura máxima, b) los momentos de lanzamiento y regreso al suelo.",
              "Explica cómo se puede determinar la altura máxima de un tiro vertical a partir de su gráfica v vs. t usando el área bajo la curva.",
              "Analiza una gráfica v vs. t de tiro vertical y explica por qué la pendiente es negativa tanto durante la subida como durante la bajada."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "movimiento_dos_dimensiones",
    "name": "Movimiento en Dos Dimensiones",
    "short_description": "Estudio del movimiento en un plano, incluyendo tiro parabólico y movimiento circular uniforme, utilizando análisis vectorial y componentes de velocidad.",
    "sub_topics": [
      {
        "key": "vectores_movimiento",
        "name": "Vectores en el Movimiento",
        "short_description": "Aplicación de vectores para describir magnitudes físicas en dos dimensiones como posición, velocidad y aceleración.",
        "sub_topics": [
          {
            "key": "componentes_vectores",
            "name": "Componentes Rectangulares de Vectores",
            "short_description": "Descomposición de vectores en componentes horizontal (x) y vertical (y) utilizando funciones trigonométricas.",
            "example_tasks": [
              "Un vector velocidad tiene magnitud de 50 m/s y forma un ángulo de 30° con la horizontal. Calcula sus componentes vₓ y vᵧ.",
              "Explica cómo se calculan las componentes de un vector usando seno y coseno, ilustrando con un diagrama.",
              "Una fuerza de 100 N actúa formando 45° con el eje horizontal. Determina las componentes horizontal y vertical de esta fuerza.",
              "Si un vector tiene componentes vₓ = 12 m/s y vᵧ = 9 m/s, calcula su magnitud y el ángulo que forma con el eje horizontal."
            ]
          },
          {
            "key": "suma_vectores",
            "name": "Suma de Vectores",
            "short_description": "Aplicación de métodos gráficos y analíticos para sumar vectores en dos dimensiones.",
            "example_tasks": [
              "Suma vectorialmente dos velocidades: v₁ = 30 m/s al este y v₂ = 40 m/s al norte. Calcula la magnitud y dirección de la velocidad resultante.",
              "Explica el método del paralelogramo para sumar dos vectores gráficamente.",
              "Usando componentes, suma los vectores A = (3, 4) y B = (5, -2). Expresa el resultado en forma de componentes y como magnitud y ángulo.",
              "Un barco navega 15 km al noreste y luego 20 km al oeste. Determina su desplazamiento resultante usando suma vectorial."
            ]
          }
        ]
      },
      {
        "key": "tiro_parabolico",
        "name": "Tiro Parabólico (Movimiento de Proyectiles)",
        "short_description": "Análisis del movimiento bidimensional de proyectiles bajo la influencia de la gravedad, combinando MRU horizontal y MRUA vertical.",
        "sub_topics": [
          {
            "key": "principio_independencia",
            "name": "Principio de Independencia de Movimientos",
            "short_description": "Comprensión de que el movimiento horizontal y vertical de un proyectil son independientes y ocurren simultáneamente.",
            "example_tasks": [
              "Explica el principio de independencia de movimientos y por qué permite analizar el tiro parabólico en dos componentes separadas.",
              "Describe las características del movimiento horizontal (MRU) y vertical (MRUA) en un tiro parabólico.",
              "¿Por qué la componente horizontal de la velocidad permanece constante durante todo el vuelo del proyectil?",
              "Un proyectil se lanza horizontalmente. Explica cómo afecta la gravedad cada componente de su movimiento."
            ]
          },
          {
            "key": "lanzamiento_horizontal",
            "name": "Lanzamiento Horizontal",
            "short_description": "Análisis de proyectiles lanzados horizontalmente desde cierta altura, donde la velocidad inicial vertical es cero.",
            "example_tasks": [
              "Una pelota se lanza horizontalmente con velocidad de 15 m/s desde una altura de 20 m. Calcula: a) el tiempo de vuelo, b) el alcance horizontal.",
              "Explica por qué el tiempo de vuelo de un lanzamiento horizontal depende únicamente de la altura inicial y no de la velocidad horizontal.",
              "Desde un acantilado de 45 m de altura se lanza una piedra horizontalmente con v = 20 m/s. Determina la velocidad (magnitud y dirección) al impactar el suelo.",
              "Dibuja la trayectoria de un proyectil lanzado horizontalmente, indicando cómo varían las componentes vₓ y vᵧ de la velocidad en diferentes puntos."
            ]
          },
          {
            "key": "lanzamiento_oblicuo",
            "name": "Lanzamiento Oblicuo",
            "short_description": "Estudio del tiro parabólico con ángulo de lanzamiento, analizando altura máxima, tiempo de vuelo y alcance máximo.",
            "example_tasks": [
              "Un proyectil se lanza con velocidad inicial de 40 m/s formando un ángulo de 30° con la horizontal. Calcula las componentes inicial horizontal y vertical de la velocidad.",
              "Para el proyectil del problema anterior, determina: a) la altura máxima, b) el tiempo de vuelo, c) el alcance horizontal.",
              "Demuestra que el ángulo de lanzamiento que produce el máximo alcance horizontal es 45° (en ausencia de resistencia del aire).",
              "Un jugador de fútbol patea el balón con velocidad de 25 m/s a 53° sobre la horizontal. ¿A qué distancia debe colocarse la portería para que el balón entre justo antes de tocar el suelo?"
            ]
          },
          {
            "key": "aplicaciones_tiro_parabolico",
            "name": "Aplicaciones del Tiro Parabólico",
            "short_description": "Resolución de problemas prácticos y situaciones reales que involucran movimiento parabólico.",
            "example_tasks": [
              "Investiga cómo los atletas en lanzamiento de jabalina optimizan el ángulo de lanzamiento para maximizar la distancia. ¿Por qué no lanzan exactamente a 45°?",
              "Un bombero debe apuntar una manguera para que el agua alcance una ventana a 15 m de altura horizontal y 20 m de distancia. Si el agua sale a 25 m/s, ¿a qué ángulo debe apuntar?",
              "Explica por qué la trayectoria de un proyectil es simétrica respecto al punto de altura máxima.",
              "Analiza el movimiento de un balón de baloncesto desde que sale de las manos del jugador hasta que entra en la canasta, identificando las componentes del tiro parabólico."
            ]
          }
        ]
      },
      {
        "key": "movimiento_circular_uniforme",
        "name": "Movimiento Circular Uniforme (MCU)",
        "short_description": "Estudio del movimiento en trayectoria circular con rapidez constante, incluyendo período, frecuencia y aceleración centrípeta.",
        "sub_topics": [
          {
            "key": "conceptos_basicos_mcu",
            "name": "Conceptos Básicos del MCU",
            "short_description": "Comprensión de las características del movimiento circular uniforme y las magnitudes que lo describen.",
            "example_tasks": [
              "Explica qué significa que un objeto se mueva con movimiento circular uniforme. ¿Qué permanece constante y qué cambia?",
              "Define período (T) y frecuencia (f) en el MCU y establece la relación matemática entre ambas magnitudes.",
              "Una rueda de la fortuna completa una vuelta cada 40 segundos. Calcula: a) su período, b) su frecuencia en Hz.",
              "¿Por qué un objeto en MCU tiene velocidad variable aunque su rapidez sea constante? Explica en términos del carácter vectorial de la velocidad."
            ]
          },
          {
            "key": "velocidad_angular_tangencial",
            "name": "Velocidad Angular y Tangencial",
            "short_description": "Relación entre velocidad tangencial (lineal) y velocidad angular en el movimiento circular.",
            "example_tasks": [
              "Un punto en el borde de un disco que gira completa 120 revoluciones en 1 minuto. Calcula su velocidad angular en rad/s.",
              "Explica la diferencia entre velocidad angular (ω) y velocidad tangencial (v). ¿Cuál es la relación entre ambas?",
              "Un CD de 12 cm de diámetro gira a 500 rpm (revoluciones por minuto). Calcula la velocidad tangencial de un punto en su borde exterior.",
              "Dos puntos están ubicados a diferentes distancias del centro de un disco giratorio: uno a 10 cm y otro a 20 cm. Si ambos tienen la misma velocidad angular, ¿qué puedes decir sobre sus velocidades tangenciales?"
            ]
          },
          {
            "key": "aceleracion_centripeta",
            "name": "Aceleración Centrípeta",
            "short_description": "Comprensión de la aceleración dirigida hacia el centro que experimenta todo objeto en movimiento circular.",
            "example_tasks": [
              "Explica por qué un objeto en MCU experimenta aceleración aunque su rapidez sea constante.",
              "Un automóvil toma una curva de radio 50 m con velocidad de 20 m/s. Calcula la aceleración centrípeta.",
              "Deduce la fórmula de la aceleración centrípeta: ac = v²/r. ¿Hacia dónde está dirigida esta aceleración?",
              "Compara la aceleración centrípeta de dos objetos en MCU con la misma velocidad tangencial pero radios diferentes (10 m y 20 m). ¿Cuál experimenta mayor aceleración?"
            ]
          },
          {
            "key": "aplicaciones_mcu",
            "name": "Aplicaciones del MCU",
            "short_description": "Análisis de situaciones cotidianas y tecnológicas que involucran movimiento circular uniforme.",
            "example_tasks": [
              "Explica cómo funcionan las centrifugadoras (de laboratorio o lavadoras) utilizando los conceptos de MCU y aceleración centrípeta.",
              "Investiga por qué los satélites artificiales orbitan la Tierra en trayectorias circulares. ¿Qué proporciona la aceleración centrípeta necesaria?",
              "Un carrusel gira con período de 10 segundos. Un niño está sentado a 3 m del centro. Calcula: a) su velocidad angular, b) su velocidad tangencial, c) su aceleración centrípeta.",
              "Analiza el movimiento de las aspas de un ventilador. Compara la velocidad tangencial y la aceleración centrípeta en dos puntos: uno cerca del centro y otro en el extremo del aspa."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "fuerzas_leyes_newton",
    "name": "Fuerzas y Leyes de Newton",
    "short_description": "Estudio de las fuerzas como causantes del cambio en el estado de movimiento de los objetos, mediante las tres leyes fundamentales de Newton y sus aplicaciones.",
    "sub_topics": [
      {
        "key": "concepto_fuerza",
        "name": "Concepto de Fuerza",
        "short_description": "Comprensión de la fuerza como interacción que puede cambiar el estado de movimiento o deformar un objeto, incluyendo su carácter vectorial.",
        "sub_topics": [
          {
            "key": "definicion_fuerza",
            "name": "Definición y Características de la Fuerza",
            "short_description": "Identificación de la fuerza como magnitud vectorial medida en newtons (N) con intensidad, dirección y sentido.",
            "example_tasks": [
              "Define qué es una fuerza y menciona tres efectos que puede producir sobre un objeto.",
              "Explica por qué la fuerza es una magnitud vectorial. ¿Qué información necesitas para describir completamente una fuerza?",
              "Identifica cinco fuerzas que actúan sobre ti en este momento mientras estás sentado en tu silla.",
              "Una fuerza de 50 N actúa hacia el este y otra de 30 N hacia el norte sobre un objeto. Calcula la fuerza resultante (magnitud y dirección)."
            ]
          },
          {
            "key": "tipos_fuerzas",
            "name": "Tipos de Fuerzas",
            "short_description": "Clasificación de fuerzas en de contacto (fricción, normal, tensión) y a distancia (gravitacional, eléctrica, magnética).",
            "example_tasks": [
              "Clasifica las siguientes fuerzas como de contacto o a distancia: peso, fricción, atracción magnética, fuerza normal, tensión de una cuerda.",
              "Explica con ejemplos la diferencia entre fuerzas de contacto y fuerzas a distancia.",
              "Dibuja un diagrama de cuerpo libre para un libro sobre una mesa, identificando todas las fuerzas que actúan sobre él.",
              "Investiga qué es la fuerza normal y explica por qué se llama así. ¿Es siempre igual al peso del objeto?"
            ]
          },
          {
            "key": "diagramas_cuerpo_libre",
            "name": "Diagramas de Cuerpo Libre",
            "short_description": "Construcción de diagramas que representan todas las fuerzas que actúan sobre un objeto para facilitar el análisis.",
            "example_tasks": [
              "Dibuja el diagrama de cuerpo libre para una caja que es empujada sobre una superficie horizontal con fricción.",
              "Construye un diagrama de cuerpo libre para un semáforo colgado de dos cables que forman ángulos con la horizontal.",
              "Explica la importancia de los diagramas de cuerpo libre para resolver problemas de dinámica.",
              "Para un bloque deslizándose hacia abajo por un plano inclinado, dibuja su diagrama de cuerpo libre identificando peso, normal y fricción."
            ]
          }
        ]
      },
      {
        "key": "primera_ley_newton",
        "name": "Primera Ley de Newton (Ley de la Inercia)",
        "short_description": "Comprensión de que un objeto permanece en reposo o en movimiento rectilíneo uniforme si la fuerza neta sobre él es cero.",
        "sub_topics": [
          {
            "key": "principio_inercia",
            "name": "Principio de Inercia",
            "short_description": "Entendimiento de la inercia como la tendencia de los objetos a mantener su estado de movimiento.",
            "example_tasks": [
              "Enuncia la primera ley de Newton con tus propias palabras y da tres ejemplos cotidianos.",
              "Explica por qué los pasajeros de un autobús se inclinan hacia adelante cuando este frena bruscamente.",
              "¿Por qué es necesario usar cinturón de seguridad en los automóviles? Relaciona tu respuesta con la ley de inercia.",
              "Un astronauta en el espacio lanza una pelota. Describe su movimiento después del lanzamiento si no hay fuerzas externas actuando sobre ella."
            ]
          },
          {
            "key": "equilibrio_fuerzas",
            "name": "Equilibrio de Fuerzas",
            "short_description": "Análisis de situaciones donde la suma vectorial de fuerzas es cero, resultando en equilibrio estático o dinámico.",
            "example_tasks": [
              "Explica la diferencia entre equilibrio estático y equilibrio dinámico, dando un ejemplo de cada uno.",
              "Tres fuerzas actúan sobre un objeto: 40 N al este, 30 N al oeste y una tercera fuerza. ¿Cuál debe ser esta tercera fuerza para que el objeto esté en equilibrio?",
              "Un cuadro de 5 kg cuelga de la pared sostenido por un cable. Dibuja el diagrama de fuerzas y explica por qué está en equilibrio.",
              "Calcula la tensión en una cuerda que sostiene un semáforo de 20 kg en equilibrio suspendido verticalmente."
            ]
          }
        ]
      },
      {
        "key": "segunda_ley_newton",
        "name": "Segunda Ley de Newton (F = ma)",
        "short_description": "Relación cuantitativa entre fuerza neta, masa y aceleración, expresada matemáticamente como F = ma.",
        "sub_topics": [
          {
            "key": "relacion_fuerza_aceleracion",
            "name": "Relación entre Fuerza, Masa y Aceleración",
            "short_description": "Comprensión de que la aceleración es directamente proporcional a la fuerza neta e inversamente proporcional a la masa.",
            "example_tasks": [
              "Enuncia la segunda ley de Newton y explica el significado de cada variable en la ecuación F = ma.",
              "Una fuerza neta de 60 N actúa sobre un objeto de 15 kg. Calcula su aceleración.",
              "Si se duplica la fuerza aplicada a un objeto manteniendo su masa constante, ¿qué sucede con su aceleración? Justifica matemáticamente.",
              "Explica por qué es más difícil acelerar un automóvil que una bicicleta aplicando la misma fuerza, usando la segunda ley de Newton."
            ]
          },
          {
            "key": "aplicaciones_segunda_ley",
            "name": "Aplicaciones de F = ma",
            "short_description": "Resolución de problemas prácticos aplicando la segunda ley de Newton en diversas situaciones.",
            "example_tasks": [
              "Un objeto de 8 kg parte del reposo y alcanza una velocidad de 20 m/s en 5 segundos. Calcula la fuerza neta aplicada.",
              "Un automóvil de 1200 kg acelera de 0 a 100 km/h en 10 segundos. Determina: a) la aceleración, b) la fuerza neta necesaria.",
              "Se aplican dos fuerzas sobre un objeto de 10 kg: 50 N hacia la derecha y 20 N hacia la izquierda. Calcula: a) la fuerza neta, b) la aceleración resultante.",
              "Un elevador de 800 kg acelera hacia arriba a 2 m/s². Calcula la tensión en el cable que lo sostiene. (Considera g = 10 m/s²)."
            ]
          },
          {
            "key": "peso_masa",
            "name": "Peso y Masa",
            "short_description": "Distinción entre masa (cantidad de materia) y peso (fuerza gravitacional), aplicando W = mg.",
            "example_tasks": [
              "Explica la diferencia entre masa y peso. ¿Por qué la masa es invariable mientras que el peso puede cambiar?",
              "Calcula el peso de una persona de 60 kg en la Tierra (g = 9.8 m/s²) y en la Luna (g = 1.6 m/s²).",
              "Un astronauta tiene una masa de 80 kg. ¿Cuál es su peso en la Tierra y en Marte (g = 3.7 m/s²)?",
              "Explica por qué en el lenguaje cotidiano confundimos masa y peso (decimos 'peso 60 kilos') y por qué esto es técnicamente incorrecto."
            ]
          }
        ]
      },
      {
        "key": "tercera_ley_newton",
        "name": "Tercera Ley de Newton (Acción y Reacción)",
        "short_description": "Comprensión de que toda fuerza de acción tiene una fuerza de reacción igual en magnitud, opuesta en dirección y aplicada sobre un objeto diferente.",
        "sub_topics": [
          {
            "key": "pares_accion_reaccion",
            "name": "Pares de Acción y Reacción",
            "short_description": "Identificación de pares de fuerzas acción-reacción en diferentes situaciones físicas.",
            "example_tasks": [
              "Enuncia la tercera ley de Newton y explica por qué los pares acción-reacción nunca se anulan entre sí.",
              "Identifica el par acción-reacción en las siguientes situaciones: a) empujas una pared, b) caminas sobre el suelo, c) un libro sobre una mesa.",
              "Explica cómo funciona la propulsión de un cohete en el espacio usando la tercera ley de Newton.",
              "Cuando saltas, empujas la Tierra hacia abajo. ¿Por qué no observamos que la Tierra se mueva? Relaciona tu respuesta con la segunda ley de Newton."
            ]
          },
          {
            "key": "aplicaciones_tercera_ley",
            "name": "Aplicaciones de la Tercera Ley",
            "short_description": "Análisis de situaciones cotidianas y tecnológicas donde se manifiesta el principio de acción y reacción.",
            "example_tasks": [
              "Explica cómo puedes nadar en el agua utilizando los conceptos de acción y reacción.",
              "Describe cómo funciona un extintor de incendios o una manguera de bomberos en términos de la tercera ley de Newton.",
              "Analiza por qué retrocede una escopeta al disparar, usando el principio de acción y reacción.",
              "Investiga cómo los pájaros y aviones logran volar aplicando la tercera ley de Newton sobre el aire circundante."
            ]
          }
        ]
      },
      {
        "key": "friccion",
        "name": "Fuerza de Fricción",
        "short_description": "Estudio de la fuerza de fricción que se opone al movimiento relativo entre superficies en contacto, diferenciando fricción estática y cinética.",
        "sub_topics": [
          {
            "key": "tipos_friccion",
            "name": "Fricción Estática y Cinética",
            "short_description": "Comprensión de las diferencias entre fricción estática (antes del movimiento) y fricción cinética (durante el movimiento).",
            "example_tasks": [
              "Explica la diferencia entre fricción estática y fricción cinética. ¿Cuál es generalmente mayor?",
              "Un bloque de 10 kg está sobre una superficie horizontal. Si el coeficiente de fricción estática es 0.4, ¿qué fuerza horizontal mínima se necesita para ponerlo en movimiento?",
              "¿Por qué es más difícil empezar a mover un objeto pesado que mantenerlo en movimiento una vez iniciado?",
              "Describe tres situaciones donde la fricción sea: a) útil y deseable, b) perjudicial e indeseable."
            ]
          },
          {
            "key": "coeficiente_friccion",
            "name": "Coeficiente de Fricción",
            "short_description": "Uso del coeficiente de fricción (μ) para calcular la fuerza de fricción mediante f = μN.",
            "example_tasks": [
              "Explica qué representa el coeficiente de fricción y de qué factores depende.",
              "Un objeto de 20 kg se desliza sobre una superficie con μ = 0.3. Calcula la fuerza de fricción cinética.",
              "Se requiere una fuerza de 40 N para mantener un objeto de 10 kg deslizándose a velocidad constante. Calcula el coeficiente de fricción cinética.",
              "Investiga valores típicos de coeficientes de fricción para diferentes pares de materiales (madera-madera, acero-acero, hielo-metal)."
            ]
          },
          {
            "key": "aplicaciones_friccion",
            "name": "Aplicaciones de la Fricción",
            "short_description": "Análisis de situaciones donde la fricción juega un papel importante, tanto beneficioso como perjudicial.",
            "example_tasks": [
              "Explica cómo los frenos de un automóvil utilizan la fricción para detenerlo.",
              "Describe por qué los neumáticos tienen diseños con ranuras y qué sucede cuando se conducen con llantas desgastadas ('lisas').",
              "Analiza por qué se usan lubricantes en maquinaria y motores. ¿Qué efecto tienen sobre la fricción?",
              "Investiga cómo afecta la lluvia al coeficiente de fricción entre los neumáticos y el pavimento, y sus implicaciones para la seguridad vial."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "trabajo_potencia",
    "name": "Trabajo y Potencia",
    "short_description": "Comprensión del trabajo mecánico como el producto de fuerza por desplazamiento y la potencia como la rapidez con que se realiza trabajo.",
    "sub_topics": [
      {
        "key": "concepto_trabajo",
        "name": "Concepto de Trabajo Mecánico",
        "short_description": "Definición física de trabajo como el producto de la fuerza aplicada por el desplazamiento en la dirección de la fuerza.",
        "sub_topics": [
          {
            "key": "definicion_trabajo",
            "name": "Definición y Cálculo del Trabajo",
            "short_description": "Aplicación de la fórmula W = F·d·cos(θ) para calcular el trabajo realizado por una fuerza.",
            "example_tasks": [
              "Define trabajo mecánico en física. ¿Por qué difiere del uso cotidiano de la palabra 'trabajo'?",
              "Una fuerza de 50 N empuja una caja 10 m en la misma dirección de la fuerza. Calcula el trabajo realizado.",
              "Explica por qué no se realiza trabajo cuando: a) sostienes un libro sin moverlo, b) caminas cargando una maleta horizontalmente.",
              "Una persona empuja una pared con una fuerza de 100 N durante 5 minutos sin moverla. ¿Cuánto trabajo realiza? Justifica tu respuesta."
            ]
          },
          {
            "key": "trabajo_angulo",
            "name": "Trabajo con Ángulo",
            "short_description": "Cálculo del trabajo cuando la fuerza forma un ángulo con la dirección del desplazamiento.",
            "example_tasks": [
              "Una fuerza de 40 N actúa formando 60° con la horizontal mientras un objeto se desplaza 5 m horizontalmente. Calcula el trabajo realizado.",
              "Explica por qué el trabajo es máximo cuando la fuerza y el desplazamiento tienen la misma dirección (θ = 0°).",
              "¿Cuánto trabajo realiza la fuerza de gravedad sobre una maleta que se desplaza horizontalmente 3 m? Justifica tu respuesta.",
              "Un trineo es jalado 20 m por una cuerda que forma 30° con la horizontal con una tensión de 150 N. Calcula el trabajo realizado por la tensión."
            ]
          },
          {
            "key": "trabajo_positivo_negativo",
            "name": "Trabajo Positivo, Negativo y Nulo",
            "short_description": "Interpretación del signo del trabajo según el ángulo entre fuerza y desplazamiento.",
            "example_tasks": [
              "Explica cuándo el trabajo es: a) positivo, b) negativo, c) cero. Da un ejemplo de cada caso.",
              "Calcula el trabajo realizado por la fricción sobre un objeto que se desliza 8 m mientras actúa una fuerza de fricción de 25 N opuesta al movimiento.",
              "Identifica si el trabajo es positivo, negativo o nulo en estos casos: a) levantar una caja, b) bajar una caja, c) la fuerza normal sobre un objeto que se desliza horizontalmente.",
              "Un paracaidista desciende a velocidad constante. Analiza el trabajo realizado por: a) la gravedad, b) la resistencia del aire."
            ]
          },
          {
            "key": "unidades_trabajo",
            "name": "Unidades del Trabajo",
            "short_description": "Comprensión del joule (J) como unidad de trabajo en el Sistema Internacional y su relación con otras unidades.",
            "example_tasks": [
              "Define el joule como unidad de trabajo. ¿A qué equivale 1 J en unidades fundamentales?",
              "Convierte 5000 J a: a) kilojoules (kJ), b) calorías (1 cal = 4.18 J).",
              "Calcula cuánto trabajo realizas al subir una escalera de 50 escalones, si tu masa es 60 kg y cada escalón tiene 20 cm de altura.",
              "Compara el trabajo realizado para levantar 1 kg a una altura de 1 m con la energía contenida en diferentes alimentos usando tablas nutricionales."
            ]
          }
        ]
      },
      {
        "key": "potencia",
        "name": "Potencia Mecánica",
        "short_description": "Estudio de la potencia como la rapidez con que se realiza trabajo o se transfiere energía.",
        "sub_topics": [
          {
            "key": "definicion_potencia",
            "name": "Definición y Cálculo de Potencia",
            "short_description": "Aplicación de la fórmula P = W/t para calcular la potencia desarrollada.",
            "example_tasks": [
              "Define potencia mecánica y explica su unidad en el Sistema Internacional (watt).",
              "Una máquina realiza 6000 J de trabajo en 10 segundos. Calcula su potencia en watts.",
              "Explica la diferencia entre una máquina poderosa y una máquina que realiza mucho trabajo total.",
              "Dos grúas levantan la misma carga a la misma altura, pero una tarda la mitad del tiempo. ¿Cuál desarrolla mayor potencia? Justifica."
            ]
          },
          {
            "key": "unidades_potencia",
            "name": "Unidades de Potencia",
            "short_description": "Manejo de diferentes unidades de potencia: watt, kilowatt, caballo de fuerza (HP).",
            "example_tasks": [
              "Convierte 2500 W a: a) kilowatts (kW), b) caballos de fuerza (1 HP = 746 W).",
              "Un motor tiene una potencia de 50 HP. ¿Cuántos watts son? ¿Cuánto trabajo puede realizar en 1 hora?",
              "Investiga la potencia típica de diferentes dispositivos: foco LED, motor de automóvil, central eléctrica.",
              "Calcula tu propia potencia al subir corriendo una escalera. Necesitas medir: tu masa, altura de la escalera y tiempo empleado."
            ]
          },
          {
            "key": "potencia_velocidad",
            "name": "Relación entre Potencia, Fuerza y Velocidad",
            "short_description": "Aplicación de la fórmula P = F·v cuando la fuerza y velocidad son constantes.",
            "example_tasks": [
              "Demuestra que P = F·v a partir de las definiciones de trabajo y potencia.",
              "Un automóvil se mueve a velocidad constante de 20 m/s venciendo una fuerza de resistencia de 800 N. Calcula la potencia del motor.",
              "¿Por qué los vehículos necesitan más potencia para mantener velocidades altas que velocidades bajas?",
              "Un ciclista desarrolla una potencia de 200 W mientras viaja a 8 m/s en terreno plano. Calcula la fuerza de resistencia que está venciendo."
            ]
          },
          {
            "key": "eficiencia_energetica",
            "name": "Eficiencia y Rendimiento",
            "short_description": "Cálculo de la eficiencia como la relación entre energía útil y energía total suministrada.",
            "example_tasks": [
              "Define eficiencia energética. ¿Por qué ninguna máquina real puede tener 100% de eficiencia?",
              "Un motor recibe 1000 J de energía y realiza 750 J de trabajo útil. Calcula su eficiencia en porcentaje.",
              "Explica a dónde va la energía 'perdida' en una máquina con eficiencia menor al 100%.",
              "Compara la eficiencia típica de: a) un motor de combustión interna (~30%), b) un motor eléctrico (~90%), c) una central hidroeléctrica (~85%)."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "energia_mecanica",
    "name": "Energía Mecánica",
    "short_description": "Estudio de la energía cinética y potencial, sus transformaciones y el principio de conservación de la energía mecánica.",
    "sub_topics": [
      {
        "key": "formas_energia",
        "name": "Formas de Energía",
        "short_description": "Identificación de diferentes formas de energía en la naturaleza y su capacidad de transformarse.",
        "sub_topics": [
          {
            "key": "concepto_energia",
            "name": "Concepto de Energía",
            "short_description": "Comprensión de la energía como la capacidad de realizar trabajo o producir cambios.",
            "example_tasks": [
              "Define energía con tus propias palabras. ¿Por qué se dice que es una de las cantidades más importantes en física?",
              "Enumera al menos seis formas diferentes de energía (mecánica, térmica, eléctrica, etc.) con ejemplos de cada una.",
              "Explica por qué la energía y el trabajo tienen las mismas unidades (joules).",
              "Describe tres transformaciones de energía que observes en tu hogar durante un día típico."
            ]
          },
          {
            "key": "transformaciones_energia",
            "name": "Transformaciones de Energía",
            "short_description": "Análisis de cómo la energía se transforma de una forma a otra en diversos procesos.",
            "example_tasks": [
              "Describe la cadena de transformaciones de energía desde que sale el Sol hasta que enciendes un foco en tu casa usando electricidad solar.",
              "Analiza las transformaciones de energía que ocurren cuando un automóvil funciona con gasolina.",
              "Explica las transformaciones de energía en una planta hidroeléctrica, desde el agua almacenada hasta la electricidad generada.",
              "Investiga cómo tu cuerpo transforma la energía química de los alimentos en energía mecánica para moverte."
            ]
          }
        ]
      },
      {
        "key": "energia_cinetica",
        "name": "Energía Cinética",
        "short_description": "Estudio de la energía asociada al movimiento de los objetos, calculada mediante Ec = ½mv².",
        "sub_topics": [
          {
            "key": "calculo_energia_cinetica",
            "name": "Cálculo de Energía Cinética",
            "short_description": "Aplicación de la fórmula Ec = ½mv² para calcular la energía de objetos en movimiento.",
            "example_tasks": [
              "Un automóvil de 1000 kg viaja a 20 m/s. Calcula su energía cinética.",
              "Explica por qué la energía cinética depende del cuadrado de la velocidad. ¿Qué implicaciones tiene esto para la seguridad vial?",
              "Compara la energía cinética de dos vehículos: uno de 800 kg a 30 m/s y otro de 1200 kg a 20 m/s. ¿Cuál tiene mayor energía cinética?",
              "Un objeto duplica su velocidad. ¿En qué factor aumenta su energía cinética? Demuestra matemáticamente."
            ]
          },
          {
            "key": "teorema_trabajo_energia",
            "name": "Teorema del Trabajo y la Energía",
            "short_description": "Comprensión de que el trabajo neto realizado sobre un objeto es igual al cambio en su energía cinética.",
            "example_tasks": [
              "Enuncia el teorema del trabajo y la energía cinética: W = ΔEc.",
              "Un objeto de 5 kg aumenta su velocidad de 10 m/s a 20 m/s. Calcula el trabajo realizado sobre él.",
              "Un automóvil de 1500 kg se detiene desde 25 m/s. ¿Cuánto trabajo realizan los frenos?",
              "Explica por qué aumentar la velocidad de un vehículo de 100 km/h a 120 km/h requiere más trabajo que de 80 km/h a 100 km/h."
            ]
          }
        ]
      },
      {
        "key": "energia_potencial",
        "name": "Energía Potencial",
        "short_description": "Estudio de la energía almacenada debido a la posición o configuración de un objeto, principalmente gravitacional y elástica.",
        "sub_topics": [
          {
            "key": "energia_potencial_gravitacional",
            "name": "Energía Potencial Gravitacional",
            "short_description": "Cálculo de la energía potencial gravitacional mediante Ep = mgh para objetos cerca de la superficie terrestre.",
            "example_tasks": [
              "Un libro de 2 kg está sobre un estante a 3 m de altura. Calcula su energía potencial gravitacional respecto al suelo.",
              "Explica por qué la energía potencial gravitacional depende de la altura de referencia elegida.",
              "Una roca de 50 kg está en la cima de un cerro a 200 m de altura. ¿Cuánta energía potencial tiene respecto a la base?",
              "Compara la energía potencial gravitacional de dos objetos: uno de 10 kg a 5 m de altura y otro de 5 kg a 10 m. ¿Son iguales? Explica."
            ]
          },
          {
            "key": "energia_potencial_elastica",
            "name": "Energía Potencial Elástica",
            "short_description": "Comprensión de la energía almacenada en objetos elásticos deformados como resortes.",
            "example_tasks": [
              "Explica qué es la energía potencial elástica y menciona tres objetos que la almacenan cuando se deforman.",
              "Describe cómo un resorte comprimido tiene capacidad de realizar trabajo al liberarse.",
              "Da ejemplos de juguetes o dispositivos que funcionen utilizando energía potencial elástica.",
              "Investiga cómo funcionan las ballestas o los trampolines en términos de energía potencial elástica."
            ]
          }
        ]
      },
      {
        "key": "conservacion_energia",
        "name": "Conservación de la Energía Mecánica",
        "short_description": "Aplicación del principio de conservación de la energía mecánica en ausencia de fuerzas no conservativas.",
        "sub_topics": [
          {
            "key": "principio_conservacion",
            "name": "Principio de Conservación",
            "short_description": "Comprensión de que la energía mecánica total permanece constante en sistemas conservativos.",
            "example_tasks": [
              "Enuncia el principio de conservación de la energía mecánica. ¿Bajo qué condiciones es válido?",
              "Explica por qué Em = Ec + Ep permanece constante en un péndulo ideal.",
              "Describe las transformaciones de energía que ocurren cuando dejas caer una pelota desde cierta altura.",
              "¿Por qué la energía mecánica NO se conserva cuando hay fricción? ¿A dónde va esa energía?"
            ]
          },
          {
            "key": "aplicaciones_conservacion",
            "name": "Aplicaciones de la Conservación de Energía",
            "short_description": "Resolución de problemas usando el principio de conservación de energía mecánica.",
            "example_tasks": [
              "Un objeto de 3 kg se suelta desde una altura de 20 m. Calcula su velocidad justo antes de tocar el suelo usando conservación de energía.",
              "Una montaña rusa parte del reposo desde 30 m de altura. ¿Qué velocidad tendrá al pasar por un punto a 10 m de altura? (Desprecia la fricción).",
              "Un péndulo se suelta desde una altura de 0.5 m. Calcula su velocidad en el punto más bajo de su trayectoria.",
              "Explica cómo un patinador puede convertir energía potencial en cinética al descender una rampa, y viceversa al subir otra."
            ]
          },
          {
            "key": "energia_no_conservacion",
            "name": "Energía con Fuerzas No Conservativas",
            "short_description": "Análisis de sistemas donde la fricción y otras fuerzas disipativas convierten energía mecánica en calor.",
            "example_tasks": [
              "Explica por qué un péndulo real eventualmente se detiene, aunque la energía total se conserve.",
              "Un bloque se desliza por una superficie con fricción perdiendo 200 J de energía mecánica. ¿A dónde fue esa energía?",
              "Calcula la energía disipada por fricción si un objeto de 5 kg con velocidad de 10 m/s se detiene después de deslizarse 8 m.",
              "Compara el movimiento de una pelota que rebota en el suelo varias veces. ¿Por qué cada rebote alcanza menor altura que el anterior?"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "maquinas_simples",
    "name": "Máquinas Simples",
    "short_description": "Estudio de dispositivos mecánicos básicos que modifican fuerzas y facilitan el trabajo: palancas, poleas, planos inclinados y sus aplicaciones.",
    "sub_topics": [
      {
        "key": "concepto_maquinas_simples",
        "name": "Concepto de Máquinas Simples",
        "short_description": "Comprensión de las máquinas simples como dispositivos que facilitan el trabajo modificando la magnitud o dirección de las fuerzas.",
        "sub_topics": [
          {
            "key": "que_son_maquinas_simples",
            "name": "¿Qué son las Máquinas Simples?",
            "short_description": "Identificación de las seis máquinas simples clásicas y su función de transformar fuerzas.",
            "example_tasks": [
              "Define qué es una máquina simple y enumera los seis tipos principales.",
              "Explica por qué se llaman 'simples' y cómo se relacionan con máquinas más complejas.",
              "Identifica al menos cinco máquinas simples que encuentres en tu hogar o escuela.",
              "Explica el principio básico: una máquina simple permite aplicar menor fuerza a costa de mayor distancia (o viceversa)."
            ]
          },
          {
            "key": "ventaja_mecanica",
            "name": "Ventaja Mecánica",
            "short_description": "Cálculo de la ventaja mecánica como la relación entre la fuerza de salida y la fuerza de entrada.",
            "example_tasks": [
              "Define ventaja mecánica. ¿Qué significa que una máquina tenga VM = 4?",
              "Una palanca permite levantar 200 N aplicando solo 50 N. Calcula su ventaja mecánica.",
              "Explica por qué una máquina con ventaja mecánica mayor que 1 multiplica la fuerza pero requiere mayor desplazamiento.",
              "¿Puede una máquina simple tener ventaja mecánica menor que 1? ¿Para qué sería útil?"
            ]
          }
        ]
      },
      {
        "key": "palancas",
        "name": "Palancas",
        "short_description": "Estudio de las palancas, sus tres tipos según la posición del fulcro, y aplicación del principio de momentos.",
        "sub_topics": [
          {
            "key": "elementos_palanca",
            "name": "Elementos de una Palanca",
            "short_description": "Identificación de fulcro, brazo de potencia, brazo de resistencia, fuerza aplicada y carga.",
            "example_tasks": [
              "Dibuja una palanca identificando: fulcro, brazo de potencia, brazo de resistencia, fuerza aplicada y resistencia.",
              "Explica cómo una palanca permite multiplicar fuerzas mediante brazos de diferente longitud.",
              "Enumera cinco herramientas o dispositivos cotidianos que funcionen como palancas.",
              "Describe cómo tus brazos y piernas funcionan como palancas cuando levantas objetos o caminas."
            ]
          },
          {
            "key": "tipos_palancas",
            "name": "Tipos de Palancas",
            "short_description": "Clasificación de palancas en primer, segundo y tercer género según la posición relativa de fulcro, potencia y resistencia.",
            "example_tasks": [
              "Explica las diferencias entre palancas de primer, segundo y tercer género con ejemplos de cada tipo.",
              "Clasifica las siguientes herramientas según su tipo de palanca: tijeras, cascanueces, pinzas, carretilla, balancín.",
              "Dibuja un esquema de cada tipo de palanca indicando la posición del fulcro, la potencia y la resistencia.",
              "Investiga qué tipo de palanca es tu antebrazo cuando levantas un peso con tu mano. Identifica dónde está el fulcro, la potencia (músculo) y la resistencia."
            ]
          },
          {
            "key": "equilibrio_palancas",
            "name": "Equilibrio en Palancas",
            "short_description": "Aplicación de la ley de la palanca: F₁ × d₁ = F₂ × d₂ para resolver problemas de equilibrio.",
            "example_tasks": [
              "Enuncia la ley de la palanca o principio de momentos.",
              "En una palanca, se aplica una fuerza de 30 N a 2 m del fulcro. ¿Qué fuerza se puede levantar si está a 0.5 m del fulcro?",
              "Dos niños juegan en un balancín: uno de 40 kg está a 2 m del centro, ¿a qué distancia debe sentarse el otro de 30 kg para equilibrar?",
              "Calcula la ventaja mecánica de una palanca donde el brazo de potencia es 3 veces mayor que el brazo de resistencia."
            ]
          }
        ]
      },
      {
        "key": "poleas",
        "name": "Poleas",
        "short_description": "Análisis de poleas fijas y móviles, y sus sistemas combinados para multiplicar fuerzas o cambiar dirección de aplicación.",
        "sub_topics": [
          {
            "key": "polea_fija",
            "name": "Polea Fija",
            "short_description": "Comprensión de que una polea fija cambia la dirección de la fuerza pero no la multiplica (VM = 1).",
            "example_tasks": [
              "Explica cómo funciona una polea fija y cuál es su principal ventaja.",
              "¿Cuál es la ventaja mecánica de una polea fija? ¿Por qué es útil aunque no multiplique la fuerza?",
              "Se usa una polea fija para levantar una carga de 80 N. ¿Qué fuerza hay que aplicar? (Desprecia fricción).",
              "Da tres ejemplos de uso de poleas fijas en la vida cotidiana o en construcción."
            ]
          },
          {
            "key": "polea_movil",
            "name": "Polea Móvil",
            "short_description": "Análisis de la polea móvil que sí multiplica la fuerza con ventaja mecánica de 2.",
            "example_tasks": [
              "Explica la diferencia entre una polea fija y una móvil en cuanto a su ventaja mecánica.",
              "Una polea móvil sostiene una carga de 100 N. ¿Qué fuerza debe aplicarse para mantenerla en equilibrio?",
              "Dibuja el diagrama de fuerzas en una polea móvil y explica por qué la ventaja mecánica es 2.",
              "¿Qué desventaja tiene usar una polea móvil comparada con una fija? (Pista: considera la distancia que debe recorrer la cuerda)."
            ]
          },
          {
            "key": "sistemas_poleas",
            "name": "Sistemas de Poleas (Polipastos)",
            "short_description": "Estudio de combinaciones de poleas fijas y móviles para obtener mayores ventajas mecánicas.",
            "example_tasks": [
              "Explica cómo un sistema de poleas (polipasto) puede multiplicar considerablemente una fuerza.",
              "Un sistema tiene 4 poleas móviles. ¿Cuál es su ventaja mecánica teórica?",
              "Investiga cómo se usan los polipastos en grúas de construcción o en montacargas.",
              "Diseña un sistema de poleas para levantar 800 N aplicando solo 100 N. ¿Cuántas poleas móviles necesitas?"
            ]
          }
        ]
      },
      {
        "key": "plano_inclinado",
        "name": "Plano Inclinado",
        "short_description": "Análisis del plano inclinado como máquina simple que reduce la fuerza necesaria para elevar objetos a costa de mayor distancia.",
        "sub_topics": [
          {
            "key": "principio_plano_inclinado",
            "name": "Principio del Plano Inclinado",
            "short_description": "Comprensión de cómo un plano inclinado facilita subir objetos reduciendo la fuerza necesaria.",
            "example_tasks": [
              "Explica por qué es más fácil subir un objeto por una rampa que levantarlo verticalmente.",
              "Un objeto de peso 200 N debe subirse a una altura de 2 m. ¿Qué distancia debe tener una rampa para reducir la fuerza a 50 N? (Ideal, sin fricción).",
              "Compara el trabajo total realizado al subir un objeto: a) verticalmente, b) por un plano inclinado. ¿Cuál requiere más trabajo?",
              "Da ejemplos de planos inclinados en tu comunidad: rampas para sillas de ruedas, carreteras de montaña, etc."
            ]
          },
          {
            "key": "fuerzas_plano_inclinado",
            "name": "Análisis de Fuerzas en el Plano Inclinado",
            "short_description": "Descomposición del peso en componentes paralela y perpendicular al plano inclinado.",
            "example_tasks": [
              "Dibuja un diagrama de un objeto en un plano inclinado y descompón su peso en componentes paralela y perpendicular al plano.",
              "Un objeto de 50 kg está sobre un plano inclinado a 30°. Calcula las componentes del peso paralela y perpendicular al plano.",
              "Explica por qué un objeto en un plano más inclinado (mayor ángulo) tiende a deslizarse con mayor facilidad.",
              "Calcula la fuerza mínima paralela al plano necesaria para mantener en equilibrio un objeto de 100 N en un plano inclinado a 37° (sin fricción)."
            ]
          },
          {
            "key": "aplicaciones_plano_inclinado",
            "name": "Aplicaciones del Plano Inclinado",
            "short_description": "Identificación de herramientas y estructuras basadas en el principio del plano inclinado.",
            "example_tasks": [
              "Explica cómo un tornillo es esencialmente un plano inclinado enrollado alrededor de un cilindro.",
              "Investiga cómo funcionan las cuñas (hachas, cuchillos) como dobles planos inclinados.",
              "Describe cómo las antiguas civilizaciones usaron planos inclinados para construir pirámides.",
              "Analiza las rampas de estacionamientos o carreteras sinuosas de montaña como aplicaciones del plano inclinado."
            ]
          }
        ]
      },
      {
        "key": "otras_maquinas_simples",
        "name": "Otras Máquinas Simples",
        "short_description": "Estudio del torno, la rueda y el eje como máquinas simples adicionales.",
        "sub_topics": [
          {
            "key": "rueda_eje",
            "name": "Rueda y Eje",
            "short_description": "Análisis de cómo la rueda y el eje funcionan como una palanca rotatoria para multiplicar fuerzas o distancias.",
            "example_tasks": [
              "Explica cómo funciona una rueda y eje, dando ejemplos como el volante, la manivela o la perilla de una puerta.",
              "Una rueda tiene radio de 30 cm y su eje tiene radio de 5 cm. Calcula la ventaja mecánica.",
              "Investiga cómo funcionan los engranes como combinaciones de ruedas y ejes para transmitir y modificar fuerzas.",
              "Explica por qué las ruedas de los vehículos hacen más fácil el transporte de cargas pesadas."
            ]
          },
          {
            "key": "torno",
            "name": "Torno o Cabrestante",
            "short_description": "Comprensión del torno como máquina para levantar cargas enrollando una cuerda en un cilindro.",
            "example_tasks": [
              "Describe cómo funciona un torno o cabrestante para levantar agua de un pozo.",
              "Explica la relación entre el radio de la manivela y el radio del cilindro en la ventaja mecánica del torno.",
              "Investiga ejemplos modernos de tornos: grúas, malacates, guinches.",
              "Calcula la ventaja mecánica de un torno si la manivela tiene 40 cm de largo y el cilindro 10 cm de radio."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "presion_fluidos",
    "name": "Presión y Fluidos",
    "short_description": "Estudio de la presión en sólidos, líquidos y gases, incluyendo los principios de Pascal y Arquímedes, y sus aplicaciones tecnológicas.",
    "sub_topics": [
      {
        "key": "concepto_presion",
        "name": "Concepto de Presión",
        "short_description": "Comprensión de la presión como fuerza por unidad de área y su aplicación en diferentes contextos.",
        "sub_topics": [
          {
            "key": "definicion_presion",
            "name": "Definición de Presión",
            "short_description": "Cálculo de la presión mediante P = F/A y comprensión de su unidad (pascal).",
            "example_tasks": [
              "Define presión y explica su fórmula P = F/A. ¿Cuál es su unidad en el Sistema Internacional?",
              "Una fuerza de 500 N se aplica sobre un área de 2 m². Calcula la presión ejercida.",
              "Explica por qué los cuchillos filosos cortan mejor que los sin filo, usando el concepto de presión.",
              "Calcula la presión que ejerces sobre el suelo al estar parado. Necesitas estimar tu peso y el área de contacto de tus zapatos."
            ]
          },
          {
            "key": "presion_solidos",
            "name": "Presión en Sólidos",
            "short_description": "Análisis de cómo la presión depende del área de contacto en superficies sólidas.",
            "example_tasks": [
              "Explica por qué los tacones de aguja causan más daño a los pisos de madera que los zapatos planos.",
              "Un elefante de 5000 kg tiene patas con área total de contacto de 0.5 m². Una mujer de 60 kg usa tacones con área de 2 cm² cada uno. ¿Quién ejerce mayor presión?",
              "Describe cómo las orugas de los tanques y tractores distribuyen el peso para no hundirse en terreno blando.",
              "Investiga por qué las raquetas de nieve permiten caminar sobre nieve profunda sin hundirse."
            ]
          },
          {
            "key": "unidades_presion",
            "name": "Unidades de Presión",
            "short_description": "Manejo de diferentes unidades de presión: pascal, atmósfera, bar, mmHg, psi.",
            "example_tasks": [
              "Convierte las siguientes presiones a pascales: 1 atm, 760 mmHg, 1 bar.",
              "Explica qué significa que la presión atmosférica al nivel del mar sea 101,325 Pa o 1 atm.",
              "Investiga la presión típica de los neumáticos de automóviles en psi y conviértela a pascales.",
              "¿Por qué los médicos miden la presión arterial en milímetros de mercurio (mmHg)?"
            ]
          }
        ]
      },
      {
        "key": "presion_fluidos",
        "name": "Presión en Fluidos",
        "short_description": "Estudio de cómo se comporta la presión en líquidos y gases, incluyendo presión hidrostática y atmosférica.",
        "sub_topics": [
          {
            "key": "presion_hidrostatica",
            "name": "Presión Hidrostática",
            "short_description": "Cálculo de la presión en líquidos debido a su peso mediante P = ρgh.",
            "example_tasks": [
              "Explica qué es la presión hidrostática y por qué aumenta con la profundidad.",
              "Calcula la presión hidrostática a 10 m de profundidad en agua (ρ = 1000 kg/m³, g = 10 m/s²).",
              "¿Por qué sientes mayor presión en tus oídos al sumergirte más profundo en una alberca?",
              "Un submarino se encuentra a 200 m bajo el mar. Calcula la presión hidrostática (densidad del agua de mar ≈ 1025 kg/m³)."
            ]
          },
          {
            "key": "presion_atmosferica",
            "name": "Presión Atmosférica",
            "short_description": "Comprensión de la presión ejercida por la atmósfera terrestre y su variación con la altitud.",
            "example_tasks": [
              "Explica qué es la presión atmosférica y por qué existe aunque no la percibamos directamente.",
              "Describe el experimento de Torricelli con el barómetro de mercurio. ¿Qué demostró?",
              "¿Por qué la presión atmosférica disminuye con la altitud? ¿Qué efectos tiene esto?",
              "Investiga la presión atmosférica en la Ciudad de México (2,240 m sobre el nivel del mar) comparada con Veracruz (nivel del mar). ¿Cómo afecta esto la cocción de alimentos?"
            ]
          },
          {
            "key": "vasos_comunicantes",
            "name": "Vasos Comunicantes",
            "short_description": "Análisis del principio de que líquidos en vasos comunicantes alcanzan el mismo nivel.",
            "example_tasks": [
              "Explica el principio de los vasos comunicantes y por qué el líquido alcanza el mismo nivel en todos los recipientes conectados.",
              "Da tres aplicaciones prácticas de los vasos comunicantes (sistemas de agua potable, sifones, niveles de construcción).",
              "Dibuja un sistema de vasos comunicantes con diferentes formas y explica por qué el nivel del agua es el mismo en todos.",
              "Investiga cómo funcionan los acueductos romanos usando el principio de vasos comunicantes."
            ]
          }
        ]
      },
      {
        "key": "principio_pascal",
        "name": "Principio de Pascal",
        "short_description": "Estudio de la transmisión de presión en fluidos confinados y sus aplicaciones en sistemas hidráulicos.",
        "sub_topics": [
          {
            "key": "enunciado_pascal",
            "name": "Enunciado del Principio de Pascal",
            "short_description": "Comprensión de que la presión aplicada a un fluido confinado se transmite íntegramente en todas direcciones.",
            "example_tasks": [
              "Enuncia el Principio de Pascal con tus propias palabras.",
              "Explica por qué cuando aprietas un globo lleno de agua, todas sus partes se expanden.",
              "Describe cómo la presión se transmite a través de un fluido en un recipiente cerrado.",
              "Da un ejemplo cotidiano donde observes la aplicación del Principio de Pascal."
            ]
          },
          {
            "key": "prensa_hidraulica",
            "name": "Prensa Hidráulica",
            "short_description": "Análisis de la prensa hidráulica como aplicación del Principio de Pascal para multiplicar fuerzas.",
            "example_tasks": [
              "Explica cómo funciona una prensa hidráulica y por qué puede multiplicar fuerzas.",
              "En una prensa hidráulica, el pistón pequeño tiene área de 10 cm² y el grande 100 cm². Si se aplican 50 N en el pequeño, ¿qué fuerza se obtiene en el grande?",
              "Calcula la ventaja mecánica de una prensa hidráulica donde el pistón de salida tiene un área 20 veces mayor que el de entrada.",
              "Investiga aplicaciones de la prensa hidráulica: elevadores de automóviles, frenos hidráulicos, maquinaria pesada."
            ]
          },
          {
            "key": "sistemas_hidraulicos",
            "name": "Sistemas Hidráulicos",
            "short_description": "Estudio de aplicaciones tecnológicas de sistemas hidráulicos en la vida cotidiana.",
            "example_tasks": [
              "Explica cómo funcionan los frenos hidráulicos de un automóvil aplicando el Principio de Pascal.",
              "Describe el funcionamiento de una excavadora hidráulica y sus ventajas.",
              "Investiga cómo funcionan las sillas de dentista o de barbería que suben y bajan mediante sistemas hidráulicos.",
              "Analiza las ventajas y desventajas de los sistemas hidráulicos comparados con sistemas mecánicos directos."
            ]
          }
        ]
      },
      {
        "key": "principio_arquimedes",
        "name": "Principio de Arquímedes",
        "short_description": "Estudio del empuje de los fluidos sobre objetos sumergidos y las condiciones de flotación.",
        "sub_topics": [
          {
            "key": "empuje_flotacion",
            "name": "Empuje y Flotación",
            "short_description": "Comprensión de la fuerza de empuje que ejerce un fluido sobre objetos sumergidos.",
            "example_tasks": [
              "Enuncia el Principio de Arquímedes. ¿Qué es la fuerza de empuje?",
              "Explica por qué sientes que pesas menos cuando estás sumergido en el agua de una alberca.",
              "Un objeto de volumen 0.5 m³ se sumerge completamente en agua. Calcula el empuje que experimenta (ρagua = 1000 kg/m³, g = 10 m/s²).",
              "Describe la experiencia de Arquímedes en la bañera y cómo lo llevó a su famoso principio."
            ]
          },
          {
            "key": "condiciones_flotacion",
            "name": "Condiciones de Flotación, Hundimiento y Suspensión",
            "short_description": "Análisis de las condiciones que determinan si un objeto flota, se hunde o permanece en equilibrio.",
            "example_tasks": [
              "Explica las tres condiciones posibles: flotación (E > W), hundimiento (E < W) y equilibrio (E = W).",
              "¿Por qué un barco de acero flota mientras que un clavo de acero se hunde? Relaciona con densidad y volumen desplazado.",
              "Un objeto tiene densidad de 800 kg/m³. ¿Flotará o se hundirá en agua? ¿Y en aceite (densidad 900 kg/m³)?",
              "Calcula qué fracción de un iceberg (densidad 920 kg/m³) permanece sumergida en agua de mar (densidad 1025 kg/m³)."
            ]
          },
          {
            "key": "aplicaciones_arquimedes",
            "name": "Aplicaciones del Principio de Arquímedes",
            "short_description": "Análisis de aplicaciones tecnológicas y naturales del empuje y la flotación.",
            "example_tasks": [
              "Explica cómo funcionan los submarinos para sumergirse y emerger usando el Principio de Arquímedes.",
              "Investiga cómo los peces usan su vejiga natatoria para controlar su profundidad en el agua.",
              "Describe cómo funcionan los globos aerostáticos y los dirigibles aplicando el empuje en gases.",
              "Analiza por qué los icebergs son peligrosos para los barcos (la mayor parte está sumergida y no se ve)."
            ]
          },
          {
            "key": "densidad_flotacion",
            "name": "Densidad y Flotación",
            "short_description": "Relación entre la densidad relativa de objetos y fluidos para predecir comportamiento de flotación.",
            "example_tasks": [
              "Define densidad y explica su relación con la flotación.",
              "Ordena los siguientes materiales según su tendencia a flotar en agua: corcho (ρ=240 kg/m³), hielo (920 kg/m³), madera (600 kg/m³), hierro (7800 kg/m³).",
              "Explica por qué el aceite flota sobre el agua basándote en sus densidades relativas.",
              "Un objeto de masa 500 g y volumen 800 cm³ se coloca en agua. ¿Flotará? Calcula su densidad y compárala con la del agua."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "calor_temperatura",
    "name": "Calor y Temperatura",
    "short_description": "Estudio de los conceptos de temperatura y calor, sus diferencias, escalas termométricas, dilatación térmica y los mecanismos de transferencia de calor.",
    "sub_topics": [
      {
        "key": "temperatura",
        "name": "Temperatura",
        "short_description": "Comprensión de la temperatura como medida del grado de agitación molecular y las escalas para medirla.",
        "sub_topics": [
          {
            "key": "concepto_temperatura",
            "name": "Concepto de Temperatura",
            "short_description": "Entendimiento de la temperatura como medida de la energía cinética promedio de las partículas.",
            "example_tasks": [
              "Define temperatura con tus propias palabras. ¿Qué representa a nivel molecular?",
              "Explica la diferencia entre temperatura y calor. ¿Por qué no son lo mismo?",
              "¿Por qué dos objetos en contacto térmico eventualmente alcanzan la misma temperatura?",
              "Describe qué sucede con el movimiento de las moléculas cuando aumenta la temperatura de una sustancia."
            ]
          },
          {
            "key": "escalas_temperatura",
            "name": "Escalas de Temperatura",
            "short_description": "Manejo de las escalas Celsius, Fahrenheit y Kelvin, y conversiones entre ellas.",
            "example_tasks": [
              "Explica las diferencias entre las escalas Celsius, Fahrenheit y Kelvin. ¿Cuáles son sus puntos de referencia?",
              "Convierte las siguientes temperaturas: a) 25°C a K, b) 98.6°F a °C, c) 300 K a °C.",
              "La temperatura corporal normal es 37°C. ¿Cuánto es en Fahrenheit y en Kelvin?",
              "Explica por qué la escala Kelvin no tiene valores negativos y qué representa el cero absoluto (0 K = -273.15°C)."
            ]
          },
          {
            "key": "termometros",
            "name": "Termómetros",
            "short_description": "Comprensión del funcionamiento de diferentes tipos de termómetros.",
            "example_tasks": [
              "Explica cómo funciona un termómetro de mercurio o alcohol basándose en la dilatación térmica.",
              "Describe al menos tres tipos diferentes de termómetros: líquido, digital, infrarrojo.",
              "¿Por qué ya no se usan termómetros de mercurio en muchos países? ¿Cuáles son las alternativas?",
              "Investiga cómo funcionan los termómetros infrarrojos que se usan para medir temperatura sin contacto."
            ]
          }
        ]
      },
      {
        "key": "dilatacion_termica",
        "name": "Dilatación Térmica",
        "short_description": "Estudio de cómo los materiales se expanden o contraen con cambios de temperatura.",
        "sub_topics": [
          {
            "key": "dilatacion_lineal",
            "name": "Dilatación Lineal",
            "short_description": "Análisis de la expansión en una dimensión usando el coeficiente de dilatación lineal.",
            "example_tasks": [
              "Explica qué es la dilatación térmica y por qué ocurre a nivel molecular.",
              "¿Por qué las vías del tren tienen espacios entre los rieles?",
              "Una barra de acero de 10 m a 20°C se calienta a 100°C. Si α = 11×10⁻⁶/°C, calcula cuánto se alarga.",
              "Describe otros ejemplos donde debemos considerar la dilatación térmica: puentes, líneas eléctricas, termostatos."
            ]
          },
          {
            "key": "dilatacion_superficial_volumetrica",
            "name": "Dilatación Superficial y Volumétrica",
            "short_description": "Comprensión de la expansión en dos y tres dimensiones.",
            "example_tasks": [
              "Explica la diferencia entre dilatación lineal, superficial y volumétrica.",
              "¿Por qué las tapas metálicas de frascos se aflojan al calentarlas con agua caliente?",
              "Un recipiente de vidrio lleno de líquido se calienta. ¿Por qué puede derramarse el líquido?",
              "Investiga la anomalía del agua: ¿por qué el agua se expande al congelarse en lugar de contraerse?"
            ]
          },
          {
            "key": "aplicaciones_dilatacion",
            "name": "Aplicaciones de la Dilatación Térmica",
            "short_description": "Análisis de aplicaciones tecnológicas que aprovechan o compensan la dilatación térmica.",
            "example_tasks": [
              "Explica cómo funciona un termostato bimetálico usando dos metales con diferentes coeficientes de dilatación.",
              "Describe por qué los vasos de vidrio pueden romperse si se les echa líquido muy caliente o muy frío bruscamente.",
              "Investiga las juntas de dilatación en edificios y puentes. ¿Para qué sirven?",
              "Analiza por qué los cables de tendido eléctrico se cuelgan con cierta holgura y no completamente tensos."
            ]
          }
        ]
      },
      {
        "key": "calor_energia",
        "name": "Calor como Energía",
        "short_description": "Comprensión del calor como energía en tránsito debido a diferencia de temperatura.",
        "sub_topics": [
          {
            "key": "calor_energia_transferencia",
            "name": "El Calor es Energía en Tránsito",
            "short_description": "Entendimiento de que el calor fluye espontáneamente de objetos calientes a fríos.",
            "example_tasks": [
              "Explica por qué el calor no es lo mismo que temperatura, sino energía en tránsito.",
              "¿En qué dirección fluye siempre el calor espontáneamente?",
              "Define equilibrio térmico. ¿Qué sucede cuando dos objetos a diferentes temperaturas se ponen en contacto?",
              "Da tres ejemplos cotidianos de transferencia de calor de un objeto caliente a uno frío."
            ]
          },
          {
            "key": "caloria_joule",
            "name": "Unidades de Calor: Caloría y Joule",
            "short_description": "Comprensión de las unidades para medir el calor y su equivalencia.",
            "example_tasks": [
              "Define la caloría como unidad de calor. ¿A qué equivale en joules? (1 cal = 4.18 J).",
              "Explica por qué actualmente se prefiere usar el joule en lugar de la caloría para medir energía térmica.",
              "Convierte 500 calorías a joules y a kilocalorías (Cal con mayúscula).",
              "Investiga qué son las calorías que aparecen en las etiquetas nutricionales. ¿Son calorías o kilocalorías?"
            ]
          },
          {
            "key": "calor_especifico",
            "name": "Calor Específico",
            "short_description": "Estudio de la capacidad calorífica específica de las sustancias mediante Q = mcΔT.",
            "example_tasks": [
              "Define calor específico. ¿Qué nos indica sobre una sustancia?",
              "¿Cuánto calor se necesita para aumentar la temperatura de 2 kg de agua de 20°C a 80°C? (cagua = 4186 J/kg°C).",
              "Explica por qué el agua es excelente para enfriar motores (tiene alto calor específico).",
              "Compara el calor específico del agua con el del hierro. ¿Cuál se calienta más rápido con la misma cantidad de calor?"
            ]
          },
          {
            "key": "calorimetria",
            "name": "Calorimetría",
            "short_description": "Aplicación del principio de conservación de energía en intercambios térmicos.",
            "example_tasks": [
              "Enuncia el principio fundamental de la calorimetría: el calor cedido es igual al calor absorbido.",
              "Se mezclan 100 g de agua a 80°C con 200 g de agua a 20°C. Calcula la temperatura final de equilibrio.",
              "Explica cómo funciona un calorímetro para medir el calor específico de sustancias.",
              "Un objeto de metal de 500 g a 100°C se introduce en 1 kg de agua a 20°C. La temperatura final es 25°C. Calcula el calor específico del metal."
            ]
          }
        ]
      },
      {
        "key": "transferencia_calor",
        "name": "Mecanismos de Transferencia de Calor",
        "short_description": "Estudio de los tres mecanismos de transferencia de calor: conducción, convección y radiación.",
        "sub_topics": [
          {
            "key": "conduccion",
            "name": "Conducción",
            "short_description": "Comprensión de la transferencia de calor por contacto directo entre partículas.",
            "example_tasks": [
              "Explica qué es la conducción térmica y cómo ocurre a nivel molecular.",
              "¿Por qué los metales conducen mejor el calor que la madera o el plástico?",
              "Da tres ejemplos cotidianos de conducción térmica (cuchara en café caliente, plancha, etc.).",
              "Explica por qué las ollas tienen mangos de madera o plástico en lugar de metal."
            ]
          },
          {
            "key": "conveccion",
            "name": "Convección",
            "short_description": "Análisis de la transferencia de calor mediante el movimiento de fluidos (líquidos y gases).",
            "example_tasks": [
              "Explica qué es la convección y por qué solo ocurre en fluidos.",
              "Describe cómo se forma una corriente de convección cuando calientas agua en una olla.",
              "¿Por qué el aire caliente sube y el aire frío baja? Relaciona con densidad.",
              "Explica cómo funcionan las brisas marinas (de día y de noche) usando el concepto de convección."
            ]
          },
          {
            "key": "radiacion",
            "name": "Radiación",
            "short_description": "Estudio de la transferencia de calor mediante ondas electromagnéticas sin necesidad de medio material.",
            "example_tasks": [
              "Explica qué es la radiación térmica. ¿Por qué no necesita un medio material para propagarse?",
              "¿Cómo llega el calor del Sol a la Tierra si el espacio es prácticamente vacío?",
              "Explica por qué los objetos oscuros absorben más radiación y se calientan más que los objetos claros.",
              "Describe cómo funciona un termo o vaso aislante, identificando cómo minimiza los tres mecanismos de transferencia de calor."
            ]
          },
          {
            "key": "aplicaciones_transferencia",
            "name": "Aplicaciones de la Transferencia de Calor",
            "short_description": "Análisis de situaciones cotidianas y tecnológicas que involucran transferencia de calor.",
            "example_tasks": [
              "Explica cómo funciona un sistema de calefacción por radiadores en una casa, identificando los tres mecanismos de transferencia.",
              "Investiga cómo funcionan los paneles solares térmicos para calentar agua.",
              "Analiza por qué en climas fríos se recomienda usar varias capas de ropa en lugar de una sola capa gruesa.",
              "Describe los mecanismos de transferencia de calor involucrados cuando cocinas en una estufa: de la llama a la olla, dentro del líquido, etc."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "ondas_mecanicas",
    "name": "Ondas Mecánicas",
    "short_description": "Estudio de las ondas como perturbaciones que transportan energía sin transportar materia, sus características y clasificación en transversales y longitudinales.",
    "sub_topics": [
      {
        "key": "concepto_ondas",
        "name": "Concepto de Onda",
        "short_description": "Comprensión de las ondas como perturbaciones que se propagan transportando energía a través de un medio.",
        "sub_topics": [
          {
            "key": "que_es_onda",
            "name": "¿Qué es una Onda?",
            "short_description": "Definición de onda y comprensión de que transporta energía sin transportar materia.",
            "example_tasks": [
              "Define qué es una onda y explica por qué no transporta materia aunque sí transporta energía.",
              "Observa las olas en el mar o en una tina con agua. ¿Se mueve el agua hacia adelante o solo sube y baja?",
              "Da cinco ejemplos de ondas que encuentres en tu vida cotidiana.",
              "Explica cómo una 'ola' en un estadio demuestra que las ondas transportan energía sin transportar materia (las personas no se mueven de lugar)."
            ]
          },
          {
            "key": "medio_propagacion",
            "name": "Medio de Propagación",
            "short_description": "Comprensión de que las ondas mecánicas requieren un medio material para propagarse.",
            "example_tasks": [
              "Explica qué es el medio de propagación de una onda. ¿Qué ejemplos de medios conoces?",
              "¿Por qué no se puede escuchar sonido en el vacío del espacio?",
              "Diferencia entre ondas mecánicas (requieren medio) y ondas electromagnéticas (no requieren medio).",
              "Describe qué medio utilizan las siguientes ondas para propagarse: sonido, olas del mar, ondas en una cuerda."
            ]
          }
        ]
      },
      {
        "key": "tipos_ondas",
        "name": "Tipos de Ondas",
        "short_description": "Clasificación de ondas según la dirección de vibración: transversales y longitudinales.",
        "sub_topics": [
          {
            "key": "ondas_transversales",
            "name": "Ondas Transversales",
            "short_description": "Estudio de ondas donde la vibración es perpendicular a la dirección de propagación.",
            "example_tasks": [
              "Define onda transversal y dibuja un diagrama mostrando la dirección de vibración y propagación.",
              "Da tres ejemplos de ondas transversales (ondas en cuerdas, olas superficiales del agua, luz).",
              "Genera una onda transversal moviendo una cuerda. Describe cómo se mueve la cuerda y cómo se propaga la onda.",
              "Explica por qué las ondas en una cuerda de guitarra son transversales."
            ]
          },
          {
            "key": "ondas_longitudinales",
            "name": "Ondas Longitudinales",
            "short_description": "Análisis de ondas donde la vibración es paralela a la dirección de propagación.",
            "example_tasks": [
              "Define onda longitudinal y dibuja un diagrama mostrando la dirección de vibración y propagación.",
              "Explica cómo el sonido es una onda longitudinal que consiste en compresiones y rarefacciones del aire.",
              "Describe un resorte comprimido y extendido como modelo de onda longitudinal.",
              "¿Por qué no podemos ver las ondas sonoras en el aire aunque las podamos oír?"
            ]
          },
          {
            "key": "comparacion_tipos",
            "name": "Comparación entre Ondas Transversales y Longitudinales",
            "short_description": "Análisis de similitudes y diferencias entre ambos tipos de ondas.",
            "example_tasks": [
              "Elabora una tabla comparativa entre ondas transversales y longitudinales.",
              "Explica qué tienen en común y qué las diferencia a ambos tipos de ondas.",
              "¿Pueden existir ondas que sean tanto transversales como longitudinales? Investiga el caso de las olas del mar.",
              "Clasifica las siguientes ondas como transversales o longitudinales: sonido, luz, ondas sísmicas P, ondas sísmicas S, ondas en una cuerda."
            ]
          }
        ]
      },
      {
        "key": "parametros_ondas",
        "name": "Parámetros de las Ondas",
        "short_description": "Estudio de las magnitudes que caracterizan una onda: longitud de onda, amplitud, período, frecuencia y velocidad.",
        "sub_topics": [
          {
            "key": "longitud_onda",
            "name": "Longitud de Onda (λ)",
            "short_description": "Comprensión de la longitud de onda como la distancia entre dos puntos equivalentes consecutivos.",
            "example_tasks": [
              "Define longitud de onda. ¿Cómo se representa y en qué unidades se mide?",
              "Dibuja una onda y marca claramente su longitud de onda medida de cresta a cresta.",
              "Una onda tiene 5 crestas completas en una distancia de 10 m. Calcula su longitud de onda.",
              "Explica la diferencia entre longitud de onda medida de cresta a cresta y de valle a valle. ¿Son iguales?"
            ]
          },
          {
            "key": "amplitud",
            "name": "Amplitud",
            "short_description": "Definición de amplitud como la máxima distancia que se desplaza una partícula del medio respecto a su posición de equilibrio.",
            "example_tasks": [
              "Define amplitud de una onda. ¿Qué representa físicamente?",
              "Explica la relación entre la amplitud de una onda y la energía que transporta.",
              "Dibuja dos ondas con la misma longitud de onda pero diferente amplitud. ¿Cuál transporta más energía?",
              "¿Por qué un sonido más fuerte corresponde a una onda con mayor amplitud?"
            ]
          },
          {
            "key": "periodo_frecuencia",
            "name": "Período y Frecuencia",
            "short_description": "Comprensión del período como el tiempo de una oscilación completa y la frecuencia como el número de oscilaciones por segundo.",
            "example_tasks": [
              "Define período (T) y frecuencia (f). ¿Cuál es la relación matemática entre ellos?",
              "Una onda tiene frecuencia de 50 Hz. Calcula su período.",
              "Explica la diferencia entre una onda de alta frecuencia y una de baja frecuencia.",
              "Si una onda completa 20 oscilaciones en 4 segundos, calcula: a) su frecuencia, b) su período."
            ]
          },
          {
            "key": "velocidad_onda",
            "name": "Velocidad de Propagación",
            "short_description": "Cálculo de la velocidad de onda mediante v = λf y comprensión de los factores que la afectan.",
            "example_tasks": [
              "Deduce o explica la fórmula v = λf para la velocidad de una onda.",
              "Una onda tiene longitud de 2 m y frecuencia de 5 Hz. Calcula su velocidad de propagación.",
              "Explica de qué depende la velocidad de una onda (propiedades del medio, no de la fuente).",
              "Una cuerda vibra con frecuencia de 100 Hz y las ondas se propagan a 20 m/s. Calcula la longitud de onda."
            ]
          }
        ]
      },
      {
        "key": "fenomenos_ondulatorios",
        "name": "Fenómenos Ondulatorios",
        "short_description": "Estudio de comportamientos característicos de las ondas: reflexión, refracción, difracción e interferencia.",
        "sub_topics": [
          {
            "key": "reflexion_ondas",
            "name": "Reflexión",
            "short_description": "Análisis del rebote de ondas al encontrar un obstáculo o cambio de medio.",
            "example_tasks": [
              "Define reflexión de ondas. ¿Qué sucede cuando una onda encuentra un obstáculo?",
              "Explica el eco como un ejemplo de reflexión de ondas sonoras.",
              "Describe un experimento donde puedas observar la reflexión de ondas en agua o en una cuerda.",
              "Investiga cómo funciona el sonar de los murciélagos y los delfines usando reflexión de ondas."
            ]
          },
          {
            "key": "refraccion_ondas",
            "name": "Refracción",
            "short_description": "Comprensión del cambio de dirección de una onda al pasar de un medio a otro con diferente velocidad.",
            "example_tasks": [
              "Define refracción de ondas. ¿Por qué ocurre?",
              "Explica por qué las olas del mar cambian de dirección al acercarse a la costa (el agua se hace menos profunda).",
              "Describe cómo la refracción puede hacer que un objeto sumergido en agua se vea en una posición diferente.",
              "Investiga cómo los terremotos producen ondas que se refractan al pasar por diferentes capas de la Tierra."
            ]
          },
          {
            "key": "difraccion_ondas",
            "name": "Difracción",
            "short_description": "Estudio de la capacidad de las ondas para rodear obstáculos y expandirse al pasar por aberturas.",
            "example_tasks": [
              "Define difracción. ¿Qué permite que las ondas hagan esto?",
              "Explica por qué puedes escuchar a alguien que habla detrás de una esquina aunque no lo veas (difracción del sonido).",
              "Describe un experimento con ondas en agua que demuestre la difracción al pasar por una abertura pequeña.",
              "¿Por qué la difracción es más notable cuando el tamaño del obstáculo o abertura es similar a la longitud de onda?"
            ]
          },
          {
            "key": "interferencia_ondas",
            "name": "Interferencia",
            "short_description": "Análisis de la superposición de ondas que produce interferencia constructiva o destructiva.",
            "example_tasks": [
              "Define interferencia de ondas. ¿Qué es interferencia constructiva y destructiva?",
              "Explica qué sucede cuando dos ondas idénticas llegan a un punto en fase (crestas con crestas) o en contrafase (cresta con valle).",
              "Describe cómo se forman los patrones de interferencia en la superficie del agua cuando dos gotas caen simultáneamente.",
              "Investiga cómo los audífonos con cancelación de ruido usan interferencia destructiva para reducir sonidos externos."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "sonido",
    "name": "Sonido",
    "short_description": "Estudio del sonido como onda longitudinal, sus características, propagación en diferentes medios, fenómenos acústicos y efectos sobre el oído humano.",
    "sub_topics": [
      {
        "key": "naturaleza_sonido",
        "name": "Naturaleza del Sonido",
        "short_description": "Comprensión del sonido como onda mecánica longitudinal producida por vibraciones.",
        "sub_topics": [
          {
            "key": "produccion_sonido",
            "name": "Producción del Sonido",
            "short_description": "Análisis de cómo se produce el sonido mediante vibraciones de objetos.",
            "example_tasks": [
              "Explica cómo se produce el sonido. ¿Qué debe ocurrir para que haya sonido?",
              "Describe cómo funcionan tus cuerdas vocales para producir sonido cuando hablas.",
              "Toca un diapasón o una regla sobre el borde de una mesa. Explica qué está vibrando y cómo se produce el sonido.",
              "Investiga cómo producen sonido diferentes instrumentos musicales: guitarra (cuerdas), flauta (columna de aire), tambor (membrana)."
            ]
          },
          {
            "key": "propagacion_sonido",
            "name": "Propagación del Sonido",
            "short_description": "Estudio de cómo el sonido se propaga mediante compresiones y rarefacciones en el medio.",
            "example_tasks": [
              "Explica cómo se propaga el sonido en el aire como ondas de compresión y rarefacción.",
              "¿Por qué el sonido no puede propagarse en el vacío?",
              "Compara la velocidad del sonido en diferentes medios: aire (~340 m/s), agua (~1500 m/s), acero (~5000 m/s). ¿Qué patrón observas?",
              "Explica por qué ves primero el relámpago y luego escuchas el trueno, aunque ocurren simultáneamente."
            ]
          },
          {
            "key": "velocidad_sonido",
            "name": "Velocidad del Sonido",
            "short_description": "Comprensión de los factores que afectan la velocidad del sonido: tipo de medio, temperatura y densidad.",
            "example_tasks": [
              "La velocidad del sonido en el aire a 20°C es aproximadamente 343 m/s. Calcula cuánto tarda en recorrer 1 km.",
              "Explica por qué el sonido viaja más rápido en sólidos que en líquidos, y más rápido en líquidos que en gases.",
              "¿Cómo afecta la temperatura del aire a la velocidad del sonido? Investiga.",
              "Si ves un relámpago y escuchas el trueno 6 segundos después, ¿a qué distancia aproximada cayó el rayo?"
            ]
          }
        ]
      },
      {
        "key": "cualidades_sonido",
        "name": "Cualidades del Sonido",
        "short_description": "Estudio de las tres cualidades fundamentales del sonido: intensidad, tono y timbre.",
        "sub_topics": [
          {
            "key": "intensidad_volumen",
            "name": "Intensidad (Volumen)",
            "short_description": "Comprensión de la intensidad como la cantidad de energía que transporta la onda sonora.",
            "example_tasks": [
              "Define intensidad del sonido. ¿De qué parámetro de la onda depende principalmente?",
              "Explica la relación entre la amplitud de una onda sonora y el volumen que percibimos.",
              "¿Por qué los sonidos se debilitan (pierden intensidad) a medida que nos alejamos de la fuente?",
              "Describe la diferencia entre un susurro y un grito en términos de intensidad y amplitud de onda."
            ]
          },
          {
            "key": "tono_frecuencia",
            "name": "Tono (Altura)",
            "short_description": "Relación entre la frecuencia de un sonido y su tono (agudo o grave).",
            "example_tasks": [
              "Explica qué es el tono de un sonido. ¿Qué lo determina?",
              "¿Qué diferencia física hay entre un sonido agudo y uno grave?",
              "El rango audible del oído humano es aproximadamente 20 Hz a 20,000 Hz. ¿Qué son los infrasonidos y ultrasonidos?",
              "Compara las frecuencias de las voces: ¿por qué la voz de un niño suena más aguda que la de un adulto?"
            ]
          },
          {
            "key": "timbre",
            "name": "Timbre",
            "short_description": "Comprensión del timbre como la cualidad que permite distinguir la fuente del sonido.",
            "example_tasks": [
              "Define timbre. ¿Por qué puedes distinguir la voz de tu mamá de la de tu papá aunque hablen con el mismo volumen y tono?",
              "Explica por qué una guitarra y un piano suenan diferente aunque toquen la misma nota musical.",
              "El timbre depende de la forma de la onda y los armónicos presentes. Investiga qué son los armónicos.",
              "Describe cómo tu cerebro usa el timbre para identificar diferentes fuentes sonoras en tu ambiente."
            ]
          }
        ]
      },
      {
        "key": "fenomenos_acusticos",
        "name": "Fenómenos Acústicos",
        "short_description": "Análisis de fenómenos específicos del sonido: eco, reverberación, resonancia y efecto Doppler.",
        "sub_topics": [
          {
            "key": "eco_reverberacion",
            "name": "Eco y Reverberación",
            "short_description": "Estudio de la reflexión del sonido que produce eco y reverberación.",
            "example_tasks": [
              "Define eco. ¿Qué condiciones se necesitan para escuchar un eco?",
              "Explica la diferencia entre eco y reverberación.",
              "Calcula la distancia mínima a un obstáculo para escuchar un eco, sabiendo que el oído humano distingue sonidos separados al menos 0.1 segundos.",
              "Investiga por qué las montañas y los cañones son buenos lugares para experimentar ecos."
            ]
          },
          {
            "key": "resonancia_acustica",
            "name": "Resonancia Acústica",
            "short_description": "Comprensión del fenómeno de resonancia cuando un objeto vibra a su frecuencia natural.",
            "example_tasks": [
              "Define resonancia acústica. ¿Qué es la frecuencia natural de vibración?",
              "Explica por qué una copa de cristal puede romperse si se produce cerca de ella un sonido de cierta frecuencia.",
              "Describe cómo las cajas de resonancia en instrumentos musicales amplifican el sonido.",
              "Investiga el caso del puente de Tacoma Narrows que colapsó por resonancia en 1940."
            ]
          },
          {
            "key": "efecto_doppler",
            "name": "Efecto Doppler",
            "short_description": "Análisis del cambio aparente de frecuencia cuando la fuente sonora o el observador están en movimiento.",
            "example_tasks": [
              "Define el efecto Doppler. ¿Qué sucede con la frecuencia percibida?",
              "Explica por qué la sirena de una ambulancia suena más aguda cuando se acerca y más grave cuando se aleja.",
              "Describe cómo el efecto Doppler se usa en radares de velocidad para detectar vehículos que exceden límites.",
              "Investiga cómo los astrónomos usan el efecto Doppler para determinar si las galaxias se acercan o se alejan de nosotros."
            ]
          },
          {
            "key": "contaminacion_acustica",
            "name": "Contaminación Acústica",
            "short_description": "Análisis de los efectos del ruido excesivo en la salud y el ambiente.",
            "example_tasks": [
              "Define contaminación acústica. ¿A partir de qué nivel de decibeles el ruido se considera perjudicial?",
              "Enumera cinco fuentes comunes de contaminación acústica en las ciudades.",
              "Investiga los efectos negativos de la exposición prolongada a niveles altos de ruido.",
              "Propón tres medidas para reducir la contaminación acústica en tu escuela o comunidad."
            ]
          }
        ]
      },
      {
        "key": "oido_audicion",
        "name": "El Oído y la Audición",
        "short_description": "Estudio de la anatomía del oído humano y el proceso de audición.",
        "sub_topics": [
          {
            "key": "partes_oido",
            "name": "Partes del Oído",
            "short_description": "Identificación de las estructuras del oído externo, medio e interno.",
            "example_tasks": [
              "Dibuja un diagrama del oído humano identificando: pabellón auricular, canal auditivo, tímpano, huesecillos, cóclea.",
              "Explica la función de cada parte del oído en el proceso de audición.",
              "Describe cómo las ondas sonoras se convierten en señales eléctricas que el cerebro interpreta.",
              "Investiga qué son los huesecillos del oído medio (martillo, yunque, estribo) y cómo amplifican el sonido."
            ]
          },
          {
            "key": "limites_audicion",
            "name": "Límites de la Audición Humana",
            "short_description": "Comprensión del rango de frecuencias audibles y la sensibilidad del oído.",
            "example_tasks": [
              "¿Cuál es el rango de frecuencias que puede detectar el oído humano? (aproximadamente 20 Hz a 20,000 Hz).",
              "Explica qué son los infrasonidos y ultrasonidos. Da ejemplos de animales que pueden detectarlos.",
              "Investiga cómo la edad afecta la capacidad auditiva (pérdida de audición de altas frecuencias).",
              "¿Por qué algunos animales como perros y murciélagos pueden escuchar ultrasonidos que los humanos no detectan?"
            ]
          },
          {
            "key": "cuidado_oido",
            "name": "Cuidado del Oído",
            "short_description": "Importancia de proteger el oído de daños por ruido excesivo.",
            "example_tasks": [
              "Explica cómo la exposición a sonidos muy intensos puede dañar permanentemente el oído.",
              "¿Por qué es importante usar protección auditiva en ambientes ruidosos (conciertos, construcción, aeropuertos)?",
              "Investiga qué nivel de decibeles produce dolor en el oído humano y posible daño.",
              "Propón tres hábitos saludables para cuidar tu audición (volumen moderado en audífonos, descansos auditivos, etc.)."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "luz_optica_geometrica",
    "name": "Luz y Óptica Geométrica",
    "short_description": "Estudio de la naturaleza de la luz, su propagación en línea recta, y los fenómenos de reflexión y refracción según la óptica geométrica.",
    "sub_topics": [
      {
        "key": "naturaleza_luz",
        "name": "Naturaleza de la Luz",
        "short_description": "Comprensión de la luz como onda electromagnética y sus propiedades fundamentales.",
        "sub_topics": [
          {
            "key": "que_es_luz",
            "name": "¿Qué es la Luz?",
            "short_description": "Introducción a la naturaleza dual de la luz (onda y partícula) y sus características básicas.",
            "example_tasks": [
              "Define luz. ¿Por qué se dice que tiene una naturaleza dual (onda-partícula)?",
              "Explica por qué la luz puede viajar en el vacío a diferencia del sonido.",
              "¿Cuál es la velocidad de la luz en el vacío? (aproximadamente 300,000 km/s o 3×10⁸ m/s).",
              "Describe tres fuentes naturales y tres artificiales de luz."
            ]
          },
          {
            "key": "propagacion_luz",
            "name": "Propagación de la Luz",
            "short_description": "Comprensión de que la luz se propaga en línea recta en medios homogéneos.",
            "example_tasks": [
              "Enuncia el principio de propagación rectilínea de la luz.",
              "Explica cómo se forman las sombras usando el principio de propagación rectilínea.",
              "Describe qué son la penumbra y la sombra total en un eclipse.",
              "Diseña un experimento sencillo para demostrar que la luz viaja en línea recta (cámara oscura, luz a través de agujeros alineados)."
            ]
          },
          {
            "key": "cuerpos_luz",
            "name": "Cuerpos Luminosos y Cuerpos Iluminados",
            "short_description": "Distinción entre objetos que emiten luz propia y objetos que reflejan luz.",
            "example_tasks": [
              "Explica la diferencia entre cuerpos luminosos y cuerpos iluminados. Da tres ejemplos de cada uno.",
              "¿Por qué vemos la Luna aunque no emite luz propia?",
              "Clasifica los siguientes objetos: Sol, Luna, linterna encendida, espejo, libro, vela encendida.",
              "Explica por qué podemos ver los objetos que no emiten luz propia (reflexión difusa)."
            ]
          }
        ]
      },
      {
        "key": "reflexion_luz",
        "name": "Reflexión de la Luz",
        "short_description": "Estudio del rebote de la luz en superficies, las leyes de reflexión y formación de imágenes en espejos.",
        "sub_topics": [
          {
            "key": "leyes_reflexion",
            "name": "Leyes de la Reflexión",
            "short_description": "Comprensión de las dos leyes fundamentales que gobiernan la reflexión de la luz.",
            "example_tasks": [
              "Enuncia las dos leyes de la reflexión de la luz.",
              "Dibuja un diagrama mostrando un rayo incidente, el rayo reflejado, la normal y los ángulos correspondientes.",
              "Si un rayo de luz incide sobre un espejo formando un ángulo de 30° con la normal, ¿cuál es el ángulo de reflexión?",
              "Explica por qué cuando te miras en un espejo plano, tu imagen aparece a la misma distancia detrás del espejo que tú estás delante."
            ]
          },
          {
            "key": "reflexion_tipos",
            "name": "Reflexión Especular y Difusa",
            "short_description": "Diferenciación entre reflexión en superficies lisas (especular) y rugosas (difusa).",
            "example_tasks": [
              "Explica la diferencia entre reflexión especular y reflexión difusa.",
              "¿Por qué un espejo produce una imagen clara mientras que una pared blanca no, aunque ambos reflejan luz?",
              "Describe cómo la reflexión difusa nos permite ver los objetos que no son fuentes luminosas.",
              "Da ejemplos de superficies que producen reflexión especular y difusa en tu entorno."
            ]
          },
          {
            "key": "espejos_planos",
            "name": "Espejos Planos",
            "short_description": "Análisis de la formación de imágenes en espejos planos y sus características.",
            "example_tasks": [
              "Describe las características de la imagen formada por un espejo plano: virtual, derecha, mismo tamaño, simétrica.",
              "Explica por qué la imagen en un espejo plano aparece invertida lateralmente (izquierda-derecha).",
              "Si te paras a 2 m de un espejo plano, ¿a qué distancia del espejo aparece tu imagen?",
              "Dibuja el diagrama de rayos para mostrar cómo se forma la imagen de un objeto frente a un espejo plano."
            ]
          },
          {
            "key": "espejos_curvos",
            "name": "Espejos Curvos (Cóncavos y Convexos)",
            "short_description": "Introducción básica a los espejos esféricos y sus aplicaciones.",
            "example_tasks": [
              "Explica la diferencia entre un espejo cóncavo (convergente) y un espejo convexo (divergente).",
              "Describe una aplicación de cada tipo: espejos cóncavos en telescopios y linternas, espejos convexos en retrovisores de automóviles.",
              "¿Por qué los espejos convexos de los retrovisores advierten que 'los objetos están más cerca de lo que aparentan'?",
              "Investiga qué es el foco de un espejo cóncavo y cómo se usa para concentrar luz."
            ]
          }
        ]
      },
      {
        "key": "refraccion_luz",
        "name": "Refracción de la Luz",
        "short_description": "Estudio del cambio de dirección de la luz al pasar entre medios con diferentes índices de refracción.",
        "sub_topics": [
          {
            "key": "concepto_refraccion",
            "name": "Concepto de Refracción",
            "short_description": "Comprensión de la refracción como el cambio de dirección de la luz al cambiar de medio.",
            "example_tasks": [
              "Define refracción de la luz. ¿Por qué ocurre?",
              "Explica el fenómeno de que un lápiz sumergido en agua parece quebrado o doblado.",
              "Describe cómo cambia la velocidad de la luz al pasar del aire al agua o al vidrio.",
              "¿Por qué la refracción hace que una alberca parezca menos profunda de lo que realmente es?"
            ]
          },
          {
            "key": "indice_refraccion",
            "name": "Índice de Refracción",
            "short_description": "Comprensión del índice de refracción como medida de cuánto se desvía la luz en un medio.",
            "example_tasks": [
              "Define índice de refracción. ¿Qué significa que el agua tenga n = 1.33?",
              "Explica por qué la luz se desvía más al entrar en vidrio (n ≈ 1.5) que en agua (n ≈ 1.33).",
              "¿En qué medio viaja la luz más rápido: aire, agua o vidrio? Justifica usando el índice de refracción.",
              "Ordena los siguientes medios según su índice de refracción: vacío, aire, agua, vidrio, diamante."
            ]
          },
          {
            "key": "ley_snell",
            "name": "Ley de Snell (introducción cualitativa)",
            "short_description": "Comprensión cualitativa de cómo se relacionan los ángulos de incidencia y refracción.",
            "example_tasks": [
              "Describe cualitativamente qué sucede cuando la luz pasa de un medio menos denso a uno más denso (se acerca a la normal).",
              "¿Qué sucede cuando la luz pasa de un medio más denso a uno menos denso? (se aleja de la normal).",
              "Dibuja el diagrama de un rayo de luz pasando del aire al agua, mostrando cómo se desvía hacia la normal.",
              "Explica por qué un diamante 'brilla' tanto (alto índice de refracción causa gran desviación de la luz)."
            ]
          },
          {
            "key": "aplicaciones_refraccion",
            "name": "Aplicaciones de la Refracción",
            "short_description": "Análisis de fenómenos y aplicaciones prácticas de la refracción.",
            "example_tasks": [
              "Explica cómo funcionan los lentes correctivos (para miopía e hipermetropía) usando refracción.",
              "Investiga qué es un espejismo y cómo se produce por refracción de luz en capas de aire de diferentes temperaturas.",
              "Describe cómo las fibras ópticas usan reflexión interna total (refracción especial) para transmitir luz e información.",
              "Explica por qué las estrellas 'titilan': la luz se refracta al pasar por capas de la atmósfera con diferentes densidades."
            ]
          }
        ]
      },
      {
        "key": "color_dispersion",
        "name": "Color y Dispersión de la Luz",
        "short_description": "Estudio de cómo la luz blanca se descompone en colores y la naturaleza del color.",
        "sub_topics": [
          {
            "key": "dispersion_prisma",
            "name": "Dispersión de la Luz",
            "short_description": "Comprensión de cómo un prisma descompone la luz blanca en el espectro de colores.",
            "example_tasks": [
              "Explica qué es la dispersión de la luz y cómo un prisma separa la luz blanca en colores.",
              "¿Por qué diferentes colores se refractan en ángulos ligeramente diferentes en un prisma?",
              "Enumera los colores del espectro visible en orden: rojo, naranja, amarillo, verde, azul, añil, violeta (ROYGBIV).",
              "Investiga el experimento de Newton con prismas que demostró que la luz blanca está compuesta de colores."
            ]
          },
          {
            "key": "arcoiris",
            "name": "El Arcoíris",
            "short_description": "Explicación de la formación del arcoíris mediante refracción y reflexión en gotas de agua.",
            "example_tasks": [
              "Explica cómo se forma un arcoíris: dispersión de luz solar en gotas de agua de lluvia.",
              "¿Por qué el arcoíris tiene forma de arco?",
              "Describe las condiciones necesarias para observar un arcoíris: sol a tus espaldas, lluvia frente a ti.",
              "Investiga qué es un arcoíris doble y por qué tiene el orden de colores invertido."
            ]
          },
          {
            "key": "color_objetos",
            "name": "Color de los Objetos",
            "short_description": "Comprensión de que el color de un objeto depende de qué longitudes de onda refleja.",
            "example_tasks": [
              "Explica por qué vemos una manzana roja: absorbe todos los colores excepto el rojo que refleja.",
              "¿Por qué un objeto se ve blanco? ¿Por qué se ve negro?",
              "Si iluminas una hoja verde con luz roja, ¿de qué color la verás? Explica.",
              "Describe cómo funcionan los filtros de color: absorben ciertos colores y transmiten otros."
            ]
          },
          {
            "key": "mezcla_colores",
            "name": "Mezcla de Colores",
            "short_description": "Distinción entre mezcla aditiva (luz) y mezcla sustractiva (pigmentos).",
            "example_tasks": [
              "Explica la diferencia entre colores primarios de luz (RGB: rojo, verde, azul) y colores primarios de pigmentos (CMY: cian, magenta, amarillo).",
              "Describe cómo las pantallas de computadora y televisión usan mezcla aditiva (RGB) para crear colores.",
              "Explica cómo las impresoras usan mezcla sustractiva (CMYK) para reproducir colores.",
              "¿Qué color resulta de mezclar luz roja y luz verde? ¿Y de mezclar pintura roja y verde?"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "optica_instrumentos",
    "name": "Óptica y Instrumentos Ópticos",
    "short_description": "Estudio de lentes, formación de imágenes, el ojo humano y diversos instrumentos ópticos como microscopios, telescopios y cámaras.",
    "sub_topics": [
      {
        "key": "lentes",
        "name": "Lentes",
        "short_description": "Estudio de lentes convergentes y divergentes, formación de imágenes y aplicaciones.",
        "sub_topics": [
          {
            "key": "tipos_lentes",
            "name": "Tipos de Lentes",
            "short_description": "Clasificación de lentes en convergentes (convexas) y divergentes (cóncavas).",
            "example_tasks": [
              "Explica la diferencia entre lentes convergentes (convexas) y lentes divergentes (cóncavas).",
              "Dibuja el perfil de cada tipo de lente y describe cómo afectan los rayos de luz paralelos.",
              "¿Qué es el punto focal de una lente? ¿Cómo difiere entre lentes convergentes y divergentes?",
              "Da ejemplos de aplicaciones de cada tipo: lentes convergentes en lupas y anteojos para hipermetropía, divergentes para miopía."
            ]
          },
          {
            "key": "formacion_imagenes_lentes",
            "name": "Formación de Imágenes en Lentes",
            "short_description": "Análisis de cómo se forman imágenes reales y virtuales con diferentes posiciones del objeto.",
            "example_tasks": [
              "Explica la diferencia entre una imagen real y una imagen virtual.",
              "Describe cómo una lupa (lente convergente) aumenta el tamaño de un objeto.",
              "¿Por qué una lente convergente puede formar imágenes reales o virtuales dependiendo de dónde coloques el objeto?",
              "Investiga cómo funcionan los proyectores usando lentes convergentes para formar imágenes reales en una pantalla."
            ]
          },
          {
            "key": "distancia_focal",
            "name": "Distancia Focal y Potencia",
            "short_description": "Comprensión de la distancia focal y la potencia de una lente medida en dioptrías.",
            "example_tasks": [
              "Define distancia focal de una lente. ¿Cómo se relaciona con su potencia de refracción?",
              "Explica qué son las dioptrías y cómo se usan para medir la potencia de lentes correctivos.",
              "Una lente tiene distancia focal de 50 cm. ¿Cuál es su potencia en dioptrías? (P = 1/f en metros).",
              "¿Por qué los anteojos para miopía tienen valores negativos de dioptrías (lentes divergentes)?"
            ]
          }
        ]
      },
      {
        "key": "ojo_humano",
        "name": "El Ojo Humano",
        "short_description": "Estudio de la anatomía del ojo, el proceso de visión y los defectos visuales comunes.",
        "sub_topics": [
          {
            "key": "anatomia_ojo",
            "name": "Anatomía del Ojo",
            "short_description": "Identificación de las partes del ojo y sus funciones en el proceso visual.",
            "example_tasks": [
              "Dibuja un diagrama del ojo humano identificando: córnea, iris, pupila, cristalino, retina, nervio óptico.",
              "Explica la función de cada parte del ojo en el proceso de visión.",
              "Describe cómo el ojo funciona de manera similar a una cámara fotográfica.",
              "¿Qué función cumple el cristalino? ¿Cómo cambia su forma para enfocar objetos cercanos y lejanos?"
            ]
          },
          {
            "key": "proceso_vision",
            "name": "Proceso de la Visión",
            "short_description": "Comprensión de cómo la luz se convierte en impulsos nerviosos que el cerebro interpreta.",
            "example_tasks": [
              "Describe el proceso completo de la visión: desde que la luz entra al ojo hasta que el cerebro interpreta la imagen.",
              "Explica qué son los fotorreceptores (conos y bastones) en la retina y cuál es su función.",
              "¿Por qué la imagen formada en la retina está invertida? ¿Cómo la 'corrige' el cerebro?",
              "Investiga la diferencia entre conos (visión en color) y bastones (visión en condiciones de poca luz)."
            ]
          },
          {
            "key": "defectos_visuales",
            "name": "Defectos Visuales",
            "short_description": "Estudio de los problemas visuales comunes: miopía, hipermetropía y astigmatismo.",
            "example_tasks": [
              "Explica qué es la miopía: dificultad para ver objetos lejanos porque la imagen se forma antes de la retina.",
              "Describe la hipermetropía: dificultad para ver objetos cercanos porque la imagen se formaría detrás de la retina.",
              "¿Qué tipo de lente se usa para corregir cada defecto? (miopía: divergente, hipermetropía: convergente).",
              "Investiga qué es el astigmatismo y cómo se produce (curvatura irregular de la córnea o cristalino)."
            ]
          },
          {
            "key": "cuidado_vista",
            "name": "Cuidado de la Vista",
            "short_description": "Importancia de proteger los ojos y mantener la salud visual.",
            "example_tasks": [
              "Enumera cinco hábitos saludables para cuidar tu vista.",
              "Explica por qué es importante descansar la vista cada cierto tiempo al usar pantallas (regla 20-20-20).",
              "¿Por qué debemos usar lentes de sol con protección UV?",
              "Investiga la importancia de la iluminación adecuada al leer o estudiar."
            ]
          }
        ]
      },
      {
        "key": "instrumentos_opticos",
        "name": "Instrumentos Ópticos",
        "short_description": "Análisis de diversos instrumentos que utilizan lentes y espejos para ampliar imágenes o mejorar la visión.",
        "sub_topics": [
          {
            "key": "lupa_microscopio",
            "name": "Lupa y Microscopio",
            "short_description": "Estudio de instrumentos para observar objetos pequeños con mayor detalle.",
            "example_tasks": [
              "Explica cómo funciona una lupa usando una lente convergente para aumentar objetos.",
              "Describe las partes básicas de un microscopio óptico: ocular, objetivos, platina, fuente de luz.",
              "¿Cómo un microscopio compuesto logra mayor aumento que una simple lupa?",
              "Investiga las diferencias entre un microscopio óptico y un microscopio electrónico en cuanto a resolución y aumentos."
            ]
          },
          {
            "key": "telescopio",
            "name": "Telescopio",
            "short_description": "Comprensión de cómo los telescopios permiten observar objetos lejanos como estrellas y planetas.",
            "example_tasks": [
              "Explica la diferencia entre un telescopio refractor (usa lentes) y un reflector (usa espejos).",
              "Describe cómo funciona un telescopio para hacer que objetos lejanos se vean más grandes y brillantes.",
              "Investiga quién inventó el primer telescopio y cómo revolucionó la astronomía (Galileo Galilei).",
              "¿Por qué los telescopios más grandes y potentes usan espejos en lugar de lentes?"
            ]
          },
          {
            "key": "camara_fotografica",
            "name": "Cámara Fotográfica",
            "short_description": "Análisis de los principios ópticos de las cámaras y su similitud con el ojo humano.",
            "example_tasks": [
              "Compara las partes de una cámara con las del ojo humano: lente/cristalino, diafragma/iris, sensor-película/retina.",
              "Explica qué función cumple el diafragma de una cámara al controlar la cantidad de luz.",
              "¿Qué es la distancia focal de un lente de cámara y cómo afecta el campo de visión?",
              "Investiga la diferencia entre cámaras analógicas (película) y digitales (sensor electrónico)."
            ]
          },
          {
            "key": "otros_instrumentos",
            "name": "Otros Instrumentos Ópticos",
            "short_description": "Introducción a otros dispositivos ópticos: binoculares, periscopio, proyector.",
            "example_tasks": [
              "Explica cómo funcionan los binoculares como dos telescopios refractores paralelos.",
              "Describe el funcionamiento de un periscopio usando dos espejos planos paralelos.",
              "¿Cómo funciona un proyector para ampliar imágenes en una pantalla grande?",
              "Investiga aplicaciones modernas de la óptica: endoscopios médicos, códigos de barras, lectores ópticos."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "espectro_electromagnetico",
    "name": "Espectro Electromagnético",
    "short_description": "Estudio de las diferentes regiones del espectro electromagnético, desde ondas de radio hasta rayos gamma, y sus aplicaciones tecnológicas.",
    "sub_topics": [
      {
        "key": "ondas_electromagneticas",
        "name": "Ondas Electromagnéticas",
        "short_description": "Comprensión de la naturaleza de las ondas electromagnéticas y sus propiedades fundamentales.",
        "sub_topics": [
          {
            "key": "naturaleza_ondas_em",
            "name": "Naturaleza de las Ondas Electromagnéticas",
            "short_description": "Entendimiento de que las ondas EM son perturbaciones de campos eléctricos y magnéticos que no requieren medio.",
            "example_tasks": [
              "Explica qué son las ondas electromagnéticas. ¿Por qué pueden viajar en el vacío?",
              "Describe cómo todas las ondas electromagnéticas viajan a la velocidad de la luz (3×10⁸ m/s en el vacío).",
              "¿Qué tienen en común y qué diferencia a todas las ondas del espectro electromagnético?",
              "Da ejemplos de ondas electromagnéticas que uses o encuentres diariamente."
            ]
          },
          {
            "key": "espectro_completo",
            "name": "El Espectro Electromagnético Completo",
            "short_description": "Visión general de las diferentes regiones ordenadas por frecuencia y longitud de onda.",
            "example_tasks": [
              "Enumera las principales regiones del espectro electromagnético en orden de frecuencia creciente: ondas de radio, microondas, infrarrojo, luz visible, ultravioleta, rayos X, rayos gamma.",
              "Explica la relación inversa entre longitud de onda y frecuencia en ondas EM.",
              "¿Qué región del espectro puede detectar el ojo humano? (luz visible, aproximadamente 400-700 nm).",
              "Elabora un diagrama del espectro electromagnético mostrando las diferentes regiones con ejemplos de aplicaciones."
            ]
          }
        ]
      },
      {
        "key": "regiones_espectro",
        "name": "Regiones del Espectro",
        "short_description": "Estudio detallado de cada región del espectro electromagnético y sus características.",
        "sub_topics": [
          {
            "key": "ondas_radio",
            "name": "Ondas de Radio",
            "short_description": "Comprensión de las ondas de mayor longitud usadas en comunicaciones.",
            "example_tasks": [
              "Describe las características de las ondas de radio: mayor longitud de onda, menor frecuencia del espectro.",
              "Explica cómo se usan las ondas de radio en: radio AM/FM, televisión, teléfonos celulares, WiFi.",
              "¿Por qué las ondas de radio pueden viajar grandes distancias y atravesar paredes?",
              "Investiga cómo funcionan las antenas para transmitir y recibir ondas de radio."
            ]
          },
          {
            "key": "microondas",
            "name": "Microondas",
            "short_description": "Estudio de microondas y sus aplicaciones en comunicaciones y cocina.",
            "example_tasks": [
              "Explica cómo funciona un horno de microondas para calentar alimentos.",
              "Describe el uso de microondas en telecomunicaciones: radar, satélites, telefonía celular.",
              "¿Por qué las microondas son efectivas para calentar agua y alimentos?",
              "Investiga las medidas de seguridad en hornos de microondas (puerta con malla metálica para contener las ondas)."
            ]
          },
          {
            "key": "infrarrojo",
            "name": "Radiación Infrarroja",
            "short_description": "Comprensión del infrarrojo como radiación térmica invisible al ojo humano.",
            "example_tasks": [
              "Explica qué es la radiación infrarroja y por qué la asociamos con el calor.",
              "Describe aplicaciones del infrarrojo: controles remotos, cámaras térmicas, visión nocturna.",
              "¿Por qué los objetos calientes emiten más radiación infrarroja?",
              "Investiga cómo las serpientes de cascabel usan receptores de infrarrojo para 'ver' presas de sangre caliente en la oscuridad."
            ]
          },
          {
            "key": "luz_visible",
            "name": "Luz Visible",
            "short_description": "Estudio de la pequeña porción del espectro que podemos ver, del rojo al violeta.",
            "example_tasks": [
              "Identifica el rango de longitudes de onda de la luz visible (aproximadamente 400-700 nm).",
              "Explica por qué el rojo tiene la mayor longitud de onda visible y el violeta la menor.",
              "Describe cómo cada color corresponde a una longitud de onda específica.",
              "¿Por qué evolucionó nuestro ojo para detectar específicamente esta región del espectro? (es la que más emite el Sol)."
            ]
          },
          {
            "key": "ultravioleta",
            "name": "Radiación Ultravioleta (UV)",
            "short_description": "Análisis de la radiación UV, sus efectos en la salud y aplicaciones.",
            "example_tasks": [
              "Explica qué es la radiación ultravioleta y por qué es invisible para nosotros.",
              "Describe los efectos positivos del UV: producción de vitamina D, desinfección.",
              "¿Cuáles son los riesgos de la exposición excesiva al UV? (quemaduras, cáncer de piel).",
              "Investiga cómo funciona el protector solar bloqueando o absorbiendo radiación UV."
            ]
          },
          {
            "key": "rayos_x",
            "name": "Rayos X",
            "short_description": "Estudio de los rayos X y sus aplicaciones médicas e industriales.",
            "example_tasks": [
              "Explica qué son los rayos X y por qué pueden atravesar tejidos blandos pero no huesos densos.",
              "Describe el uso médico de rayos X en radiografías y tomografías.",
              "¿Por qué los técnicos radiólogos usan protección de plomo?",
              "Investiga otras aplicaciones de rayos X: inspección de equipaje en aeropuertos, análisis de materiales."
            ]
          },
          {
            "key": "rayos_gamma",
            "name": "Rayos Gamma",
            "short_description": "Comprensión de la radiación de más alta energía y frecuencia del espectro.",
            "example_tasks": [
              "Describe los rayos gamma: mayor frecuencia, menor longitud de onda, mayor energía del espectro.",
              "Explica de dónde provienen los rayos gamma: desintegración nuclear, eventos cósmicos.",
              "¿Qué aplicaciones tienen los rayos gamma? (tratamiento de cáncer, esterilización de equipos médicos).",
              "Investiga por qué los rayos gamma son tan peligrosos para los seres vivos (alta energía ionizante)."
            ]
          }
        ]
      },
      {
        "key": "aplicaciones_espectro",
        "name": "Aplicaciones del Espectro Electromagnético",
        "short_description": "Análisis de aplicaciones tecnológicas y científicas de diferentes regiones del espectro.",
        "sub_topics": [
          {
            "key": "comunicaciones",
            "name": "Comunicaciones",
            "short_description": "Uso de ondas EM en sistemas de comunicación modernos.",
            "example_tasks": [
              "Explica cómo las diferentes regiones del espectro se usan en comunicaciones: radio, TV, celulares, satélites, fibra óptica.",
              "Describe la ventaja de usar diferentes frecuencias para diferentes aplicaciones.",
              "¿Por qué el WiFi y Bluetooth usan microondas de baja potencia?",
              "Investiga cómo evolucionaron las comunicaciones: de telégrafo, a radio, a televisión, a internet inalámbrico."
            ]
          },
          {
            "key": "medicina",
            "name": "Aplicaciones Médicas",
            "short_description": "Uso de ondas EM en diagnóstico y tratamiento médico.",
            "example_tasks": [
              "Enumera aplicaciones médicas de diferentes regiones: rayos X (radiografías), UV (desinfección), gamma (radioterapia), infrarrojo (termografía).",
              "Explica cómo la radioterapia usa radiación gamma o rayos X para destruir células cancerosas.",
              "Describe cómo funcionan las lámparas UV para desinfectar quirófanos y equipos médicos.",
              "Investiga qué es una tomografía computarizada (CT scan) y cómo usa rayos X."
            ]
          },
          {
            "key": "astronomia",
            "name": "Astronomía en Diferentes Longitudes de Onda",
            "short_description": "Observación del universo en diferentes regiones del espectro.",
            "example_tasks": [
              "Explica por qué los astrónomos observan el espacio en diferentes longitudes de onda, no solo luz visible.",
              "Describe qué revelan diferentes regiones: radio (galaxias, púlsares), infrarrojo (estrellas nacientes), rayos X (agujeros negros).",
              "¿Por qué algunos telescopios deben estar en el espacio? (la atmósfera bloquea muchas longitudes de onda).",
              "Investiga el Telescopio Espacial Hubble y qué regiones del espectro puede observar."
            ]
          },
          {
            "key": "tecnologia_cotidiana",
            "name": "Tecnología Cotidiana",
            "short_description": "Aplicaciones de ondas EM en dispositivos de uso diario.",
            "example_tasks": [
              "Identifica qué tipo de ondas EM usan los siguientes dispositivos: control remoto, horno de microondas, celular, router WiFi, lámpara, lámpara bronceadora.",
              "Explica cómo los códigos de barras y escáneres usan luz (generalmente láser) para leer información.",
              "Describe cómo funcionan los sensores de movimiento usando infrarrojo o microondas.",
              "Investiga tecnologías emergentes que usan ondas EM: carga inalámbrica, 5G, realidad aumentada."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "electrostatica",
    "name": "Electrostática",
    "short_description": "Estudio de las cargas eléctricas en reposo, sus interacciones, la ley de Coulomb y los fenómenos de electrización y campo eléctrico.",
    "sub_topics": [
      {
        "key": "carga_electrica",
        "name": "Carga Eléctrica",
        "short_description": "Comprensión de la carga eléctrica como propiedad fundamental de la materia, con dos tipos: positiva y negativa.",
        "sub_topics": [
          {
            "key": "naturaleza_carga",
            "name": "Naturaleza de la Carga Eléctrica",
            "short_description": "Entendimiento de que la carga eléctrica reside en protones (positiva) y electrones (negativa).",
            "example_tasks": [
              "Define carga eléctrica. ¿Qué partículas subatómicas poseen carga eléctrica?",
              "Explica por qué un átomo normalmente es eléctricamente neutro.",
              "Describe la diferencia entre carga positiva y negativa en términos de protones y electrones.",
              "¿Cuál es la unidad de carga eléctrica en el Sistema Internacional? (coulomb, C)."
            ]
          },
          {
            "key": "conservacion_carga",
            "name": "Conservación de la Carga",
            "short_description": "Comprensión de que la carga eléctrica total de un sistema aislado se conserva.",
            "example_tasks": [
              "Enuncia el principio de conservación de la carga eléctrica.",
              "Explica cómo al frotar dos objetos neutros, uno adquiere carga positiva y el otro negativa, pero la carga total permanece cero.",
              "¿Por qué no se puede crear ni destruir carga eléctrica, solo transferirla?",
              "Describe un ejemplo donde se observe la conservación de carga: electrización por frotamiento."
            ]
          },
          {
            "key": "interaccion_cargas",
            "name": "Interacción entre Cargas",
            "short_description": "Comprensión de que cargas del mismo signo se repelen y de signo opuesto se atraen.",
            "example_tasks": [
              "Enuncia el principio fundamental de la electrostática: cargas iguales se repelen, cargas opuestas se atraen.",
              "Explica por qué un globo frotado puede atraer pequeños pedazos de papel.",
              "Describe experimentos sencillos que demuestren atracción y repulsión eléctrica.",
              "¿Por qué el cabello se levanta y separa después de peinarlo con un peine de plástico en ambiente seco?"
            ]
          }
        ]
      },
      {
        "key": "metodos_electrizacion",
        "name": "Métodos de Electrización",
        "short_description": "Estudio de las formas de cargar eléctricamente un objeto: frotamiento, contacto e inducción.",
        "sub_topics": [
          {
            "key": "electrizacion_frotamiento",
            "name": "Electrización por Frotamiento",
            "short_description": "Transferencia de electrones entre dos materiales al frotarlos.",
            "example_tasks": [
              "Explica cómo funciona la electrización por frotamiento: transferencia de electrones de un material a otro.",
              "Da tres ejemplos de electrización por frotamiento: peine y cabello, globo y lana, ámbar frotado.",
              "¿Por qué algunos materiales ceden electrones fácilmente mientras otros los aceptan?",
              "Realiza un experimento: frota un globo con tu cabello y observa cómo puede atraer papelitos o pegarse a la pared."
            ]
          },
          {
            "key": "electrizacion_contacto",
            "name": "Electrización por Contacto",
            "short_description": "Transferencia de carga al tocar un objeto cargado con uno neutro.",
            "example_tasks": [
              "Explica cómo funciona la electrización por contacto: redistribución de cargas entre objetos en contacto.",
              "Describe qué sucede cuando tocas un objeto cargado con tu dedo (transferencia de carga).",
              "Si tocas una esfera metálica neutra con una barra cargada negativamente, ¿qué tipo de carga adquiere la esfera?",
              "Explica por qué los materiales conductores se electrizan mejor por contacto que los aislantes."
            ]
          },
          {
            "key": "electrizacion_induccion",
            "name": "Electrización por Inducción",
            "short_description": "Separación de cargas en un objeto neutro por la presencia cercana de un objeto cargado.",
            "example_tasks": [
              "Explica cómo funciona la electrización por inducción: redistribución de cargas sin contacto directo.",
              "Describe el proceso completo de electrización por inducción usando una esfera metálica y una barra cargada.",
              "¿Por qué un globo cargado puede atraer objetos neutros como una pared o el agua de un grifo?",
              "Investiga cómo funcionan los electroscopios para detectar cargas eléctricas usando inducción."
            ]
          }
        ]
      },
      {
        "key": "conductores_aislantes",
        "name": "Conductores y Aislantes",
        "short_description": "Clasificación de materiales según su capacidad para permitir el movimiento de cargas eléctricas.",
        "sub_topics": [
          {
            "key": "materiales_conductores",
            "name": "Materiales Conductores",
            "short_description": "Materiales que permiten el flujo fácil de cargas eléctricas debido a electrones libres.",
            "example_tasks": [
              "Define conductor eléctrico. ¿Por qué los metales son buenos conductores?",
              "Enumera cinco materiales conductores: cobre, aluminio, oro, plata, agua con sales.",
              "Explica qué son los electrones libres y por qué permiten la conducción eléctrica.",
              "¿Por qué los cables eléctricos están hechos generalmente de cobre o aluminio?"
            ]
          },
          {
            "key": "materiales_aislantes",
            "name": "Materiales Aislantes",
            "short_description": "Materiales que no permiten el flujo fácil de cargas eléctricas.",
            "example_tasks": [
              "Define aislante eléctrico. ¿Por qué ciertos materiales no conducen electricidad?",
              "Enumera cinco materiales aislantes: plástico, vidrio, madera seca, caucho, cerámica.",
              "Explica por qué los cables eléctricos están recubiertos de plástico o caucho.",
              "¿Por qué es importante usar herramientas con mangos aislantes al trabajar con electricidad?"
            ]
          },
          {
            "key": "semiconductores",
            "name": "Semiconductores",
            "short_description": "Materiales con propiedades intermedias entre conductores y aislantes.",
            "example_tasks": [
              "Define semiconductor. ¿Qué los hace diferentes de conductores y aislantes?",
              "Menciona dos semiconductores importantes: silicio y germanio.",
              "Explica por qué los semiconductores son fundamentales en la electrónica moderna (transistores, chips).",
              "Investiga cómo la temperatura y las impurezas afectan la conductividad de los semiconductores."
            ]
          }
        ]
      },
      {
        "key": "ley_coulomb",
        "name": "Ley de Coulomb",
        "short_description": "Estudio de la fuerza de atracción o repulsión entre cargas eléctricas mediante la ley de Coulomb.",
        "sub_topics": [
          {
            "key": "enunciado_ley_coulomb",
            "name": "Enunciado de la Ley de Coulomb",
            "short_description": "Comprensión de que la fuerza eléctrica es proporcional al producto de las cargas e inversamente proporcional al cuadrado de la distancia.",
            "example_tasks": [
              "Enuncia la ley de Coulomb: F = k(q₁q₂)/r².",
              "Explica qué representa cada variable en la ecuación: F (fuerza), k (constante), q₁ y q₂ (cargas), r (distancia).",
              "¿Cuál es el valor de la constante de Coulomb k? (aproximadamente 9×10⁹ N·m²/C²).",
              "Compara la ley de Coulomb con la ley de gravitación universal de Newton. ¿Qué similitudes encuentras?"
            ]
          },
          {
            "key": "calculos_ley_coulomb",
            "name": "Cálculos con la Ley de Coulomb",
            "short_description": "Aplicación de la ley de Coulomb para calcular fuerzas entre cargas.",
            "example_tasks": [
              "Dos cargas de +2 μC y +3 μC están separadas 30 cm. Calcula la fuerza de repulsión entre ellas.",
              "Si se duplica la distancia entre dos cargas, ¿cómo cambia la fuerza eléctrica entre ellas?",
              "Una carga de +5 μC y otra de -5 μC están separadas 10 cm. Calcula la fuerza de atracción.",
              "Explica por qué la fuerza eléctrica disminuye rápidamente al aumentar la distancia (relación del cuadrado inverso)."
            ]
          }
        ]
      },
      {
        "key": "campo_electrico",
        "name": "Campo Eléctrico",
        "short_description": "Comprensión del campo eléctrico como región del espacio donde una carga experimenta una fuerza.",
        "sub_topics": [
          {
            "key": "concepto_campo",
            "name": "Concepto de Campo Eléctrico",
            "short_description": "Entendimiento del campo eléctrico como perturbación del espacio causada por una carga.",
            "example_tasks": [
              "Define campo eléctrico. ¿Por qué es útil este concepto?",
              "Explica cómo una carga crea un campo eléctrico a su alrededor que puede afectar a otras cargas.",
              "¿En qué dirección apunta el campo eléctrico creado por una carga positiva? ¿Y por una negativa?",
              "Describe cómo se representan los campos eléctricos mediante líneas de campo."
            ]
          },
          {
            "key": "lineas_campo",
            "name": "Líneas de Campo Eléctrico",
            "short_description": "Representación visual de campos eléctricos mediante líneas que muestran dirección y magnitud.",
            "example_tasks": [
              "Dibuja las líneas de campo eléctrico alrededor de: a) una carga positiva aislada, b) una carga negativa aislada.",
              "Dibuja las líneas de campo entre dos cargas: a) ambas positivas, b) ambas negativas, c) una positiva y una negativa.",
              "Explica qué indica la densidad de las líneas de campo (concentración = campo más intenso).",
              "¿Por qué las líneas de campo eléctrico nunca se cruzan entre sí?"
            ]
          },
          {
            "key": "intensidad_campo",
            "name": "Intensidad del Campo Eléctrico",
            "short_description": "Cálculo de la intensidad del campo eléctrico mediante E = F/q.",
            "example_tasks": [
              "Define intensidad de campo eléctrico. ¿Cuál es su unidad? (N/C o V/m).",
              "Una carga de prueba de 2 μC experimenta una fuerza de 0.4 N en cierto punto. Calcula la intensidad del campo eléctrico ahí.",
              "Calcula la intensidad del campo eléctrico a 20 cm de una carga de +5 μC.",
              "Explica por qué el campo eléctrico es independiente de la carga de prueba que usemos para medirlo."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "corriente_electrica",
    "name": "Corriente Eléctrica",
    "short_description": "Estudio del flujo de cargas eléctricas, intensidad de corriente, diferencia de potencial, resistencia eléctrica y la ley de Ohm.",
    "sub_topics": [
      {
        "key": "concepto_corriente",
        "name": "Concepto de Corriente Eléctrica",
        "short_description": "Comprensión de la corriente como flujo ordenado de cargas eléctricas a través de un conductor.",
        "sub_topics": [
          {
            "key": "flujo_cargas",
            "name": "Flujo de Cargas",
            "short_description": "Entendimiento de cómo los electrones se mueven en un conductor creando corriente eléctrica.",
            "example_tasks": [
              "Define corriente eléctrica. ¿Qué se mueve realmente en un cable conductor?",
              "Explica la diferencia entre materiales con corriente y materiales sin corriente en términos de movimiento de electrones.",
              "¿Por qué se necesita una diferencia de potencial (voltaje) para que fluya corriente?",
              "Describe la analogía entre corriente eléctrica y flujo de agua en una tubería."
            ]
          },
          {
            "key": "intensidad_corriente",
            "name": "Intensidad de Corriente",
            "short_description": "Medición de la cantidad de carga que fluye por unidad de tiempo mediante I = Q/t.",
            "example_tasks": [
              "Define intensidad de corriente. ¿Cuál es su unidad? (ampere, A).",
              "Si por un conductor pasan 10 coulombs de carga en 2 segundos, ¿cuál es la intensidad de corriente?",
              "Explica qué significa que un foco consuma 2 amperes de corriente.",
              "¿Qué representa 1 ampere en términos de flujo de electrones por segundo?"
            ]
          },
          {
            "key": "sentido_corriente",
            "name": "Sentido de la Corriente",
            "short_description": "Distinción entre sentido convencional (positivo a negativo) y sentido real del flujo de electrones.",
            "example_tasks": [
              "Explica por qué históricamente se definió que la corriente fluye de positivo a negativo (sentido convencional).",
              "Describe el sentido real del movimiento de electrones (negativo a positivo).",
              "¿Por qué se sigue usando el sentido convencional aunque sepamos que los electrones se mueven en sentido contrario?",
              "Dibuja un circuito simple indicando tanto el sentido convencional como el flujo real de electrones."
            ]
          }
        ]
      },
      {
        "key": "voltaje",
        "name": "Diferencia de Potencial (Voltaje)",
        "short_description": "Estudio del voltaje como la energía por unidad de carga que impulsa el flujo de corriente.",
        "sub_topics": [
          {
            "key": "concepto_voltaje",
            "name": "Concepto de Voltaje",
            "short_description": "Comprensión del voltaje como diferencia de energía potencial eléctrica entre dos puntos.",
            "example_tasks": [
              "Define diferencia de potencial o voltaje. ¿Qué mide realmente?",
              "Explica por qué se necesita una diferencia de potencial para que fluya corriente (analogía: diferencia de altura para que fluya agua).",
              "¿Cuál es la unidad de voltaje? (volt, V).",
              "Describe qué significa que una pila tenga un voltaje de 1.5 V."
            ]
          },
          {
            "key": "fuentes_voltaje",
            "name": "Fuentes de Voltaje",
            "short_description": "Identificación de dispositivos que proporcionan diferencia de potencial: pilas, baterías, generadores.",
            "example_tasks": [
              "Enumera cinco fuentes comunes de voltaje: pilas, baterías, generadores, celdas solares, tomas de corriente domésticas.",
              "Explica la diferencia entre corriente directa (CD o DC) y corriente alterna (CA o AC).",
              "¿Qué tipo de corriente proporcionan las pilas y baterías? ¿Y las tomas de corriente en casas?",
              "En México, ¿cuál es el voltaje estándar de las tomas domésticas? (127 V, 60 Hz)."
            ]
          },
          {
            "key": "medicion_voltaje",
            "name": "Medición de Voltaje",
            "short_description": "Uso del voltímetro para medir diferencia de potencial entre dos puntos.",
            "example_tasks": [
              "Explica cómo se conecta un voltímetro en un circuito (en paralelo entre los dos puntos).",
              "¿Por qué un voltímetro debe tener alta resistencia interna?",
              "Describe cómo medir el voltaje de una pila usando un multímetro.",
              "Si conectas un voltímetro entre los terminales de una pila de 9V, ¿qué lectura esperas?"
            ]
          }
        ]
      },
      {
        "key": "resistencia",
        "name": "Resistencia Eléctrica",
        "short_description": "Estudio de la resistencia como oposición al flujo de corriente en materiales conductores.",
        "sub_topics": [
          {
            "key": "concepto_resistencia",
            "name": "Concepto de Resistencia",
            "short_description": "Comprensión de la resistencia como propiedad que dificulta el paso de corriente.",
            "example_tasks": [
              "Define resistencia eléctrica. ¿Qué la causa a nivel microscópico?",
              "¿Cuál es la unidad de resistencia? (ohm, Ω).",
              "Explica por qué algunos materiales tienen mayor resistencia que otros.",
              "Da ejemplos de materiales con baja resistencia (conductores) y alta resistencia (aislantes)."
            ]
          },
          {
            "key": "factores_resistencia",
            "name": "Factores que Afectan la Resistencia",
            "short_description": "Análisis de cómo la longitud, área transversal, material y temperatura afectan la resistencia.",
            "example_tasks": [
              "Explica cómo la longitud de un conductor afecta su resistencia (mayor longitud = mayor resistencia).",
              "¿Cómo afecta el grosor (área transversal) de un cable a su resistencia? (mayor grosor = menor resistencia).",
              "Describe cómo el tipo de material afecta la resistencia (resistividad).",
              "¿Por qué la resistencia de la mayoría de los metales aumenta con la temperatura?"
            ]
          },
          {
            "key": "resistores",
            "name": "Resistores",
            "short_description": "Identificación de resistores como componentes que proporcionan resistencia controlada en circuitos.",
            "example_tasks": [
              "Explica qué es un resistor y para qué se usa en circuitos electrónicos.",
              "Describe cómo se identifican los valores de resistencia usando el código de colores.",
              "Investiga diferentes tipos de resistores: fijos, variables (potenciómetros), de alambre.",
              "¿Por qué es importante limitar la corriente en ciertos componentes como LEDs usando resistores?"
            ]
          }
        ]
      },
      {
        "key": "ley_ohm",
        "name": "Ley de Ohm",
        "short_description": "Aplicación de la ley fundamental que relaciona voltaje, corriente y resistencia: V = IR.",
        "sub_topics": [
          {
            "key": "enunciado_ley_ohm",
            "name": "Enunciado de la Ley de Ohm",
            "short_description": "Comprensión de la relación proporcional entre voltaje, corriente y resistencia.",
            "example_tasks": [
              "Enuncia la ley de Ohm: V = I × R.",
              "Explica qué significa cada variable: V (voltaje en volts), I (corriente en amperes), R (resistencia en ohms).",
              "Si aumentas el voltaje en un circuito manteniendo constante la resistencia, ¿qué pasa con la corriente?",
              "Si aumentas la resistencia manteniendo constante el voltaje, ¿qué pasa con la corriente?"
            ]
          },
          {
            "key": "calculos_ley_ohm",
            "name": "Cálculos con la Ley de Ohm",
            "short_description": "Resolución de problemas usando V = IR para encontrar voltaje, corriente o resistencia.",
            "example_tasks": [
              "Una resistencia de 10 Ω está conectada a una fuente de 12 V. Calcula la corriente que circula.",
              "Por un conductor circulan 2 A cuando se conecta a 24 V. Calcula su resistencia.",
              "Una corriente de 0.5 A circula por una resistencia de 100 Ω. ¿Cuál es el voltaje aplicado?",
              "Un foco tiene resistencia de 240 Ω y está conectado a 120 V. Calcula la corriente que consume."
            ]
          },
          {
            "key": "aplicaciones_ley_ohm",
            "name": "Aplicaciones de la Ley de Ohm",
            "short_description": "Uso práctico de la ley de Ohm en el diseño y análisis de circuitos.",
            "example_tasks": [
              "Explica cómo usar la ley de Ohm para seleccionar el resistor adecuado para proteger un LED.",
              "Calcula qué resistencia necesitas para limitar la corriente a 20 mA con una fuente de 9 V.",
              "Describe cómo los electricistas usan la ley de Ohm para calcular el grosor apropiado de cables en instalaciones.",
              "Investiga por qué los dispositivos tienen especificaciones de voltaje y corriente, y cómo se relacionan con la ley de Ohm."
            ]
          }
        ]
      },
      {
        "key": "potencia_electrica",
        "name": "Potencia Eléctrica",
        "short_description": "Estudio de la potencia como la rapidez de transformación de energía eléctrica, medida en watts.",
        "sub_topics": [
          {
            "key": "concepto_potencia_electrica",
            "name": "Concepto de Potencia Eléctrica",
            "short_description": "Comprensión de la potencia eléctrica como energía consumida o transformada por unidad de tiempo.",
            "example_tasks": [
              "Define potencia eléctrica. ¿Cuál es su unidad? (watt, W).",
              "Explica la relación entre potencia, energía y tiempo: P = E/t.",
              "Describe las fórmulas para calcular potencia eléctrica: P = VI, P = I²R, P = V²/R.",
              "¿Qué significa que un aparato tenga una potencia de 100 W?"
            ]
          },
          {
            "key": "calculos_potencia",
            "name": "Cálculos de Potencia",
            "short_description": "Aplicación de fórmulas para calcular potencia consumida por dispositivos eléctricos.",
            "example_tasks": [
              "Un foco consume 2 A a 120 V. Calcula la potencia que consume.",
              "Calcula la potencia disipada en una resistencia de 50 Ω cuando circulan 3 A.",
              "Un calentador tiene resistencia de 20 Ω y se conecta a 120 V. ¿Cuál es su potencia?",
              "Compara el consumo energético de un foco incandescente de 60 W vs. un LED de 9 W que dan la misma iluminación."
            ]
          },
          {
            "key": "energia_consumo",
            "name": "Energía y Consumo Eléctrico",
            "short_description": "Cálculo de energía consumida y su costo en kilowatt-hora (kWh).",
            "example_tasks": [
              "Explica qué es un kilowatt-hora (kWh) y por qué se usa para facturar electricidad.",
              "Un televisor de 150 W funciona 4 horas diarias. Calcula su consumo mensual en kWh.",
              "Si el costo de la electricidad es $2 por kWh, ¿cuánto cuesta operar un refrigerador de 200 W durante un mes (24 h/día)?",
              "Calcula el ahorro anual al reemplazar 10 focos de 60 W por LEDs de 9 W, usados 5 horas diarias (considera $2/kWh)."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "circuitos_electricos",
    "name": "Circuitos Eléctricos",
    "short_description": "Análisis de circuitos en serie y paralelo, sus características, cálculo de resistencia equivalente y aplicaciones prácticas.",
    "sub_topics": [
      {
        "key": "elementos_circuito",
        "name": "Elementos de un Circuito",
        "short_description": "Identificación de los componentes básicos de un circuito eléctrico y su representación simbólica.",
        "sub_topics": [
          {
            "key": "componentes_basicos",
            "name": "Componentes Básicos",
            "short_description": "Reconocimiento de fuente de voltaje, conductores, resistencias, interruptores y dispositivos de carga.",
            "example_tasks": [
              "Enumera los cinco elementos esenciales de un circuito eléctrico básico.",
              "Dibuja los símbolos esquemáticos para: pila, resistor, interruptor, foco, conductor.",
              "Explica la función de cada componente en un circuito simple.",
              "Describe qué se necesita para que circule corriente en un circuito (circuito cerrado, fuente de voltaje)."
            ]
          },
          {
            "key": "diagrama_circuitos",
            "name": "Diagramas de Circuitos",
            "short_description": "Interpretación y construcción de diagramas esquemáticos de circuitos eléctricos.",
            "example_tasks": [
              "Dibuja el diagrama de un circuito simple con una pila, un interruptor y un foco.",
              "Interpreta un diagrama esquemático e identifica cómo están conectados los componentes.",
              "Explica la diferencia entre el circuito físico real y su representación esquemática.",
              "Diseña un circuito que permita encender dos focos independientemente usando dos interruptores."
            ]
          },
          {
            "key": "circuito_abierto_cerrado",
            "name": "Circuito Abierto vs. Cerrado",
            "short_description": "Comprensión de la diferencia entre circuitos abiertos (sin corriente) y cerrados (con corriente).",
            "example_tasks": [
              "Define circuito abierto y circuito cerrado. ¿Cuál permite el flujo de corriente?",
              "Explica cómo funciona un interruptor para abrir y cerrar un circuito.",
              "¿Por qué los dispositivos dejan de funcionar cuando se abre el circuito?",
              "Describe situaciones donde un circuito se abre accidentalmente (cable roto, fusible quemado)."
            ]
          }
        ]
      },
      {
        "key": "circuitos_serie",
        "name": "Circuitos en Serie",
        "short_description": "Análisis de circuitos donde los componentes están conectados uno tras otro en una sola trayectoria.",
        "sub_topics": [
          {
            "key": "caracteristicas_serie",
            "name": "Características de Circuitos en Serie",
            "short_description": "Comprensión de que en serie la corriente es la misma en todos los puntos y los voltajes se suman.",
            "example_tasks": [
              "Describe cómo están conectados los componentes en un circuito en serie.",
              "Explica por qué la corriente es la misma en todos los componentes de un circuito en serie.",
              "¿Cómo se relacionan los voltajes en circuitos en serie? (VT = V₁ + V₂ + V₃ + ...).",
              "Si una bombilla se funde en una serie de luces navideñas antiguas conectadas en serie, ¿qué sucede con las demás?"
            ]
          },
          {
            "key": "resistencia_equivalente_serie",
            "name": "Resistencia Equivalente en Serie",
            "short_description": "Cálculo de la resistencia total mediante la suma de resistencias individuales.",
            "example_tasks": [
              "Enuncia la fórmula para resistencia equivalente en serie: RT = R₁ + R₂ + R₃ + ...",
              "Tres resistencias de 10 Ω, 20 Ω y 30 Ω están en serie. Calcula la resistencia equivalente.",
              "Explica por qué la resistencia total en serie siempre es mayor que cualquier resistencia individual.",
              "Un circuito serie tiene una pila de 12 V y tres resistores de 4 Ω cada uno. Calcula la corriente total."
            ]
          },
          {
            "key": "aplicaciones_serie",
            "name": "Aplicaciones de Circuitos en Serie",
            "short_description": "Identificación de situaciones donde se usan circuitos en serie y sus ventajas/desventajas.",
            "example_tasks": [
              "Da tres ejemplos de circuitos en serie: luces navideñas antiguas, interruptores de seguridad, divisores de voltaje.",
              "Explica las ventajas y desventajas de conectar dispositivos en serie.",
              "¿Por qué los circuitos domésticos NO usan conexión en serie para las luces y electrodomésticos?",
              "Describe cómo funcionan los interruptores de seguridad en serie (si uno se abre, todo el circuito se desconecta)."
            ]
          }
        ]
      },
      {
        "key": "circuitos_paralelo",
        "name": "Circuitos en Paralelo",
        "short_description": "Análisis de circuitos donde los componentes están conectados en ramificaciones con puntos comunes.",
        "sub_topics": [
          {
            "key": "caracteristicas_paralelo",
            "name": "Características de Circuitos en Paralelo",
            "short_description": "Comprensión de que en paralelo el voltaje es el mismo en todas las ramas y las corrientes se suman.",
            "example_tasks": [
              "Describe cómo están conectados los componentes en un circuito en paralelo.",
              "Explica por qué el voltaje es el mismo en todos los componentes de un circuito en paralelo.",
              "¿Cómo se relacionan las corrientes en circuitos en paralelo? (IT = I₁ + I₂ + I₃ + ...).",
              "Si una bombilla se funde en un circuito en paralelo, ¿qué sucede con las demás? Compara con circuitos en serie."
            ]
          },
          {
            "key": "resistencia_equivalente_paralelo",
            "name": "Resistencia Equivalente en Paralelo",
            "short_description": "Cálculo de la resistencia total usando la fórmula del inverso de la suma de inversos.",
            "example_tasks": [
              "Enuncia la fórmula para resistencia equivalente en paralelo: 1/RT = 1/R₁ + 1/R₂ + 1/R₃ + ...",
              "Dos resistencias de 6 Ω y 12 Ω están en paralelo. Calcula la resistencia equivalente.",
              "Explica por qué la resistencia total en paralelo siempre es menor que la menor resistencia individual.",
              "Tres resistencias idénticas de 30 Ω están en paralelo. Calcula la resistencia equivalente."
            ]
          },
          {
            "key": "aplicaciones_paralelo",
            "name": "Aplicaciones de Circuitos en Paralelo",
            "short_description": "Identificación de situaciones donde se usan circuitos en paralelo en instalaciones domésticas.",
            "example_tasks": [
              "Explica por qué las instalaciones eléctricas domésticas usan conexiones en paralelo.",
              "Describe las ventajas de conectar dispositivos en paralelo (funcionamiento independiente, mismo voltaje).",
              "¿Por qué puedes encender y apagar luces independientemente en tu casa?",
              "Analiza cómo las tomas de corriente en tu casa están conectadas en paralelo a partir del medidor."
            ]
          }
        ]
      },
      {
        "key": "circuitos_mixtos",
        "name": "Circuitos Mixtos",
        "short_description": "Análisis de circuitos que combinan conexiones en serie y en paralelo.",
        "sub_topics": [
          {
            "key": "analisis_circuitos_mixtos",
            "name": "Análisis de Circuitos Mixtos",
            "short_description": "Estrategias para simplificar y resolver circuitos con combinaciones serie-paralelo.",
            "example_tasks": [
              "Identifica en un diagrama qué resistencias están en serie y cuáles en paralelo.",
              "Describe el procedimiento para calcular la resistencia equivalente de un circuito mixto (simplificar por partes).",
              "Un circuito tiene dos resistencias de 6 Ω en paralelo, y este conjunto está en serie con una resistencia de 4 Ω. Calcula la resistencia total.",
              "Explica por qué es importante analizar circuitos mixtos por secciones."
            ]
          }
        ]
      },
      {
        "key": "seguridad_electrica",
        "name": "Seguridad Eléctrica",
        "short_description": "Comprensión de riesgos eléctricos y medidas de seguridad con dispositivos de protección.",
        "sub_topics": [
          {
            "key": "riesgos_electricos",
            "name": "Riesgos de la Electricidad",
            "short_description": "Conocimiento de los peligros asociados con el uso inadecuado de electricidad.",
            "example_tasks": [
              "Explica qué es una descarga eléctrica y por qué es peligrosa para el cuerpo humano.",
              "¿Por qué el agua y la electricidad forman una combinación peligrosa?",
              "Describe los efectos de diferentes intensidades de corriente en el cuerpo humano (desde hormigueo hasta paros cardíacos).",
              "Enumera cinco situaciones de riesgo eléctrico en el hogar."
            ]
          },
          {
            "key": "dispositivos_proteccion",
            "name": "Dispositivos de Protección",
            "short_description": "Funcionamiento de fusibles, interruptores termomagnéticos y conexión a tierra.",
            "example_tasks": [
              "Explica cómo funciona un fusible para proteger un circuito del exceso de corriente.",
              "Describe qué es un interruptor termomagnético (breaker) y cuándo se activa.",
              "¿Qué es una conexión a tierra y por qué es importante para la seguridad?",
              "Investiga qué es un interruptor diferencial (GFI o GFCI) y cómo protege contra descargas eléctricas."
            ]
          },
          {
            "key": "practicas_seguras",
            "name": "Prácticas Seguras",
            "short_description": "Recomendaciones para el uso seguro de la electricidad en el hogar y la escuela.",
            "example_tasks": [
              "Enumera diez reglas de seguridad al trabajar con electricidad.",
              "Explica por qué no debes sobrecargar tomas de corriente con múltiples dispositivos.",
              "¿Qué hacer si ves un cable eléctrico dañado o pelado?",
              "Describe los primeros auxilios básicos en caso de descarga eléctrica (no tocar a la víctima mientras esté en contacto con corriente, llamar emergencias)."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "magnetismo",
    "name": "Magnetismo",
    "short_description": "Estudio de los imanes, campos magnéticos, magnetismo terrestre y la interacción entre magnetismo y electricidad.",
    "sub_topics": [
      {
        "key": "imanes",
        "name": "Imanes y Propiedades Magnéticas",
        "short_description": "Comprensión de los imanes como objetos que atraen materiales ferromagnéticos y sus características fundamentales.",
        "sub_topics": [
          {
            "key": "propiedades_imanes",
            "name": "Propiedades de los Imanes",
            "short_description": "Identificación de las características básicas de los imanes: polos, atracción, repulsión.",
            "example_tasks": [
              "Describe las propiedades fundamentales de los imanes (tienen dos polos, atraen materiales ferromagnéticos).",
              "Explica qué sucede cuando acercas los polos de dos imanes: polo norte con polo norte, polo sur con polo sur, polo norte con polo sur.",
              "¿Por qué no puedes separar los polos de un imán cortándolo por la mitad?",
              "Enumera materiales que son atraídos por imanes (hierro, níquel, cobalto) y materiales que no lo son."
            ]
          },
          {
            "key": "tipos_imanes",
            "name": "Tipos de Imanes",
            "short_description": "Clasificación de imanes en naturales, artificiales permanentes y temporales.",
            "example_tasks": [
              "Explica la diferencia entre imanes naturales (magnetita) y artificiales.",
              "¿Qué es un imán permanente? Da tres ejemplos.",
              "Describe qué es un imán temporal y cómo se crea (electroimanes).",
              "Investiga diferentes formas de imanes: barra, herradura, disco, y sus aplicaciones específicas."
            ]
          },
          {
            "key": "materiales_magneticos",
            "name": "Materiales Magnéticos",
            "short_description": "Clasificación de materiales según su comportamiento ante campos magnéticos.",
            "example_tasks": [
              "Define materiales ferromagnéticos. Da ejemplos: hierro, níquel, cobalto.",
              "Explica qué son materiales paramagnéticos y diamagnéticos.",
              "¿Por qué algunos metales como el aluminio o el cobre no son atraídos por imanes?",
              "Describe cómo se puede magnetizar un clavo de hierro frotándolo con un imán."
            ]
          }
        ]
      },
      {
        "key": "campo_magnetico",
        "name": "Campo Magnético",
        "short_description": "Estudio del campo magnético como región del espacio donde se manifiestan fuerzas magnéticas.",
        "sub_topics": [
          {
            "key": "concepto_campo_magnetico",
            "name": "Concepto de Campo Magnético",
            "short_description": "Comprensión del campo magnético y su representación mediante líneas de campo.",
            "example_tasks": [
              "Define campo magnético. ¿Qué es una línea de campo magnético?",
              "Describe un experimento con limaduras de hierro para visualizar el campo magnético de un imán de barra.",
              "¿En qué dirección apuntan las líneas de campo magnético? (del polo norte al polo sur, fuera del imán).",
              "Explica por qué las líneas de campo magnético nunca se cruzan."
            ]
          },
          {
            "key": "patron_campo",
            "name": "Patrón de Campos Magnéticos",
            "short_description": "Visualización de patrones de campo alrededor de diferentes configuraciones de imanes.",
            "example_tasks": [
              "Dibuja el patrón de líneas de campo alrededor de un imán de barra.",
              "Dibuja las líneas de campo entre dos imanes cuando: a) se enfrentan polos opuestos, b) se enfrentan polos iguales.",
              "Explica qué indica la densidad de líneas de campo (mayor densidad = campo más intenso).",
              "Describe el campo magnético de un imán en herradura."
            ]
          }
        ]
      },
      {
        "key": "magnetismo_terrestre",
        "name": "Magnetismo Terrestre",
        "short_description": "Comprensión de la Tierra como un imán gigante y el funcionamiento de las brújulas.",
        "sub_topics": [
          {
            "key": "tierra_como_iman",
            "name": "La Tierra como Imán",
            "short_description": "Entendimiento de que la Tierra tiene un campo magnético con polos magnéticos.",
            "example_tasks": [
              "Explica por qué la Tierra se comporta como un imán gigante.",
              "¿Dónde están ubicados los polos magnéticos de la Tierra? ¿Coinciden con los polos geográficos?",
              "Describe qué es el polo norte magnético y por qué en realidad es un polo sur magnético (atrae el extremo norte de las brújulas).",
              "Investiga qué causa el campo magnético terrestre (corrientes en el núcleo de hierro fundido)."
            ]
          },
          {
            "key": "brujula",
            "name": "La Brújula",
            "short_description": "Funcionamiento de la brújula como instrumento de navegación que usa el campo magnético terrestre.",
            "example_tasks": [
              "Explica cómo funciona una brújula para indicar la dirección norte.",
              "¿Por qué la aguja de una brújula siempre apunta hacia el norte geográfico (aproximadamente)?",
              "Describe cómo usar una brújula para orientarte.",
              "Investiga la importancia histórica de la brújula en la navegación y exploración."
            ]
          },
          {
            "key": "aurora_magnetosfera",
            "name": "Auroras y Magnetosfera",
            "short_description": "Comprensión de fenómenos relacionados con el campo magnético terrestre.",
            "example_tasks": [
              "Explica qué son las auroras boreales y australes y cómo se relacionan con el campo magnético de la Tierra.",
              "Describe qué es la magnetosfera y cómo protege a la Tierra del viento solar.",
              "¿Qué son las tormentas magnéticas y cómo pueden afectar las comunicaciones y redes eléctricas?",
              "Investiga por qué las auroras se ven principalmente en zonas cercanas a los polos."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "electromagnetismo",
    "name": "Electromagnetismo",
    "short_description": "Estudio de la relación entre electricidad y magnetismo, incluyendo electroimanes, inducción electromagnética y aplicaciones en motores y generadores.",
    "sub_topics": [
      {
        "key": "campo_magnetico_corriente",
        "name": "Campo Magnético de una Corriente",
        "short_description": "Descubrimiento de que una corriente eléctrica genera un campo magnético alrededor del conductor.",
        "sub_topics": [
          {
            "key": "experimento_oersted",
            "name": "Experimento de Oersted",
            "short_description": "Comprensión del descubrimiento histórico de la relación entre electricidad y magnetismo.",
            "example_tasks": [
              "Describe el experimento de Oersted que demostró que una corriente eléctrica desvía una brújula.",
              "Explica qué demostró este experimento sobre la relación entre electricidad y magnetismo.",
              "Dibuja el patrón del campo magnético alrededor de un conductor recto que lleva corriente.",
              "¿Cómo determinas la dirección del campo magnético usando la regla de la mano derecha?"
            ]
          },
          {
            "key": "electroimanes",
            "name": "Electroimanes",
            "short_description": "Estudio de imanes temporales creados por corriente eléctrica en bobinas.",
            "example_tasks": [
              "Explica qué es un electroimán y cómo se construye (bobina de alambre alrededor de un núcleo ferromagnético).",
              "Describe factores que afectan la fuerza de un electroimán: número de vueltas, intensidad de corriente, material del núcleo.",
              "¿Cuál es la ventaja de los electroimanes sobre los imanes permanentes? (se pueden encender y apagar).",
              "Enumera cinco aplicaciones de electroimanes: grúas magnéticas, timbres, relés, motores eléctricos, altavoces."
            ]
          }
        ]
      },
      {
        "key": "induccion_electromagnetica",
        "name": "Inducción Electromagnética",
        "short_description": "Comprensión de cómo un campo magnético variable induce una corriente eléctrica.",
        "sub_topics": [
          {
            "key": "ley_faraday",
            "name": "Ley de Faraday",
            "short_description": "Descubrimiento de que se induce voltaje en un conductor cuando cambia el flujo magnético.",
            "example_tasks": [
              "Explica el principio de inducción electromagnética descubierto por Faraday.",
              "Describe un experimento que demuestre inducción: mover un imán dentro de una bobina genera corriente.",
              "¿Qué factores aumentan el voltaje inducido? (velocidad del movimiento, intensidad del campo, número de espiras).",
              "Explica por qué se genera corriente solo cuando el imán se mueve, no cuando está estático."
            ]
          },
          {
            "key": "generadores",
            "name": "Generadores Eléctricos",
            "short_description": "Aplicación de la inducción electromagnética para convertir energía mecánica en eléctrica.",
            "example_tasks": [
              "Explica cómo funciona un generador eléctrico usando inducción electromagnética.",
              "Describe el principio básico: rotar una bobina en un campo magnético induce corriente alterna.",
              "¿Qué tipos de energía se convierten en un generador? (mecánica a eléctrica).",
              "Investiga diferentes tipos de generadores: hidroeléctricos, eólicos, térmicos, y qué los hace girar."
            ]
          },
          {
            "key": "transformadores",
            "name": "Transformadores",
            "short_description": "Dispositivos que usan inducción para cambiar el voltaje de corriente alterna.",
            "example_tasks": [
              "Explica cómo funciona un transformador con dos bobinas acopladas magnéticamente.",
              "¿Qué es un transformador elevador? ¿Y uno reductor?",
              "Describe la importancia de los transformadores en la distribución de electricidad.",
              "Investiga por qué los transformadores solo funcionan con corriente alterna, no con corriente directa."
            ]
          }
        ]
      },
      {
        "key": "motores_electricos",
        "name": "Motores Eléctricos",
        "short_description": "Estudio de dispositivos que convierten energía eléctrica en mecánica usando electromagnetismo.",
        "sub_topics": [
          {
            "key": "principio_motor",
            "name": "Principio del Motor Eléctrico",
            "short_description": "Comprensión de cómo la interacción entre campo magnético y corriente produce rotación.",
            "example_tasks": [
              "Explica el principio básico de un motor eléctrico: fuerza sobre un conductor con corriente en un campo magnético.",
              "Describe cómo un motor convierte energía eléctrica en energía mecánica de rotación.",
              "¿Qué función cumple el conmutador en un motor de corriente directa?",
              "Compara motores de corriente directa (DC) y corriente alterna (AC)."
            ]
          },
          {
            "key": "aplicaciones_motores",
            "name": "Aplicaciones de Motores",
            "short_description": "Identificación de usos de motores eléctricos en la vida cotidiana y la industria.",
            "example_tasks": [
              "Enumera diez dispositivos que usen motores eléctricos en tu casa.",
              "Explica las ventajas de los motores eléctricos sobre motores de combustión.",
              "Describe aplicaciones industriales de motores eléctricos.",
              "Investiga los vehículos eléctricos y cómo sus motores son más eficientes que los de gasolina."
            ]
          }
        ]
      },
      {
        "key": "aplicaciones_electromagnetismo",
        "name": "Aplicaciones Tecnológicas del Electromagnetismo",
        "short_description": "Análisis de tecnologías modernas basadas en principios electromagnéticos.",
        "sub_topics": [
          {
            "key": "comunicaciones_electromagneticas",
            "name": "Comunicaciones",
            "short_description": "Uso del electromagnetismo en radio, televisión, telefonía celular.",
            "example_tasks": [
              "Explica cómo las ondas electromagnéticas transportan información en comunicaciones.",
              "Describe el funcionamiento básico de la radio: conversión de señal eléctrica a onda electromagnética.",
              "¿Cómo funcionan las antenas para transmitir y recibir señales electromagnéticas?",
              "Investiga cómo la telefonía celular usa ondas electromagnéticas para comunicación."
            ]
          },
          {
            "key": "tecnologia_medica",
            "name": "Tecnología Médica",
            "short_description": "Aplicaciones del electromagnetismo en diagnóstico y tratamiento médico.",
            "example_tasks": [
              "Explica cómo funciona una resonancia magnética (MRI) usando campos magnéticos potentes.",
              "Describe otras aplicaciones médicas: estimulación magnética transcraneal, terapia con campos electromagnéticos.",
              "¿Cómo se usan los electroimanes en equipos de diálisis y separación de células?",
              "Investiga la importancia de los marcapasos que usan electricidad controlada para regular el corazón."
            ]
          },
          {
            "key": "transporte_levitacion",
            "name": "Levitación Magnética",
            "short_description": "Tecnología de trenes de levitación magnética (maglev).",
            "example_tasks": [
              "Explica cómo funcionan los trenes maglev usando repulsión o atracción magnética.",
              "¿Qué ventajas tienen los trenes maglev sobre trenes convencionales? (mayor velocidad, menos fricción, menos ruido).",
              "Describe países que han implementado tecnología maglev: Japón, China, Alemania.",
              "Investiga los desafíos económicos y técnicos de implementar sistemas maglev."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "estructura_materia",
    "name": "Estructura de la Materia",
    "short_description": "Estudio de los modelos atómicos, partículas subatómicas y la estructura interna de la materia desde la perspectiva de la física moderna.",
    "sub_topics": [
      {
        "key": "modelos_atomicos",
        "name": "Modelos Atómicos",
        "short_description": "Evolución histórica de los modelos atómicos desde Dalton hasta el modelo cuántico.",
        "sub_topics": [
          {
            "key": "modelo_dalton",
            "name": "Modelo de Dalton",
            "short_description": "Comprensión del primer modelo atómico científico que describe al átomo como esfera sólida indivisible.",
            "example_tasks": [
              "Describe el modelo atómico de Dalton y sus principales postulados.",
              "Explica qué aportó Dalton al conocimiento científico sobre la materia.",
              "¿Qué limitaciones tenía el modelo de Dalton que fueron descubiertas posteriormente?",
              "Investiga el contexto histórico en el que Dalton propuso su teoría atómica (principios del siglo XIX)."
            ]
          },
          {
            "key": "modelo_thomson",
            "name": "Modelo de Thomson",
            "short_description": "Estudio del modelo del 'budín de pasas' que incorpora los electrones descubiertos por Thomson.",
            "example_tasks": [
              "Describe el modelo atómico de Thomson (budín de pasas o budín con ciruelas).",
              "Explica el descubrimiento del electrón por Thomson y cómo modificó la idea del átomo.",
              "¿Qué experimentos llevaron a Thomson a proponer que los átomos contienen partículas negativas?",
              "Compara el modelo de Thomson con el de Dalton. ¿Qué progreso representó?"
            ]
          },
          {
            "key": "modelo_rutherford",
            "name": "Modelo de Rutherford",
            "short_description": "Comprensión del modelo planetario con núcleo denso y positivo rodeado de electrones.",
            "example_tasks": [
              "Describe el experimento de la lámina de oro de Rutherford y sus conclusiones.",
              "Explica el modelo planetario de Rutherford: núcleo pequeño y denso con electrones orbitando.",
              "¿Qué problema fundamental tenía el modelo de Rutherford según la física clásica? (los electrones en órbita deberían perder energía y colapsar).",
              "Compara el tamaño del núcleo con el tamaño total del átomo usando analogías."
            ]
          },
          {
            "key": "modelo_bohr",
            "name": "Modelo de Bohr",
            "short_description": "Estudio del modelo con órbitas cuantizadas que explica el espectro del hidrógeno.",
            "example_tasks": [
              "Describe los postulados principales del modelo de Bohr: órbitas estacionarias, saltos cuánticos.",
              "Explica cómo el modelo de Bohr resolvió el problema de la estabilidad atómica.",
              "¿Qué significa que los niveles de energía estén 'cuantizados'?",
              "Relaciona el modelo de Bohr con los espectros de emisión y absorción de luz."
            ]
          },
          {
            "key": "modelo_actual",
            "name": "Modelo Cuántico Actual",
            "short_description": "Introducción al modelo de la mecánica cuántica con orbitales de probabilidad.",
            "example_tasks": [
              "Explica las diferencias fundamentales entre el modelo de Bohr (órbitas definidas) y el modelo cuántico (orbitales de probabilidad).",
              "Describe qué es un orbital atómico y cómo difiere de una órbita.",
              "¿Qué es el principio de incertidumbre de Heisenberg y cómo se aplica a los electrones?",
              "Investiga cómo el modelo cuántico explica mejor el comportamiento de átomos con muchos electrones."
            ]
          }
        ]
      },
      {
        "key": "particulas_subatomicas",
        "name": "Partículas Subatómicas",
        "short_description": "Identificación y características de las partículas que componen el átomo: protones, neutrones y electrones.",
        "sub_topics": [
          {
            "key": "proton",
            "name": "Protón",
            "short_description": "Comprensión del protón como partícula subatómica con carga positiva ubicada en el núcleo.",
            "example_tasks": [
              "Describe las características del protón: carga (+1), masa relativa (~1 u), ubicación (núcleo).",
              "Explica por qué el número de protones determina la identidad del elemento (número atómico).",
              "¿Qué mantiene unidos a los protones en el núcleo a pesar de la repulsión eléctrica entre cargas positivas?",
              "Compara la masa del protón con la masa del electrón."
            ]
          },
          {
            "key": "neutron",
            "name": "Neutrón",
            "short_description": "Estudio del neutrón como partícula sin carga ubicada en el núcleo que contribuye a la masa.",
            "example_tasks": [
              "Describe las características del neutrón: sin carga (neutro), masa similar al protón, ubicación (núcleo).",
              "Explica qué son los isótopos y cómo se relacionan con el número de neutrones.",
              "¿Por qué el descubrimiento del neutrón fue posterior al del protón y electrón? (no tiene carga, más difícil de detectar).",
              "Investiga quién descubrió el neutrón (James Chadwick, 1932)."
            ]
          },
          {
            "key": "electron",
            "name": "Electrón",
            "short_description": "Análisis del electrón como partícula ligera con carga negativa que orbita el núcleo.",
            "example_tasks": [
              "Describe las características del electrón: carga (-1), masa muy pequeña (~1/1836 de un protón), ubicación (alrededor del núcleo).",
              "Explica por qué los electrones determinan las propiedades químicas de los elementos.",
              "¿Cómo se distribuyen los electrones en capas o niveles de energía?",
              "Investiga la dualidad onda-partícula del electrón."
            ]
          },
          {
            "key": "otras_particulas",
            "name": "Otras Partículas Subatómicas",
            "short_description": "Introducción a otras partículas: quarks, fotones, neutrinos.",
            "example_tasks": [
              "Investiga qué son los quarks y cómo forman protones y neutrones.",
              "Explica qué es el fotón como partícula de luz (cuanto de energía electromagnética).",
              "¿Qué son los neutrinos y por qué son tan difíciles de detectar?",
              "Describe brevemente el Modelo Estándar de la física de partículas."
            ]
          }
        ]
      },
      {
        "key": "numero_atomico_masico",
        "name": "Número Atómico y Número de Masa",
        "short_description": "Comprensión de los números que identifican y caracterizan a los átomos.",
        "sub_topics": [
          {
            "key": "numero_atomico",
            "name": "Número Atómico (Z)",
            "short_description": "Identificación de elementos por su número de protones.",
            "example_tasks": [
              "Define número atómico. ¿Por qué determina la identidad del elemento?",
              "Explica por qué todos los átomos de hidrógeno tienen Z=1 y todos los de carbono Z=6.",
              "¿Cómo se organizan los elementos en la tabla periódica según su número atómico?",
              "Un átomo tiene 17 protones. ¿Qué elemento es? (Cloro)."
            ]
          },
          {
            "key": "numero_masa",
            "name": "Número de Masa (A)",
            "short_description": "Cálculo del número total de nucleones (protones + neutrones).",
            "example_tasks": [
              "Define número de masa. ¿Cómo se calcula? (A = Z + N).",
              "Un átomo de carbono tiene 6 protones y 6 neutrones. ¿Cuál es su número de masa?",
              "Explica la notación simbólica: ¹²₆C, donde el superíndice es A y el subíndice es Z.",
              "Calcula el número de neutrones en un átomo de uranio-238 (Z=92)."
            ]
          },
          {
            "key": "isotopos",
            "name": "Isótopos",
            "short_description": "Comprensión de átomos del mismo elemento con diferente número de neutrones.",
            "example_tasks": [
              "Define isótopo. ¿En qué se diferencian los isótopos de un mismo elemento?",
              "Da ejemplos de isótopos del hidrógeno: protio (¹H), deuterio (²H), tritio (³H).",
              "Explica por qué los isótopos tienen las mismas propiedades químicas pero diferentes propiedades nucleares.",
              "Investiga las aplicaciones de isótopos radiactivos en medicina (diagnóstico y tratamiento)."
            ]
          }
        ]
      },
      {
        "key": "dualidad_onda_particula",
        "name": "Dualidad Onda-Partícula",
        "short_description": "Introducción al concepto cuántico de que la materia y la luz tienen propiedades tanto de ondas como de partículas.",
        "sub_topics": [
          {
            "key": "naturaleza_luz",
            "name": "Naturaleza de la Luz",
            "short_description": "Comprensión de que la luz se comporta como onda y como partícula (fotón).",
            "example_tasks": [
              "Explica el concepto de dualidad onda-partícula de la luz.",
              "Describe el efecto fotoeléctrico que demostró la naturaleza corpuscular de la luz (Einstein).",
              "¿Qué es un fotón? Explica cómo la energía de un fotón depende de su frecuencia (E = hf).",
              "Investiga experimentos que muestran comportamiento ondulatorio (interferencia) y corpuscular (efecto fotoeléctrico) de la luz."
            ]
          },
          {
            "key": "ondas_de_materia",
            "name": "Ondas de Materia (De Broglie)",
            "short_description": "Comprensión de que partículas como electrones también exhiben comportamiento ondulatorio.",
            "example_tasks": [
              "Explica la hipótesis de De Broglie: toda partícula en movimiento tiene asociada una onda.",
              "¿Qué experimentos demostraron la naturaleza ondulatoria de los electrones? (difracción de electrones).",
              "Explica por qué no observamos el comportamiento ondulatorio de objetos macroscópicos como pelotas.",
              "Investiga el microscopio electrónico que aprovecha la naturaleza ondulatoria de los electrones."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "fisica_nuclear",
    "name": "Física Nuclear",
    "short_description": "Estudio de los procesos que ocurren en el núcleo atómico, incluyendo radiactividad, reacciones nucleares y sus aplicaciones en energía y medicina.",
    "sub_topics": [
      {
        "key": "radiactividad",
        "name": "Radiactividad",
        "short_description": "Comprensión de la radiactividad como desintegración espontánea de núcleos inestables que emiten radiación.",
        "sub_topics": [
          {
            "key": "descubrimiento_radiactividad",
            "name": "Descubrimiento de la Radiactividad",
            "short_description": "Contexto histórico del descubrimiento de la radiactividad natural.",
            "example_tasks": [
              "Describe el descubrimiento de la radiactividad por Henri Becquerel (1896) con sales de uranio.",
              "Explica las contribuciones de Marie y Pierre Curie al estudio de la radiactividad (descubrimiento del polonio y radio).",
              "¿Por qué fue importante este descubrimiento para la física moderna?",
              "Investiga los riesgos de salud que enfrentaron los primeros investigadores de la radiactividad."
            ]
          },
          {
            "key": "tipos_radiacion",
            "name": "Tipos de Radiación",
            "short_description": "Clasificación de la radiación nuclear en alfa, beta y gamma según sus características.",
            "example_tasks": [
              "Describe las características de la radiación alfa: núcleos de helio (2 protones + 2 neutrones), poca penetración, alta ionización.",
              "Explica la radiación beta: electrones o positrones emitidos, penetración media.",
              "Describe la radiación gamma: ondas electromagnéticas de alta energía, gran penetración, baja ionización.",
              "Compara el poder de penetración de las tres radiaciones: ¿cuál detiene una hoja de papel, cuál detiene aluminio, cuál requiere plomo?"
            ]
          },
          {
            "key": "desintegracion_nuclear",
            "name": "Desintegración Nuclear",
            "short_description": "Comprensión de cómo los núcleos inestables se transforman emitiendo partículas.",
            "example_tasks": [
              "Explica qué es la desintegración alfa y cómo cambia el núcleo (disminuye Z en 2, A en 4).",
              "Describe la desintegración beta y los cambios en el núcleo (Z aumenta en 1, A permanece igual cuando se emite un electrón).",
              "¿Qué es la emisión gamma? ¿Cambia la composición del núcleo?",
              "Escribe la ecuación de desintegración alfa del uranio-238: ²³⁸U → ²³⁴Th + ⁴He."
            ]
          },
          {
            "key": "vida_media",
            "name": "Vida Media y Período de Semidesintegración",
            "short_description": "Concepto de vida media como tiempo necesario para que se desintegre la mitad de una muestra radiactiva.",
            "example_tasks": [
              "Define período de semidesintegración o vida media de un isótopo radiactivo.",
              "Si la vida media del carbono-14 es 5730 años, ¿qué fracción de una muestra quedará después de 11,460 años?",
              "Explica cómo se usa la datación por carbono-14 para determinar la edad de fósiles y objetos arqueológicos.",
              "¿Por qué diferentes isótopos radiactivos tienen vidas medias muy diferentes (de fracciones de segundo a miles de millones de años)?"
            ]
          }
        ]
      },
      {
        "key": "reacciones_nucleares",
        "name": "Reacciones Nucleares",
        "short_description": "Estudio de procesos de fisión y fusión nuclear que liberan enormes cantidades de energía.",
        "sub_topics": [
          {
            "key": "fision_nuclear",
            "name": "Fisión Nuclear",
            "short_description": "Comprensión de la división de núcleos pesados en núcleos más ligeros con liberación de energía.",
            "example_tasks": [
              "Define fisión nuclear. ¿Qué es una reacción en cadena?",
              "Explica cómo funciona la fisión del uranio-235 cuando absorbe un neutrón.",
              "Describe cómo se controla una reacción en cadena en un reactor nuclear (barras de control).",
              "¿Qué relación tiene la fisión nuclear con la ecuación E=mc² de Einstein?"
            ]
          },
          {
            "key": "fusion_nuclear",
            "name": "Fusión Nuclear",
            "short_description": "Estudio de la unión de núcleos ligeros para formar núcleos más pesados con liberación de energía.",
            "example_tasks": [
              "Define fusión nuclear. ¿Dónde ocurre naturalmente? (en el Sol y las estrellas).",
              "Explica la fusión de hidrógeno en helio como fuente de energía del Sol.",
              "¿Por qué la fusión requiere temperaturas extremadamente altas (millones de grados)?",
              "Investiga los esfuerzos para lograr fusión nuclear controlada como fuente de energía limpia (proyectos como ITER)."
            ]
          },
          {
            "key": "energia_nuclear",
            "name": "E = mc²",
            "short_description": "Comprensión de la equivalencia masa-energía y su aplicación en reacciones nucleares.",
            "example_tasks": [
              "Explica la famosa ecuación de Einstein E=mc² y qué significa.",
              "¿Por qué las reacciones nucleares liberan mucha más energía que las reacciones químicas?",
              "Describe el concepto de 'defecto de masa': la masa del núcleo es menor que la suma de sus componentes.",
              "Calcula cuánta energía se libera si 1 gramo de masa se convierte completamente en energía (E=mc², c=3×10⁸ m/s)."
            ]
          }
        ]
      },
      {
        "key": "aplicaciones_energia_nuclear",
        "name": "Aplicaciones de la Energía Nuclear",
        "short_description": "Análisis de usos pacíficos y riesgos de la energía nuclear en generación eléctrica y medicina.",
        "sub_topics": [
          {
            "key": "centrales_nucleares",
            "name": "Centrales Nucleoeléctricas",
            "short_description": "Funcionamiento de plantas que generan electricidad mediante fisión controlada.",
            "example_tasks": [
              "Explica cómo una central nuclear genera electricidad: fisión → calor → vapor → turbinas → generador.",
              "Describe los componentes principales: reactor, barras de combustible, moderador, barras de control, sistema de refrigeración.",
              "¿Qué ventajas tienen las centrales nucleares? (no emiten CO₂ durante operación, alta densidad energética).",
              "¿Qué desventajas y riesgos presentan? (residuos radiactivos, accidentes potenciales, costo elevado)."
            ]
          },
          {
            "key": "aplicaciones_medicas",
            "name": "Aplicaciones Médicas",
            "short_description": "Uso de radiación e isótopos radiactivos en diagnóstico y tratamiento de enfermedades.",
            "example_tasks": [
              "Explica cómo funcionan las gammagrafías y tomografías por emisión de positrones (PET) usando isótopos radiactivos.",
              "Describe el uso de radiación en radioterapia para destruir células cancerosas.",
              "¿Qué es la medicina nuclear y cómo se utilizan trazadores radiactivos?",
              "Investiga la importancia del tecnecio-99m en diagnósticos médicos."
            ]
          },
          {
            "key": "otras_aplicaciones",
            "name": "Otras Aplicaciones",
            "short_description": "Usos adicionales de la radiactividad en industria, agricultura e investigación.",
            "example_tasks": [
              "Explica cómo se usa la radiación para esterilizar equipo médico y alimentos.",
              "Describe el uso de trazadores radiactivos en estudios de procesos industriales y biológicos.",
              "¿Cómo se aplica la radiactividad en la agricultura? (mejoramiento de cultivos, control de plagas).",
              "Investiga el uso de detectores de humo que contienen americio-241."
            ]
          }
        ]
      },
      {
        "key": "proteccion_radiologica",
        "name": "Protección Radiológica y Seguridad",
        "short_description": "Medidas de seguridad y protección contra la radiación ionizante.",
        "sub_topics": [
          {
            "key": "efectos_radiacion",
            "name": "Efectos Biológicos de la Radiación",
            "short_description": "Comprensión de cómo la radiación afecta a los organismos vivos.",
            "example_tasks": [
              "Explica qué es la radiación ionizante y por qué es peligrosa para las células.",
              "Describe los efectos de la exposición a radiación: daño celular, mutaciones, cáncer.",
              "¿Qué es una dosis de radiación y cómo se mide? (sievert, Sv).",
              "Compara fuentes naturales de radiación (cósmica, terrestre) con fuentes artificiales."
            ]
          },
          {
            "key": "medidas_proteccion",
            "name": "Medidas de Protección",
            "short_description": "Principios básicos de protección radiológica: tiempo, distancia y blindaje.",
            "example_tasks": [
              "Explica los tres principios de protección radiológica: minimizar tiempo de exposición, maximizar distancia, usar blindaje.",
              "Describe qué materiales se usan para blindaje contra diferentes tipos de radiación.",
              "¿Qué hacen los trabajadores en instalaciones nucleares para protegerse? (dosímetros, equipo de protección, protocolos).",
              "Investiga qué hacer en caso de emergencia nuclear (refugio, yoduro de potasio, evacuación)."
            ]
          },
          {
            "key": "residuos_nucleares",
            "name": "Gestión de Residuos Radiactivos",
            "short_description": "Desafíos del manejo y almacenamiento de desechos radiactivos.",
            "example_tasks": [
              "Explica qué son los residuos nucleares y por qué son problemáticos (permanecen radiactivos por miles de años).",
              "Describe métodos de almacenamiento: piscinas de enfriamiento, almacenamiento en seco, repositorios geológicos profundos.",
              "¿Qué desafíos presenta el almacenamiento a largo plazo de residuos de alta actividad?",
              "Investiga el debate sobre la energía nuclear: beneficios vs. riesgos ambientales."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "energia_medio_ambiente",
    "name": "Energía y Medio Ambiente",
    "short_description": "Análisis de diferentes fuentes de energía, su impacto ambiental, eficiencia energética y la importancia del desarrollo sustentable.",
    "sub_topics": [
      {
        "key": "fuentes_energia",
        "name": "Fuentes de Energía",
        "short_description": "Clasificación y estudio de fuentes de energía renovables y no renovables.",
        "sub_topics": [
          {
            "key": "energias_no_renovables",
            "name": "Energías No Renovables",
            "short_description": "Combustibles fósiles y energía nuclear que se agotan con el uso.",
            "example_tasks": [
              "Enumera las principales fuentes de energía no renovables: petróleo, carbón, gas natural, uranio.",
              "Explica por qué se llaman 'no renovables' (se formaron hace millones de años y no se regeneran en escala humana).",
              "Describe ventajas: alta densidad energética, infraestructura desarrollada, disponibilidad actual.",
              "Analiza desventajas: contaminación, emisiones de CO₂, agotamiento de reservas, impactos ambientales."
            ]
          },
          {
            "key": "energias_renovables",
            "name": "Energías Renovables",
            "short_description": "Fuentes de energía que se regeneran naturalmente: solar, eólica, hidráulica, etc.",
            "example_tasks": [
              "Enumera fuentes de energía renovables: solar, eólica, hidráulica, geotérmica, biomasa, mareomotriz.",
              "Explica por qué son 'renovables' o 'limpias'.",
              "Describe ventajas: sostenibles, bajas emisiones, disponibilidad ilimitada.",
              "Analiza desafíos: intermitencia, almacenamiento, costo inicial, impacto en ecosistemas locales."
            ]
          },
          {
            "key": "energia_solar",
            "name": "Energía Solar",
            "short_description": "Aprovechamiento de la radiación solar mediante paneles fotovoltaicos y térmicos.",
            "example_tasks": [
              "Explica cómo funcionan los paneles solares fotovoltaicos (efecto fotoeléctrico, conversión luz→electricidad).",
              "Describe sistemas solares térmicos para calentar agua o generar electricidad.",
              "¿Qué ventajas tiene México para aprovechar energía solar? (alta insolación, especialmente en el norte).",
              "Investiga proyectos solares en México: parques fotovoltaicos en Sonora, Chihuahua, etc."
            ]
          },
          {
            "key": "energia_eolica",
            "name": "Energía Eólica",
            "short_description": "Generación eléctrica mediante aerogeneradores que aprovechan el viento.",
            "example_tasks": [
              "Explica cómo funcionan los aerogeneradores: viento → movimiento de aspas → generador → electricidad.",
              "Describe dónde son más efectivos los parques eólicos (costas, montañas, zonas con vientos constantes).",
              "¿Qué regiones de México tienen alto potencial eólico? (Oaxaca, La Ventosa; Tamaulipas).",
              "Analiza ventajas y desventajas de la energía eólica."
            ]
          },
          {
            "key": "energia_hidraulica",
            "name": "Energía Hidráulica",
            "short_description": "Generación eléctrica mediante el aprovechamiento de la energía potencial del agua.",
            "example_tasks": [
              "Explica cómo funciona una presa hidroeléctrica: energía potencial → cinética → turbinas → generador.",
              "Describe las principales presas hidroeléctricas en México: Chicoasén, La Angostura, Malpaso.",
              "¿Qué ventajas tiene la energía hidroeléctrica? (confiable, almacenamiento, control de inundaciones).",
              "Analiza impactos ambientales: alteración de ecosistemas fluviales, desplazamiento de comunidades."
            ]
          },
          {
            "key": "otras_renovables",
            "name": "Otras Fuentes Renovables",
            "short_description": "Energía geotérmica, biomasa y energías marinas.",
            "example_tasks": [
              "Explica cómo funciona la energía geotérmica aprovechando el calor interno de la Tierra.",
              "Investiga las plantas geotérmicas en México (Cerro Prieto en Baja California, Los Azufres en Michoacán).",
              "Describe qué es la biomasa y cómo se convierte en energía útil.",
              "Investiga fuentes emergentes: energía de olas (undimotriz), de mareas (mareomotriz), corrientes oceánicas."
            ]
          }
        ]
      },
      {
        "key": "impacto_ambiental",
        "name": "Impacto Ambiental de la Energía",
        "short_description": "Análisis de los efectos ambientales de diferentes fuentes energéticas.",
        "sub_topics": [
          {
            "key": "cambio_climatico",
            "name": "Cambio Climático y Efecto Invernadero",
            "short_description": "Comprensión de cómo las emisiones de gases aumentan la temperatura global.",
            "example_tasks": [
              "Explica el efecto invernadero natural y por qué es necesario para la vida.",
              "Describe cómo el exceso de CO₂ y otros gases intensifica el efecto invernadero causando calentamiento global.",
              "Enumera consecuencias del cambio climático: derretimiento de glaciares, aumento del nivel del mar, eventos climáticos extremos.",
              "¿Qué sectores contribuyen más a las emisiones de gases de invernadero? (generación eléctrica, transporte, industria)."
            ]
          },
          {
            "key": "contaminacion_aire",
            "name": "Contaminación del Aire",
            "short_description": "Efectos de la quema de combustibles fósiles en la calidad del aire.",
            "example_tasks": [
              "Describe contaminantes producidos por combustibles fósiles: CO₂, SO₂, NOₓ, material particulado.",
              "Explica efectos en la salud: enfermedades respiratorias, cardiovasculares, cáncer.",
              "¿Qué es la lluvia ácida y cómo se relaciona con la quema de carbón y petróleo?",
              "Analiza la calidad del aire en ciudades mexicanas como la Ciudad de México, Monterrey, Guadalajara."
            ]
          },
          {
            "key": "huella_carbono",
            "name": "Huella de Carbono",
            "short_description": "Medición de emisiones de gases de efecto invernadero asociadas a actividades humanas.",
            "example_tasks": [
              "Define huella de carbono. ¿Cómo se mide? (toneladas de CO₂ equivalente).",
              "Calcula aproximadamente tu huella de carbono personal considerando: transporte, electricidad, alimentación, consumo.",
              "Compara la huella de carbono de diferentes fuentes de energía por kWh generado.",
              "Propón cinco acciones concretas para reducir tu huella de carbono."
            ]
          }
        ]
      },
      {
        "key": "eficiencia_energetica",
        "name": "Eficiencia Energética y Conservación",
        "short_description": "Estrategias para usar la energía de manera más eficiente y reducir el consumo.",
        "sub_topics": [
          {
            "key": "ahorro_energia_hogar",
            "name": "Ahorro de Energía en el Hogar",
            "short_description": "Medidas prácticas para reducir el consumo energético doméstico.",
            "example_tasks": [
              "Enumera diez acciones para ahorrar energía en casa: focos LED, apagar aparatos, aislamiento térmico, etc.",
              "Explica cómo los focos LED ahorran energía comparados con incandescentes (mayor eficiencia, menor calor).",
              "Describe la importancia del etiquetado de eficiencia energética en electrodomésticos.",
              "Calcula el ahorro económico anual de reemplazar 5 focos de 60W por LEDs de 9W usados 5h diarias."
            ]
          },
          {
            "key": "transporte_sostenible",
            "name": "Transporte Sostenible",
            "short_description": "Alternativas de movilidad que reducen el consumo energético y emisiones.",
            "example_tasks": [
              "Compara la eficiencia energética de diferentes medios de transporte: automóvil individual, transporte público, bicicleta, caminar.",
              "Explica las ventajas de los vehículos eléctricos e híbridos.",
              "Describe el concepto de movilidad sustentable: transporte público eficiente, ciclovías, peatonalización.",
              "Investiga iniciativas de transporte sostenible en tu ciudad: Metrobús, Ecobici, sistemas BRT."
            ]
          },
          {
            "key": "edificios_sustentables",
            "name": "Edificios y Diseño Sustentable",
            "short_description": "Arquitectura que minimiza el consumo energético mediante diseño inteligente.",
            "example_tasks": [
              "Describe características de edificios sustentables: orientación solar, aislamiento, ventilación natural, paneles solares.",
              "Explica qué son las certificaciones de sustentabilidad (LEED, BREEAM).",
              "¿Cómo el diseño bioclimático aprovecha condiciones naturales para confort térmico?",
              "Investiga ejemplos de edificios sustentables en México."
            ]
          }
        ]
      },
      {
        "key": "desarrollo_sustentable",
        "name": "Desarrollo Sustentable",
        "short_description": "Modelo de desarrollo que satisface necesidades actuales sin comprometer recursos futuros.",
        "sub_topics": [
          {
            "key": "concepto_sustentabilidad",
            "name": "Concepto de Sustentabilidad",
            "short_description": "Comprensión del equilibrio entre desarrollo económico, social y protección ambiental.",
            "example_tasks": [
              "Define desarrollo sustentable según el Informe Brundtland.",
              "Explica los tres pilares de la sustentabilidad: ambiental, económico, social.",
              "¿Por qué es importante pensar en las generaciones futuras al tomar decisiones actuales?",
              "Describe los Objetivos de Desarrollo Sostenible (ODS) de la ONU, especialmente el #7 (Energía asequible y no contaminante) y #13 (Acción por el clima)."
            ]
          },
          {
            "key": "economia_circular",
            "name": "Economía Circular",
            "short_description": "Modelo económico que busca minimizar residuos mediante reutilización y reciclaje.",
            "example_tasks": [
              "Explica el concepto de economía circular vs. economía lineal (extraer-producir-desechar).",
              "Describe las 3R: Reducir, Reutilizar, Reciclar. Da ejemplos de cada una.",
              "¿Cómo el reciclaje ahorra energía? (ejemplo: reciclar aluminio usa 95% menos energía que producirlo de mineral).",
              "Investiga iniciativas de economía circular en tu comunidad o país."
            ]
          },
          {
            "key": "compromiso_personal",
            "name": "Compromiso y Acción Personal",
            "short_description": "Responsabilidad individual en la construcción de un futuro sustentable.",
            "example_tasks": [
              "Elabora un plan personal de acción ambiental con metas específicas para un mes.",
              "Calcula tu consumo energético mensual y propón estrategias para reducirlo 20%.",
              "Investiga cómo tu escuela puede volverse más sustentable: energía solar, separación de residuos, huerto escolar.",
              "Diseña una campaña de concientización sobre eficiencia energética para tu comunidad."
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "tecnologia_fisica_aplicada",
    "name": "Tecnología y Física Aplicada",
    "short_description": "Exploración de cómo los principios físicos se aplican en tecnologías modernas y dispositivos de uso cotidiano.",
    "sub_topics": [
      {
        "key": "electronica_basica",
        "name": "Electrónica Básica",
        "short_description": "Introducción a componentes y dispositivos electrónicos fundamentales.",
        "sub_topics": [
          {
            "key": "semiconductores_diodos",
            "name": "Semiconductores y Diodos",
            "short_description": "Comprensión básica de materiales semiconductores y su aplicación en diodos.",
            "example_tasks": [
              "Explica qué son los semiconductores y por qué son importantes en electrónica (silicio, germanio).",
              "Describe cómo funciona un diodo: permite corriente en una dirección, la bloquea en la otra.",
              "¿Qué es un LED (diodo emisor de luz) y cómo funciona?",
              "Investiga aplicaciones de diodos: rectificación de corriente, protección de circuitos, indicadores luminosos."
            ]
          },
          {
            "key": "transistores",
            "name": "Transistores",
            "short_description": "Introducción al transistor como componente fundamental de la electrónica moderna.",
            "example_tasks": [
              "Explica qué es un transistor y sus funciones básicas: amplificador y interruptor.",
              "Describe por qué los transistores revolucionaron la tecnología (miniaturización, velocidad, eficiencia).",
              "¿Cómo se usan millones de transistores en microprocesadores de computadoras?",
              "Investiga la Ley de Moore: duplicación de transistores en chips cada ~2 años."
            ]
          },
          {
            "key": "circuitos_integrados",
            "name": "Circuitos Integrados",
            "short_description": "Comprensión de chips que contienen miles o millones de componentes electrónicos.",
            "example_tasks": [
              "Explica qué es un circuito integrado o chip.",
              "Describe la importancia de los circuitos integrados en dispositivos modernos: computadoras, teléfonos, electrodomésticos.",
              "¿Qué es un microprocesador y cómo funciona como el 'cerebro' de una computadora?",
              "Investiga el proceso de fabricación de chips (fotolitografía, escalas nanométricas)."
            ]
          }
        ]
      },
      {
        "key": "telecomunicaciones",
        "name": "Telecomunicaciones",
        "short_description": "Aplicaciones de ondas electromagnéticas en comunicación a distancia.",
        "sub_topics": [
          {
            "key": "telefonia_celular",
            "name": "Telefonía Celular",
            "short_description": "Funcionamiento de redes móviles que usan ondas electromagnéticas.",
            "example_tasks": [
              "Explica cómo funcionan los teléfonos celulares: conversión de voz en señales electromagnéticas, transmisión por antenas.",
              "Describe qué son las celdas en redes celulares y cómo permiten cobertura amplia.",
              "¿Qué diferencias hay entre generaciones de telefonía: 2G, 3G, 4G, 5G?",
              "Investiga las frecuencias usadas en telefonía celular y por qué se necesita espectro electromagnético regulado."
            ]
          },
          {
            "key": "internet_wifi",
            "name": "Internet y WiFi",
            "short_description": "Transmisión inalámbrica de datos mediante ondas de radio.",
            "example_tasks": [
              "Explica cómo funciona el WiFi: transmisión de datos por ondas de radio (2.4 GHz, 5 GHz).",
              "Describe qué es un router y cómo distribuye la conexión a internet.",
              "¿Por qué las señales WiFi tienen alcance limitado y se debilitan con paredes?",
              "Investiga la fibra óptica: transmisión de datos por luz en cables de vidrio a alta velocidad."
            ]
          },
          {
            "key": "satelites",
            "name": "Satélites de Comunicación",
            "short_description": "Uso de satélites artificiales para telecomunicaciones globales.",
            "example_tasks": [
              "Explica cómo funcionan los satélites de comunicación en órbita geoestacionaria.",
              "Describe aplicaciones: televisión satelital, GPS, internet satelital, comunicaciones de emergencia.",
              "¿Por qué hay retardo en comunicaciones satelitales? (distancia de ~36,000 km).",
              "Investiga el sistema GPS: triangulación con múltiples satélites para determinar posición."
            ]
          }
        ]
      },
      {
        "key": "tecnologia_imagenes",
        "name": "Tecnología de Imágenes",
        "short_description": "Aplicaciones de física en captura, procesamiento y visualización de imágenes.",
        "sub_topics": [
          {
            "key": "fotografia_digital",
            "name": "Fotografía Digital",
            "short_description": "Funcionamiento de cámaras digitales y sensores de imagen.",
            "example_tasks": [
              "Explica cómo un sensor digital (CCD o CMOS) captura luz y la convierte en imagen digital.",
              "Describe qué son los píxeles y cómo determinan la resolución de una imagen.",
              "¿Cómo funcionan los filtros de color (Bayer) en sensores para captar imágenes en color?",
              "Compara fotografía analógica (película química) vs. digital (sensor electrónico)."
            ]
          },
          {
            "key": "pantallas",
            "name": "Pantallas y Displays",
            "short_description": "Tecnologías de visualización: LCD, LED, OLED, plasma.",
            "example_tasks": [
              "Explica cómo funcionan las pantallas LCD (cristal líquido con luz de fondo).",
              "Describe la tecnología LED y OLED (diodos emisores de luz, píxeles que emiten luz propia).",
              "¿Qué ventajas tienen las pantallas OLED? (mejor contraste, negros verdaderos, menor consumo).",
              "Investiga pantallas emergentes: MicroLED, e-ink, pantallas flexibles."
            ]
          },
          {
            "key": "imagenes_medicas",
            "name": "Imágenes Médicas",
            "short_description": "Uso de diferentes radiaciones para obtener imágenes del interior del cuerpo.",
            "example_tasks": [
              "Compara diferentes tecnologías de imagen médica: rayos X, tomografía, resonancia magnética, ultrasonido.",
              "Explica cómo funcionan los ultrasonidos: ondas sonoras de alta frecuencia y ecos.",
              "Describe las ventajas de la resonancia magnética: no usa radiación ionizante, excelente contraste de tejidos blandos.",
              "Investiga aplicaciones emergentes: imágenes 3D, realidad aumentada en cirugía."
            ]
          }
        ]
      },
      {
        "key": "tecnologias_futuro",
        "name": "Tecnologías del Futuro",
        "short_description": "Exploración de tecnologías emergentes basadas en principios físicos avanzados.",
        "sub_topics": [
          {
            "key": "nanotecnologia",
            "name": "Nanotecnología",
            "short_description": "Manipulación de materia a escala nanométrica (millonésimas de milímetro).",
            "example_tasks": [
              "Explica qué es la nanotecnología y la escala nanométrica (1-100 nanómetros).",
              "Describe aplicaciones actuales: medicina (administración dirigida de fármacos), materiales (más resistentes y ligeros), electrónica (chips más pequeños).",
              "¿Qué son los nanotubos de carbono y por qué tienen propiedades extraordinarias?",
              "Investiga aplicaciones futuras y consideraciones éticas de la nanotecnología."
            ]
          },
          {
            "key": "computacion_cuantica",
            "name": "Computación Cuántica",
            "short_description": "Computadoras que usan principios de mecánica cuántica para procesamiento.",
            "example_tasks": [
              "Explica en términos simples qué es un qubit y cómo difiere de un bit clásico.",
              "Describe el principio de superposición: un qubit puede estar en ambos estados (0 y 1) simultáneamente.",
              "¿Qué problemas podrían resolver las computadoras cuánticas que son imposibles para las clásicas?",
              "Investiga el estado actual de la computación cuántica: prototipos experimentales, empresas líderes (IBM, Google)."
            ]
          },
          {
            "key": "inteligencia_artificial",
            "name": "Inteligencia Artificial y Física",
            "short_description": "Intersección entre IA y física en investigación y aplicaciones.",
            "example_tasks": [
              "Explica cómo la IA se usa en física: análisis de datos de experimentos, simulaciones, descubrimiento de patrones.",
              "Describe aplicaciones: predicción de estructuras de proteínas, análisis de datos astronómicos, optimización de reactores de fusión.",
              "¿Cómo el aprendizaje automático ayuda en el descubrimiento de nuevos materiales?",
              "Investiga el papel de la física en el desarrollo de hardware para IA (GPUs, chips neuromórficos)."
            ]
          },
          {
            "key": "exploracion_espacial",
            "name": "Exploración Espacial",
            "short_description": "Aplicaciones de física en conquista del espacio y tecnología aeroespacial.",
            "example_tasks": [
              "Explica los principios físicos que permiten que los cohetes funcionen en el vacío del espacio (tercera ley de Newton).",
              "Describe desafíos físicos de viajes espaciales: microgravedad, radiación cósmica, distancias enormes.",
              "¿Qué es la propulsión iónica y cómo podría revolucionar viajes espaciales largos?",
              "Investiga proyectos actuales: estación espacial internacional, exploración de Marte, telescopio James Webb."
            ]
          }
        ]
      }
    ]
  }
]
