[
  {
    "key": "scientific_investigation_laboratory_skills",
    "name": "Scientific Investigation and Laboratory Skills",
    "short_description": "Students develop skills in scientific inquiry, experimental design, data collection and analysis, and laboratory safety procedures specific to biological investigations. This foundational topic prepares students to conduct investigations throughout the biology curriculum.",
    "sub_topics": [
      {
        "key": "scientific_method_inquiry",
        "name": "Scientific Method and Inquiry",
        "short_description": "Students learn to formulate testable questions, develop hypotheses, design controlled experiments, and draw evidence-based conclusions in biological contexts.",
        "sub_topics": [
          {
            "key": "asking_scientific_questions",
            "name": "Asking Scientific Questions",
            "short_description": "Formulating testable questions about biological phenomena that can be investigated through observation or experimentation.",
            "example_tasks": [
              "Identify which of the following is a testable scientific question: 'Why are plants green?' or 'How does light intensity affect plant growth rate?'",
              "Convert the general question 'What do birds eat?' into a specific, testable question about bird feeding behavior in your local area",
              "Evaluate three student-generated questions about seed germination and explain which one is most suitable for a controlled experiment"
            ]
          },
          {
            "key": "developing_hypotheses",
            "name": "Developing Hypotheses",
            "short_description": "Creating testable predictions based on background knowledge and logical reasoning about biological relationships.",
            "example_tasks": [
              "Write a hypothesis predicting how temperature will affect the rate of yeast fermentation, including the reasoning behind your prediction",
              "Given an experiment about plant growth in different soil types, identify the hypothesis and explain whether it is testable",
              "Develop two alternative hypotheses to explain why a certain species of frog is only found near streams with specific pH levels"
            ]
          },
          {
            "key": "experimental_design_variables",
            "name": "Experimental Design and Variables",
            "short_description": "Identifying independent, dependent, and controlled variables while designing fair tests with appropriate controls.",
            "example_tasks": [
              "Design an experiment to test whether fertilizer affects tomato plant height, identifying the independent variable, dependent variable, and at least three controlled variables",
              "Analyze a poorly designed experiment about antibiotic effectiveness on bacteria and explain what changes would improve the experimental design",
              "Create a data table with appropriate columns for an experiment testing how exercise affects heart rate in humans, including all necessary variables"
            ]
          },
          {
            "key": "data_collection_recording",
            "name": "Data Collection and Recording",
            "short_description": "Systematically gathering qualitative and quantitative data using appropriate tools and recording observations accurately.",
            "example_tasks": [
              "Design a data collection table for a week-long observation of bird species visiting a backyard feeder, including columns for date, time, species, and number of individuals",
              "Use a microscope to observe and record detailed observations about onion root tip cells, including diagrams with appropriate labels and scale",
              "Collect and record measurements of leaf length from 20 maple trees, ensuring proper use of metric units and significant figures"
            ]
          },
          {
            "key": "analyzing_interpreting_data",
            "name": "Analyzing and Interpreting Data",
            "short_description": "Using mathematical and computational thinking to identify patterns, trends, and relationships in biological data.",
            "example_tasks": [
              "Calculate the mean, median, and range for a dataset showing the heights of bean plants grown under different light conditions, then interpret which condition was most effective",
              "Analyze a graph showing population changes of predators and prey over time and explain the relationship between the two populations",
              "Compare data tables from two different experiments on enzyme activity and draw conclusions about the optimal pH for the enzyme"
            ]
          },
          {
            "key": "drawing_conclusions_communicating",
            "name": "Drawing Conclusions and Communicating Results",
            "short_description": "Making evidence-based claims supported by data and effectively communicating scientific findings.",
            "example_tasks": [
              "Write a conclusion paragraph for an experiment on photosynthesis that includes whether the hypothesis was supported, evidence from the data, and possible sources of error",
              "Create a scientific poster presenting the results of an investigation on mold growth, including background, methods, data graphs, and conclusions",
              "Evaluate a student's conclusion about cell size and explain whether it is adequately supported by the experimental evidence presented"
            ]
          }
        ]
      },
      {
        "key": "laboratory_safety_procedures",
        "name": "Laboratory Safety and Procedures",
        "short_description": "Students learn and practice safe laboratory techniques, proper handling of equipment and materials, and appropriate response to emergencies.",
        "sub_topics": [
          {
            "key": "lab_safety_rules",
            "name": "Laboratory Safety Rules",
            "short_description": "Understanding and following essential safety rules to prevent accidents and injuries in the biology laboratory.",
            "example_tasks": [
              "Identify five unsafe behaviors in a laboratory scenario illustration and explain why each is dangerous and how to correct it",
              "Match laboratory safety symbols (biohazard, chemical hazard, sharp objects) with their meanings and appropriate safety precautions",
              "Explain the proper procedure for handling a broken glass thermometer in the lab and why these steps are necessary"
            ]
          },
          {
            "key": "protective_equipment",
            "name": "Personal Protective Equipment",
            "short_description": "Proper selection and use of safety goggles, gloves, aprons, and other protective equipment during investigations.",
            "example_tasks": [
              "Determine which personal protective equipment is required for an investigation involving iodine solution and plant cells: safety goggles, gloves, apron, or all three",
              "Explain why it is necessary to wear safety goggles even when observing other students conduct experiments with chemicals",
              "Describe the correct procedure for removing and disposing of contaminated gloves after handling bacterial cultures"
            ]
          },
          {
            "key": "using_lab_equipment",
            "name": "Using Laboratory Equipment Safely",
            "short_description": "Demonstrating proper techniques for using microscopes, hot plates, glassware, and other common biology lab equipment.",
            "example_tasks": [
              "List the correct sequence of steps for focusing a compound microscope on a prepared slide, from lowest to highest magnification",
              "Explain why you should never heat a closed container and describe what could happen if this rule is violated",
              "Demonstrate proper technique for using a pipette to transfer a precise volume of liquid without contamination"
            ]
          },
          {
            "key": "handling_biological_materials",
            "name": "Handling Living Organisms and Biological Materials",
            "short_description": "Safely and ethically handling plants, animals, and microorganisms while respecting living things and preventing contamination.",
            "example_tasks": [
              "Describe the proper procedure for handling a live earthworm during a dissection activity, including both safety and ethical considerations",
              "Explain why hands must be washed before and after handling bacterial cultures, and describe the correct handwashing technique",
              "Create a care plan for maintaining a classroom aquarium that addresses water quality, temperature, feeding, and observation safety"
            ]
          },
          {
            "key": "waste_disposal_cleanup",
            "name": "Waste Disposal and Laboratory Cleanup",
            "short_description": "Proper disposal of biological, chemical, and sharp waste materials and maintaining a clean, organized workspace.",
            "example_tasks": [
              "Sort a list of laboratory materials into the correct disposal categories: regular trash, biohazard waste, sharps container, or chemical waste",
              "Describe the step-by-step procedure for cleaning up a microscope station after observing bacterial cultures, including disinfection",
              "Explain why biological specimens should not be disposed of in regular trash and identify appropriate disposal methods for different materials"
            ]
          }
        ]
      },
      {
        "key": "measurement_tools",
        "name": "Measurement and Tools in Biology",
        "short_description": "Students develop proficiency in using metric measurements, microscopes, and other tools essential for biological investigations.",
        "sub_topics": [
          {
            "key": "metric_system_biology",
            "name": "Metric System in Biology",
            "short_description": "Using appropriate metric units and conversions for measuring length, mass, volume, and temperature in biological contexts.",
            "example_tasks": [
              "Convert the following measurements to appropriate units: a bacterial cell measuring 0.002 mm to micrometers, and a whale measuring 25,000 mm to meters",
              "Select the most appropriate tool and unit to measure: the length of a beetle, the mass of a seed, the volume of water in a beaker, and the temperature of pond water",
              "Calculate the total magnification of a microscope when using a 10x eyepiece and a 40x objective lens"
            ]
          },
          {
            "key": "microscope_skills",
            "name": "Microscope Skills",
            "short_description": "Proper use of compound and stereoscopic microscopes to observe cells, tissues, and small organisms.",
            "example_tasks": [
              "Label the parts of a compound microscope including eyepiece, objective lenses, stage, diaphragm, coarse and fine adjustment knobs, and light source",
              "Prepare a wet mount slide of an onion skin cell, focus it under low power, then switch to high power following proper procedures",
              "Calculate the field of view diameter at high power (400x) if the low power (40x) field of view diameter is 4.0 mm"
            ]
          },
          {
            "key": "creating_biological_models",
            "name": "Creating Biological Models and Diagrams",
            "short_description": "Developing accurate scientific drawings, models, and diagrams to represent biological structures and processes.",
            "example_tasks": [
              "Create a detailed biological drawing of a plant cell as seen under a microscope, including title, labels, magnification, and appropriate scale",
              "Construct a 3D model of a cell that accurately represents the relative sizes and positions of at least five organelles",
              "Draw a diagram showing the life cycle of a fern, including both the sporophyte and gametophyte stages with appropriate labels"
            ]
          },
          {
            "key": "data_graphing_visualization",
            "name": "Data Graphing and Visualization",
            "short_description": "Creating appropriate graphs and visual representations to display and analyze biological data.",
            "example_tasks": [
              "Construct a line graph showing how temperature affects enzyme activity based on provided data, including proper title, axis labels, and scale",
              "Determine whether a bar graph or line graph is more appropriate for displaying: (a) number of seeds that germinated each day, and (b) average height of plants in different fertilizer treatments",
              "Create a double line graph comparing the population sizes of rabbits and foxes over a 10-year period, then analyze the relationship between the two populations"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "cell_structure_function",
    "name": "Cell Structure and Function",
    "short_description": "Students explore the cell as the basic unit of life, comparing prokaryotic and eukaryotic cells, identifying organelles and their functions, and understanding how materials move across cell membranes. This forms the foundation for understanding all living systems.",
    "sub_topics": [
      {
        "key": "cell_theory",
        "name": "Cell Theory and Discovery",
        "short_description": "Understanding the historical development of cell theory and the three principles that form the foundation of modern biology.",
        "sub_topics": [
          {
            "key": "history_cell_discovery",
            "name": "History of Cell Discovery",
            "short_description": "Exploring the contributions of scientists like Hooke, Leeuwenhoek, Schleiden, Schwann, and Virchow to our understanding of cells.",
            "example_tasks": [
              "Create a timeline showing the major discoveries in cell biology from Robert Hooke's observation of cork cells in 1665 to the development of the modern cell theory",
              "Explain how the invention of the microscope made it possible for scientists to discover cells and develop the cell theory",
              "Compare what Robert Hooke saw when he observed cork cells with what Anton van Leeuwenhoek observed in pond water, and explain why their observations were different"
            ]
          },
          {
            "key": "three_principles_cell_theory",
            "name": "Three Principles of Cell Theory",
            "short_description": "Learning and applying the three main principles: all living things are made of cells, cells are the basic unit of life, and all cells come from preexisting cells.",
            "example_tasks": [
              "State the three parts of the cell theory and provide an example from nature that supports each principle",
              "Explain why viruses are not considered living things according to the cell theory",
              "A student claims that rocks are alive because they grow larger over time. Use the cell theory to explain why this claim is incorrect"
            ]
          },
          {
            "key": "cells_building_blocks",
            "name": "Cells as Building Blocks of Life",
            "short_description": "Understanding that all organisms are composed of one or more cells and that cellular structure relates to function.",
            "example_tasks": [
              "Compare a unicellular organism like an amoeba with a multicellular organism like a human in terms of how they carry out life functions",
              "Explain why elephants have more cells than mice, but both have cells of approximately the same size",
              "Describe the advantage of being multicellular rather than unicellular for organisms living in diverse environments"
            ]
          }
        ]
      },
      {
        "key": "prokaryotic_eukaryotic_cells",
        "name": "Prokaryotic and Eukaryotic Cells",
        "short_description": "Comparing and contrasting the two major cell types, including their structures, complexity, and examples of organisms in each category.",
        "sub_topics": [
          {
            "key": "prokaryotic_cell_structure",
            "name": "Prokaryotic Cell Structure",
            "short_description": "Examining the simple structure of prokaryotic cells including cell wall, cell membrane, cytoplasm, ribosomes, and genetic material.",
            "example_tasks": [
              "Label a diagram of a bacterial cell including cell wall, cell membrane, cytoplasm, ribosomes, nucleoid region, and flagellum",
              "Explain why prokaryotic cells are generally smaller and simpler than eukaryotic cells",
              "Describe how bacteria can survive without membrane-bound organelles and still carry out all necessary life functions"
            ]
          },
          {
            "key": "eukaryotic_cell_structure",
            "name": "Eukaryotic Cell Structure",
            "short_description": "Exploring the complex structure of eukaryotic cells including the nucleus and membrane-bound organelles.",
            "example_tasks": [
              "Create a Venn diagram comparing prokaryotic and eukaryotic cells, showing structures that are unique to each and structures they share",
              "Explain the advantage of having a nucleus and other membrane-bound organelles in eukaryotic cells",
              "Identify whether each of the following organisms has prokaryotic or eukaryotic cells: bacteria, plants, animals, fungi, and protists"
            ]
          },
          {
            "key": "plant_vs_animal_cells",
            "name": "Plant vs. Animal Cells",
            "short_description": "Identifying the unique structures in plant cells (cell wall, chloroplasts, large central vacuole) compared to animal cells.",
            "example_tasks": [
              "Create a two-column chart listing organelles found in both plant and animal cells versus organelles found only in plant cells or only in animal cells",
              "Examine microscope slides of onion cells and cheek cells, then draw and label each type identifying at least three differences",
              "Explain why plant cells need cell walls but animal cells do not, relating structure to function in each organism type"
            ]
          },
          {
            "key": "specialized_cells",
            "name": "Specialized Cells",
            "short_description": "Understanding how cell structure is related to specialized functions in different cell types.",
            "example_tasks": [
              "Compare the structure of a nerve cell (long extensions), red blood cell (no nucleus, disk shape), and muscle cell (many mitochondria), explaining how each structure helps the cell perform its function",
              "Examine images of root hair cells, white blood cells, and sperm cells, then match each to its function based on structural features",
              "Design a specialized cell for absorbing sunlight efficiently, drawing it and labeling structures that would help it perform this function"
            ]
          }
        ]
      },
      {
        "key": "cell_organelles_functions",
        "name": "Cell Organelles and Their Functions",
        "short_description": "Identifying major organelles in eukaryotic cells and understanding how each contributes to cell survival and function.",
        "sub_topics": [
          {
            "key": "nucleus_genetic_control",
            "name": "Nucleus and Genetic Control",
            "short_description": "Understanding the nucleus as the control center containing DNA and directing cellular activities.",
            "example_tasks": [
              "Explain why the nucleus is often called the 'control center' or 'brain' of the cell, using specific examples of what it controls",
              "Describe what would happen to a cell if its nucleus were removed, and explain why",
              "Label the parts of the nucleus including nuclear envelope, nuclear pores, chromatin/chromosomes, and nucleolus"
            ]
          },
          {
            "key": "mitochondria_energy",
            "name": "Mitochondria and Energy Production",
            "short_description": "Learning how mitochondria convert energy from food into ATP through cellular respiration.",
            "example_tasks": [
              "Explain why mitochondria are called the 'powerhouse of the cell' and describe the form of energy they produce",
              "Predict which cell types would have the most mitochondria (muscle cells, skin cells, or fat storage cells) and justify your prediction",
              "Describe the relationship between the food you eat and the ATP produced in your mitochondria"
            ]
          },
          {
            "key": "chloroplasts_photosynthesis",
            "name": "Chloroplasts and Photosynthesis",
            "short_description": "Understanding how chloroplasts capture light energy and convert it to chemical energy in plant cells.",
            "example_tasks": [
              "Explain why animal cells do not have chloroplasts and must obtain energy differently than plant cells",
              "Describe the role of chlorophyll in chloroplasts and explain why most plants appear green",
              "Compare the energy functions of mitochondria and chloroplasts, showing how they are related in plant cells"
            ]
          },
          {
            "key": "endoplasmic_reticulum_ribosomes",
            "name": "Endoplasmic Reticulum and Ribosomes",
            "short_description": "Learning about protein synthesis on ribosomes and the role of rough and smooth ER in processing and transport.",
            "example_tasks": [
              "Distinguish between rough ER (with ribosomes) and smooth ER (without ribosomes) and explain their different functions in the cell",
              "Trace the path of a protein from synthesis on a ribosome, through the rough ER, to its final destination in the cell",
              "Explain why cells that produce large amounts of proteins (like pancreatic cells making enzymes) have extensive rough ER"
            ]
          },
          {
            "key": "golgi_apparatus",
            "name": "Golgi Apparatus",
            "short_description": "Understanding how the Golgi apparatus modifies, packages, and ships proteins and lipids to their destinations.",
            "example_tasks": [
              "Use an analogy (such as a post office or factory packaging department) to explain the function of the Golgi apparatus",
              "Describe the sequence of organelles involved in producing and secreting a protein hormone: ribosomes → rough ER → Golgi → cell membrane",
              "Explain what might happen to a cell if its Golgi apparatus stopped functioning properly"
            ]
          },
          {
            "key": "lysosomes_vacuoles",
            "name": "Lysosomes and Vacuoles",
            "short_description": "Learning about cellular digestion by lysosomes and storage functions of vacuoles.",
            "example_tasks": [
              "Explain why lysosomes are sometimes called the 'cleanup crew' or 'recycling center' of the cell",
              "Compare the small vacuoles in animal cells with the large central vacuole in plant cells, explaining the different functions",
              "Describe how a white blood cell uses lysosomes to destroy bacteria that have been engulfed by the cell"
            ]
          },
          {
            "key": "cell_membrane_cytoplasm",
            "name": "Cell Membrane and Cytoplasm",
            "short_description": "Understanding the cell membrane as a selective barrier and cytoplasm as the gel-like substance where organelles are suspended.",
            "example_tasks": [
              "Draw and label the phospholipid bilayer structure of the cell membrane, showing the hydrophilic heads and hydrophobic tails",
              "Explain why the cell membrane is described as 'selectively permeable' and give examples of substances it allows through and blocks",
              "Describe the role of cytoplasm in the cell and explain how it helps organelles function"
            ]
          },
          {
            "key": "cytoskeleton",
            "name": "Cytoskeleton",
            "short_description": "Learning about the protein framework that provides cell shape, support, and enables movement.",
            "example_tasks": [
              "Compare the cytoskeleton to the skeleton in a human body, explaining both similarities and differences in function",
              "Describe three functions of the cytoskeleton: providing structural support, enabling cell movement, and transporting materials within the cell",
              "Explain how the cytoskeleton allows certain cells like amoebas to change shape and move"
            ]
          }
        ]
      },
      {
        "key": "cell_membrane_transport",
        "name": "Cell Membrane and Transport",
        "short_description": "Understanding how materials move into and out of cells through passive and active transport mechanisms.",
        "sub_topics": [
          {
            "key": "selective_permeability",
            "name": "Selective Permeability",
            "short_description": "Learning how the cell membrane controls which substances can enter or leave the cell.",
            "example_tasks": [
              "Explain what 'selectively permeable' means and why this property is essential for cell survival",
              "Predict which of the following can pass directly through the cell membrane: oxygen, glucose, carbon dioxide, water, ions",
              "Describe how the structure of the phospholipid bilayer relates to its function as a selective barrier"
            ]
          },
          {
            "key": "diffusion",
            "name": "Diffusion",
            "short_description": "Understanding the passive movement of particles from high to low concentration until equilibrium is reached.",
            "example_tasks": [
              "Place a drop of food coloring in water and observe what happens over time. Explain this in terms of diffusion and particle movement",
              "Predict and explain the direction oxygen will diffuse when the concentration is higher outside a cell than inside",
              "Explain why diffusion is considered a form of passive transport that requires no energy from the cell"
            ]
          },
          {
            "key": "osmosis",
            "name": "Osmosis",
            "short_description": "Learning about the diffusion of water across a selectively permeable membrane from high to low water concentration.",
            "example_tasks": [
              "Predict what will happen to a plant cell placed in pure water (hypotonic solution) and explain your prediction using the concept of osmosis",
              "Compare what happens to red blood cells in hypotonic, isotonic, and hypertonic solutions, drawing diagrams to show the results",
              "Explain why fresh vegetables become crisp when placed in cold water and wilted when salt is added to them"
            ]
          },
          {
            "key": "facilitated_diffusion",
            "name": "Facilitated Diffusion",
            "short_description": "Understanding how carrier and channel proteins help large or charged molecules cross the membrane without energy.",
            "example_tasks": [
              "Explain why glucose molecules require protein channels to enter cells even though diffusion is occurring down a concentration gradient",
              "Compare simple diffusion and facilitated diffusion, identifying what they have in common and how they differ",
              "Describe the role of protein channels in facilitated diffusion using an analogy such as a door in a fence"
            ]
          },
          {
            "key": "active_transport",
            "name": "Active Transport",
            "short_description": "Learning how cells use energy (ATP) to move substances against their concentration gradient through protein pumps.",
            "example_tasks": [
              "Explain why active transport requires energy while diffusion does not, using the analogy of riding a bike uphill versus downhill",
              "Describe how the sodium-potassium pump maintains different ion concentrations inside and outside of nerve cells",
              "Compare active transport with passive transport in terms of energy requirement, concentration gradient, and protein involvement"
            ]
          },
          {
            "key": "endocytosis_exocytosis",
            "name": "Endocytosis and Exocytosis",
            "short_description": "Understanding how large particles and molecules enter cells by endocytosis and leave cells by exocytosis.",
            "example_tasks": [
              "Draw and label diagrams showing the steps of endocytosis as a cell engulfs a bacterium, forming a vesicle",
              "Explain how a cell secretes insulin using exocytosis, describing the role of vesicles and the cell membrane",
              "Compare phagocytosis ('cell eating') and pinocytosis ('cell drinking'), providing examples of when cells use each process"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "cell_division_reproduction",
    "name": "Cell Division and Reproduction",
    "short_description": "Students explore how cells reproduce through mitosis and meiosis, understanding the cell cycle, chromosome behavior, and the differences between asexual and sexual reproduction. This knowledge connects cellular processes to organism reproduction and heredity.",
    "sub_topics": [
      {
        "key": "cell_cycle",
        "name": "The Cell Cycle",
        "short_description": "Understanding the stages of the cell cycle including interphase, mitosis, and cytokinesis, and how cells regulate growth and division.",
        "sub_topics": [
          {
            "key": "interphase",
            "name": "Interphase",
            "short_description": "Learning about the G1, S, and G2 phases when cells grow, replicate DNA, and prepare for division.",
            "example_tasks": [
              "Describe what happens during each part of interphase: G1 (growth), S (DNA replication), and G2 (preparation for mitosis)",
              "Explain why DNA replication during S phase is essential before a cell can divide",
              "Calculate the approximate time a cell spends in interphase if the complete cell cycle takes 24 hours and mitosis takes 1 hour"
            ]
          },
          {
            "key": "chromosomes_chromatin",
            "name": "Chromosomes and Chromatin",
            "short_description": "Understanding the structure of DNA packaging into chromatin and chromosomes, including sister chromatids and centromeres.",
            "example_tasks": [
              "Explain the difference between chromatin (loose DNA) during interphase and chromosomes (tightly coiled DNA) during mitosis",
              "Draw and label a replicated chromosome showing two sister chromatids joined at the centromere",
              "Describe why DNA must be tightly coiled into chromosomes before cell division can occur"
            ]
          },
          {
            "key": "cell_cycle_regulation",
            "name": "Cell Cycle Regulation and Checkpoints",
            "short_description": "Learning how cells control division through checkpoints and what happens when regulation fails.",
            "example_tasks": [
              "Explain the purpose of cell cycle checkpoints and describe what the cell checks for at the G1 checkpoint",
              "Describe what happens when cell cycle regulation fails and cells divide uncontrollably (cancer)",
              "Compare normal cell division with cancer cell division in terms of regulation and growth patterns"
            ]
          }
        ]
      },
      {
        "key": "mitosis",
        "name": "Mitosis",
        "short_description": "Understanding the process of nuclear division that produces two genetically identical daughter cells for growth and repair.",
        "sub_topics": [
          {
            "key": "purpose_mitosis",
            "name": "Purpose and Importance of Mitosis",
            "short_description": "Learning why organisms use mitosis for growth, repair, and asexual reproduction.",
            "example_tasks": [
              "List three important functions of mitosis in multicellular organisms: growth, repair of damaged tissue, and replacement of dead cells",
              "Explain why your body must produce millions of new cells every day through mitosis",
              "Describe how mitosis allows a single fertilized egg cell to develop into a complete organism with trillions of cells"
            ]
          },
          {
            "key": "prophase",
            "name": "Prophase",
            "short_description": "Observing the first stage of mitosis when chromatin condenses into chromosomes and the nuclear envelope breaks down.",
            "example_tasks": [
              "Draw and describe prophase showing chromatin condensing into visible chromosomes and the centrioles moving to opposite poles",
              "Explain why chromosomes must condense and become visible before they can be separated into daughter cells",
              "Identify prophase in microscope images of onion root tip cells undergoing mitosis"
            ]
          },
          {
            "key": "metaphase",
            "name": "Metaphase",
            "short_description": "Understanding the alignment of chromosomes at the cell's equator during the second stage of mitosis.",
            "example_tasks": [
              "Draw a cell in metaphase showing chromosomes aligned at the metaphase plate with spindle fibers attached to centromeres",
              "Explain why chromosomes must line up at the cell's equator before they can be pulled apart",
              "Describe the role of spindle fibers in positioning chromosomes during metaphase"
            ]
          },
          {
            "key": "anaphase",
            "name": "Anaphase",
            "short_description": "Learning about the separation of sister chromatids as they move to opposite poles of the cell.",
            "example_tasks": [
              "Draw anaphase showing sister chromatids being pulled apart to opposite ends of the cell by shortening spindle fibers",
              "Explain what would happen if the spindle fibers did not separate sister chromatids correctly during anaphase",
              "Count the number of chromosomes moving to each pole during anaphase if the parent cell started with 8 chromosomes"
            ]
          },
          {
            "key": "telophase_cytokinesis",
            "name": "Telophase and Cytokinesis",
            "short_description": "Understanding the final stages when nuclear envelopes reform and the cytoplasm divides to produce two daughter cells.",
            "example_tasks": [
              "Draw telophase showing two nuclei forming, chromosomes decondensing, and the cell beginning to pinch in the middle",
              "Compare cytokinesis in animal cells (cleavage furrow) and plant cells (cell plate formation), explaining why they differ",
              "Explain why cytokinesis is necessary in addition to mitosis to produce two complete daughter cells"
            ]
          },
          {
            "key": "outcomes_mitosis",
            "name": "Outcomes of Mitosis",
            "short_description": "Understanding that mitosis produces two genetically identical diploid daughter cells with the same chromosome number as the parent.",
            "example_tasks": [
              "Explain why the two daughter cells produced by mitosis are genetically identical to each other and to the parent cell",
              "If a human skin cell with 46 chromosomes undergoes mitosis, how many chromosomes will each daughter cell have? Explain your answer",
              "Describe the role of mitosis in healing a cut on your skin, from injury to complete repair"
            ]
          }
        ]
      },
      {
        "key": "meiosis",
        "name": "Meiosis",
        "short_description": "Understanding the specialized cell division that produces gametes (sex cells) with half the chromosome number for sexual reproduction.",
        "sub_topics": [
          {
            "key": "purpose_meiosis",
            "name": "Purpose and Importance of Meiosis",
            "short_description": "Learning why organisms use meiosis to produce gametes and maintain chromosome number across generations.",
            "example_tasks": [
              "Explain why meiosis must reduce the chromosome number by half when producing sperm and egg cells",
              "Describe what would happen to chromosome numbers in offspring if gametes were produced by mitosis instead of meiosis",
              "Calculate the chromosome number in human gametes if human body cells have 46 chromosomes"
            ]
          },
          {
            "key": "meiosis_one",
            "name": "Meiosis I",
            "short_description": "Understanding the first division that separates homologous chromosome pairs, reducing chromosome number by half.",
            "example_tasks": [
              "Draw and label the stages of meiosis I (prophase I, metaphase I, anaphase I, telophase I) showing homologous pairs separating",
              "Explain what happens during crossing over in prophase I and why this increases genetic variation",
              "Compare the alignment of chromosomes in metaphase of mitosis versus metaphase I of meiosis"
            ]
          },
          {
            "key": "meiosis_two",
            "name": "Meiosis II",
            "short_description": "Learning about the second division that separates sister chromatids, similar to mitosis but producing haploid cells.",
            "example_tasks": [
              "Explain why meiosis II is similar to mitosis but produces haploid cells instead of diploid cells",
              "Draw the stages of meiosis II showing how sister chromatids separate to produce four haploid cells",
              "If a cell enters meiosis II with 8 chromosomes, how many chromosomes will each of the four daughter cells have at the end?"
            ]
          },
          {
            "key": "outcomes_meiosis",
            "name": "Outcomes of Meiosis",
            "short_description": "Understanding that meiosis produces four genetically unique haploid cells from one diploid parent cell.",
            "example_tasks": [
              "Compare the outcomes of mitosis and meiosis in terms of number of daughter cells, chromosome number, and genetic variation",
              "Explain how meiosis produces four genetically different cells even though they come from the same parent cell",
              "Trace the chromosome number through meiosis: if a cell starts with 12 chromosomes (diploid), how many will be in each cell after meiosis I? After meiosis II?"
            ]
          },
          {
            "key": "genetic_variation_meiosis",
            "name": "Genetic Variation in Meiosis",
            "short_description": "Learning how crossing over and independent assortment during meiosis create genetic diversity.",
            "example_tasks": [
              "Explain two ways that meiosis produces genetic variation: crossing over during prophase I and independent assortment during metaphase I",
              "Calculate the number of genetically different gametes that can be produced through independent assortment alone if an organism has 3 pairs of homologous chromosomes (2³ = 8)",
              "Describe why siblings from the same parents can look different from each other, using concepts of meiosis and genetic variation"
            ]
          }
        ]
      },
      {
        "key": "asexual_sexual_reproduction",
        "name": "Asexual and Sexual Reproduction",
        "short_description": "Comparing and contrasting reproduction methods in organisms and understanding the advantages and disadvantages of each.",
        "sub_topics": [
          {
            "key": "asexual_reproduction_types",
            "name": "Types of Asexual Reproduction",
            "short_description": "Learning about binary fission, budding, fragmentation, vegetative reproduction, and spore formation.",
            "example_tasks": [
              "Match each type of asexual reproduction with an example: binary fission (bacteria), budding (hydra), fragmentation (starfish), vegetative reproduction (strawberry runners)",
              "Explain how bacteria reproduce through binary fission and why this allows populations to grow rapidly",
              "Describe how a single potato with eyes can produce many genetically identical potato plants through vegetative reproduction"
            ]
          },
          {
            "key": "advantages_asexual",
            "name": "Advantages and Disadvantages of Asexual Reproduction",
            "short_description": "Understanding the benefits of rapid reproduction and the drawback of no genetic variation.",
            "example_tasks": [
              "List three advantages of asexual reproduction: rapid population growth, no need to find a mate, successful traits are preserved",
              "Explain why a disease could wipe out an entire population of asexually reproducing organisms",
              "Describe a situation where asexual reproduction would be more advantageous than sexual reproduction"
            ]
          },
          {
            "key": "sexual_reproduction_process",
            "name": "Sexual Reproduction Process",
            "short_description": "Understanding how gametes combine during fertilization to form a zygote with genetic contributions from both parents.",
            "example_tasks": [
              "Describe the process of sexual reproduction from gamete formation through fertilization to zygote development",
              "Explain why offspring from sexual reproduction are genetically different from both parents",
              "Calculate the chromosome number of a zygote if a sperm with 12 chromosomes fertilizes an egg with 12 chromosomes"
            ]
          },
          {
            "key": "advantages_sexual",
            "name": "Advantages and Disadvantages of Sexual Reproduction",
            "short_description": "Learning how genetic variation promotes adaptation while requiring more time and energy than asexual reproduction.",
            "example_tasks": [
              "Explain why genetic variation from sexual reproduction helps populations survive environmental changes and diseases",
              "List disadvantages of sexual reproduction: requires finding a mate, takes more time and energy, produces fewer offspring",
              "Compare the rate of population growth for bacteria (asexual) versus rabbits (sexual), explaining the difference"
            ]
          },
          {
            "key": "comparing_reproduction_methods",
            "name": "Comparing Reproduction Methods",
            "short_description": "Analyzing when organisms might use asexual versus sexual reproduction based on environmental conditions.",
            "example_tasks": [
              "Create a table comparing asexual and sexual reproduction in terms of genetic variation, speed, energy requirement, and number of parents needed",
              "Explain why some organisms like strawberries can reproduce both sexually (seeds) and asexually (runners)",
              "Describe whether asexual or sexual reproduction would be better for: (a) colonizing a new stable environment, (b) surviving in a changing environment"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "biochemistry_energy_living_systems",
    "name": "Biochemistry and Energy in Living Systems",
    "short_description": "Students explore the chemical basis of life, including the four major macromolecules, enzyme function, and the energy transformations in photosynthesis and cellular respiration. This topic connects chemistry to biological processes.",
    "sub_topics": [
      {
        "key": "organic_compounds_macromolecules",
        "name": "Organic Compounds and Macromolecules",
        "short_description": "Understanding the four main types of biological molecules - carbohydrates, lipids, proteins, and nucleic acids - and their roles in living organisms.",
        "sub_topics": [
          {
            "key": "carbohydrates",
            "name": "Carbohydrates",
            "short_description": "Learning about simple and complex sugars that provide quick energy and structural support in organisms.",
            "example_tasks": [
              "Identify examples of carbohydrates: glucose (simple sugar), starch (plant storage), glycogen (animal storage), and cellulose (plant cell walls)",
              "Explain the difference between simple carbohydrates (sugars) and complex carbohydrates (starches), including which provides faster energy",
              "Describe why athletes 'carb load' before competitions, relating carbohydrates to quick energy production"
            ]
          },
          {
            "key": "lipids",
            "name": "Lipids",
            "short_description": "Understanding fats, oils, phospholipids, and steroids that store energy and form cell membranes.",
            "example_tasks": [
              "Compare the functions of different lipids: fats/oils (long-term energy storage), phospholipids (cell membranes), and steroids (chemical messengers)",
              "Explain why lipids store more than twice as much energy per gram as carbohydrates",
              "Describe the structure of the cell membrane phospholipid bilayer, including hydrophilic heads and hydrophobic tails"
            ]
          },
          {
            "key": "proteins",
            "name": "Proteins",
            "short_description": "Learning about proteins built from amino acids that serve as enzymes, antibodies, hormones, and structural components.",
            "example_tasks": [
              "List five functions of proteins in living organisms: enzymes, antibodies, hormones, transport, and structure",
              "Explain how 20 different amino acids can combine to create thousands of different proteins with unique functions",
              "Describe examples of proteins in the human body: hemoglobin (oxygen transport), insulin (hormone), and keratin (hair structure)"
            ]
          },
          {
            "key": "nucleic_acids",
            "name": "Nucleic Acids",
            "short_description": "Understanding DNA and RNA as information molecules that store and transmit genetic instructions.",
            "example_tasks": [
              "Compare DNA and RNA in terms of structure, sugar type (deoxyribose vs ribose), and function (genetic storage vs protein synthesis)",
              "Explain why nucleic acids are called 'information molecules' and describe what information they contain",
              "Describe the structure of a nucleotide, the building block of DNA and RNA, including the three components: sugar, phosphate, and nitrogen base"
            ]
          },
          {
            "key": "identifying_macromolecules",
            "name": "Identifying and Testing for Macromolecules",
            "short_description": "Learning laboratory tests to identify the presence of different macromolecules in food and other substances.",
            "example_tasks": [
              "Describe the chemical tests for macromolecules: Benedict's test (simple sugars), iodine test (starch), paper test (lipids), and biuret test (proteins)",
              "Design an experiment to test three unknown foods for the presence of carbohydrates, lipids, and proteins",
              "Interpret test results: if a food sample turns dark blue-black with iodine and positive with the paper test, which macromolecules are present?"
            ]
          }
        ]
      },
      {
        "key": "enzymes",
        "name": "Enzymes",
        "short_description": "Understanding biological catalysts that speed up chemical reactions in living organisms without being consumed in the process.",
        "sub_topics": [
          {
            "key": "enzyme_structure_function",
            "name": "Enzyme Structure and Function",
            "short_description": "Learning how enzymes are proteins with specific shapes that determine which reactions they catalyze.",
            "example_tasks": [
              "Explain why enzymes are called biological catalysts and how they speed up chemical reactions without being used up",
              "Draw and label the lock-and-key model of enzyme action showing enzyme, substrate, active site, and product",
              "Describe what happens at the active site when an enzyme binds to its specific substrate"
            ]
          },
          {
            "key": "substrate_specificity",
            "name": "Substrate Specificity",
            "short_description": "Understanding why each enzyme works on only specific substrate molecules due to complementary shapes.",
            "example_tasks": [
              "Explain why the enzyme lactase can only break down lactose and not other sugars like sucrose",
              "Use the lock-and-key analogy to explain enzyme-substrate specificity",
              "Predict whether an enzyme that breaks down protein would be able to break down carbohydrates, explaining your reasoning"
            ]
          },
          {
            "key": "factors_affecting_enzymes",
            "name": "Factors Affecting Enzyme Activity",
            "short_description": "Learning how temperature, pH, and substrate concentration affect enzyme function.",
            "example_tasks": [
              "Graph how enzyme activity changes with temperature, showing optimal temperature and denaturation at high temperatures",
              "Explain why stomach enzymes (pepsin) work best at pH 2 while intestinal enzymes work best at pH 8",
              "Design an experiment to test how temperature affects the rate of catalase breaking down hydrogen peroxide, using liver samples"
            ]
          },
          {
            "key": "enzyme_denaturation",
            "name": "Enzyme Denaturation",
            "short_description": "Understanding how extreme conditions can permanently change enzyme shape and eliminate function.",
            "example_tasks": [
              "Explain what happens to an enzyme's shape and function when it is denatured by high temperature or extreme pH",
              "Describe why cooking food permanently changes its texture and makes it easier to digest (protein denaturation)",
              "Predict what would happen to enzyme activity in the human body if body temperature increased from 37°C to 42°C during a high fever"
            ]
          },
          {
            "key": "enzymes_in_cells",
            "name": "Enzymes in Living Cells",
            "short_description": "Learning about important enzyme-catalyzed reactions in organisms, including digestion and cellular processes.",
            "example_tasks": [
              "List three important digestive enzymes and what macromolecules they break down: amylase (starch), protease (proteins), lipase (fats)",
              "Explain the role of catalase in breaking down toxic hydrogen peroxide in cells into harmless water and oxygen",
              "Describe how people who are lactose intolerant lack the enzyme lactase and therefore cannot digest milk sugar"
            ]
          }
        ]
      },
      {
        "key": "photosynthesis",
        "name": "Photosynthesis",
        "short_description": "Understanding how plants and other autotrophs capture light energy and convert it into chemical energy in glucose.",
        "sub_topics": [
          {
            "key": "photosynthesis_overview",
            "name": "Overview of Photosynthesis",
            "short_description": "Learning the overall process, chemical equation, and importance of photosynthesis to all life on Earth.",
            "example_tasks": [
              "Write the balanced chemical equation for photosynthesis: 6CO₂ + 6H₂O + light energy → C₆H₁₂O₆ + 6O₂",
              "Explain why photosynthesis is essential for almost all life on Earth, even for organisms that don't perform photosynthesis",
              "Identify the reactants (inputs) and products (outputs) of photosynthesis and where each comes from or goes to"
            ]
          },
          {
            "key": "chloroplast_structure",
            "name": "Chloroplast Structure",
            "short_description": "Understanding the organelle where photosynthesis occurs, including thylakoids, grana, and stroma.",
            "example_tasks": [
              "Draw and label a chloroplast showing outer membrane, inner membrane, thylakoids, grana, and stroma",
              "Explain why chloroplasts have a large internal membrane surface area (thylakoids) for capturing light energy",
              "Describe where the light-dependent reactions occur (thylakoids) versus where the Calvin cycle occurs (stroma)"
            ]
          },
          {
            "key": "light_dependent_reactions",
            "name": "Light-Dependent Reactions",
            "short_description": "Learning how chlorophyll captures light energy to split water molecules and produce ATP and NADPH.",
            "example_tasks": [
              "Describe the role of chlorophyll in capturing light energy during the light-dependent reactions",
              "Explain what happens to water molecules during the light-dependent reactions (photolysis) and what is produced",
              "List the products of the light-dependent reactions (ATP, NADPH, and O₂) and explain where each is used or released"
            ]
          },
          {
            "key": "calvin_cycle",
            "name": "Calvin Cycle (Light-Independent Reactions)",
            "short_description": "Understanding how carbon dioxide is converted into glucose using energy from ATP and NADPH.",
            "example_tasks": [
              "Explain why the Calvin cycle is called 'light-independent' even though it depends on products from the light-dependent reactions",
              "Describe how carbon dioxide from the air is incorporated into organic molecules during carbon fixation",
              "Trace the flow of carbon from CO₂ in the atmosphere through photosynthesis to glucose molecules in plants"
            ]
          },
          {
            "key": "factors_affecting_photosynthesis",
            "name": "Factors Affecting Photosynthesis Rate",
            "short_description": "Learning how light intensity, carbon dioxide concentration, temperature, and water availability affect photosynthesis.",
            "example_tasks": [
              "Design an experiment to test how light intensity affects the rate of photosynthesis in aquatic plants (measuring oxygen bubbles)",
              "Explain why greenhouse growers sometimes add extra CO₂ to the air to increase plant growth",
              "Graph and interpret how photosynthesis rate changes with increasing light intensity, showing the leveling off at high light levels"
            ]
          },
          {
            "key": "importance_photosynthesis",
            "name": "Importance of Photosynthesis",
            "short_description": "Understanding photosynthesis as the foundation of food chains and source of atmospheric oxygen.",
            "example_tasks": [
              "Explain how photosynthesis is the source of nearly all food energy on Earth, connecting it to food chains",
              "Describe how photosynthesis by ancient cyanobacteria created Earth's oxygen-rich atmosphere billions of years ago",
              "Calculate how much oxygen a large tree produces through photosynthesis in a year and how many people this could support"
            ]
          }
        ]
      },
      {
        "key": "cellular_respiration",
        "name": "Cellular Respiration",
        "short_description": "Understanding how cells break down glucose to release energy stored in chemical bonds, producing ATP for cellular work.",
        "sub_topics": [
          {
            "key": "cellular_respiration_overview",
            "name": "Overview of Cellular Respiration",
            "short_description": "Learning the overall process, chemical equation, and relationship to photosynthesis.",
            "example_tasks": [
              "Write the balanced chemical equation for cellular respiration: C₆H₁₂O₆ + 6O₂ → 6CO₂ + 6H₂O + ATP",
              "Compare the equations for photosynthesis and cellular respiration, showing how they are opposite processes",
              "Explain why cellular respiration occurs in all organisms (plants and animals) but photosynthesis occurs only in plants and some other organisms"
            ]
          },
          {
            "key": "atp_energy_currency",
            "name": "ATP as Energy Currency",
            "short_description": "Understanding how ATP stores and releases energy for cellular processes through the breaking and forming of bonds.",
            "example_tasks": [
              "Explain why ATP is called the 'energy currency' of the cell",
              "Describe how energy is released when ATP is broken down into ADP and phosphate, and stored when ADP is converted back to ATP",
              "List five cellular processes that require ATP energy: active transport, protein synthesis, muscle contraction, cell division, and nerve impulses"
            ]
          },
          {
            "key": "glycolysis",
            "name": "Glycolysis",
            "short_description": "Learning the first stage of cellular respiration that occurs in the cytoplasm, breaking glucose into pyruvate.",
            "example_tasks": [
              "Describe where glycolysis occurs (cytoplasm) and what it produces: 2 pyruvate, 2 ATP (net), and 2 NADH",
              "Explain why glycolysis is considered anaerobic (doesn't require oxygen) and occurs in all organisms",
              "Calculate the net ATP production from glycolysis (4 ATP produced minus 2 ATP invested)"
            ]
          },
          {
            "key": "krebs_cycle",
            "name": "Krebs Cycle (Citric Acid Cycle)",
            "short_description": "Understanding the second stage occurring in mitochondria that completes glucose breakdown and produces electron carriers.",
            "example_tasks": [
              "Describe where the Krebs cycle occurs (mitochondrial matrix) and what it produces from each pyruvate: CO₂, ATP, NADH, and FADH₂",
              "Explain why the Krebs cycle is also called the citric acid cycle",
              "Trace what happens to the carbon atoms from glucose: how many CO₂ molecules are released during the Krebs cycle for each glucose?"
            ]
          },
          {
            "key": "electron_transport_chain",
            "name": "Electron Transport Chain",
            "short_description": "Learning how the electron transport chain in the inner mitochondrial membrane produces most of the ATP.",
            "example_tasks": [
              "Describe the role of the electron transport chain in producing ATP using energy from NADH and FADH₂",
              "Explain why oxygen is called the 'final electron acceptor' and what happens if oxygen is not available",
              "Calculate the total ATP yield from one glucose molecule: approximately 36-38 ATP (2 from glycolysis, 2 from Krebs cycle, 32-34 from electron transport chain)"
            ]
          },
          {
            "key": "aerobic_vs_anaerobic",
            "name": "Aerobic vs. Anaerobic Respiration",
            "short_description": "Comparing cellular respiration with oxygen to fermentation without oxygen.",
            "example_tasks": [
              "Compare aerobic respiration (with O₂, producing ~36 ATP) to fermentation (without O₂, producing only 2 ATP)",
              "Explain why muscle cells undergo lactic acid fermentation during intense exercise when oxygen supply is insufficient",
              "Describe how yeast fermentation produces ethanol and CO₂, and how this is used in bread making and beer brewing"
            ]
          },
          {
            "key": "photosynthesis_respiration_connection",
            "name": "Connection Between Photosynthesis and Cellular Respiration",
            "short_description": "Understanding how these two processes form a cycle that sustains life on Earth.",
            "example_tasks": [
              "Draw a diagram showing how the products of photosynthesis (glucose and O₂) are the reactants for cellular respiration, and vice versa",
              "Explain how plants perform both photosynthesis and cellular respiration, while animals perform only cellular respiration",
              "Describe the flow of energy from the sun through photosynthesis to glucose to ATP, and how matter cycles between these processes"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "dna_molecular_genetics",
    "name": "DNA and Molecular Genetics",
    "short_description": "Students explore the structure and function of DNA as the hereditary material, learning about DNA replication, the role of RNA, protein synthesis, and how mutations affect genetic information. This topic connects molecular biology to heredity and traits.",
    "sub_topics": [
      {
        "key": "dna_structure",
        "name": "DNA Structure",
        "short_description": "Understanding the double helix structure of DNA, including nucleotides, complementary base pairing, and the sugar-phosphate backbone.",
        "sub_topics": [
          {
            "key": "nucleotide_components",
            "name": "Nucleotide Components",
            "short_description": "Learning the three parts of a DNA nucleotide: deoxyribose sugar, phosphate group, and nitrogen base.",
            "example_tasks": [
              "Draw and label a single DNA nucleotide showing the deoxyribose sugar, phosphate group, and nitrogen base components",
              "Explain how nucleotides link together through bonds between the sugar of one nucleotide and the phosphate of the next",
              "Identify the four nitrogen bases in DNA (adenine, thymine, guanine, cytosine) and classify them as purines or pyrimidines"
            ]
          },
          {
            "key": "complementary_base_pairing",
            "name": "Complementary Base Pairing",
            "short_description": "Understanding Chargaff's rules and how adenine pairs with thymine, and guanine pairs with cytosine through hydrogen bonds.",
            "example_tasks": [
              "Given one DNA strand with the sequence ATGCTAGC, write the complementary strand using base pairing rules",
              "Explain why adenine always pairs with thymine (A-T) and guanine always pairs with cytosine (G-C) in DNA",
              "If a DNA molecule contains 30% thymine, calculate the percentages of adenine, guanine, and cytosine using Chargaff's rules"
            ]
          },
          {
            "key": "double_helix_structure",
            "name": "Double Helix Structure",
            "short_description": "Learning about the twisted ladder shape of DNA discovered by Watson and Crick, with antiparallel strands.",
            "example_tasks": [
              "Draw and label the DNA double helix showing the sugar-phosphate backbone as the sides of the ladder and base pairs as the rungs",
              "Explain what 'antiparallel' means in terms of DNA strand orientation (5' to 3' direction)",
              "Describe the contributions of Rosalind Franklin's X-ray crystallography images to discovering DNA's double helix structure"
            ]
          },
          {
            "key": "dna_organization",
            "name": "DNA Organization in Cells",
            "short_description": "Understanding how DNA is packaged with proteins into chromatin and chromosomes in eukaryotic cells.",
            "example_tasks": [
              "Explain how nearly 2 meters of DNA can fit inside a tiny cell nucleus through coiling and packaging with histone proteins",
              "Describe the organization levels from DNA double helix to nucleosomes to chromatin to chromosomes",
              "Compare where DNA is located in prokaryotic cells (nucleoid region, not membrane-bound) versus eukaryotic cells (inside nucleus)"
            ]
          }
        ]
      },
      {
        "key": "dna_replication",
        "name": "DNA Replication",
        "short_description": "Learning how DNA copies itself before cell division, ensuring genetic information is passed to daughter cells.",
        "sub_topics": [
          {
            "key": "semiconservative_replication",
            "name": "Semiconservative Replication",
            "short_description": "Understanding that each new DNA molecule contains one original strand and one new strand.",
            "example_tasks": [
              "Explain what 'semiconservative' means in DNA replication and why each daughter DNA molecule has one old and one new strand",
              "Draw a diagram showing DNA replication, with the original double helix separating and two new complementary strands being synthesized",
              "Describe how semiconservative replication was proven by the Meselson-Stahl experiment using heavy and light nitrogen isotopes"
            ]
          },
          {
            "key": "replication_process",
            "name": "DNA Replication Process",
            "short_description": "Learning the steps of replication including unwinding, base pairing, and forming new DNA strands.",
            "example_tasks": [
              "Describe the role of DNA helicase in unwinding and separating the two DNA strands at the replication fork",
              "Explain how DNA polymerase adds complementary nucleotides to build new strands, following base pairing rules",
              "Sequence the steps of DNA replication: (1) helicase unwinds the double helix, (2) DNA polymerase adds nucleotides, (3) two identical DNA molecules form"
            ]
          },
          {
            "key": "why_replication_matters",
            "name": "Importance of DNA Replication",
            "short_description": "Understanding when and why DNA replication occurs during the cell cycle.",
            "example_tasks": [
              "Explain why DNA must replicate during S phase of interphase before mitosis or meiosis can occur",
              "Describe what would happen if DNA replication errors were not corrected by proofreading mechanisms",
              "Calculate how many DNA molecules exist after three rounds of replication starting with one original molecule (use exponential growth: 2^n)"
            ]
          }
        ]
      },
      {
        "key": "rna_protein_synthesis",
        "name": "RNA and Protein Synthesis",
        "short_description": "Understanding how genetic information flows from DNA to RNA to proteins through transcription and translation.",
        "sub_topics": [
          {
            "key": "rna_structure_types",
            "name": "RNA Structure and Types",
            "short_description": "Learning the differences between RNA and DNA, and the three types of RNA involved in protein synthesis.",
            "example_tasks": [
              "Compare RNA and DNA in five ways: sugar (ribose vs deoxyribose), bases (uracil vs thymine), strands (single vs double), and location",
              "Describe the three types of RNA and their functions: mRNA (carries genetic code), tRNA (brings amino acids), rRNA (makes up ribosomes)",
              "Explain why RNA uses uracil instead of thymine and how uracil pairs with adenine"
            ]
          },
          {
            "key": "transcription",
            "name": "Transcription",
            "short_description": "Learning how DNA is used as a template to create complementary mRNA in the nucleus.",
            "example_tasks": [
              "Describe the process of transcription: RNA polymerase binds to DNA promoter, unwinds DNA, and builds mRNA using complementary base pairing",
              "Given a DNA template strand TACGCTAGC, write the mRNA sequence that would be transcribed (remember U replaces T)",
              "Explain why only one gene (section of DNA) is transcribed at a time, not the entire chromosome"
            ]
          },
          {
            "key": "genetic_code",
            "name": "The Genetic Code",
            "short_description": "Understanding how three-letter codons in mRNA specify amino acids and how the code is universal.",
            "example_tasks": [
              "Use a codon table to determine which amino acids are coded by the mRNA sequence: AUG CCG UAC GGC UAA",
              "Explain why the genetic code is called 'redundant' or 'degenerate' (multiple codons can code for the same amino acid)",
              "Identify the start codon (AUG, codes for methionine) and three stop codons (UAA, UAG, UGA) and their roles in translation"
            ]
          },
          {
            "key": "translation",
            "name": "Translation",
            "short_description": "Learning how ribosomes read mRNA codons and tRNA brings amino acids to build proteins.",
            "example_tasks": [
              "Describe the steps of translation: ribosome binds to mRNA at start codon, tRNA brings amino acids, peptide bonds form, protein chain grows until stop codon",
              "Explain the role of tRNA anticodons in matching complementary mRNA codons to bring the correct amino acid",
              "Trace the flow of genetic information from DNA → mRNA (transcription) → protein (translation), known as the Central Dogma"
            ]
          },
          {
            "key": "gene_expression",
            "name": "Gene Expression and Regulation",
            "short_description": "Understanding that not all genes are expressed all the time and how cells control which proteins are made.",
            "example_tasks": [
              "Explain why a muscle cell and a nerve cell have the same DNA but look and function differently (differential gene expression)",
              "Describe environmental factors that can affect gene expression, such as temperature affecting fur color in Himalayan rabbits",
              "Explain the concept of 'turning genes on or off' and why this regulation is essential for cell specialization"
            ]
          }
        ]
      },
      {
        "key": "mutations",
        "name": "Mutations",
        "short_description": "Learning about changes in DNA sequences, their causes, effects on proteins and organisms, and their role in evolution.",
        "sub_topics": [
          {
            "key": "types_of_mutations",
            "name": "Types of Mutations",
            "short_description": "Understanding point mutations (substitution) and frameshift mutations (insertion and deletion).",
            "example_tasks": [
              "Compare substitution, insertion, and deletion mutations using the sentence: THE CAT ATE THE RAT (change to THE CAR ATE THE RAT, or THE ECA TAT ETH ERAT)",
              "Explain why frameshift mutations (insertions or deletions) usually have more severe effects than substitution mutations",
              "Given the DNA sequence TACGCTAGC, show the effect of: (a) substituting the 4th base, (b) deleting the 3rd base, (c) inserting a base after the 2nd position"
            ]
          },
          {
            "key": "causes_of_mutations",
            "name": "Causes of Mutations",
            "short_description": "Learning about spontaneous mutations and induced mutations caused by mutagens.",
            "example_tasks": [
              "List three types of mutagens that can cause DNA damage: radiation (UV light, X-rays), chemicals (tobacco smoke), and biological agents (viruses)",
              "Explain how UV radiation from the sun can cause mutations in skin cells and lead to skin cancer",
              "Describe why DNA replication errors occur spontaneously and how most are corrected by proofreading mechanisms"
            ]
          },
          {
            "key": "effects_of_mutations",
            "name": "Effects of Mutations on Organisms",
            "short_description": "Understanding that mutations can be harmful, beneficial, or neutral depending on their effect on protein function.",
            "example_tasks": [
              "Categorize mutations as harmful (sickle cell anemia in malaria-free areas), beneficial (antibiotic resistance in bacteria), or neutral (silent mutations)",
              "Explain how a single nucleotide change causes sickle cell disease by changing one amino acid in hemoglobin protein",
              "Describe a beneficial mutation example: the ability to digest lactose in adulthood due to mutations in human populations that herded dairy animals"
            ]
          },
          {
            "key": "germline_vs_somatic",
            "name": "Germline vs. Somatic Mutations",
            "short_description": "Understanding the difference between mutations in sex cells (heritable) and body cells (not heritable).",
            "example_tasks": [
              "Explain why mutations in gametes (sex cells) can be passed to offspring but mutations in skin cells cannot",
              "Describe why cancer mutations in body cells are not inherited by children even though cancer can run in families (inherited predisposition)",
              "Compare the impact of a germline mutation (affects all cells of offspring) versus a somatic mutation (affects only some cells in one individual)"
            ]
          },
          {
            "key": "mutations_evolution",
            "name": "Mutations and Evolution",
            "short_description": "Learning how mutations are the original source of genetic variation that drives evolution.",
            "example_tasks": [
              "Explain how mutations introduce new alleles into populations, providing raw material for natural selection",
              "Describe why mutation rates are usually very low but even rare mutations can lead to significant changes over many generations",
              "Give an example of how a random mutation provided an advantage: antibiotic resistance mutations in bacteria allow survival when antibiotics are present"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "heredity_mendelian_genetics",
    "name": "Heredity and Mendelian Genetics",
    "short_description": "Students explore patterns of inheritance, learning how traits are passed from parents to offspring through genes and alleles. This includes Punnett squares, probability, dominant and recessive traits, and different inheritance patterns.",
    "sub_topics": [
      {
        "key": "basic_genetics_concepts",
        "name": "Basic Genetics Concepts",
        "short_description": "Understanding fundamental terminology including genes, alleles, genotype, phenotype, homozygous, and heterozygous.",
        "sub_topics": [
          {
            "key": "genes_alleles",
            "name": "Genes and Alleles",
            "short_description": "Learning that genes are sections of DNA that code for traits, and alleles are different versions of the same gene.",
            "example_tasks": [
              "Explain the difference between a gene (section of DNA coding for a trait) and an allele (different version of that gene)",
              "Give examples of genes and their alleles: flower color gene has purple and white alleles; human blood type gene has A, B, and O alleles",
              "Describe why sexually reproducing organisms have two alleles for each gene (one from each parent)"
            ]
          },
          {
            "key": "genotype_phenotype",
            "name": "Genotype and Phenotype",
            "short_description": "Understanding genotype as the genetic makeup and phenotype as the observable characteristics.",
            "example_tasks": [
              "Distinguish between genotype (TT, Tt, or tt) and phenotype (tall or short) for plant height",
              "Explain why two organisms can have the same phenotype but different genotypes (Tt and TT both appear tall)",
              "Given that a mouse has brown fur, explain why you cannot determine its exact genotype without more information (could be BB or Bb)"
            ]
          },
          {
            "key": "dominant_recessive",
            "name": "Dominant and Recessive Alleles",
            "short_description": "Learning how dominant alleles mask recessive alleles in heterozygous individuals.",
            "example_tasks": [
              "Explain why the dominant allele is expressed in the phenotype even when only one copy is present (heterozygous)",
              "Use letter notation correctly: capital letter for dominant allele (T) and lowercase for recessive allele (t)",
              "Determine the phenotype of these genotypes if B=brown eyes (dominant) and b=blue eyes (recessive): BB, Bb, bb"
            ]
          },
          {
            "key": "homozygous_heterozygous",
            "name": "Homozygous and Heterozygous",
            "short_description": "Understanding organisms with two identical alleles (homozygous) versus two different alleles (heterozygous).",
            "example_tasks": [
              "Classify each genotype as homozygous dominant, homozygous recessive, or heterozygous: TT, Tt, tt",
              "Explain why homozygous recessive (tt) is the only genotype that shows the recessive phenotype",
              "Describe why heterozygous individuals (Tt) are sometimes called 'carriers' when they have one recessive disease allele but don't show symptoms"
            ]
          }
        ]
      },
      {
        "key": "mendels_experiments",
        "name": "Mendel's Experiments",
        "short_description": "Learning about Gregor Mendel's pea plant experiments and the laws of inheritance he discovered.",
        "sub_topics": [
          {
            "key": "mendels_pea_plants",
            "name": "Mendel's Pea Plant Studies",
            "short_description": "Understanding why Mendel chose pea plants and which traits he studied.",
            "example_tasks": [
              "List three reasons Mendel chose pea plants: short generation time, many offspring, easy to control breeding, clear contrasting traits",
              "Identify seven traits Mendel studied in pea plants: seed shape, seed color, flower color, pod shape, pod color, flower position, stem height",
              "Explain how Mendel controlled pollination to ensure purebred lines (true-breeding) by preventing cross-pollination"
            ]
          },
          {
            "key": "law_of_segregation",
            "name": "Law of Segregation",
            "short_description": "Learning that allele pairs separate during gamete formation so each gamete receives only one allele.",
            "example_tasks": [
              "Explain the Law of Segregation: paired alleles separate during meiosis so each gamete gets only one allele for each gene",
              "Describe how a heterozygous parent (Tt) produces two types of gametes (T or t) in equal proportions",
              "Apply the Law of Segregation to predict gamete types from these parent genotypes: TT, Tt, tt"
            ]
          },
          {
            "key": "law_of_independent_assortment",
            "name": "Law of Independent Assortment",
            "short_description": "Understanding that genes for different traits are inherited independently of each other.",
            "example_tasks": [
              "Explain the Law of Independent Assortment: genes for different traits (like height and seed color) are inherited independently",
              "Determine the gamete types from a parent with genotype TtYy, showing all four possible combinations (TY, Ty, tY, ty)",
              "Describe the exception to independent assortment: linked genes on the same chromosome tend to be inherited together"
            ]
          },
          {
            "key": "monohybrid_crosses",
            "name": "Monohybrid Crosses",
            "short_description": "Learning to predict offspring ratios when crossing parents that differ in one trait.",
            "example_tasks": [
              "Complete a Punnett square for Tt × Tt and determine the genotypic ratio (1 TT : 2 Tt : 1 tt) and phenotypic ratio (3 tall : 1 short)",
              "Explain why Mendel's F2 generation showed a 3:1 ratio of dominant to recessive phenotypes",
              "Predict offspring genotypes and phenotypes from crossing Tt × tt (testcross)"
            ]
          }
        ]
      },
      {
        "key": "punnett_squares_probability",
        "name": "Punnett Squares and Probability",
        "short_description": "Using Punnett squares to predict inheritance patterns and calculating probabilities of specific outcomes.",
        "sub_topics": [
          {
            "key": "constructing_punnett_squares",
            "name": "Constructing Punnett Squares",
            "short_description": "Learning the proper method to set up and complete Punnett squares for genetic crosses.",
            "example_tasks": [
              "Create a Punnett square for the cross Bb × Bb, showing parent gametes on top and side, and offspring genotypes in boxes",
              "Complete a two-trait Punnett square (dihybrid cross) for BbTt × BbTt with 16 boxes",
              "Explain why gametes are placed on the outside of the Punnett square and offspring genotypes are placed inside the boxes"
            ]
          },
          {
            "key": "interpreting_results",
            "name": "Interpreting Punnett Square Results",
            "short_description": "Analyzing Punnett squares to determine genotypic and phenotypic ratios.",
            "example_tasks": [
              "From a Punnett square showing Bb × Bb cross, calculate the probability that an offspring will have the genotype BB (1/4 or 25%)",
              "Determine both genotypic ratio (1:2:1) and phenotypic ratio (3:1) from a monohybrid cross Punnett square",
              "Explain why the phenotypic ratio is different from the genotypic ratio in a cross between two heterozygous individuals"
            ]
          },
          {
            "key": "probability_rules",
            "name": "Probability Rules in Genetics",
            "short_description": "Applying multiplication and addition rules to calculate probabilities of genetic outcomes.",
            "example_tasks": [
              "Use the multiplication rule to calculate the probability of having three children, all with the recessive phenotype from Bb × Bb parents (1/4 × 1/4 × 1/4)",
              "Apply the addition rule to find the probability of a child being either homozygous dominant OR homozygous recessive from Bb × Bb (1/4 + 1/4)",
              "Calculate the probability that a child will inherit the dominant phenotype from one trait AND the recessive phenotype from another trait (use multiplication)"
            ]
          },
          {
            "key": "testcrosses",
            "name": "Testcrosses",
            "short_description": "Understanding how to determine unknown genotypes by crossing with homozygous recessive individuals.",
            "example_tasks": [
              "Explain why crossing an organism showing the dominant phenotype with a homozygous recessive partner (testcross) reveals whether it is homozygous or heterozygous",
              "If a testcross produces offspring with both dominant and recessive phenotypes, determine the genotype of the dominant parent (must be heterozygous)",
              "Design a testcross to determine whether a purple-flowered plant is PP or Pp (cross with white-flowered pp plant)"
            ]
          }
        ]
      },
      {
        "key": "complex_inheritance_patterns",
        "name": "Complex Inheritance Patterns",
        "short_description": "Learning about inheritance patterns that don't follow simple Mendelian dominant-recessive rules.",
        "sub_topics": [
          {
            "key": "incomplete_dominance",
            "name": "Incomplete Dominance",
            "short_description": "Understanding when heterozygotes show a blended phenotype intermediate between the two homozygotes.",
            "example_tasks": [
              "Explain incomplete dominance using snapdragon flower color: red (RR) × white (WW) produces pink (RW) offspring",
              "Create a Punnett square for RW × RW and determine the phenotypic ratio (1 red : 2 pink : 1 white)",
              "Compare incomplete dominance with complete dominance, explaining why there are three distinct phenotypes instead of two"
            ]
          },
          {
            "key": "codominance",
            "name": "Codominance",
            "short_description": "Learning when both alleles are fully expressed in heterozygotes, producing a combined phenotype.",
            "example_tasks": [
              "Explain codominance using human blood type: I^A and I^B are codominant, so I^A I^B individuals have type AB blood expressing both antigens",
              "Describe roan coat color in horses as an example of codominance: heterozygous horses have both red and white hairs",
              "Compare codominance with incomplete dominance: codominance shows both traits fully, while incomplete dominance shows a blend"
            ]
          },
          {
            "key": "multiple_alleles",
            "name": "Multiple Alleles",
            "short_description": "Understanding genes with more than two alleles in a population, such as ABO blood types.",
            "example_tasks": [
              "Explain the ABO blood system with three alleles (I^A, I^B, i) and determine all possible genotypes for each blood type (A, B, AB, O)",
              "Complete a Punnett square for parents with blood types I^A i × I^B i and determine possible blood types of offspring",
              "Describe why a population can have multiple alleles even though each individual only has two alleles for any gene"
            ]
          },
          {
            "key": "polygenic_inheritance",
            "name": "Polygenic Inheritance",
            "short_description": "Learning about traits controlled by multiple genes, producing continuous variation.",
            "example_tasks": [
              "Identify human traits showing polygenic inheritance: height, skin color, eye color, and intelligence",
              "Explain why polygenic traits show continuous variation (a range of phenotypes) rather than distinct categories",
              "Describe how multiple genes with additive effects produce the wide range of human skin colors across populations"
            ]
          },
          {
            "key": "sex_linked_traits",
            "name": "Sex-Linked Traits",
            "short_description": "Understanding traits carried on X chromosomes that show different inheritance patterns in males and females.",
            "example_tasks": [
              "Explain why males are more likely to express X-linked recessive traits like color blindness or hemophilia (only need one recessive allele)",
              "Complete a Punnett square for a carrier female (X^H X^h) and normal male (X^H Y) and determine the probability of having a son with hemophilia",
              "Describe why a color-blind father cannot pass color blindness to his sons but all his daughters will be carriers"
            ]
          }
        ]
      },
      {
        "key": "pedigrees_human_genetics",
        "name": "Pedigrees and Human Genetics",
        "short_description": "Learning to analyze family trees to trace inheritance patterns of traits and genetic disorders.",
        "sub_topics": [
          {
            "key": "reading_pedigrees",
            "name": "Reading and Interpreting Pedigrees",
            "short_description": "Understanding pedigree symbols and conventions for males, females, affected individuals, and relationships.",
            "example_tasks": [
              "Identify pedigree symbols: squares (males), circles (females), shaded shapes (affected individuals), horizontal lines (mating), vertical lines (offspring)",
              "Interpret a three-generation pedigree showing parents, grandparents, siblings, and cousins",
              "Determine which individuals in a pedigree are affected by a trait and which are unaffected carriers"
            ]
          },
          {
            "key": "autosomal_dominant",
            "name": "Autosomal Dominant Inheritance",
            "short_description": "Analyzing pedigrees showing dominant traits on autosomes, where affected individuals have at least one affected parent.",
            "example_tasks": [
              "Identify characteristics of autosomal dominant inheritance: trait appears in every generation, affected children have an affected parent, both sexes equally affected",
              "Determine genotypes of individuals in a pedigree showing Huntington's disease (autosomal dominant)",
              "Explain why unaffected parents cannot have children with an autosomal dominant disorder"
            ]
          },
          {
            "key": "autosomal_recessive",
            "name": "Autosomal Recessive Inheritance",
            "short_description": "Learning to recognize recessive traits where affected individuals can have unaffected carrier parents.",
            "example_tasks": [
              "Identify characteristics of autosomal recessive inheritance: trait can skip generations, unaffected parents can have affected children, both sexes equally affected",
              "Analyze a pedigree for cystic fibrosis (autosomal recessive) and determine which individuals must be carriers",
              "Calculate the probability that two carrier parents will have an affected child (1/4) or a carrier child (1/2)"
            ]
          },
          {
            "key": "x_linked_pedigrees",
            "name": "X-Linked Inheritance Pedigrees",
            "short_description": "Analyzing pedigrees for sex-linked traits that show characteristic male-to-grandson patterns.",
            "example_tasks": [
              "Identify characteristics of X-linked recessive traits: more males affected, affected males have carrier mothers, no male-to-male transmission",
              "Analyze a pedigree for hemophilia and determine the genotypes of all family members using X^H and X^h notation",
              "Explain the pattern where an affected grandfather passes the trait through his carrier daughter to his grandson"
            ]
          },
          {
            "key": "genetic_counseling",
            "name": "Genetic Counseling and Risk Assessment",
            "short_description": "Using pedigrees to calculate probability of offspring inheriting genetic disorders.",
            "example_tasks": [
              "Given a pedigree showing Tay-Sachs disease (autosomal recessive), calculate the probability that a couple's child will be affected",
              "Determine carrier status for individuals in a pedigree and assess risk for future children",
              "Explain how genetic counselors use pedigree analysis to help families make informed decisions about family planning"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "modern_genetics_biotechnology",
    "name": "Modern Genetics and Biotechnology",
    "short_description": "Students explore current applications of genetic knowledge including genetic engineering, cloning, selective breeding, DNA fingerprinting, and biotechnology. This topic includes ethical considerations surrounding genetic technologies.",
    "sub_topics": [
      {
        "key": "selective_breeding",
        "name": "Selective Breeding",
        "short_description": "Understanding traditional methods of choosing organisms with desired traits to breed over many generations.",
        "sub_topics": [
          {
            "key": "artificial_selection",
            "name": "Artificial Selection",
            "short_description": "Learning how humans select and breed organisms with desirable traits for agriculture and animal husbandry.",
            "example_tasks": [
              "Explain how farmers have used selective breeding for thousands of years to develop crops with larger fruits, higher yields, and disease resistance",
              "Describe how all dog breeds descended from wolves through artificial selection for specific traits like size, temperament, and appearance",
              "Compare artificial selection (human-directed) with natural selection (environment-directed) in terms of the selecting force and time scale"
            ]
          },
          {
            "key": "inbreeding_hybridization",
            "name": "Inbreeding and Hybridization",
            "short_description": "Understanding two selective breeding methods: crossing closely related organisms or crossing different varieties.",
            "example_tasks": [
              "Explain inbreeding: breeding closely related organisms to maintain desired traits, with examples like purebred dogs or thoroughbred horses",
              "Describe hybridization: crossing different varieties to combine desirable traits, such as developing disease-resistant wheat varieties",
              "Compare advantages and disadvantages: inbreeding maintains traits but can increase harmful recessive alleles; hybridization increases variation but may lose desired traits"
            ]
          },
          {
            "key": "selective_breeding_examples",
            "name": "Examples of Selective Breeding",
            "short_description": "Examining real-world applications in agriculture, animal breeding, and domestication.",
            "example_tasks": [
              "Describe how modern corn (maize) was developed from teosinte through selective breeding over thousands of years, resulting in larger, more nutritious kernels",
              "Explain how dairy cows have been selectively bred to produce much more milk than wild cattle",
              "Research how broiler chickens have been bred to grow much faster and larger than their wild ancestors, and discuss implications"
            ]
          }
        ]
      },
      {
        "key": "genetic_engineering",
        "name": "Genetic Engineering",
        "short_description": "Learning about direct manipulation of DNA to transfer genes between organisms and create genetically modified organisms (GMOs).",
        "sub_topics": [
          {
            "key": "recombinant_dna",
            "name": "Recombinant DNA Technology",
            "short_description": "Understanding how scientists cut and paste DNA from different organisms using restriction enzymes and plasmids.",
            "example_tasks": [
              "Describe the process of creating recombinant DNA: (1) cut DNA with restriction enzymes, (2) insert gene into plasmid, (3) introduce into bacteria",
              "Explain the role of restriction enzymes as 'molecular scissors' that cut DNA at specific sequences",
              "Describe how plasmids serve as vectors (carriers) to transfer genes into bacterial cells"
            ]
          },
          {
            "key": "genetically_modified_organisms",
            "name": "Genetically Modified Organisms (GMOs)",
            "short_description": "Learning about organisms with genes inserted from other species for desired traits.",
            "example_tasks": [
              "Explain how Bt corn was created by inserting a bacterial gene that produces a protein toxic to pest insects",
              "Describe Golden Rice, genetically modified to produce beta-carotene (vitamin A precursor) to address malnutrition",
              "Discuss why some salmon are genetically modified to grow faster by inserting growth hormone genes from other fish species"
            ]
          },
          {
            "key": "medical_applications",
            "name": "Medical Applications of Genetic Engineering",
            "short_description": "Understanding how genetic engineering produces medicines and treats genetic diseases.",
            "example_tasks": [
              "Explain how human insulin is produced by genetically engineered bacteria containing the human insulin gene, helping diabetes patients",
              "Describe gene therapy: inserting functional genes into cells to treat genetic disorders like SCID (severe combined immunodeficiency)",
              "Discuss the development of genetically engineered vaccines and how they differ from traditional vaccines"
            ]
          },
          {
            "key": "benefits_risks_gmos",
            "name": "Benefits and Risks of GMOs",
            "short_description": "Evaluating potential advantages and concerns about genetically modified organisms.",
            "example_tasks": [
              "List potential benefits of GMO crops: increased yield, reduced pesticide use, enhanced nutrition, drought resistance",
              "Identify concerns about GMOs: unknown long-term health effects, environmental impacts, loss of biodiversity, ethical considerations",
              "Research and present both sides of a GMO debate: herbicide-resistant crops reduce tillage (beneficial) but may increase herbicide use (concerning)"
            ]
          }
        ]
      },
      {
        "key": "cloning",
        "name": "Cloning",
        "short_description": "Understanding natural and artificial cloning, including reproductive cloning and therapeutic cloning.",
        "sub_topics": [
          {
            "key": "natural_cloning",
            "name": "Natural Cloning",
            "short_description": "Learning about natural production of genetically identical organisms through asexual reproduction.",
            "example_tasks": [
              "Explain how identical twins are natural clones formed when a zygote splits into two embryos with identical DNA",
              "Describe asexual reproduction in plants (vegetative propagation) as a form of natural cloning",
              "Give examples of organisms that naturally produce clones: bacteria (binary fission), strawberry plants (runners), starfish (fragmentation)"
            ]
          },
          {
            "key": "reproductive_cloning",
            "name": "Reproductive Cloning",
            "short_description": "Understanding somatic cell nuclear transfer (SCNT) used to create Dolly the sheep and other cloned animals.",
            "example_tasks": [
              "Describe the steps of reproductive cloning: (1) remove nucleus from egg cell, (2) insert nucleus from body cell, (3) stimulate division, (4) implant embryo",
              "Explain why Dolly the sheep (1996) was significant as the first mammal cloned from an adult somatic cell",
              "Discuss current uses of animal cloning: preserving endangered species, reproducing prize livestock, medical research animals"
            ]
          },
          {
            "key": "therapeutic_cloning",
            "name": "Therapeutic Cloning and Stem Cells",
            "short_description": "Learning about creating embryonic stem cells for medical research and potential treatments.",
            "example_tasks": [
              "Explain therapeutic cloning: creating embryos to harvest stem cells for research or treatment, not to produce babies",
              "Describe potential medical applications: growing replacement organs, treating spinal cord injuries, Parkinson's disease treatment",
              "Compare embryonic stem cells (can become any cell type) with adult stem cells (limited differentiation potential)"
            ]
          },
          {
            "key": "cloning_ethics",
            "name": "Ethical Issues in Cloning",
            "short_description": "Examining ethical concerns and debates surrounding human and animal cloning.",
            "example_tasks": [
              "Discuss ethical concerns about human reproductive cloning: identity issues, safety risks, 'playing God' arguments",
              "Debate the ethics of therapeutic cloning: potential medical benefits versus moral status of embryos",
              "Explain why many countries have banned human reproductive cloning but may allow therapeutic cloning research"
            ]
          }
        ]
      },
      {
        "key": "dna_technology_forensics",
        "name": "DNA Technology and Forensics",
        "short_description": "Learning how DNA analysis is used to identify individuals, solve crimes, and establish relationships.",
        "sub_topics": [
          {
            "key": "dna_fingerprinting",
            "name": "DNA Fingerprinting",
            "short_description": "Understanding how unique patterns in DNA can identify individuals with near certainty.",
            "example_tasks": [
              "Explain DNA fingerprinting: analyzing specific regions of DNA that vary greatly between individuals (VNTRs - variable number tandem repeats)",
              "Describe the process: extract DNA, amplify using PCR, cut with restriction enzymes, separate by gel electrophoresis, visualize banding pattern",
              "Explain why DNA fingerprints are unique to each individual (except identical twins) based on inheritance of DNA patterns from both parents"
            ]
          },
          {
            "key": "forensic_applications",
            "name": "Forensic Applications",
            "short_description": "Learning how DNA evidence is used in criminal investigations and identifying remains.",
            "example_tasks": [
              "Describe how DNA from blood, hair, or skin cells at a crime scene can be compared to suspect DNA to establish guilt or innocence",
              "Explain the role of CODIS (Combined DNA Index System), the FBI's DNA database containing profiles of convicted offenders",
              "Discuss how DNA analysis identified remains of disaster victims or historical figures (e.g., identifying Tsar Nicholas II's family)"
            ]
          },
          {
            "key": "paternity_testing",
            "name": "Paternity Testing and Relationships",
            "short_description": "Understanding how DNA analysis establishes biological relationships between individuals.",
            "example_tasks": [
              "Explain how paternity tests compare DNA patterns between child, mother, and alleged father to determine biological parentage",
              "Describe how mitochondrial DNA analysis traces maternal lineage because mitochondria are inherited only from mothers",
              "Discuss how DNA testing services like 23andMe can identify relatives by comparing DNA patterns across their databases"
            ]
          },
          {
            "key": "pcr_technique",
            "name": "PCR (Polymerase Chain Reaction)",
            "short_description": "Learning how PCR amplifies tiny DNA samples into millions of copies for analysis.",
            "example_tasks": [
              "Describe the three steps of PCR that repeat in cycles: (1) heat to separate DNA strands, (2) cool to allow primers to bind, (3) DNA polymerase copies DNA",
              "Explain why PCR is essential for forensics: can amplify DNA from tiny samples (single hair, drop of blood)",
              "Calculate how much DNA is produced after PCR: starting with 1 DNA molecule, how many after 30 cycles? (2^30 = over 1 billion)"
            ]
          }
        ]
      },
      {
        "key": "bioethics",
        "name": "Bioethics in Genetics",
        "short_description": "Examining ethical, legal, and social implications of genetic technologies and biotechnology.",
        "sub_topics": [
          {
            "key": "genetic_privacy",
            "name": "Genetic Privacy and Discrimination",
            "short_description": "Understanding concerns about genetic information privacy and potential discrimination.",
            "example_tasks": [
              "Discuss concerns about genetic information privacy: should insurance companies or employers have access to genetic test results?",
              "Explain GINA (Genetic Information Nondiscrimination Act): U.S. law prohibiting genetic discrimination in health insurance and employment",
              "Debate whether genetic testing should be mandatory, optional, or prohibited for certain purposes (employment, insurance, criminal justice)"
            ]
          },
          {
            "key": "designer_babies",
            "name": "Designer Babies and Gene Editing",
            "short_description": "Examining ethical questions about selecting or editing genes in human embryos.",
            "example_tasks": [
              "Discuss the ethics of selecting embryos for desired traits (sex selection, disease prevention, enhancement traits)",
              "Explain CRISPR-Cas9 gene editing technology and debate whether it should be used to edit human embryos",
              "Compare different ethical positions: (1) only preventing serious diseases, (2) allowing enhancement, (3) prohibiting all human gene editing"
            ]
          },
          {
            "key": "ownership_genetic_resources",
            "name": "Ownership of Genetic Resources",
            "short_description": "Understanding debates about patenting genes and genetic information.",
            "example_tasks": [
              "Debate whether companies should be allowed to patent genes they discover (BRCA1 breast cancer gene controversy)",
              "Discuss biopiracy concerns: wealthy nations or companies using genetic resources from developing countries without compensation",
              "Examine who owns your genetic information: you, researchers who sequence it, companies who store it?"
            ]
          },
          {
            "key": "informed_consent",
            "name": "Informed Consent in Genetic Research",
            "short_description": "Learning about ethical requirements for voluntary participation in genetic studies.",
            "example_tasks": [
              "Explain informed consent: participants must understand risks, benefits, and how their genetic information will be used before agreeing to testing",
              "Discuss challenges with genetic research: results may affect family members who didn't consent, unexpected findings (non-paternity)",
              "Debate whether children should be tested for adult-onset genetic diseases when no treatment is available"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "evolution_natural_selection",
    "name": "Evolution and Natural Selection",
    "short_description": "Students explore Darwin's theory of evolution by natural selection, evidence supporting evolution, mechanisms of evolutionary change, and how species adapt to their environments over time. This topic connects genetics to population changes and biodiversity.",
    "sub_topics": [
      {
        "key": "history_evolutionary_thought",
        "name": "History of Evolutionary Thought",
        "short_description": "Understanding how ideas about species change developed, from early naturalists to Darwin's synthesis.",
        "sub_topics": [
          {
            "key": "early_ideas_about_life",
            "name": "Early Ideas About Life's Diversity",
            "short_description": "Learning about pre-Darwin ideas including Lamarck's theory of acquired characteristics.",
            "example_tasks": [
              "Describe Lamarck's theory of acquired characteristics: organisms develop traits during life and pass them to offspring (giraffes stretching necks)",
              "Explain why Lamarck's theory was incorrect: acquired traits (like bodybuilder muscles) are not inherited because they don't change DNA",
              "Compare Lamarck's ideas with Darwin's natural selection in explaining how giraffes evolved long necks"
            ]
          },
          {
            "key": "darwins_voyage",
            "name": "Darwin's Voyage and Observations",
            "short_description": "Understanding Darwin's observations on the HMS Beagle that led to his theory of evolution.",
            "example_tasks": [
              "Describe Darwin's observations of finches on the Galápagos Islands: different beak shapes on different islands related to available food sources",
              "Explain how Darwin observed that organisms on the Galápagos resembled South American species but had unique adaptations to island environments",
              "Discuss why Darwin delayed publishing his theory for over 20 years after returning from the voyage"
            ]
          },
          {
            "key": "influences_on_darwin",
            "name": "Influences on Darwin's Thinking",
            "short_description": "Learning about ideas from geology, economics, and breeding that shaped Darwin's theory.",
            "example_tasks": [
              "Explain how Lyell's geological gradualism (slow Earth changes) influenced Darwin to think about gradual biological changes",
              "Describe how Malthus's essay on population growth (competition for limited resources) influenced Darwin's thinking about survival",
              "Discuss how artificial selection by breeders showed Darwin that traits could change dramatically over generations"
            ]
          }
        ]
      },
      {
        "key": "natural_selection",
        "name": "Natural Selection",
        "short_description": "Understanding Darwin's mechanism for evolution through differential survival and reproduction based on inherited variation.",
        "sub_topics": [
          {
            "key": "principles_natural_selection",
            "name": "Principles of Natural Selection",
            "short_description": "Learning the four main components: variation, heritability, differential survival, and adaptation.",
            "example_tasks": [
              "List and explain the four principles of natural selection: (1) variation exists, (2) variation is heritable, (3) more offspring than survive, (4) individuals with advantageous traits survive and reproduce more",
              "Explain why all four conditions must be present for natural selection to occur",
              "Apply natural selection principles to explain antibiotic resistance in bacteria populations"
            ]
          },
          {
            "key": "fitness_adaptation",
            "name": "Fitness and Adaptation",
            "short_description": "Understanding fitness as reproductive success and adaptations as inherited traits that increase fitness.",
            "example_tasks": [
              "Define biological fitness: the ability to survive and reproduce in a specific environment (not physical strength)",
              "Explain why a trait that increases survival but prevents reproduction has low fitness (e.g., mules are sterile)",
              "Identify adaptations in organisms: cactus water storage, arctic fox white fur, bacterial antibiotic resistance, and explain how each increases fitness"
            ]
          },
          {
            "key": "examples_natural_selection",
            "name": "Examples of Natural Selection",
            "short_description": "Examining well-documented cases of natural selection in action.",
            "example_tasks": [
              "Describe peppered moth evolution in England: light moths favored before pollution, dark moths favored during industrial revolution, light moths favored after pollution controls",
              "Explain antibiotic resistance as natural selection: random mutations provide resistance, antibiotics kill susceptible bacteria, resistant bacteria survive and multiply",
              "Analyze Darwin's finches: different beak shapes evolved through natural selection based on available seeds on different islands"
            ]
          },
          {
            "key": "types_of_selection",
            "name": "Types of Natural Selection",
            "short_description": "Learning about directional, stabilizing, and disruptive selection patterns.",
            "example_tasks": [
              "Explain directional selection: one extreme phenotype is favored (e.g., larger size in horses over time, antibiotic resistance increasing)",
              "Describe stabilizing selection: intermediate phenotypes favored, extremes selected against (e.g., human birth weight - too small or too large reduces survival)",
              "Define disruptive selection: both extremes favored over intermediate (e.g., light and dark colored lizards survive better than medium in mixed environments)"
            ]
          },
          {
            "key": "limits_of_natural_selection",
            "name": "Limits and Misconceptions",
            "short_description": "Understanding what natural selection can and cannot do, and common misconceptions.",
            "example_tasks": [
              "Explain why evolution by natural selection does not have a goal or direction (organisms don't evolve 'in order to' survive)",
              "Describe why individuals don't evolve - populations evolve as allele frequencies change over generations",
              "Clarify that natural selection acts on existing variation; it doesn't create new traits (mutations create variation, selection acts on it)"
            ]
          }
        ]
      },
      {
        "key": "evidence_for_evolution",
        "name": "Evidence for Evolution",
        "short_description": "Examining multiple lines of evidence from different scientific fields that support evolutionary theory.",
        "sub_topics": [
          {
            "key": "fossil_record",
            "name": "Fossil Record",
            "short_description": "Understanding how fossils document the history of life and transitional forms between groups.",
            "example_tasks": [
              "Explain how the fossil record shows change over time: older rocks contain simpler organisms, more recent rocks show greater diversity and complexity",
              "Describe transitional fossils: Archaeopteryx (reptile-bird transition), Tiktaalik (fish-tetrapod transition), and what features they share with ancestor and descendant groups",
              "Discuss gaps in the fossil record and why they occur (fossilization is rare, erosion, undiscovered fossils)"
            ]
          },
          {
            "key": "comparative_anatomy",
            "name": "Comparative Anatomy",
            "short_description": "Learning about homologous structures, analogous structures, and vestigial organs as evidence of common ancestry.",
            "example_tasks": [
              "Identify homologous structures (same underlying structure, different function): human arm, whale flipper, bat wing, cat leg - all have same bone pattern",
              "Distinguish analogous structures (different structure, same function): bird wing vs butterfly wing - look similar but evolved independently",
              "Explain vestigial structures as evidence of evolution: human appendix, whale hip bones, snake leg remnants - inherited from ancestors but reduced function"
            ]
          },
          {
            "key": "comparative_embryology",
            "name": "Comparative Embryology",
            "short_description": "Understanding how similarities in embryonic development suggest common ancestry.",
            "example_tasks": [
              "Describe embryonic similarities in vertebrates: all have gill pouches, tails, and similar early development stages",
              "Explain why human embryos have gill pouches even though humans never develop gills (inherited developmental program from fish ancestors)",
              "Compare embryonic development of different vertebrates and explain what similarities tell us about evolutionary relationships"
            ]
          },
          {
            "key": "molecular_evidence",
            "name": "Molecular and Genetic Evidence",
            "short_description": "Learning how DNA and protein comparisons reveal evolutionary relationships.",
            "example_tasks": [
              "Explain how DNA sequence similarities between species indicate common ancestry: humans and chimpanzees share about 98% of DNA",
              "Describe how cytochrome c protein comparisons show evolutionary relationships: more similar sequences indicate more recent common ancestors",
              "Compare DNA sequences from different species to construct evolutionary trees showing relationships"
            ]
          },
          {
            "key": "biogeography",
            "name": "Biogeography",
            "short_description": "Understanding how geographic distribution of species supports evolution and continental drift.",
            "example_tasks": [
              "Explain why marsupials are found mainly in Australia: isolated after continental drift, evolved independently from placental mammals elsewhere",
              "Describe how island species resemble nearby mainland species but have unique adaptations (Galápagos finches, Hawaiian honeycreepers)",
              "Discuss why similar environments on different continents have different species (convergent evolution vs common ancestry)"
            ]
          }
        ]
      },
      {
        "key": "mechanisms_of_evolution",
        "name": "Mechanisms of Evolution",
        "short_description": "Understanding processes beyond natural selection that cause populations to evolve, including mutation, gene flow, and genetic drift.",
        "sub_topics": [
          {
            "key": "mutation_source_variation",
            "name": "Mutation as Source of Variation",
            "short_description": "Learning how mutations introduce new alleles that provide raw material for evolution.",
            "example_tasks": [
              "Explain why mutations are the ultimate source of all genetic variation in populations",
              "Describe how most mutations are neutral or harmful, but rare beneficial mutations can be favored by natural selection",
              "Give examples of beneficial mutations: antibiotic resistance in bacteria, lactose tolerance in humans, CCR5 mutation providing HIV resistance"
            ]
          },
          {
            "key": "gene_flow",
            "name": "Gene Flow (Migration)",
            "short_description": "Understanding how movement of individuals between populations affects allele frequencies.",
            "example_tasks": [
              "Define gene flow: movement of alleles between populations through migration and interbreeding",
              "Explain how gene flow increases genetic variation within populations but decreases differences between populations",
              "Describe examples of gene flow: pollen dispersal between plant populations, bird migration mixing populations, human migration throughout history"
            ]
          },
          {
            "key": "genetic_drift",
            "name": "Genetic Drift",
            "short_description": "Learning how random chance can cause allele frequency changes, especially in small populations.",
            "example_tasks": [
              "Explain genetic drift: random changes in allele frequencies due to chance events, not selection",
              "Describe the bottleneck effect: population size drastically reduced by disaster, surviving population has different allele frequencies than original",
              "Explain the founder effect: small group establishes new population, allele frequencies differ from source population (e.g., Amish populations)"
            ]
          },
          {
            "key": "sexual_selection",
            "name": "Sexual Selection",
            "short_description": "Understanding how mate choice and competition for mates drive evolution of traits.",
            "example_tasks": [
              "Explain sexual selection: traits evolve because they increase mating success, not necessarily survival",
              "Describe intrasexual selection (same-sex competition): male deer antlers, elephant seal size - males compete for access to females",
              "Explain intersexual selection (mate choice): peacock tails, bird songs - elaborate traits evolve because they are preferred by mates"
            ]
          },
          {
            "key": "coevolution",
            "name": "Coevolution",
            "short_description": "Learning how two species evolve in response to each other over time.",
            "example_tasks": [
              "Define coevolution: reciprocal evolutionary changes in two or more species that interact closely",
              "Describe predator-prey coevolution: cheetahs evolve greater speed, gazelles evolve greater speed and agility (evolutionary arms race)",
              "Explain plant-pollinator coevolution: flowers and pollinators evolve complementary traits (flower shape matches pollinator mouthparts)"
            ]
          }
        ]
      },
      {
        "key": "speciation",
        "name": "Speciation",
        "short_description": "Understanding how new species form through reproductive isolation and divergence of populations.",
        "sub_topics": [
          {
            "key": "species_concept",
            "name": "Species Concept",
            "short_description": "Learning the biological species concept: groups of organisms that can interbreed and produce fertile offspring.",
            "example_tasks": [
              "Define the biological species concept: members can interbreed and produce fertile offspring in nature",
              "Explain why horses and donkeys are different species even though they can mate: their offspring (mules) are sterile",
              "Discuss limitations of the species concept: asexual organisms, extinct organisms, populations that rarely meet"
            ]
          },
          {
            "key": "reproductive_isolation",
            "name": "Reproductive Isolation",
            "short_description": "Understanding mechanisms that prevent gene flow between populations.",
            "example_tasks": [
              "Distinguish prezygotic barriers (prevent fertilization): temporal isolation, behavioral isolation, mechanical isolation, gametic isolation",
              "Describe postzygotic barriers (reduce hybrid viability or fertility): hybrid offspring die, or are weak, or are sterile",
              "Give examples of reproductive isolation: firefly mating signals (behavioral), different flowering times (temporal), horse-donkey sterile mules (postzygotic)"
            ]
          },
          {
            "key": "allopatric_speciation",
            "name": "Allopatric Speciation",
            "short_description": "Learning how geographic separation leads to new species formation.",
            "example_tasks": [
              "Explain allopatric speciation: populations separated by geographic barrier, evolve independently, become reproductively isolated",
              "Describe examples: Grand Canyon separating squirrel populations, island populations diverging from mainland",
              "Explain the role of different selective pressures in separated environments driving divergence"
            ]
          },
          {
            "key": "sympatric_speciation",
            "name": "Sympatric Speciation",
            "short_description": "Understanding how new species can form in the same geographic area without physical separation.",
            "example_tasks": [
              "Explain sympatric speciation: reproductive isolation without geographic separation",
              "Describe polyploidy in plants: chromosome duplication creates instant reproductive isolation (tetraploid can't breed with diploid parent)",
              "Give examples: cichlid fish in single lakes evolving different species, apple maggot flies adapting to different host plants"
            ]
          },
          {
            "key": "patterns_of_evolution",
            "name": "Patterns and Rates of Evolution",
            "short_description": "Learning about gradualism, punctuated equilibrium, adaptive radiation, and convergent evolution.",
            "example_tasks": [
              "Compare gradualism (slow, steady change) with punctuated equilibrium (rapid change followed by long stability) as patterns in the fossil record",
              "Explain adaptive radiation: single ancestral species rapidly diversifies into many species (Darwin's finches, Hawaiian honeycreepers)",
              "Describe convergent evolution: unrelated species evolve similar traits due to similar environments (dolphin, shark, ichthyosaur body shapes)"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "classification_taxonomy",
    "name": "Classification and Taxonomy",
    "short_description": "Students learn how scientists organize and classify the diversity of life using taxonomic hierarchies, dichotomous keys, and phylogenetic trees. This topic emphasizes evolutionary relationships and the three-domain system of classification.",
    "sub_topics": [
      {
        "key": "need_for_classification",
        "name": "Need for Classification Systems",
        "short_description": "Understanding why scientists classify organisms and the historical development of classification systems.",
        "sub_topics": [
          {
            "key": "organizing_diversity",
            "name": "Organizing Life's Diversity",
            "short_description": "Learning why classification helps scientists communicate about millions of species and understand relationships.",
            "example_tasks": [
              "Explain why biologists need a universal system to name and organize the estimated 8-10 million species on Earth",
              "Describe how classification systems help scientists predict characteristics of newly discovered organisms based on their group",
              "Discuss the challenge of classifying organisms before modern genetics: early systems used only physical characteristics"
            ]
          },
          {
            "key": "linnaeus_binomial_nomenclature",
            "name": "Linnaeus and Binomial Nomenclature",
            "short_description": "Understanding the two-part naming system developed by Carolus Linnaeus for scientific names.",
            "example_tasks": [
              "Explain binomial nomenclature: each species has a two-part Latin name consisting of genus and species (e.g., Homo sapiens)",
              "Apply naming conventions: genus capitalized, species lowercase, both italicized or underlined (Canis lupus or Canis lupus)",
              "Describe why scientific names are better than common names: one species may have many common names, or one common name may refer to many species"
            ]
          },
          {
            "key": "basis_for_classification",
            "name": "Basis for Classification",
            "short_description": "Learning how classification systems have evolved from physical traits to evolutionary relationships.",
            "example_tasks": [
              "Compare early classification based on appearance (whales grouped with fish) to modern classification based on evolutionary relationships (whales grouped with mammals)",
              "Explain how DNA evidence has revolutionized classification by revealing true evolutionary relationships",
              "Describe why modern classification aims to group organisms that share a common ancestor (phylogenetic approach)"
            ]
          }
        ]
      },
      {
        "key": "taxonomic_hierarchy",
        "name": "Taxonomic Hierarchy",
        "short_description": "Understanding the nested levels of classification from domain to species, and how organisms are grouped at each level.",
        "sub_topics": [
          {
            "key": "levels_of_classification",
            "name": "Levels of Classification",
            "short_description": "Learning the seven main taxonomic categories from broadest to most specific.",
            "example_tasks": [
              "List the taxonomic hierarchy in order from broadest to most specific: Domain, Kingdom, Phylum, Class, Order, Family, Genus, Species (mnemonic: Dear King Philip Came Over For Good Soup)",
              "Classify humans through all levels: Domain Eukarya, Kingdom Animalia, Phylum Chordata, Class Mammalia, Order Primates, Family Hominidae, Genus Homo, Species sapiens",
              "Explain why organisms in the same genus are more closely related than organisms in the same family or order"
            ]
          },
          {
            "key": "domains_of_life",
            "name": "Three Domains of Life",
            "short_description": "Understanding the highest level of classification: Bacteria, Archaea, and Eukarya.",
            "example_tasks": [
              "Compare the three domains: Bacteria (prokaryotes, common bacteria), Archaea (prokaryotes, extreme environments), Eukarya (eukaryotes, includes protists, fungi, plants, animals)",
              "Explain why Archaea and Bacteria are in separate domains despite both being prokaryotes (different cell chemistry and genetics)",
              "Describe where each domain is commonly found: bacteria everywhere, archaea in extreme environments, eukarya everywhere including multicellular organisms"
            ]
          },
          {
            "key": "six_kingdoms",
            "name": "Six Kingdoms",
            "short_description": "Learning the kingdoms within domains: Bacteria, Archaea, Protista, Fungi, Plantae, and Animalia.",
            "example_tasks": [
              "List and describe the six kingdoms with key characteristics: Bacteria (prokaryote, everywhere), Archaea (prokaryote, extremophiles), Protista (eukaryote, mostly unicellular), Fungi (eukaryote, decomposers), Plantae (eukaryote, photosynthetic), Animalia (eukaryote, consumers)",
              "Classify organisms into kingdoms: E. coli (Bacteria), methanogens (Archaea), amoeba (Protista), mushroom (Fungi), oak tree (Plantae), human (Animalia)",
              "Explain why Kingdom Protista is sometimes called a 'junk drawer' kingdom (contains diverse organisms that don't fit other kingdoms)"
            ]
          },
          {
            "key": "understanding_hierarchy",
            "name": "Understanding Hierarchical Relationships",
            "short_description": "Learning how shared characteristics increase as you move down the hierarchy toward species level.",
            "example_tasks": [
              "Explain why all members of a family share more characteristics than all members of an order",
              "Determine the most recent common ancestor level for: (a) humans and chimpanzees (Family), (b) humans and dogs (Class), (c) humans and oak trees (Domain)",
              "Use classification to predict: if two organisms are in the same genus, what can you infer about their similarities and evolutionary relationship?"
            ]
          }
        ]
      },
      {
        "key": "dichotomous_keys",
        "name": "Dichotomous Keys",
        "short_description": "Learning to use and create identification tools that use paired choices to determine species identity.",
        "sub_topics": [
          {
            "key": "using_dichotomous_keys",
            "name": "Using Dichotomous Keys",
            "short_description": "Understanding how to follow paired statements or questions to identify unknown organisms.",
            "example_tasks": [
              "Use a dichotomous key to identify five different leaf samples based on characteristics like leaf shape, margin type, and vein pattern",
              "Follow a key to identify common birds based on characteristics like size, beak shape, color pattern, and habitat",
              "Explain why dichotomous keys use pairs of contrasting statements (dichotomous means 'divided into two parts')"
            ]
          },
          {
            "key": "creating_dichotomous_keys",
            "name": "Creating Dichotomous Keys",
            "short_description": "Learning to construct effective keys using observable characteristics.",
            "example_tasks": [
              "Create a dichotomous key to identify 6-8 common classroom objects (pencil, eraser, book, etc.) using observable characteristics",
              "Design a key to distinguish between different types of shoes (sneakers, sandals, boots, dress shoes) based on physical features",
              "Construct a dichotomous key for 5 different insect orders using characteristics like number of wings, wing type, mouthparts, and body segments"
            ]
          },
          {
            "key": "characteristics_for_keys",
            "name": "Choosing Appropriate Characteristics",
            "short_description": "Understanding what makes good characteristics for identification: observable, consistent, and contrasting.",
            "example_tasks": [
              "Evaluate characteristics for a plant key: explain why 'leaf shape' is better than 'smells nice' or 'my favorite plant'",
              "List observable characteristics useful for identifying trees: leaf type (needle vs broad), leaf arrangement (opposite vs alternate), bark texture, fruit type",
              "Explain why dichotomous keys should avoid subjective terms like 'large' or 'pretty' and instead use measurable or clearly defined terms"
            ]
          }
        ]
      },
      {
        "key": "phylogenetic_trees",
        "name": "Phylogenetic Trees and Cladograms",
        "short_description": "Understanding diagrams that show evolutionary relationships based on shared derived characteristics.",
        "sub_topics": [
          {
            "key": "reading_phylogenetic_trees",
            "name": "Reading Phylogenetic Trees",
            "short_description": "Learning to interpret branching diagrams showing evolutionary relationships among species.",
            "example_tasks": [
              "Identify parts of a phylogenetic tree: root (common ancestor), branches (evolutionary lineages), nodes (common ancestors), tips (current species or groups)",
              "Determine which species are most closely related on a tree: those that share the most recent common ancestor (closest node)",
              "Use a phylogenetic tree of vertebrates to determine when key features evolved: backbone, jaws, lungs, four limbs, amniotic egg"
            ]
          },
          {
            "key": "shared_derived_characteristics",
            "name": "Shared Derived Characteristics",
            "short_description": "Understanding how evolutionary innovations (derived traits) define groups on phylogenetic trees.",
            "example_tasks": [
              "Identify shared derived characteristics on a vertebrate cladogram: all tetrapods share four limbs, all amniotes share amniotic egg",
              "Explain why 'vertebrae' is a shared derived characteristic for vertebrates but an ancestral characteristic for mammals",
              "Construct a simple cladogram for 4-5 organisms using a table of characteristics (presence/absence of features)"
            ]
          },
          {
            "key": "common_ancestry",
            "name": "Common Ancestry and Divergence",
            "short_description": "Learning how phylogenetic trees show when lineages split from common ancestors.",
            "example_tasks": [
              "Use a primate phylogenetic tree to determine approximately when humans and chimpanzees diverged from their common ancestor",
              "Compare two phylogenetic trees showing different hypotheses about bird relationships and explain what evidence would support each",
              "Explain why phylogenetic trees show relationships, not a 'ladder of progress' from simple to complex organisms"
            ]
          },
          {
            "key": "molecular_phylogenies",
            "name": "Molecular Evidence in Phylogenies",
            "short_description": "Understanding how DNA and protein comparisons create more accurate evolutionary trees.",
            "example_tasks": [
              "Explain how scientists use DNA sequence differences to determine how long ago species diverged (molecular clock)",
              "Describe why molecular evidence sometimes contradicts classification based on appearance (convergent evolution can make unrelated species look similar)",
              "Analyze a simple DNA sequence alignment for 3-4 species and determine which are most closely related based on fewest differences"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "microorganisms",
    "name": "Microorganisms",
    "short_description": "Students explore bacteria, viruses, protists, and fungi, learning about their structures, life processes, ecological roles, and impacts on human health. This topic emphasizes the diversity and importance of microscopic life.",
    "sub_topics": [
      {
        "key": "bacteria",
        "name": "Bacteria",
        "short_description": "Understanding prokaryotic cells, bacterial structure, reproduction, and their beneficial and harmful roles.",
        "sub_topics": [
          {
            "key": "bacterial_structure",
            "name": "Bacterial Cell Structure",
            "short_description": "Learning the components of bacterial cells including cell wall, flagella, and genetic material organization.",
            "example_tasks": [
              "Draw and label a bacterial cell showing cell wall, cell membrane, cytoplasm, ribosomes, nucleoid (DNA), plasmids, and flagellum",
              "Explain the function of the bacterial cell wall (protection, shape) and why antibiotics like penicillin target cell wall synthesis",
              "Compare prokaryotic cells (bacteria) with eukaryotic cells: no nucleus, no membrane-bound organelles, circular DNA, smaller size"
            ]
          },
          {
            "key": "bacterial_shapes",
            "name": "Bacterial Shapes and Arrangements",
            "short_description": "Identifying three main bacterial shapes: cocci, bacilli, and spirilla, and their grouping patterns.",
            "example_tasks": [
              "Identify bacterial shapes from microscope images or diagrams: cocci (spherical), bacilli (rod-shaped), spirilla (spiral)",
              "Describe bacterial arrangements: diplo- (pairs), strepto- (chains), staphylo- (clusters), using examples like Streptococcus and Staphylococcus",
              "Explain how bacterial shape relates to function and habitat (e.g., spiral shape helps some bacteria move through thick liquids)"
            ]
          },
          {
            "key": "bacterial_reproduction",
            "name": "Bacterial Reproduction",
            "short_description": "Understanding binary fission as asexual reproduction and genetic exchange through conjugation.",
            "example_tasks": [
              "Describe binary fission: DNA replicates, cell grows, cell divides into two identical daughter cells",
              "Calculate bacterial population growth: if one bacterium divides every 20 minutes, how many after 4 hours? (2^12 = 4,096)",
              "Explain bacterial conjugation: transfer of DNA between bacteria through a pilus, increasing genetic variation (important for antibiotic resistance spread)"
            ]
          },
          {
            "key": "beneficial_bacteria",
            "name": "Beneficial Roles of Bacteria",
            "short_description": "Learning about bacteria's essential roles in ecosystems, human body, and biotechnology.",
            "example_tasks": [
              "Describe beneficial bacteria in the human digestive system: produce vitamins, aid digestion, prevent harmful bacteria colonization",
              "Explain bacteria's role in nitrogen cycle: nitrogen-fixing bacteria convert atmospheric nitrogen to ammonia usable by plants",
              "List biotechnology applications: bacteria produce insulin, clean up oil spills (bioremediation), make yogurt and cheese (fermentation)"
            ]
          },
          {
            "key": "pathogenic_bacteria",
            "name": "Pathogenic Bacteria and Disease",
            "short_description": "Understanding how disease-causing bacteria harm hosts and how we control bacterial infections.",
            "example_tasks": [
              "Identify common bacterial diseases: strep throat (Streptococcus), Lyme disease (Borrelia), food poisoning (Salmonella, E. coli)",
              "Explain how pathogenic bacteria cause disease: produce toxins, damage tissues, trigger immune responses",
              "Describe methods to control bacterial growth: sterilization (heat, chemicals), refrigeration (slows growth), antibiotics (kill bacteria)"
            ]
          },
          {
            "key": "antibiotic_resistance",
            "name": "Antibiotic Resistance",
            "short_description": "Understanding how bacteria evolve resistance and why this is a major public health concern.",
            "example_tasks": [
              "Explain how antibiotic resistance evolves through natural selection: random mutations provide resistance, antibiotics kill susceptible bacteria, resistant bacteria survive and multiply",
              "Describe MRSA (methicillin-resistant Staphylococcus aureus) as an example of dangerous antibiotic-resistant bacteria",
              "List ways to slow antibiotic resistance: complete full antibiotic course, don't use antibiotics for viral infections, reduce antibiotic use in agriculture"
            ]
          }
        ]
      },
      {
        "key": "viruses",
        "name": "Viruses",
        "short_description": "Learning about viral structure, replication cycles, and their position between living and non-living.",
        "sub_topics": [
          {
            "key": "viral_structure",
            "name": "Viral Structure",
            "short_description": "Understanding basic components: genetic material (DNA or RNA) surrounded by protein coat (capsid).",
            "example_tasks": [
              "Draw and label a virus showing genetic material (DNA or RNA), capsid (protein coat), and sometimes envelope (membrane layer)",
              "Compare viral sizes: viruses are much smaller than bacteria (require electron microscope to see)",
              "Explain why viruses are not made of cells and lack organelles, ribosomes, and cell membranes"
            ]
          },
          {
            "key": "living_or_nonliving",
            "name": "Living or Non-Living?",
            "short_description": "Debating whether viruses are alive based on characteristics of life.",
            "example_tasks": [
              "List characteristics of life that viruses have: contain genetic material, can reproduce (with host), evolve",
              "List characteristics of life that viruses lack: not made of cells, no metabolism, don't grow, can't reproduce independently",
              "Argue both positions: why viruses should be considered living and why they should be considered non-living, then take a position"
            ]
          },
          {
            "key": "viral_replication",
            "name": "Viral Replication Cycles",
            "short_description": "Learning about lytic and lysogenic cycles of bacteriophages and viral reproduction in general.",
            "example_tasks": [
              "Describe the lytic cycle: virus attaches to host cell, injects DNA, takes over cell machinery, produces new viruses, cell bursts (lyses), releases viruses",
              "Explain the lysogenic cycle: viral DNA integrates into host chromosome, replicates with host DNA, may later enter lytic cycle",
              "Compare lytic (immediate destruction) with lysogenic (dormant period) cycles in terms of timing and host cell fate"
            ]
          },
          {
            "key": "viral_diseases",
            "name": "Viral Diseases",
            "short_description": "Understanding common viral infections and why they're difficult to treat.",
            "example_tasks": [
              "Identify common viral diseases: influenza, common cold, COVID-19, measles, chickenpox, HIV/AIDS",
              "Explain why antibiotics don't work against viruses (antibiotics target bacterial structures that viruses lack)",
              "Describe how the immune system fights viral infections: recognizes and destroys infected cells, produces antibodies"
            ]
          },
          {
            "key": "preventing_viral_disease",
            "name": "Preventing Viral Diseases",
            "short_description": "Learning about vaccines, antiviral medications, and prevention strategies.",
            "example_tasks": [
              "Explain how vaccines work: expose immune system to weakened or inactive virus, body produces antibodies, provides immunity without disease",
              "Describe prevention methods: handwashing, avoiding contact with infected people, covering coughs/sneezes, vaccination",
              "Discuss antiviral medications: slow viral replication (not as effective as antibiotics for bacteria), examples like Tamiflu for influenza"
            ]
          }
        ]
      },
      {
        "key": "protists",
        "name": "Protists",
        "short_description": "Exploring the diverse kingdom of mostly unicellular eukaryotes including animal-like, plant-like, and fungus-like protists.",
        "sub_topics": [
          {
            "key": "protist_diversity",
            "name": "Diversity of Protists",
            "short_description": "Understanding that protists are a diverse group unified mainly by being eukaryotic and not fitting other kingdoms.",
            "example_tasks": [
              "Explain why Kingdom Protista is diverse: includes organisms with different nutrition methods, body plans, and life cycles",
              "List three main categories: animal-like (protozoans), plant-like (algae), fungus-like (slime molds, water molds)",
              "Describe why protists are mostly aquatic: live in fresh water, salt water, or moist environments"
            ]
          },
          {
            "key": "animal_like_protists",
            "name": "Animal-Like Protists (Protozoans)",
            "short_description": "Learning about heterotrophic protists that move and consume food like animals.",
            "example_tasks": [
              "Identify four groups by movement: Sarcodina (pseudopods/amoeba), Ciliophora (cilia/paramecium), Zoomastigina (flagella), Sporozoa (non-motile/Plasmodium)",
              "Describe amoeba movement: extends pseudopods (false feet), cytoplasm flows into extension, surrounds and engulfs food (phagocytosis)",
              "Explain diseases caused by protozoans: malaria (Plasmodium, spread by mosquitoes), giardia (contaminated water), sleeping sickness (Trypanosoma)"
            ]
          },
          {
            "key": "plant_like_protists",
            "name": "Plant-Like Protists (Algae)",
            "short_description": "Understanding photosynthetic protists that produce much of Earth's oxygen.",
            "example_tasks": [
              "Describe characteristics of algae: photosynthetic, contain chloroplasts, produce oxygen, form base of aquatic food chains",
              "Compare types of algae: green algae (ancestor of plants), red algae (deep water), brown algae (kelp), diatoms (glass-like cell walls)",
              "Explain algae's importance: produce over 50% of Earth's oxygen, food source for aquatic organisms, can form harmful algal blooms"
            ]
          },
          {
            "key": "fungus_like_protists",
            "name": "Fungus-Like Protists",
            "short_description": "Learning about protists that absorb nutrients from decaying matter like fungi.",
            "example_tasks": [
              "Describe slime molds: unicellular when food is available, form multicellular mass when conditions are poor, produce spores",
              "Explain water molds: decompose dead organisms in water, some are parasitic (caused Irish potato famine)",
              "Compare fungus-like protists with true fungi: protists have different cell wall composition and life cycles"
            ]
          }
        ]
      },
      {
        "key": "fungi",
        "name": "Fungi",
        "short_description": "Understanding the structure, nutrition, reproduction, and ecological roles of fungi including mushrooms, molds, and yeasts.",
        "sub_topics": [
          {
            "key": "fungal_characteristics",
            "name": "Characteristics of Fungi",
            "short_description": "Learning key features that distinguish fungi from plants and animals.",
            "example_tasks": [
              "List defining characteristics of fungi: eukaryotic, heterotrophic (absorb nutrients), cell walls made of chitin, mostly multicellular (except yeasts)",
              "Explain why fungi are not plants: lack chlorophyll, cannot photosynthesize, have chitin cell walls (not cellulose), absorb food (not produce it)",
              "Describe fungal body structure: hyphae (thread-like filaments), mycelium (network of hyphae), fruiting body (reproductive structure like mushroom)"
            ]
          },
          {
            "key": "fungal_nutrition",
            "name": "Fungal Nutrition and Decomposition",
            "short_description": "Understanding how fungi obtain nutrients by secreting enzymes and absorbing digested material.",
            "example_tasks": [
              "Explain extracellular digestion: fungi secrete enzymes onto food source, enzymes break down large molecules, fungi absorb nutrients",
              "Describe fungi's role as decomposers: break down dead organisms and waste, recycle nutrients back to ecosystem",
              "Compare three types: saprobes (decompose dead matter), parasites (obtain nutrients from living hosts), mutualists (beneficial relationships)"
            ]
          },
          {
            "key": "fungal_reproduction",
            "name": "Fungal Reproduction",
            "short_description": "Learning about asexual and sexual reproduction through spores.",
            "example_tasks": [
              "Describe asexual reproduction: producing spores in sporangia, spores dispersed by wind/water, germinate into new mycelium",
              "Explain sexual reproduction: hyphae from two fungi fuse, produce fruiting bodies (mushrooms), release sexual spores",
              "Compare advantages: asexual (rapid, colonize favorable environments) versus sexual (genetic variation, adaptation)"
            ]
          },
          {
            "key": "types_of_fungi",
            "name": "Major Groups of Fungi",
            "short_description": "Identifying common fungi including mushrooms, molds, and yeasts.",
            "example_tasks": [
              "Identify club fungi (Basidiomycota): mushrooms, puffballs, bracket fungi - produce spores in club-shaped structures",
              "Describe sac fungi (Ascomycota): yeasts, morels, truffles - produce spores in sac-like structures",
              "Explain zygote fungi (Zygomycota): bread mold, fast-growing decomposers"
            ]
          },
          {
            "key": "fungal_relationships",
            "name": "Ecological Roles and Relationships",
            "short_description": "Understanding symbiotic relationships involving fungi and their importance in ecosystems.",
            "example_tasks": [
              "Describe lichens: symbiotic partnership between fungus (provides structure, moisture) and algae or cyanobacteria (provides food through photosynthesis)",
              "Explain mycorrhizae: mutualistic association between fungi and plant roots (fungus gets sugars, plant gets water and minerals)",
              "Discuss importance of fungi in forests: decompose fallen trees, form mycorrhizal networks connecting plants, cycle nutrients"
            ]
          },
          {
            "key": "fungi_human_impact",
            "name": "Fungi and Humans",
            "short_description": "Learning about beneficial and harmful effects of fungi on human activities.",
            "example_tasks": [
              "List beneficial uses: food (mushrooms, cheese), fermentation (bread, beer, wine), medicine (antibiotics like penicillin)",
              "Identify harmful fungi: athlete's foot, ringworm (human infections), Dutch elm disease (plant pathogen), crop diseases",
              "Explain how Alexander Fleming discovered penicillin from Penicillium mold, revolutionizing medicine"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "plant_biology",
    "name": "Plant Biology",
    "short_description": "Students explore plant structure, function, photosynthesis, transport systems, reproduction, and plant responses to environmental stimuli. This topic emphasizes how structure relates to function in autotrophic organisms.",
    "sub_topics": [
      {
        "key": "plant_structure",
        "name": "Plant Structure and Tissues",
        "short_description": "Understanding the organization of plant bodies into roots, stems, and leaves, and the specialized tissues within each organ.",
        "sub_topics": [
          {
            "key": "plant_organs",
            "name": "Plant Organs: Roots, Stems, and Leaves",
            "short_description": "Learning the three main organs of vascular plants and their primary functions.",
            "example_tasks": [
              "Describe the three main plant organs and their functions: roots (anchor, absorb water/minerals), stems (support, transport), leaves (photosynthesis, gas exchange)",
              "Draw and label a typical plant showing roots (including root hairs), stem (including nodes and internodes), and leaves (including petiole and blade)",
              "Compare monocots and dicots: one cotyledon vs two, parallel vs branched leaf veins, fibrous vs taproot systems"
            ]
          },
          {
            "key": "root_structure_function",
            "name": "Root Structure and Function",
            "short_description": "Understanding root anatomy including root cap, root hairs, and different root types.",
            "example_tasks": [
              "Draw a root tip showing zones: root cap (protection), zone of cell division (meristem), zone of elongation (cell growth), zone of maturation (root hairs)",
              "Explain the function of root hairs: increase surface area for water and mineral absorption",
              "Compare taproot systems (one main root, carrots, dandelions) with fibrous root systems (many thin roots, grasses)"
            ]
          },
          {
            "key": "stem_structure_function",
            "name": "Stem Structure and Function",
            "short_description": "Learning about stem anatomy, vascular bundles, and specialized stems.",
            "example_tasks": [
              "Identify stem structures: nodes (where leaves attach), internodes (regions between nodes), buds (new growth points)",
              "Describe vascular bundle arrangement: scattered in monocots (corn), arranged in ring in dicots (sunflower)",
              "Give examples of specialized stems: bulbs (onion), tubers (potato), rhizomes (ginger), runners (strawberry)"
            ]
          },
          {
            "key": "leaf_structure_function",
            "name": "Leaf Structure and Function",
            "short_description": "Understanding leaf anatomy including epidermis, mesophyll, veins, and stomata.",
            "example_tasks": [
              "Draw and label a cross-section of a leaf: cuticle, upper epidermis, palisade mesophyll, spongy mesophyll, lower epidermis, stomata, guard cells, veins",
              "Explain how leaf structure relates to photosynthesis: thin and flat (maximize light capture), many chloroplasts in palisade layer, air spaces for gas exchange",
              "Describe the role of stomata and guard cells: control gas exchange (CO₂ in, O₂ out) and water loss through transpiration"
            ]
          },
          {
            "key": "plant_tissues",
            "name": "Plant Tissue Types",
            "short_description": "Learning about dermal, ground, and vascular tissues and their specialized functions.",
            "example_tasks": [
              "Identify three tissue systems: dermal (protection, outer layer), ground (photosynthesis, storage, support), vascular (transport)",
              "Describe vascular tissues: xylem (transports water and minerals upward), phloem (transports sugars throughout plant)",
              "Explain meristem tissue: regions of rapid cell division at tips of roots and shoots, responsible for plant growth"
            ]
          }
        ]
      },
      {
        "key": "plant_transport",
        "name": "Plant Transport Systems",
        "short_description": "Understanding how water, minerals, and sugars move through plants via xylem and phloem.",
        "sub_topics": [
          {
            "key": "xylem_water_transport",
            "name": "Xylem and Water Transport",
            "short_description": "Learning how water and minerals move from roots to leaves through xylem tissue.",
            "example_tasks": [
              "Describe xylem structure: dead cells form hollow tubes, thick cell walls provide support, one-way transport upward",
              "Explain transpiration-cohesion-tension theory: water evaporates from leaves (transpiration), pulls water column up (cohesion), creates tension",
              "Design an experiment to demonstrate water transport: place celery in colored water, observe dye moving through xylem over time"
            ]
          },
          {
            "key": "phloem_sugar_transport",
            "name": "Phloem and Sugar Transport",
            "short_description": "Understanding translocation of sugars from sources to sinks through living phloem cells.",
            "example_tasks": [
              "Describe phloem structure: living cells with pores between them, two-way transport, carries sugars and other nutrients",
              "Explain source-to-sink flow: sugars loaded at source (mature leaves), transported to sinks (roots, fruits, new growth)",
              "Compare xylem and phloem: xylem (water up, dead cells, one-way) vs phloem (sugars all directions, living cells, two-way)"
            ]
          },
          {
            "key": "transpiration",
            "name": "Transpiration",
            "short_description": "Learning about water loss through stomata and factors affecting transpiration rate.",
            "example_tasks": [
              "Explain the transpiration process: water evaporates from mesophyll cells, exits through stomata as water vapor",
              "Identify factors affecting transpiration rate: temperature (increases rate), humidity (decreases rate), wind (increases rate), light (opens stomata)",
              "Describe the transpiration-photosynthesis trade-off: open stomata allow CO₂ in for photosynthesis but also allow water loss"
            ]
          },
          {
            "key": "stomatal_regulation",
            "name": "Stomatal Regulation",
            "short_description": "Understanding how guard cells control stomata opening and closing.",
            "example_tasks": [
              "Explain how guard cells control stomata: gain water (swell, stomata open), lose water (shrink, stomata close)",
              "Describe when stomata are typically open (daytime, for photosynthesis) and closed (night, to conserve water)",
              "Discuss adaptations in desert plants: fewer stomata, stomata in pits, CAM photosynthesis (open stomata at night)"
            ]
          }
        ]
      },
      {
        "key": "photosynthesis_in_plants",
        "name": "Photosynthesis in Plants",
        "short_description": "Reviewing photosynthesis with emphasis on plant structures and adaptations for capturing light energy.",
        "sub_topics": [
          {
            "key": "leaf_adaptations_photosynthesis",
            "name": "Leaf Adaptations for Photosynthesis",
            "short_description": "Understanding how leaf structure maximizes light capture and gas exchange.",
            "example_tasks": [
              "Explain adaptations: broad, flat shape (maximum light exposure), thin (light penetrates to all cells), transparent cuticle and epidermis (light reaches mesophyll)",
              "Describe why palisade mesophyll cells are packed with chloroplasts near the upper leaf surface",
              "Discuss spongy mesophyll structure: air spaces allow CO₂ to reach all cells for photosynthesis"
            ]
          },
          {
            "key": "factors_affecting_photosynthesis",
            "name": "Factors Affecting Photosynthesis Rate",
            "short_description": "Learning how light intensity, CO₂ concentration, temperature, and water affect photosynthesis.",
            "example_tasks": [
              "Graph how photosynthesis rate changes with increasing light intensity: increases then plateaus at light saturation point",
              "Explain limiting factors: at any time, the factor in shortest supply limits photosynthesis rate",
              "Design an experiment testing how one variable (light, CO₂, temperature) affects photosynthesis rate in aquatic plants, measuring oxygen bubble production"
            ]
          },
          {
            "key": "c3_c4_cam_plants",
            "name": "C3, C4, and CAM Photosynthesis",
            "short_description": "Understanding different photosynthetic pathways as adaptations to various environments.",
            "example_tasks": [
              "Describe C3 plants: most common, Calvin cycle in mesophyll, less efficient in hot/dry conditions (wheat, soybeans)",
              "Explain C4 plants: adapted to hot climates, fix CO₂ in mesophyll then release to bundle sheath for Calvin cycle, more efficient (corn, sugarcane)",
              "Describe CAM plants: adapted to deserts, open stomata at night to store CO₂, close stomata during day, use stored CO₂ for photosynthesis (cacti, pineapples)"
            ]
          }
        ]
      },
      {
        "key": "plant_reproduction",
        "name": "Plant Reproduction",
        "short_description": "Learning about alternation of generations, flower structure, pollination, fertilization, and seed dispersal in flowering plants.",
        "sub_topics": [
          {
            "key": "alternation_of_generations",
            "name": "Alternation of Generations",
            "short_description": "Understanding plant life cycles alternating between diploid sporophyte and haploid gametophyte generations.",
            "example_tasks": [
              "Define sporophyte (diploid, produces spores through meiosis) and gametophyte (haploid, produces gametes through mitosis)",
              "Compare life cycles: in mosses, gametophyte is dominant; in ferns and seed plants, sporophyte is dominant",
              "Trace a flowering plant life cycle: mature plant (sporophyte) → meiosis → spores → gametophytes (pollen, embryo sac) → gametes → fertilization → embryo in seed → mature plant"
            ]
          },
          {
            "key": "flower_structure",
            "name": "Flower Structure and Function",
            "short_description": "Learning the parts of a flower and their roles in sexual reproduction.",
            "example_tasks": [
              "Draw and label a complete flower: sepals (protect bud), petals (attract pollinators), stamens (male: anther + filament), pistil (female: stigma + style + ovary)",
              "Identify male reproductive structures: stamen produces pollen grains (male gametophytes) containing sperm",
              "Identify female reproductive structures: ovary contains ovules (female gametophytes) with egg cells"
            ]
          },
          {
            "key": "pollination",
            "name": "Pollination",
            "short_description": "Understanding the transfer of pollen from anther to stigma and pollination mechanisms.",
            "example_tasks": [
              "Compare self-pollination (pollen to stigma of same flower) with cross-pollination (pollen to stigma of different flower)",
              "Describe pollination mechanisms: wind (grasses, many trees), animals (insects, birds, bats, mammals)",
              "Explain flower adaptations for different pollinators: bright colors and nectar for insects/birds, strong scent at night for moths/bats, light pollen for wind"
            ]
          },
          {
            "key": "fertilization_seed_development",
            "name": "Fertilization and Seed Development",
            "short_description": "Learning about double fertilization and development of embryo, endosperm, and seed coat.",
            "example_tasks": [
              "Explain double fertilization unique to flowering plants: one sperm fertilizes egg (→ embryo), second sperm fertilizes polar nuclei (→ endosperm)",
              "Describe seed structure: embryo (young plant with radicle and cotyledons), endosperm (food supply), seed coat (protection)",
              "Trace development after fertilization: fertilized ovule → seed, ovary → fruit"
            ]
          },
          {
            "key": "fruit_seed_dispersal",
            "name": "Fruit Development and Seed Dispersal",
            "short_description": "Understanding how fruits aid seed dispersal through various mechanisms.",
            "example_tasks": [
              "Explain fruit function: protect developing seeds, aid in seed dispersal to reduce competition with parent plant",
              "Identify dispersal mechanisms: wind (dandelion, maple), animals eating fruit (berries, apples), water (coconut), mechanical (exploding seed pods), animal fur (burs)",
              "Match fruit adaptations to dispersal method: wings/parachutes (wind), fleshy/nutritious (animal ingestion), hooks/barbs (animal fur)"
            ]
          },
          {
            "key": "seed_germination",
            "name": "Seed Germination",
            "short_description": "Learning the conditions required for seeds to sprout and grow into seedlings.",
            "example_tasks": [
              "List requirements for germination: water (activate enzymes), oxygen (cellular respiration), appropriate temperature",
              "Describe germination process: seed absorbs water, embryo activates, radicle (root) emerges first, shoot emerges, cotyledons may provide food or photosynthesize",
              "Explain seed dormancy: period of inactivity that prevents germination until conditions are favorable (protects against early spring frost, summer drought)"
            ]
          }
        ]
      },
      {
        "key": "plant_responses",
        "name": "Plant Responses and Hormones",
        "short_description": "Understanding how plants respond to environmental stimuli through tropisms and hormone regulation.",
        "sub_topics": [
          {
            "key": "tropisms",
            "name": "Tropisms",
            "short_description": "Learning about directional growth responses to environmental stimuli.",
            "example_tasks": [
              "Define tropism: directional growth response to environmental stimulus (positive = toward, negative = away)",
              "Describe phototropism: growth response to light (shoots grow toward light, roots away from light)",
              "Explain gravitropism: growth response to gravity (roots grow downward, shoots grow upward), and thigmotropism: response to touch (vines wrap around support)"
            ]
          },
          {
            "key": "plant_hormones",
            "name": "Plant Hormones",
            "short_description": "Understanding chemical messengers that coordinate plant growth and development.",
            "example_tasks": [
              "Describe auxins: promote cell elongation, cause phototropism (accumulate on shady side, causing bending toward light), inhibit lateral bud growth (apical dominance)",
              "Explain gibberellins: promote stem elongation, break seed dormancy, stimulate fruit development",
              "Identify other hormones: cytokinins (promote cell division), ethylene (promotes fruit ripening), abscisic acid (closes stomata during drought)"
            ]
          },
          {
            "key": "photoperiodism",
            "name": "Photoperiodism",
            "short_description": "Learning how plants respond to day length to time seasonal activities like flowering.",
            "example_tasks": [
              "Define photoperiodism: plant response to relative lengths of day and night",
              "Compare plant types: short-day plants (flower when nights are long - fall, like poinsettias), long-day plants (flower when nights are short - summer, like spinach), day-neutral (not affected by day length)",
              "Explain how florists manipulate day length to make poinsettias bloom at Christmas"
            ]
          },
          {
            "key": "plant_defense_responses",
            "name": "Plant Defense Responses",
            "short_description": "Understanding how plants protect themselves from herbivores and pathogens.",
            "example_tasks": [
              "Describe physical defenses: thorns, spines, tough leaves, waxy coatings, bark",
              "Explain chemical defenses: toxins (poison ivy), bad-tasting compounds (tannins), chemical signals to attract predators of herbivores",
              "Discuss rapid responses: Venus flytrap closing, mimosa leaves folding when touched, chemical signals warning neighboring plants of attack"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "animal_biology_diversity",
    "name": "Animal Biology and Diversity",
    "short_description": "Students explore animal classification, body plans, and the diversity of invertebrate and vertebrate phyla. This topic emphasizes evolutionary relationships, adaptations, and the connection between structure and function across animal groups.",
    "sub_topics": [
      {
        "key": "characteristics_of_animals",
        "name": "Characteristics of Animals",
        "short_description": "Understanding features that define the animal kingdom and distinguish animals from other organisms.",
        "sub_topics": [
          {
            "key": "defining_animals",
            "name": "Defining Characteristics",
            "short_description": "Learning the traits all animals share: multicellular, heterotrophic, eukaryotic, motile.",
            "example_tasks": [
              "List characteristics of animals: multicellular, eukaryotic cells without cell walls, heterotrophic (consume food), most can move, reproduce sexually",
              "Explain why sponges are animals even though they don't move as adults (larvae are motile, all other animal characteristics present)",
              "Compare animals with plants and fungi: animals (motile, ingest food), plants (sessile, make food), fungi (sessile, absorb food)"
            ]
          },
          {
            "key": "animal_body_plans",
            "name": "Animal Body Plans",
            "short_description": "Understanding symmetry, body cavities, and tissue layers that organize animal bodies.",
            "example_tasks": [
              "Compare symmetry types: asymmetry (sponges), radial (cnidarians, divide through center multiple ways), bilateral (most animals, left-right mirror)",
              "Describe germ layers: ectoderm (outer skin, nervous system), mesoderm (muscles, organs), endoderm (digestive tract lining)",
              "Explain body cavities: acoelomate (no cavity - flatworms), pseudocoelomate (partially lined - roundworms), coelomate (fully lined - most complex animals)"
            ]
          },
          {
            "key": "animal_development",
            "name": "Animal Development Patterns",
            "short_description": "Learning about protostomes versus deuterostomes based on embryonic development.",
            "example_tasks": [
              "Compare protostomes (mouth forms first, includes mollusks, annelids, arthropods) with deuterostomes (anus forms first, includes echinoderms, chordates)",
              "Explain why developmental patterns help classify animals: reveal evolutionary relationships not obvious from adult appearance",
              "Describe the blastopore: opening in early embryo that becomes mouth in protostomes, anus in deuterostomes"
            ]
          }
        ]
      },
      {
        "key": "invertebrate_diversity",
        "name": "Invertebrate Diversity",
        "short_description": "Exploring animals without backbones, which comprise over 95% of animal species.",
        "sub_topics": [
          {
            "key": "sponges_cnidarians",
            "name": "Sponges and Cnidarians",
            "short_description": "Learning about the simplest animal phyla: porifera (sponges) and cnidaria (jellyfish, corals).",
            "example_tasks": [
              "Describe sponge characteristics: no true tissues, filter feeders, pores throughout body, spicules or spongin for support",
              "Explain cnidarian features: radial symmetry, two tissue layers, gastrovascular cavity, tentacles with stinging cells (cnidocytes)",
              "Identify cnidarians: jellyfish (medusa form), sea anemones and corals (polyp form), hydra, Portuguese man-of-war"
            ]
          },
          {
            "key": "worms",
            "name": "Worm Phyla",
            "short_description": "Understanding flatworms (Platyhelminthes), roundworms (Nematoda), and segmented worms (Annelida).",
            "example_tasks": [
              "Compare flatworms: flat body, no body cavity, some free-living (planaria), many parasitic (tapeworms, flukes)",
              "Describe roundworms: cylindrical, pseudocoelom, complete digestive system, many parasites (hookworms, pinworms, Ascaris)",
              "Explain annelid segmentation: body divided into repeating segments, closed circulatory system, examples include earthworms, leeches, marine worms"
            ]
          },
          {
            "key": "mollusks",
            "name": "Mollusks",
            "short_description": "Learning about soft-bodied animals, many with shells: snails, clams, octopuses.",
            "example_tasks": [
              "List molluscan characteristics: soft body, muscular foot, mantle (may secrete shell), radula (scraping mouthpart in some)",
              "Compare classes: gastropods (snails, slugs - one shell or none), bivalves (clams, oysters - two shells), cephalopods (squid, octopus - reduced/internal shell, advanced)",
              "Explain adaptations: gastropod torsion, bivalve filter feeding, cephalopod jet propulsion and complex nervous system"
            ]
          },
          {
            "key": "arthropods",
            "name": "Arthropods",
            "short_description": "Understanding the most diverse animal phylum with exoskeletons and jointed appendages.",
            "example_tasks": [
              "List arthropod characteristics: segmented body, exoskeleton (chitin), jointed appendages, open circulatory system, molting",
              "Identify major groups: crustaceans (crabs, lobsters, shrimp), arachnids (spiders, scorpions, ticks), insects (most diverse), myriapods (centipedes, millipedes)",
              "Explain insect success: small size, flight, short generation time, diverse adaptations, complete metamorphosis allows different niches for larvae and adults"
            ]
          },
          {
            "key": "echinoderms",
            "name": "Echinoderms",
            "short_description": "Learning about spiny-skinned marine animals: sea stars, sea urchins, sea cucumbers.",
            "example_tasks": [
              "Describe echinoderm characteristics: radial symmetry (adults), endoskeleton, water vascular system with tube feet, spiny skin",
              "Explain water vascular system: network of water-filled canals, operates tube feet for movement, feeding, and gas exchange",
              "Identify examples: sea stars (asteroidea), brittle stars (ophiuroidea), sea urchins (echinoidea), sea cucumbers (holothuroidea), sea lilies (crinoidea)"
            ]
          }
        ]
      },
      {
        "key": "vertebrate_diversity",
        "name": "Vertebrate Diversity",
        "short_description": "Exploring animals with backbones, including fish, amphibians, reptiles, birds, and mammals.",
        "sub_topics": [
          {
            "key": "chordate_characteristics",
            "name": "Chordate Characteristics",
            "short_description": "Learning the four defining features of phylum Chordata present at some life stage.",
            "example_tasks": [
              "List four chordate characteristics: notochord (flexible rod), dorsal nerve cord, pharyngeal pouches (gill slits), post-anal tail",
              "Explain how humans show chordate features: as embryos, have notochord (becomes discs between vertebrae), nerve cord (becomes spinal cord), gill pouches, tail",
              "Compare vertebrates (have backbone) with other chordates like tunicates and lancelets (notochord persists)"
            ]
          },
          {
            "key": "fish",
            "name": "Fishes",
            "short_description": "Understanding the three classes of fish: jawless, cartilaginous, and bony fish.",
            "example_tasks": [
              "Compare fish classes: jawless (lampreys, hagfish - no jaws/paired fins), cartilaginous (sharks, rays - cartilage skeleton), bony (most fish - bone skeleton)",
              "Describe fish adaptations: gills (extract oxygen from water), scales (protection), fins (movement/stability), swim bladder in bony fish (buoyancy control)",
              "Explain countercurrent exchange in gills: blood flows opposite to water flow, maximizes oxygen absorption"
            ]
          },
          {
            "key": "amphibians",
            "name": "Amphibians",
            "short_description": "Learning about animals that live partly in water and partly on land: frogs, salamanders, caecilians.",
            "example_tasks": [
              "List amphibian characteristics: moist skin (gas exchange), metamorphosis (aquatic larvae → terrestrial adults), ectothermic, typically lay eggs in water",
              "Describe frog metamorphosis: eggs → tadpoles (gills, tail, herbivorous) → adults (lungs/skin breathing, legs, carnivorous)",
              "Explain amphibian challenges: thin moist skin (must stay near water, vulnerable to pollutants), need water for reproduction"
            ]
          },
          {
            "key": "reptiles",
            "name": "Reptiles",
            "short_description": "Understanding the first fully terrestrial vertebrates: snakes, lizards, turtles, crocodilians.",
            "example_tasks": [
              "List reptile adaptations for land: dry scaly skin (prevents water loss), amniotic egg (shell, internal membranes), lungs throughout life, ectothermic",
              "Describe amniotic egg: shell (protection), amnion (fluid cushion), allantois (waste storage), yolk sac (food), chorion (gas exchange)",
              "Compare reptile orders: turtles (shell), lizards/snakes (Squamata), crocodilians (alligators, crocodiles), tuataras (primitive)"
            ]
          },
          {
            "key": "birds",
            "name": "Birds",
            "short_description": "Learning about endothermic vertebrates adapted for flight with feathers and lightweight skeletons.",
            "example_tasks": [
              "List bird adaptations for flight: feathers (lift, insulation), hollow bones (lightweight), high metabolism (energy), efficient respiratory system (air sacs), keen vision",
              "Describe feather types: contour (flight and body shape), down (insulation), explain how feathers are modified scales from reptilian ancestors",
              "Explain bird respiratory system: air flows one direction through lungs (more efficient), air sacs store and move air"
            ]
          },
          {
            "key": "mammals",
            "name": "Mammals",
            "short_description": "Understanding endothermic vertebrates with hair and mammary glands: monotremes, marsupials, placentals.",
            "example_tasks": [
              "List mammalian characteristics: hair/fur (insulation), mammary glands (milk for young), endothermic, four-chambered heart, specialized teeth",
              "Compare three groups: monotremes (lay eggs - platypus, echidna), marsupials (pouches, short gestation - kangaroo, opossum), placentals (placenta, longer gestation - most mammals)",
              "Explain placenta function: allows nutrients, oxygen, and wastes to exchange between mother and developing embryo without blood mixing"
            ]
          }
        ]
      },
      {
        "key": "animal_adaptations",
        "name": "Animal Adaptations",
        "short_description": "Understanding how animals are adapted to their environments through structure, physiology, and behavior.",
        "sub_topics": [
          {
            "key": "structural_adaptations",
            "name": "Structural Adaptations",
            "short_description": "Learning about physical features that help animals survive in specific environments.",
            "example_tasks": [
              "Identify structural adaptations: bird beaks (shapes match food sources), mammal teeth (carnivores, herbivores, omnivores), camouflage coloration",
              "Explain adaptations to extreme environments: arctic mammals (thick fur, small extremities), desert animals (large ears for heat loss, nocturnal)",
              "Compare aquatic adaptations: streamlined bodies, fins/flippers, gills or ability to hold breath, countershading"
            ]
          },
          {
            "key": "physiological_adaptations",
            "name": "Physiological Adaptations",
            "short_description": "Understanding internal processes and body functions that help animals survive.",
            "example_tasks": [
              "Explain hibernation: metabolic slowdown in winter to conserve energy when food is scarce",
              "Describe estivation: dormancy during hot, dry periods (opposite of hibernation)",
              "Compare endotherms (maintain constant body temperature internally) with ectotherms (body temperature varies with environment)"
            ]
          },
          {
            "key": "behavioral_adaptations",
            "name": "Behavioral Adaptations",
            "short_description": "Learning about instinctive and learned behaviors that increase survival and reproduction.",
            "example_tasks": [
              "Identify behavioral adaptations: migration (seasonal movement to follow resources), territorial behavior (secure resources), courtship displays (attract mates)",
              "Explain predator-prey behaviors: predators (stalking, pack hunting), prey (herding, alarm calls, freezing)",
              "Describe parental care variations: r-selected species (many offspring, little care) vs K-selected species (few offspring, extensive care)"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "human_body_systems_one",
    "name": "Human Body Systems I",
    "short_description": "Students explore the skeletal, muscular, integumentary, and nervous systems, learning about their structures, functions, and how they work together to support, protect, move, and coordinate the human body.",
    "sub_topics": [
      {
        "key": "skeletal_system",
        "name": "Skeletal System",
        "short_description": "Understanding bones, cartilage, ligaments, and joints that provide structure, protection, and movement.",
        "sub_topics": [
          {
            "key": "functions_of_skeleton",
            "name": "Functions of the Skeletal System",
            "short_description": "Learning the five main functions: support, protection, movement, mineral storage, and blood cell production.",
            "example_tasks": [
              "List and explain five functions of the skeleton: support (framework), protection (skull protects brain), movement (with muscles), mineral storage (calcium, phosphorus), blood cell production (red marrow)",
              "Identify which bones protect specific organs: skull (brain), ribs (heart and lungs), vertebrae (spinal cord), pelvis (reproductive organs)",
              "Explain how bones work as levers with muscles to produce movement at joints"
            ]
          },
          {
            "key": "bone_structure",
            "name": "Bone Structure and Composition",
            "short_description": "Understanding compact bone, spongy bone, marrow, and the composition of bone tissue.",
            "example_tasks": [
              "Draw and label a long bone (femur) showing: diaphysis (shaft), epiphysis (ends), compact bone (dense outer layer), spongy bone (inner lattice), marrow cavity, periosteum (outer membrane)",
              "Compare compact bone (dense, strong, forms outer layer) with spongy bone (lighter, contains spaces, found at ends and inside flat bones)",
              "Explain bone composition: living cells (osteocytes), protein fibers (collagen for flexibility), minerals (calcium phosphate for hardness)"
            ]
          },
          {
            "key": "axial_appendicular_skeleton",
            "name": "Axial and Appendicular Skeleton",
            "short_description": "Learning the two divisions of the skeleton and major bones in each.",
            "example_tasks": [
              "Identify axial skeleton bones (80 bones): skull, vertebral column (spine), ribs, sternum - forms axis of body",
              "Identify appendicular skeleton bones (126 bones): shoulder girdle, arms, hands, pelvic girdle, legs, feet - bones of limbs and attachments",
              "Label major bones on a skeleton diagram: cranium, mandible, clavicle, scapula, humerus, radius, ulna, femur, tibia, fibula, vertebrae, ribs"
            ]
          },
          {
            "key": "joints",
            "name": "Joints and Movement",
            "short_description": "Understanding different joint types and the movements they allow.",
            "example_tasks": [
              "Compare joint types: immovable (skull sutures), slightly movable (vertebrae), freely movable (synovial joints - knee, elbow, shoulder)",
              "Identify synovial joint types: hinge (elbow, knee - back and forth), ball-and-socket (shoulder, hip - all directions), pivot (neck - rotation), gliding (wrist - sliding)",
              "Explain joint structure: cartilage (cushions bones), synovial fluid (lubricates), ligaments (connect bone to bone)"
            ]
          },
          {
            "key": "bone_growth_maintenance",
            "name": "Bone Growth and Maintenance",
            "short_description": "Learning how bones grow, remodel, and maintain health throughout life.",
            "example_tasks": [
              "Describe bone growth: cartilage model in embryo, ossification (bone replaces cartilage), growth plates at ends allow lengthening during childhood/adolescence",
              "Explain bone remodeling: osteoblasts build new bone, osteoclasts break down old bone, continuous process throughout life",
              "Discuss bone health: calcium and vitamin D (strengthen bones), exercise (stimulates bone growth), conditions like osteoporosis (bone loss with age)"
            ]
          }
        ]
      },
      {
        "key": "muscular_system",
        "name": "Muscular System",
        "short_description": "Understanding the three types of muscle tissue and how skeletal muscles produce movement through contraction.",
        "sub_topics": [
          {
            "key": "types_of_muscle_tissue",
            "name": "Types of Muscle Tissue",
            "short_description": "Learning the differences between skeletal, smooth, and cardiac muscle.",
            "example_tasks": [
              "Compare three muscle types: skeletal (voluntary, striated, attached to bones), smooth (involuntary, non-striated, organs), cardiac (involuntary, striated, heart only)",
              "Identify where each muscle type is found: skeletal (arms, legs, trunk), smooth (stomach, intestines, blood vessels, bladder), cardiac (heart)",
              "Examine microscope images and identify muscle types based on appearance: skeletal and cardiac have striations (bands), smooth does not"
            ]
          },
          {
            "key": "skeletal_muscle_structure",
            "name": "Skeletal Muscle Structure and Function",
            "short_description": "Understanding muscle fiber organization and how muscles attach to bones.",
            "example_tasks": [
              "Describe muscle organization: muscle → bundles of muscle fibers → myofibrils → actin and myosin filaments",
              "Explain muscle attachments: tendons (connect muscle to bone), origin (fixed end), insertion (moving end)",
              "Identify major skeletal muscles: biceps/triceps (arm), quadriceps/hamstrings (leg), pectorals (chest), abdominals, deltoids (shoulder)"
            ]
          },
          {
            "key": "muscle_contraction",
            "name": "Muscle Contraction Mechanism",
            "short_description": "Learning how muscles contract through the sliding filament theory.",
            "example_tasks": [
              "Describe the sliding filament model: myosin (thick filaments) pull on actin (thin filaments), filaments slide past each other, muscle shortens",
              "Explain the role of ATP in muscle contraction: provides energy for myosin heads to pull actin filaments",
              "Describe the signal pathway: nerve impulse → neuromuscular junction → calcium released → actin and myosin interact → contraction"
            ]
          },
          {
            "key": "muscle_pairs_movement",
            "name": "Antagonistic Muscle Pairs",
            "short_description": "Understanding how opposing muscles work in pairs to move bones.",
            "example_tasks": [
              "Explain antagonistic pairs: one muscle contracts (agonist) while the other relaxes (antagonist) to move bones",
              "Describe the biceps-triceps pair: biceps contracts to bend arm (flexion), triceps contracts to straighten arm (extension)",
              "Identify other antagonistic pairs: quadriceps-hamstrings (leg extension/flexion), tibialis anterior-gastrocnemius (foot flexion/extension)"
            ]
          },
          {
            "key": "muscle_health_exercise",
            "name": "Muscle Health and Exercise",
            "short_description": "Learning how exercise affects muscles and maintaining muscular system health.",
            "example_tasks": [
              "Explain muscle hypertrophy: muscles increase in size with resistance exercise as fibers thicken",
              "Describe muscle atrophy: muscles decrease in size with lack of use (injury, bed rest, aging)",
              "Discuss aerobic vs anaerobic exercise: aerobic (endurance, uses oxygen), anaerobic (short bursts, produces lactic acid), importance of both for fitness"
            ]
          }
        ]
      },
      {
        "key": "integumentary_system",
        "name": "Integumentary System",
        "short_description": "Understanding the structure and functions of skin, hair, and nails as the body's protective covering.",
        "sub_topics": [
          {
            "key": "skin_structure",
            "name": "Skin Structure and Layers",
            "short_description": "Learning about the epidermis, dermis, and hypodermis layers of skin.",
            "example_tasks": [
              "Draw and label a cross-section of skin: epidermis (outer, protective), dermis (middle, contains blood vessels, nerves, glands), hypodermis (inner, fat layer)",
              "Describe the epidermis: outermost layer, dead cells at surface (constantly shed), melanocytes produce melanin (skin color, UV protection)",
              "Explain dermis contents: blood vessels (nourishment), nerve endings (sensation), sweat glands (cooling), oil glands (lubrication), hair follicles"
            ]
          },
          {
            "key": "functions_of_skin",
            "name": "Functions of the Integumentary System",
            "short_description": "Understanding protection, temperature regulation, sensation, and vitamin D production.",
            "example_tasks": [
              "List five functions of skin: protection (barrier against infection, injury, UV), temperature regulation (sweating, blood flow), sensation (touch, pain, temperature), excretion (sweat), vitamin D synthesis",
              "Explain how skin protects: physical barrier, melanin blocks UV, acid mantle prevents bacterial growth, immune cells fight pathogens",
              "Describe thermoregulation: sweating and evaporation cool body, blood vessels dilate (heat loss) or constrict (heat conservation), goosebumps (vestigial hair raising)"
            ]
          },
          {
            "key": "hair_and_nails",
            "name": "Hair and Nails",
            "short_description": "Learning about accessory structures made of keratin protein.",
            "example_tasks": [
              "Describe hair structure: grows from follicle in dermis, shaft made of dead keratin cells, melanin provides color, arrector pili muscle causes goosebumps",
              "Explain hair functions: protection (scalp from sun), warmth (insulation), sensation (nerve endings at base)",
              "Describe nail structure and function: made of keratin, protect fingertips and toes, aid in grasping objects, grow from nail bed"
            ]
          },
          {
            "key": "skin_health_damage",
            "name": "Skin Health and Damage",
            "short_description": "Understanding skin conditions, healing, and the effects of sun exposure.",
            "example_tasks": [
              "Explain wound healing stages: blood clots (stops bleeding), inflammation (fights infection), tissue growth (new cells fill gap), remodeling (scar formation)",
              "Describe effects of UV radiation: sunburn (cell damage), premature aging (wrinkles), increased skin cancer risk (melanoma and non-melanoma types)",
              "Discuss skin protection: sunscreen (blocks UV), protective clothing, avoiding peak sun hours, importance of checking moles for changes"
            ]
          }
        ]
      },
      {
        "key": "nervous_system",
        "name": "Nervous System",
        "short_description": "Understanding how the brain, spinal cord, and nerves detect stimuli, process information, and coordinate responses throughout the body.",
        "sub_topics": [
          {
            "key": "organization_nervous_system",
            "name": "Organization of the Nervous System",
            "short_description": "Learning the divisions: central nervous system (CNS) and peripheral nervous system (PNS).",
            "example_tasks": [
              "Identify CNS components: brain (control center, processes information) and spinal cord (relay between brain and body)",
              "Describe PNS: all nerves outside CNS, carries messages to and from CNS, divided into somatic (voluntary) and autonomic (involuntary)",
              "Explain autonomic nervous system divisions: sympathetic (fight or flight - increases heart rate, breathing) and parasympathetic (rest and digest - conserves energy)"
            ]
          },
          {
            "key": "neurons_nerve_impulses",
            "name": "Neurons and Nerve Impulses",
            "short_description": "Understanding neuron structure and how electrical signals transmit information.",
            "example_tasks": [
              "Draw and label a neuron: cell body (contains nucleus), dendrites (receive signals), axon (transmits signals), myelin sheath (insulation), axon terminals (release neurotransmitters)",
              "Describe three neuron types: sensory (detect stimuli, carry to CNS), motor (carry commands from CNS to muscles/glands), interneurons (connect neurons in CNS)",
              "Explain nerve impulse: electrical signal travels down axon, sodium and potassium ions move across membrane, all-or-nothing response, speeds up with myelin"
            ]
          },
          {
            "key": "synapses_neurotransmitters",
            "name": "Synapses and Neurotransmitters",
            "short_description": "Learning how signals cross gaps between neurons using chemical messengers.",
            "example_tasks": [
              "Describe synapse structure: gap between neurons, presynaptic neuron (sends signal), synaptic cleft (gap), postsynaptic neuron (receives signal)",
              "Explain synaptic transmission: nerve impulse reaches axon terminal → vesicles release neurotransmitters into cleft → neurotransmitters bind to receptors on next neuron → signal continues or stops",
              "Identify neurotransmitter examples and effects: acetylcholine (muscle contraction), dopamine (reward, movement), serotonin (mood), endorphins (pain relief)"
            ]
          },
          {
            "key": "brain_structure_function",
            "name": "Brain Structure and Function",
            "short_description": "Understanding major brain regions and their roles in controlling body functions.",
            "example_tasks": [
              "Identify brain regions: cerebrum (largest, conscious thought, memory, voluntary movement), cerebellum (balance, coordination), brainstem (automatic functions - breathing, heart rate)",
              "Describe cerebrum lobes: frontal (reasoning, planning, speech), parietal (sensory processing), temporal (hearing, memory), occipital (vision)",
              "Explain brain protection: skull (hard bone), meninges (three membranes), cerebrospinal fluid (cushions brain and spinal cord)"
            ]
          },
          {
            "key": "spinal_cord_reflexes",
            "name": "Spinal Cord and Reflexes",
            "short_description": "Learning about the spinal cord's role in relaying signals and controlling automatic responses.",
            "example_tasks": [
              "Describe spinal cord structure: protected by vertebrae, connects brain to PNS, gray matter (neuron cell bodies) and white matter (axons)",
              "Explain reflex arc: sensory receptor → sensory neuron → interneuron in spinal cord → motor neuron → effector (muscle) - bypasses brain for speed",
              "Give reflex examples: knee-jerk (stretch reflex), withdrawal from hot object (protective reflex), explain survival advantage of rapid responses"
            ]
          },
          {
            "key": "senses",
            "name": "Senses and Sensory Processing",
            "short_description": "Understanding how sensory organs detect stimuli and send information to the brain.",
            "example_tasks": [
              "List five senses and their receptors: sight (photoreceptors in retina), hearing (hair cells in cochlea), smell (chemoreceptors in nose), taste (taste buds on tongue), touch (various receptors in skin)",
              "Explain sensory pathway: stimulus → receptor detects change → sensory neuron → brain processes → perception",
              "Describe how brain integrates sensory information: taste and smell work together (flavor), vision and balance coordinate movement"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "human_body_systems_two",
    "name": "Human Body Systems II",
    "short_description": "Students explore the circulatory, respiratory, digestive, and excretory systems, learning how these systems transport materials, exchange gases, process nutrients, and remove wastes to maintain homeostasis.",
    "sub_topics": [
      {
        "key": "circulatory_system",
        "name": "Circulatory System",
        "short_description": "Understanding the heart, blood vessels, and blood that transport oxygen, nutrients, and wastes throughout the body.",
        "sub_topics": [
          {
            "key": "functions_circulatory_system",
            "name": "Functions of the Circulatory System",
            "short_description": "Learning the main roles: transport, protection, and temperature regulation.",
            "example_tasks": [
              "List three functions: transport (oxygen, nutrients, wastes, hormones), protection (immune cells, clotting), temperature regulation (distributes heat)",
              "Explain how the circulatory system maintains homeostasis by connecting all body systems",
              "Describe what happens without circulation: cells can't get oxygen/nutrients, wastes accumulate, death occurs within minutes"
            ]
          },
          {
            "key": "heart_structure_function",
            "name": "Heart Structure and Function",
            "short_description": "Understanding the four-chambered heart and how it pumps blood through two circuits.",
            "example_tasks": [
              "Draw and label the heart: four chambers (right and left atria, right and left ventricles), four valves (prevent backflow), septum (separates sides)",
              "Trace blood flow through the heart: body → right atrium → right ventricle → lungs → left atrium → left ventricle → body",
              "Explain double circulation: pulmonary circuit (right side pumps to lungs), systemic circuit (left side pumps to body), why left ventricle has thicker walls"
            ]
          },
          {
            "key": "blood_vessels",
            "name": "Blood Vessels",
            "short_description": "Learning about arteries, veins, and capillaries and their specialized structures.",
            "example_tasks": [
              "Compare vessel types: arteries (carry blood away from heart, thick elastic walls, high pressure), veins (carry blood to heart, thinner walls, valves, low pressure), capillaries (microscopic, one cell thick, exchange site)",
              "Explain why arteries need thick elastic walls: withstand high pressure from heart contractions",
              "Describe capillary function: thin walls allow exchange of oxygen, nutrients, and wastes between blood and tissues"
            ]
          },
          {
            "key": "blood_components",
            "name": "Blood Components and Functions",
            "short_description": "Understanding plasma, red blood cells, white blood cells, and platelets.",
            "example_tasks": [
              "Identify blood components: plasma (liquid, 55%, carries cells and dissolved substances), red blood cells (carry oxygen with hemoglobin), white blood cells (fight infection), platelets (clotting)",
              "Explain red blood cell adaptations: no nucleus (more room for hemoglobin), biconcave shape (large surface area), contain hemoglobin (binds oxygen)",
              "Describe clotting process: platelets stick to damaged vessel → cascade of reactions → fibrin forms mesh → traps blood cells → forms clot"
            ]
          },
          {
            "key": "blood_types",
            "name": "Blood Types and Transfusions",
            "short_description": "Learning about ABO and Rh blood groups and compatibility for transfusions.",
            "example_tasks": [
              "Explain ABO blood types: A (A antigens), B (B antigens), AB (both antigens, universal recipient), O (no antigens, universal donor)",
              "Describe antibodies: type A blood has anti-B antibodies, type B has anti-A, AB has neither, O has both",
              "Determine safe transfusions: type A can receive A or O, type B can receive B or O, AB can receive any, O can only receive O; explain why mismatches cause clumping"
            ]
          },
          {
            "key": "cardiovascular_health",
            "name": "Cardiovascular Health",
            "short_description": "Understanding factors affecting heart and blood vessel health.",
            "example_tasks": [
              "Explain cardiovascular diseases: atherosclerosis (plaque buildup), heart attack (blocked coronary artery), stroke (blocked brain artery)",
              "Identify risk factors: high blood pressure, high cholesterol, smoking, obesity, lack of exercise, family history",
              "Describe healthy habits: regular aerobic exercise (strengthens heart), healthy diet (low saturated fat), maintain healthy weight, don't smoke"
            ]
          }
        ]
      },
      {
        "key": "respiratory_system",
        "name": "Respiratory System",
        "short_description": "Understanding how the lungs and airways exchange oxygen and carbon dioxide between air and blood.",
        "sub_topics": [
          {
            "key": "respiratory_structures",
            "name": "Respiratory System Structures",
            "short_description": "Learning the path of air from nose to alveoli.",
            "example_tasks": [
              "Trace the path of air: nose/mouth → pharynx (throat) → larynx (voice box) → trachea (windpipe) → bronchi → bronchioles → alveoli (air sacs)",
              "Draw and label the respiratory system showing all major structures",
              "Explain structure functions: nasal cavity (warms, moistens, filters air), cilia and mucus (trap particles), epiglottis (covers trachea during swallowing)"
            ]
          },
          {
            "key": "gas_exchange",
            "name": "Gas Exchange in Alveoli",
            "short_description": "Understanding how oxygen and carbon dioxide diffuse between air and blood.",
            "example_tasks": [
              "Describe alveoli structure: millions of tiny air sacs, one cell thick, surrounded by capillaries, large total surface area",
              "Explain gas exchange by diffusion: oxygen (high in alveoli, low in blood) diffuses into blood, carbon dioxide (high in blood, low in alveoli) diffuses into air",
              "Relate structure to function: thin walls and large surface area maximize diffusion rate"
            ]
          },
          {
            "key": "breathing_mechanics",
            "name": "Mechanics of Breathing",
            "short_description": "Learning how the diaphragm and rib muscles cause inhalation and exhalation.",
            "example_tasks": [
              "Describe inhalation: diaphragm contracts (moves down), rib muscles contract (ribs move out), chest cavity volume increases, air pressure decreases, air rushes in",
              "Describe exhalation: diaphragm relaxes (moves up), rib muscles relax (ribs move in), chest cavity volume decreases, air pressure increases, air flows out",
              "Explain why breathing is mostly involuntary: controlled by medulla oblongata in brainstem, responds to CO₂ levels in blood"
            ]
          },
          {
            "key": "respiratory_health",
            "name": "Respiratory Health and Disease",
            "short_description": "Understanding factors that affect lung function and common respiratory disorders.",
            "example_tasks": [
              "Describe how smoking damages lungs: destroys cilia (reduced cleaning), increases mucus, damages alveoli (emphysema), causes cancer",
              "Compare respiratory diseases: asthma (airways narrow, difficulty breathing), bronchitis (inflamed airways, excess mucus), emphysema (damaged alveoli, reduced gas exchange)",
              "Identify ways to maintain respiratory health: don't smoke, avoid air pollution, exercise regularly, prevent infections (handwashing, vaccines)"
            ]
          }
        ]
      },
      {
        "key": "digestive_system",
        "name": "Digestive System",
        "short_description": "Understanding how food is broken down mechanically and chemically into nutrients that can be absorbed.",
        "sub_topics": [
          {
            "key": "digestive_organs",
            "name": "Organs of the Digestive System",
            "short_description": "Learning the alimentary canal and accessory organs involved in digestion.",
            "example_tasks": [
              "Trace food path through alimentary canal: mouth → esophagus → stomach → small intestine → large intestine → rectum → anus",
              "Identify accessory organs: salivary glands (produce saliva), liver (produces bile), gallbladder (stores bile), pancreas (produces enzymes and bicarbonate)",
              "Draw and label a diagram of the digestive system showing all major organs"
            ]
          },
          {
            "key": "mechanical_chemical_digestion",
            "name": "Mechanical and Chemical Digestion",
            "short_description": "Understanding the two types of digestion that break down food.",
            "example_tasks": [
              "Compare mechanical digestion (physical breakdown): chewing, stomach churning, peristalsis with chemical digestion (enzyme breakdown): carbohydrates → sugars, proteins → amino acids, fats → fatty acids and glycerol",
              "Explain why both types are necessary: mechanical increases surface area for enzymes to work, chemical breaks bonds in large molecules",
              "Identify where each type occurs: mechanical (mouth, stomach), chemical (mouth, stomach, small intestine)"
            ]
          },
          {
            "key": "digestion_in_mouth_stomach",
            "name": "Digestion in Mouth and Stomach",
            "short_description": "Learning about initial mechanical and chemical breakdown of food.",
            "example_tasks": [
              "Describe mouth digestion: teeth (mechanical), salivary amylase (begins starch → sugar), tongue (tastes, mixes, shapes food into bolus)",
              "Explain stomach digestion: churning (mechanical), pepsin (begins protein breakdown), hydrochloric acid (activates pepsin, kills bacteria, low pH ~2)",
              "Describe protective adaptations: thick mucus layer prevents stomach from digesting itself, esophageal sphincters prevent backflow"
            ]
          },
          {
            "key": "small_intestine_absorption",
            "name": "Small Intestine and Nutrient Absorption",
            "short_description": "Understanding where most chemical digestion and absorption occur.",
            "example_tasks": [
              "Describe small intestine structure: very long (6+ meters), folded with villi and microvilli (greatly increase surface area for absorption)",
              "Explain enzyme sources: pancreas (protease, lipase, amylase), small intestine lining (peptidases, maltase, lactase, sucrase)",
              "Trace nutrient absorption: broken down nutrients pass through villi → blood vessels (sugars, amino acids) or lymph vessels (fatty acids) → transported throughout body"
            ]
          },
          {
            "key": "large_intestine_elimination",
            "name": "Large Intestine and Elimination",
            "short_description": "Learning about water absorption and waste removal.",
            "example_tasks": [
              "Describe large intestine functions: absorb remaining water and minerals, house beneficial bacteria (produce vitamins), form feces from undigested material",
              "Explain role of beneficial bacteria: produce vitamin K and some B vitamins, prevent harmful bacteria growth",
              "Describe elimination: feces stored in rectum, expelled through anus, fiber important for healthy bowel movements"
            ]
          },
          {
            "key": "liver_pancreas_roles",
            "name": "Roles of Liver and Pancreas",
            "short_description": "Understanding how accessory organs aid digestion without food passing through them.",
            "example_tasks": [
              "List liver functions: produces bile (emulsifies fats), processes absorbed nutrients, detoxifies harmful substances, stores glucose as glycogen",
              "Describe pancreas functions: produces digestive enzymes (protease, lipase, amylase), produces bicarbonate (neutralizes stomach acid in small intestine)",
              "Explain bile's role: breaks large fat droplets into smaller ones (emulsification), increasing surface area for lipase to work"
            ]
          }
        ]
      },
      {
        "key": "excretory_system",
        "name": "Excretory System",
        "short_description": "Understanding how kidneys filter blood, regulate water balance, and remove metabolic wastes.",
        "sub_topics": [
          {
            "key": "excretory_organs",
            "name": "Organs of the Excretory System",
            "short_description": "Learning the structures involved in waste removal and their connections.",
            "example_tasks": [
              "Identify urinary system organs: kidneys (filter blood), ureters (carry urine to bladder), bladder (stores urine), urethra (releases urine from body)",
              "Draw and label the excretory system showing the pathway: kidneys → ureters → bladder → urethra",
              "Describe other excretory organs: lungs (remove CO₂), skin (removes some wastes in sweat), liver (processes wastes)"
            ]
          },
          {
            "key": "kidney_structure_function",
            "name": "Kidney Structure and Function",
            "short_description": "Understanding the kidney's role in filtering blood and producing urine.",
            "example_tasks": [
              "Describe kidney structure: outer cortex, inner medulla, renal pelvis (collects urine), contains about 1 million nephrons (functional units)",
              "List kidney functions: filter wastes from blood, regulate water and salt balance, maintain blood pH, produce urine",
              "Explain blood flow: renal artery brings blood → kidneys filter → renal vein carries cleaned blood away"
            ]
          },
          {
            "key": "nephron_filtration",
            "name": "Nephron and Urine Formation",
            "short_description": "Learning the three processes: filtration, reabsorption, and secretion.",
            "example_tasks": [
              "Draw and label a nephron: glomerulus (capillary ball), Bowman's capsule (surrounds glomerulus), tubule, collecting duct",
              "Describe filtration: blood pressure forces water, glucose, salts, urea from glomerulus into Bowman's capsule (small molecules pass, blood cells and proteins stay)",
              "Explain reabsorption and secretion: tubule reabsorbs useful substances (water, glucose, salts) back to blood, secretes additional wastes into tubule, remaining fluid is urine"
            ]
          },
          {
            "key": "water_balance",
            "name": "Water Balance and Homeostasis",
            "short_description": "Understanding how kidneys regulate the body's water content.",
            "example_tasks": [
              "Explain how kidneys maintain water balance: when dehydrated, reabsorb more water (concentrated urine), when hydrated, reabsorb less (dilute urine)",
              "Describe ADH (antidiuretic hormone): released when dehydrated, causes kidneys to reabsorb more water",
              "Discuss importance of water balance for homeostasis: affects blood volume, blood pressure, concentration of dissolved substances"
            ]
          },
          {
            "key": "excretory_health",
            "name": "Excretory System Health",
            "short_description": "Learning about kidney diseases and maintaining urinary system health.",
            "example_tasks": [
              "Describe kidney problems: kidney stones (mineral crystals block ureters), kidney failure (kidneys can't filter properly, requires dialysis or transplant), urinary tract infections",
              "Explain dialysis: machine filters blood when kidneys fail, blood passes through artificial membrane that removes wastes",
              "Identify ways to maintain kidney health: drink adequate water, limit salt intake, control blood pressure and diabetes, avoid excessive pain medication"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "human_body_systems_three",
    "name": "Human Body Systems III",
    "short_description": "Students explore the immune, endocrine, and reproductive systems, learning how the body defends against disease, regulates functions with hormones, and produces new generations.",
    "sub_topics": [
      {
        "key": "immune_system",
        "name": "Immune System",
        "short_description": "Understanding how the body defends against pathogens through nonspecific and specific immune responses.",
        "sub_topics": [
          {
            "key": "pathogens_disease",
            "name": "Pathogens and Disease",
            "short_description": "Learning about disease-causing organisms and how they enter and harm the body.",
            "example_tasks": [
              "Identify types of pathogens: bacteria (unicellular prokaryotes), viruses (non-living infectious particles), fungi (yeasts, molds), protozoans (unicellular eukaryotes)",
              "Describe how pathogens cause disease: produce toxins, damage cells and tissues, consume nutrients, trigger inflammatory responses",
              "Explain transmission methods: direct contact, airborne (coughing, sneezing), contaminated food/water, vectors (mosquitoes, ticks)"
            ]
          },
          {
            "key": "nonspecific_defenses",
            "name": "Nonspecific Defenses",
            "short_description": "Understanding first and second lines of defense that protect against all pathogens.",
            "example_tasks": [
              "Describe first line (barriers): skin (physical barrier, acid pH), mucous membranes (trap pathogens), secretions (tears, saliva contain lysozyme)",
              "Explain second line (inflammatory response): damaged tissue releases chemicals → blood vessels dilate → white blood cells arrive → phagocytes engulf pathogens → signs include redness, swelling, heat, pain",
              "Describe fever: elevated body temperature inhibits pathogen growth, speeds up immune responses"
            ]
          },
          {
            "key": "specific_immune_response",
            "name": "Specific Immune Response",
            "short_description": "Learning how the immune system targets specific pathogens with antibodies and specialized cells.",
            "example_tasks": [
              "Explain antigens: foreign molecules on pathogen surface that immune system recognizes",
              "Describe antibody-mediated immunity: B cells recognize antigens → produce antibodies (Y-shaped proteins) → antibodies bind to specific antigens → mark pathogens for destruction",
              "Explain cell-mediated immunity: T cells directly attack infected cells or cancer cells, some T cells activate B cells and other immune responses"
            ]
          },
          {
            "key": "immune_memory",
            "name": "Immune Memory and Immunity",
            "short_description": "Understanding how the immune system remembers pathogens for faster future responses.",
            "example_tasks": [
              "Describe primary immune response: first exposure to pathogen, takes days to produce antibodies, may get sick",
              "Explain secondary immune response: memory cells recognize pathogen from previous exposure, rapid antibody production, usually prevent illness",
              "Compare active immunity (body produces own antibodies - from infection or vaccine) with passive immunity (receive antibodies from another source - mother to baby, injection)"
            ]
          },
          {
            "key": "vaccines",
            "name": "Vaccines and Immunization",
            "short_description": "Learning how vaccines provide immunity without causing disease.",
            "example_tasks": [
              "Explain how vaccines work: contain weakened or inactive pathogen or parts of pathogen → immune system responds → produces memory cells → provides immunity without illness",
              "Describe types: live attenuated (weakened pathogen), inactivated (killed pathogen), subunit (pathogen parts), mRNA (genetic instructions)",
              "Discuss importance of vaccination: prevents diseases (measles, polio, COVID-19), protects individuals and community (herd immunity)"
            ]
          },
          {
            "key": "immune_disorders",
            "name": "Immune System Disorders",
            "short_description": "Understanding allergies, autoimmune diseases, and immunodeficiency.",
            "example_tasks": [
              "Explain allergies: immune system overreacts to harmless substances (pollen, food, pet dander), releases histamine causing symptoms",
              "Describe autoimmune diseases: immune system attacks body's own cells (Type 1 diabetes, rheumatoid arthritis, lupus)",
              "Explain immunodeficiency: weakened immune system can't fight infections effectively (HIV/AIDS, genetic disorders, cancer treatments)"
            ]
          }
        ]
      },
      {
        "key": "endocrine_system",
        "name": "Endocrine System",
        "short_description": "Understanding how hormones regulate body functions including growth, metabolism, and reproduction.",
        "sub_topics": [
          {
            "key": "hormones_glands",
            "name": "Hormones and Endocrine Glands",
            "short_description": "Learning about chemical messengers and the glands that secrete them.",
            "example_tasks": [
              "Define hormones: chemical messengers produced by endocrine glands, travel through bloodstream, affect target cells with specific receptors",
              "Compare endocrine signaling (slow, long-lasting hormones in blood) with nervous signaling (fast, short-duration nerve impulses)",
              "Identify major endocrine glands: pituitary, thyroid, parathyroid, adrenals, pancreas, ovaries (female), testes (male)"
            ]
          },
          {
            "key": "pituitary_gland",
            "name": "Pituitary Gland - Master Gland",
            "short_description": "Understanding the pituitary's role in controlling other endocrine glands.",
            "example_tasks": [
              "Explain why pituitary is called 'master gland': controls other endocrine glands by releasing regulatory hormones",
              "Describe pituitary hormones: growth hormone (regulates growth), TSH (stimulates thyroid), ADH (water balance), oxytocin (childbirth, milk release)",
              "Explain pituitary-hypothalamus connection: hypothalamus (brain region) controls pituitary, links nervous and endocrine systems"
            ]
          },
          {
            "key": "thyroid_metabolism",
            "name": "Thyroid and Metabolism",
            "short_description": "Learning how thyroid hormones control metabolic rate.",
            "example_tasks": [
              "Describe thyroid function: produces thyroxine (T4), controls metabolic rate (how fast cells use energy)",
              "Explain thyroid disorders: hyperthyroidism (too much thyroxine, high metabolism, weight loss), hypothyroidism (too little, low metabolism, weight gain, fatigue)",
              "Discuss iodine importance: needed to make thyroid hormones, iodized salt prevents deficiency (goiter)"
            ]
          },
          {
            "key": "pancreas_blood_sugar",
            "name": "Pancreas and Blood Sugar Regulation",
            "short_description": "Understanding how insulin and glucagon maintain stable blood glucose levels.",
            "example_tasks": [
              "Explain insulin function: secreted when blood sugar high (after eating), causes cells to take up glucose, liver stores glucose as glycogen",
              "Describe glucagon function: secreted when blood sugar low (between meals), causes liver to break down glycogen and release glucose",
              "Compare diabetes types: Type 1 (pancreas produces little/no insulin, autoimmune), Type 2 (cells don't respond to insulin, lifestyle-related), both result in high blood sugar"
            ]
          },
          {
            "key": "adrenal_stress_response",
            "name": "Adrenal Glands and Stress Response",
            "short_description": "Learning about hormones that help the body respond to stress.",
            "example_tasks": [
              "Describe adrenal gland location: sit atop kidneys, have outer cortex and inner medulla",
              "Explain fight-or-flight response: adrenal medulla releases adrenaline (epinephrine) → increases heart rate, breathing, blood sugar, alertness",
              "Describe cortisol: released during long-term stress, increases blood sugar, suppresses immune system, chronic elevation harmful"
            ]
          },
          {
            "key": "feedback_mechanisms",
            "name": "Negative Feedback Mechanisms",
            "short_description": "Understanding how the endocrine system self-regulates hormone levels.",
            "example_tasks": [
              "Define negative feedback: hormone affects target organ → sends signal back to gland → stops hormone release, maintains homeostasis",
              "Explain blood sugar regulation as negative feedback: high glucose → insulin released → glucose decreases → insulin release stops",
              "Describe thyroid regulation: low thyroxine → pituitary releases TSH → thyroid produces thyroxine → high thyroxine inhibits TSH release"
            ]
          }
        ]
      },
      {
        "key": "reproductive_system",
        "name": "Reproductive System",
        "short_description": "Understanding human sexual reproduction, including male and female reproductive anatomy, gamete production, fertilization, and development.",
        "sub_topics": [
          {
            "key": "male_reproductive_system",
            "name": "Male Reproductive System",
            "short_description": "Learning about structures that produce and deliver sperm.",
            "example_tasks": [
              "Identify male organs: testes (produce sperm and testosterone), scrotum (holds testes outside body), vas deferens (transport sperm), urethra (delivers sperm), penis",
              "Describe sperm production: occurs in testes, begins at puberty, continues throughout adult life, millions produced daily",
              "Explain testosterone functions: stimulates sperm production, develops male characteristics (facial hair, deeper voice, muscle growth)"
            ]
          },
          {
            "key": "female_reproductive_system",
            "name": "Female Reproductive System",
            "short_description": "Learning about structures that produce eggs and support pregnancy.",
            "example_tasks": [
              "Identify female organs: ovaries (produce eggs and hormones), fallopian tubes (egg transport, fertilization site), uterus (fetus develops), vagina (birth canal)",
              "Describe egg production: females born with all eggs, at puberty eggs mature and are released (ovulation), typically one per month",
              "Explain estrogen and progesterone: estrogen develops female characteristics (breast development, wider hips), both regulate menstrual cycle and prepare uterus for pregnancy"
            ]
          },
          {
            "key": "menstrual_cycle",
            "name": "Menstrual Cycle",
            "short_description": "Understanding the monthly cycle of egg development and uterine preparation.",
            "example_tasks": [
              "Describe four phases: menstruation (days 1-5, uterine lining sheds), follicular phase (days 1-14, egg matures), ovulation (day 14, egg released), luteal phase (days 15-28, uterus prepares for pregnancy)",
              "Explain hormone changes: FSH stimulates egg development, estrogen thickens uterine lining, LH surge triggers ovulation, progesterone maintains lining",
              "Describe what happens without fertilization: progesterone drops, uterine lining breaks down, menstruation begins, cycle repeats"
            ]
          },
          {
            "key": "fertilization_development",
            "name": "Fertilization and Early Development",
            "short_description": "Learning about conception and the first stages of human development.",
            "example_tasks": [
              "Describe fertilization: sperm meets egg in fallopian tube, one sperm penetrates egg, nuclei fuse, zygote (diploid cell) forms",
              "Explain early development: zygote divides repeatedly while moving to uterus (3-4 days), forms hollow ball (blastocyst), implants in uterine wall (6-7 days after fertilization)",
              "Trace development: zygote (1 cell) → morula (solid ball) → blastocyst (hollow ball) → embryo (implants and begins forming tissues)"
            ]
          },
          {
            "key": "pregnancy_fetal_development",
            "name": "Pregnancy and Fetal Development",
            "short_description": "Understanding the three trimesters and major developmental milestones.",
            "example_tasks": [
              "Describe trimester development: first (major organs form, embryo becomes fetus), second (movement felt, rapid growth), third (final maturation, weight gain)",
              "Explain placenta function: exchange organ between mother and fetus, provides oxygen and nutrients, removes wastes, produces hormones, connected by umbilical cord",
              "Identify developmental stages: 8 weeks (embryo becomes fetus, all organs present), 20 weeks (halfway, movement), 40 weeks (full term, birth)"
            ]
          },
          {
            "key": "birth_process",
            "name": "Birth Process",
            "short_description": "Learning about the stages of labor and delivery.",
            "example_tasks": [
              "Describe three stages of labor: dilation (cervix opens), delivery (baby passes through birth canal), afterbirth (placenta delivered)",
              "Explain hormone roles: oxytocin causes uterine contractions, positive feedback increases contractions until birth",
              "Discuss newborn adaptations: lungs begin functioning (first breath), umbilical cord cut (baby now independent), digestive system begins processing milk"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "human_health_disease",
    "name": "Human Health and Disease",
    "short_description": "Students explore factors affecting human health including infectious and non-infectious diseases, nutrition, lifestyle choices, and preventive health measures. This topic emphasizes personal health decisions and public health.",
    "sub_topics": [
      {
        "key": "infectious_diseases",
        "name": "Infectious Diseases",
        "short_description": "Understanding diseases caused by pathogens that can spread from person to person.",
        "sub_topics": [
          {
            "key": "bacterial_infections",
            "name": "Bacterial Infections",
            "short_description": "Learning about common bacterial diseases and antibiotic treatment.",
            "example_tasks": [
              "Identify common bacterial infections: strep throat (Streptococcus), tuberculosis (Mycobacterium), Lyme disease (Borrelia), food poisoning (Salmonella, E. coli)",
              "Explain antibiotic treatment: antibiotics kill bacteria or prevent growth, must complete full course, ineffective against viruses",
              "Discuss antibiotic resistance: overuse causes bacteria to evolve resistance, creating 'superbugs' that are difficult to treat"
            ]
          },
          {
            "key": "viral_infections",
            "name": "Viral Infections",
            "short_description": "Understanding viral diseases and why they are harder to treat than bacterial infections.",
            "example_tasks": [
              "Identify viral diseases: influenza, common cold, COVID-19, measles, chickenpox, HIV/AIDS, HPV",
              "Explain why antibiotics don't work on viruses: viruses use host cell machinery, antibiotics target bacterial structures that viruses lack",
              "Describe antiviral medications: slow viral replication but don't kill viruses, vaccines are more effective prevention"
            ]
          },
          {
            "key": "disease_transmission_prevention",
            "name": "Disease Transmission and Prevention",
            "short_description": "Learning how infectious diseases spread and methods to prevent transmission.",
            "example_tasks": [
              "Identify transmission routes: direct contact (touching, sexual contact), airborne (droplets from coughing/sneezing), contaminated food/water, vectors (mosquitoes, ticks)",
              "List prevention methods: handwashing (most important), vaccines, avoiding contact with sick people, covering coughs/sneezes, food safety, vector control",
              "Explain herd immunity: when enough people are vaccinated, disease can't spread easily, protects those who can't be vaccinated"
            ]
          }
        ]
      },
      {
        "key": "noninfectious_diseases",
        "name": "Non-Infectious Diseases",
        "short_description": "Understanding diseases that are not caused by pathogens and cannot be transmitted.",
        "sub_topics": [
          {
            "key": "genetic_disorders",
            "name": "Genetic Disorders",
            "short_description": "Learning about diseases caused by mutations in DNA.",
            "example_tasks": [
              "Identify genetic disorders: sickle cell disease (recessive, abnormal hemoglobin), cystic fibrosis (recessive, thick mucus), Huntington's disease (dominant, nervous system degeneration)",
              "Explain inheritance patterns: some are recessive (need two copies), some dominant (need one copy), some X-linked (mostly affect males)",
              "Discuss genetic testing and counseling: can identify carriers, predict risk for offspring, raises ethical considerations"
            ]
          },
          {
            "key": "cancer",
            "name": "Cancer",
            "short_description": "Understanding uncontrolled cell growth and factors that increase cancer risk.",
            "example_tasks": [
              "Explain cancer development: mutations in genes controlling cell division → cells divide uncontrollably → tumor forms, may spread (metastasis)",
              "Identify risk factors: tobacco use (lung, mouth), UV exposure (skin), certain viruses (HPV, hepatitis), family history, age, diet, alcohol",
              "Describe treatment approaches: surgery (remove tumor), radiation (kill cancer cells), chemotherapy (drugs kill rapidly dividing cells), immunotherapy"
            ]
          },
          {
            "key": "cardiovascular_disease",
            "name": "Cardiovascular Disease",
            "short_description": "Learning about diseases affecting the heart and blood vessels.",
            "example_tasks": [
              "Describe atherosclerosis: plaque builds up in arteries, narrows vessels, reduces blood flow, can lead to heart attack or stroke",
              "Identify risk factors: high blood pressure, high cholesterol, smoking, obesity, physical inactivity, diabetes, family history",
              "Explain prevention: heart-healthy diet (low saturated fat, high fiber), regular exercise, maintain healthy weight, don't smoke, manage stress"
            ]
          },
          {
            "key": "diabetes",
            "name": "Diabetes",
            "short_description": "Understanding the disease where blood sugar regulation fails.",
            "example_tasks": [
              "Compare Type 1 (autoimmune, pancreas produces little insulin, usually starts young, requires insulin injections) and Type 2 (cells resistant to insulin, usually starts in adulthood, linked to obesity and lifestyle)",
              "Explain complications of uncontrolled diabetes: nerve damage, kidney disease, vision problems, heart disease, poor wound healing",
              "Describe management: Type 1 (insulin injections, blood sugar monitoring), Type 2 (diet, exercise, weight loss, sometimes medication), both require careful monitoring"
            ]
          }
        ]
      },
      {
        "key": "nutrition_diet",
        "name": "Nutrition and Diet",
        "short_description": "Understanding nutrients needed for health and making informed food choices.",
        "sub_topics": [
          {
            "key": "essential_nutrients",
            "name": "Essential Nutrients",
            "short_description": "Learning about the six types of nutrients the body needs.",
            "example_tasks": [
              "Identify six nutrient groups: carbohydrates (energy), proteins (growth and repair), fats (energy storage, insulation), vitamins (regulate processes), minerals (bone, enzyme function), water (all body functions)",
              "Explain macronutrients vs micronutrients: macro needed in large amounts (carbs, proteins, fats), micro needed in small amounts (vitamins, minerals)",
              "Describe specific nutrient functions: calcium (bones, teeth), iron (hemoglobin), vitamin C (immune system, wound healing), vitamin D (calcium absorption)"
            ]
          },
          {
            "key": "balanced_diet",
            "name": "Balanced Diet and Nutrition Guidelines",
            "short_description": "Understanding MyPlate and recommendations for healthy eating.",
            "example_tasks": [
              "Describe MyPlate recommendations: half plate fruits and vegetables, quarter plate grains (prefer whole grains), quarter plate protein, dairy on side",
              "Explain dietary guidelines: limit added sugars, saturated fats, and sodium; eat variety of foods; appropriate calorie intake for age, sex, activity level",
              "Compare food labels: identify serving size, calories, nutrients, daily value percentages, make informed choices"
            ]
          },
          {
            "key": "diet_related_health_issues",
            "name": "Diet-Related Health Issues",
            "short_description": "Learning about malnutrition, obesity, and eating disorders.",
            "example_tasks": [
              "Explain malnutrition: deficiency (not enough nutrients - scurvy from lack of vitamin C, anemia from lack of iron) or excess (too many calories - obesity)",
              "Describe obesity: excess body fat, BMI >30, increases risk for diabetes, heart disease, certain cancers; caused by excess calories and inadequate exercise",
              "Discuss eating disorders: anorexia (severe food restriction), bulimia (binge eating and purging), binge eating disorder; serious mental health conditions requiring treatment"
            ]
          }
        ]
      },
      {
        "key": "lifestyle_health",
        "name": "Lifestyle and Health",
        "short_description": "Understanding how daily choices affect long-term health and disease risk.",
        "sub_topics": [
          {
            "key": "physical_activity",
            "name": "Physical Activity and Exercise",
            "short_description": "Learning about the benefits of regular physical activity.",
            "example_tasks": [
              "List benefits of regular exercise: strengthens heart and lungs, builds strong bones and muscles, maintains healthy weight, improves mood, reduces disease risk",
              "Explain recommended activity: 60 minutes daily for adolescents, mix of aerobic (running, swimming) and muscle-strengthening activities (resistance training)",
              "Compare sedentary lifestyle risks: obesity, weak muscles and bones, increased disease risk, poor cardiovascular health"
            ]
          },
          {
            "key": "substance_abuse",
            "name": "Substance Abuse and Addiction",
            "short_description": "Understanding the harmful effects of tobacco, alcohol, and other drugs.",
            "example_tasks": [
              "Describe tobacco effects: nicotine (addictive), damages lungs (emphysema, bronchitis), causes cancer (lung, mouth, throat), harms cardiovascular system",
              "Explain alcohol effects: depressant, impairs judgment and coordination, damages liver (cirrhosis), brain damage with chronic use, especially harmful to developing brains",
              "Discuss addiction: physical dependence (body needs substance), psychological dependence (craving), tolerance (need more for same effect), difficult to quit"
            ]
          },
          {
            "key": "sleep_stress_mental_health",
            "name": "Sleep, Stress, and Mental Health",
            "short_description": "Learning how sleep, stress management, and mental health affect overall wellness.",
            "example_tasks": [
              "Explain importance of sleep: body repairs tissues, brain consolidates memories, immune system strengthens; teens need 8-10 hours nightly",
              "Describe healthy stress management: exercise, relaxation techniques, talking to others, time management; chronic stress harms physical and mental health",
              "Discuss mental health: just as important as physical health, common issues include anxiety and depression, treatment available (therapy, medication), reduce stigma by talking openly"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "ecology_fundamentals",
    "name": "Ecology Fundamentals",
    "short_description": "Students explore the interactions between organisms and their environment, learning about ecological organization, energy flow, and nutrient cycles. This topic emphasizes the interconnectedness of living and nonliving components in ecosystems.",
    "sub_topics": [
      {
        "key": "levels_of_organization",
        "name": "Levels of Ecological Organization",
        "short_description": "Understanding the hierarchy from individual organisms to the biosphere.",
        "sub_topics": [
          {
            "key": "organism_to_biosphere",
            "name": "Organism to Biosphere",
            "short_description": "Learning the nested levels of ecological study from smallest to largest scale.",
            "example_tasks": [
              "List levels in order: organism (individual) → population (same species, same area) → community (all populations in area) → ecosystem (community + environment) → biome (large region with similar climate/organisms) → biosphere (all life on Earth)",
              "Classify examples at each level: one rabbit (organism), all rabbits in a field (population), all plants and animals in field (community), field including soil and water (ecosystem)",
              "Explain why ecologists study different levels: organism (adaptations), population (growth, interactions), community (diversity, relationships), ecosystem (energy flow, nutrient cycling)"
            ]
          },
          {
            "key": "habitat_niche",
            "name": "Habitat and Ecological Niche",
            "short_description": "Understanding where organisms live and their role in the ecosystem.",
            "example_tasks": [
              "Define habitat: physical place where organism lives (pond, forest floor, rocky shore)",
              "Define niche: organism's role in ecosystem including what it eats, when it's active, where it lives, how it interacts with others",
              "Compare: squirrels and woodpeckers live in same habitat (oak tree) but different niches (squirrels eat acorns on ground, woodpeckers eat insects in bark)"
            ]
          }
        ]
      },
      {
        "key": "biotic_abiotic_factors",
        "name": "Biotic and Abiotic Factors",
        "short_description": "Understanding living and nonliving components that influence ecosystems.",
        "sub_topics": [
          {
            "key": "abiotic_factors",
            "name": "Abiotic Factors",
            "short_description": "Learning about nonliving environmental components that affect organisms.",
            "example_tasks": [
              "Identify abiotic factors: temperature, sunlight, water, soil, air, minerals, pH, salinity, wind, elevation",
              "Explain how abiotic factors limit organism distribution: cacti need low water, tropical plants need warmth, aquatic organisms need water",
              "Design an experiment testing how one abiotic factor (light, temperature, water) affects plant growth"
            ]
          },
          {
            "key": "biotic_factors",
            "name": "Biotic Factors",
            "short_description": "Understanding how living organisms interact and influence each other.",
            "example_tasks": [
              "Identify biotic factors: predators, prey, competitors, parasites, decomposers, food sources, disease organisms",
              "Explain how biotic factors affect populations: predators limit prey numbers, competition for resources, diseases reduce populations",
              "Describe symbiotic relationships as biotic interactions: mutualism (both benefit), commensalism (one benefits, other unaffected), parasitism (one benefits, other harmed)"
            ]
          },
          {
            "key": "limiting_factors",
            "name": "Limiting Factors",
            "short_description": "Learning about factors that restrict population growth and distribution.",
            "example_tasks": [
              "Define limiting factor: any resource or condition that limits population size (water, food, space, nesting sites, temperature)",
              "Explain Liebig's Law of the Minimum: population limited by resource in shortest supply, even if others are abundant",
              "Identify limiting factors in examples: desert (water), arctic (temperature), island (space), deep ocean (light, food)"
            ]
          }
        ]
      },
      {
        "key": "energy_flow",
        "name": "Energy Flow in Ecosystems",
        "short_description": "Understanding how energy moves through ecosystems from producers to consumers.",
        "sub_topics": [
          {
            "key": "producers_consumers_decomposers",
            "name": "Producers, Consumers, and Decomposers",
            "short_description": "Learning the three functional groups based on how organisms obtain energy.",
            "example_tasks": [
              "Define producers (autotrophs): make their own food through photosynthesis (plants, algae) or chemosynthesis (some bacteria), form base of food chains",
              "Classify consumers (heterotrophs): herbivores (eat plants), carnivores (eat animals), omnivores (eat both), scavengers (eat dead organisms)",
              "Explain decomposers: break down dead organisms and wastes (bacteria, fungi), recycle nutrients back to ecosystem, essential for nutrient cycling"
            ]
          },
          {
            "key": "food_chains_webs",
            "name": "Food Chains and Food Webs",
            "short_description": "Understanding pathways of energy and matter transfer in ecosystems.",
            "example_tasks": [
              "Construct a food chain: sun → grass (producer) → grasshopper (primary consumer) → frog (secondary consumer) → snake (tertiary consumer) → hawk (quaternary consumer)",
              "Draw a food web showing multiple interconnected food chains in a forest or aquatic ecosystem with at least 10 organisms",
              "Explain why food webs are more realistic than food chains: most organisms eat multiple food sources, shows ecosystem complexity and stability"
            ]
          },
          {
            "key": "trophic_levels",
            "name": "Trophic Levels and Energy Pyramids",
            "short_description": "Learning about feeding levels and energy loss through ecosystems.",
            "example_tasks": [
              "Identify trophic levels: first (producers), second (herbivores), third (carnivores eating herbivores), fourth (carnivores eating carnivores)",
              "Explain 10% rule: only about 10% of energy transfers to next trophic level, 90% lost as heat through metabolism, limits number of trophic levels to 4-5",
              "Draw an energy pyramid showing decreasing energy and biomass at higher levels; explain why there are fewer top predators than producers"
            ]
          },
          {
            "key": "energy_vs_matter",
            "name": "Energy Flow vs. Matter Cycling",
            "short_description": "Understanding that energy flows one-way while matter cycles.",
            "example_tasks": [
              "Compare energy flow (one direction: sun → producers → consumers → heat, eventually lost) with matter cycling (atoms recycled: decomposers return nutrients to soil)",
              "Explain why ecosystems need continuous energy input from sun but don't need new matter",
              "Trace carbon atom: atmosphere (CO₂) → plant → animal → decomposer → atmosphere (complete cycle)"
            ]
          }
        ]
      },
      {
        "key": "nutrient_cycles",
        "name": "Biogeochemical Cycles",
        "short_description": "Understanding how essential elements cycle through living and nonliving parts of ecosystems.",
        "sub_topics": [
          {
            "key": "water_cycle",
            "name": "Water Cycle",
            "short_description": "Learning how water moves through evaporation, condensation, precipitation, and runoff.",
            "example_tasks": [
              "Draw and label the water cycle: evaporation (water → vapor), transpiration (plants release water vapor), condensation (vapor → clouds), precipitation (rain, snow), runoff (flows to rivers, oceans), infiltration (soaks into ground)",
              "Explain the sun's role: provides energy for evaporation, drives the entire cycle",
              "Describe human impacts: water pollution, damming rivers, groundwater depletion, deforestation reduces transpiration"
            ]
          },
          {
            "key": "carbon_cycle",
            "name": "Carbon Cycle",
            "short_description": "Understanding carbon movement through atmosphere, organisms, and Earth.",
            "example_tasks": [
              "Trace carbon cycle: atmosphere (CO₂) → producers (photosynthesis) → consumers (eating) → atmosphere (cellular respiration, combustion, decomposition)",
              "Explain long-term carbon storage: fossil fuels (ancient organisms), limestone (shells, skeletons), dissolved in oceans",
              "Describe how burning fossil fuels affects the carbon cycle: releases stored carbon into atmosphere as CO₂, contributes to climate change"
            ]
          },
          {
            "key": "nitrogen_cycle",
            "name": "Nitrogen Cycle",
            "short_description": "Learning how nitrogen moves between atmosphere, soil, and organisms.",
            "example_tasks": [
              "Describe nitrogen cycle steps: nitrogen fixation (bacteria convert N₂ to ammonia), nitrification (ammonia → nitrites → nitrates), assimilation (plants absorb nitrates), denitrification (bacteria convert nitrates back to N₂)",
              "Explain importance: nitrogen needed for proteins and DNA, but most organisms can't use atmospheric N₂ (78% of air)",
              "Discuss human impacts: fertilizers add nitrates (can pollute water), burning fossil fuels creates nitrogen oxides (air pollution)"
            ]
          },
          {
            "key": "phosphorus_cycle",
            "name": "Phosphorus Cycle",
            "short_description": "Understanding phosphorus movement through rocks, soil, organisms, and water.",
            "example_tasks": [
              "Trace phosphorus cycle: rocks → soil (weathering) → plants → animals → decomposition → soil, some washes to ocean → sediment → rocks (very slow)",
              "Explain why phosphorus is often limiting factor: no atmospheric reservoir, cycle is slow, easily washed away",
              "Describe fertilizer runoff problem: excess phosphorus enters waterways → algal blooms → eutrophication → dead zones"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "populations_communities",
    "name": "Populations and Communities",
    "short_description": "Students explore population dynamics including growth patterns, limiting factors, and interactions between species in communities. This topic emphasizes how populations change over time and interact with other species.",
    "sub_topics": [
      {
        "key": "population_characteristics",
        "name": "Population Characteristics",
        "short_description": "Understanding properties that describe populations including size, density, and distribution.",
        "sub_topics": [
          {
            "key": "population_size_density",
            "name": "Population Size and Density",
            "short_description": "Learning to measure and describe population numbers and spacing.",
            "example_tasks": [
              "Define population size: total number of individuals in a population at a given time",
              "Calculate population density: number of individuals per unit area (50 rabbits per square kilometer) or volume (100 fish per cubic meter of pond)",
              "Explain why density matters more than size: 100 deer in 1 km² (crowded, high competition) vs 100 deer in 100 km² (sparse, low competition)"
            ]
          },
          {
            "key": "distribution_patterns",
            "name": "Distribution Patterns",
            "short_description": "Understanding how individuals are spaced within their habitat.",
            "example_tasks": [
              "Identify three patterns: clumped (groups - herds, schools, resources patchy), uniform (evenly spaced - territorial animals, planted crops), random (no pattern - rare, trees in some forests)",
              "Explain causes: clumped (resources concentrated, social behavior, protection), uniform (competition, territoriality), random (resources abundant and uniform)",
              "Analyze distribution maps: determine which pattern is shown and hypothesize reasons"
            ]
          },
          {
            "key": "age_structure",
            "name": "Age Structure",
            "short_description": "Learning how the proportions of different age groups affect population growth.",
            "example_tasks": [
              "Interpret age structure diagrams: pyramid shape (growing population, many young), column shape (stable population), inverted pyramid (declining population, few young)",
              "Explain reproductive age importance: populations with many individuals of reproductive age will likely grow rapidly",
              "Compare human population pyramids: developing countries (young populations, rapid growth) vs developed countries (older populations, slow/negative growth)"
            ]
          }
        ]
      },
      {
        "key": "population_growth",
        "name": "Population Growth",
        "short_description": "Understanding factors affecting population size and patterns of growth over time.",
        "sub_topics": [
          {
            "key": "birth_death_rates",
            "name": "Birth and Death Rates",
            "short_description": "Learning how births, deaths, immigration, and emigration change population size.",
            "example_tasks": [
              "Calculate population change: (births + immigration) - (deaths + emigration) = change in population size",
              "Define birth rate: number of births per 1,000 individuals per year; death rate: number of deaths per 1,000 per year",
              "Use data to predict population change: if birth rate = 20/1000, death rate = 15/1000, is population growing or shrinking?"
            ]
          },
          {
            "key": "exponential_growth",
            "name": "Exponential Growth",
            "short_description": "Understanding J-shaped growth curves when resources are unlimited.",
            "example_tasks": [
              "Describe exponential growth: population increases by constant percentage per time period (doubles: 2 → 4 → 8 → 16 → 32), creates J-shaped curve",
              "Explain conditions: occurs when resources unlimited, no predators, ideal environment (rarely happens long-term in nature)",
              "Give examples: bacteria in fresh nutrient broth, invasive species in new habitat (initial phase), human population over past centuries"
            ]
          },
          {
            "key": "logistic_growth",
            "name": "Logistic Growth and Carrying Capacity",
            "short_description": "Learning about S-shaped growth curves limited by environmental resistance.",
            "example_tasks": [
              "Describe logistic growth: population grows exponentially at first, then slows as resources become limited, levels off at carrying capacity (S-shaped curve)",
              "Define carrying capacity (K): maximum population size environment can support given available resources",
              "Explain what happens at carrying capacity: birth rate equals death rate, population fluctuates around K, limited by resources"
            ]
          },
          {
            "key": "limiting_factors_growth",
            "name": "Limiting Factors and Population Control",
            "short_description": "Understanding density-dependent and density-independent factors.",
            "example_tasks": [
              "Define density-dependent factors: effects increase as population density increases (competition for food, disease spread, predation, parasitism, waste accumulation)",
              "Define density-independent factors: affect population regardless of density (natural disasters, weather, seasonal changes, habitat destruction)",
              "Classify examples: disease outbreak (density-dependent), hurricane (density-independent), competition for nesting sites (density-dependent), drought (density-independent)"
            ]
          }
        ]
      },
      {
        "key": "community_interactions",
        "name": "Community Interactions",
        "short_description": "Understanding relationships between species in ecological communities.",
        "sub_topics": [
          {
            "key": "competition",
            "name": "Competition",
            "short_description": "Learning how organisms compete for limited resources.",
            "example_tasks": [
              "Define competition: interaction where organisms vie for same limited resource (food, water, space, light, mates)",
              "Compare interspecific (between species) and intraspecific (within species) competition; explain why intraspecific is often more intense (same exact needs)",
              "Explain competitive exclusion principle: two species with identical niches cannot coexist indefinitely; one will outcompete and eliminate the other"
            ]
          },
          {
            "key": "predation",
            "name": "Predation",
            "short_description": "Understanding predator-prey relationships and population cycles.",
            "example_tasks": [
              "Define predation: one organism (predator) kills and eats another (prey)",
              "Describe predator-prey cycles: prey population increases → predator population increases (more food) → prey population decreases (more predation) → predator population decreases (less food) → cycle repeats",
              "Identify adaptations: predator (speed, claws, camouflage, pack hunting), prey (speed, camouflage, warning coloration, spines, herding)"
            ]
          },
          {
            "key": "symbiosis",
            "name": "Symbiotic Relationships",
            "short_description": "Learning about close, long-term interactions between species.",
            "example_tasks": [
              "Define mutualism: both species benefit (bee-flower: bee gets nectar, flower gets pollinated; bacteria in human intestines: bacteria get food, humans get vitamins)",
              "Define commensalism: one benefits, other unaffected (barnacles on whale: barnacles get transportation, whale unaffected; birds nesting in trees)",
              "Define parasitism: one benefits (parasite), other harmed (host); parasite usually doesn't kill host (tapeworm, flea, tick, mistletoe)"
            ]
          },
          {
            "key": "ecological_succession",
            "name": "Ecological Succession",
            "short_description": "Understanding how communities change over time following disturbance.",
            "example_tasks": [
              "Define primary succession: development of ecosystem from bare rock/new land (no soil), slow process, pioneer species (lichens, mosses) → grasses → shrubs → trees",
              "Define secondary succession: redevelopment after disturbance that leaves soil intact (fire, farming, logging), faster than primary, starts with seeds/roots in soil",
              "Describe climax community: stable, mature community that persists until major disturbance (old-growth forest, mature grassland)"
            ]
          }
        ]
      },
      {
        "key": "biomes",
        "name": "Biomes",
        "short_description": "Learning about major terrestrial and aquatic ecosystems characterized by climate and dominant organisms.",
        "sub_topics": [
          {
            "key": "terrestrial_biomes",
            "name": "Terrestrial Biomes",
            "short_description": "Understanding major land biomes defined by temperature and precipitation.",
            "example_tasks": [
              "Identify major biomes: tropical rainforest (hot, wet, high biodiversity), desert (dry, extreme temperatures), grassland (moderate rain, grazing animals), temperate forest (four seasons, deciduous trees), taiga (cold, coniferous forest), tundra (coldest, permafrost, low-growing plants)",
              "Match biomes to characteristics: which has greatest biodiversity (tropical rainforest), which has permafrost (tundra), which has periodic fires (grassland)",
              "Explain how climate determines biome: temperature and precipitation are primary factors, create conditions favoring certain organisms"
            ]
          },
          {
            "key": "aquatic_ecosystems",
            "name": "Aquatic Ecosystems",
            "short_description": "Learning about freshwater and marine ecosystems.",
            "example_tasks": [
              "Compare freshwater ecosystems: lakes/ponds (standing water, stratified), rivers/streams (flowing water, high oxygen), wetlands (shallow water, high productivity)",
              "Describe marine zones: intertidal (shoreline, alternately covered/exposed), neritic (shallow ocean over continental shelf, most life), oceanic (open ocean, deep), benthic (ocean floor)",
              "Explain estuaries: where freshwater meets saltwater, high nutrients, important nursery for many species"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "ecosystems_biodiversity",
    "name": "Ecosystems and Biodiversity",
    "short_description": "Students explore ecosystem structure and function, biodiversity importance, and ecosystem services. This topic emphasizes the value of diverse, healthy ecosystems and threats to biodiversity.",
    "sub_topics": [
      {
        "key": "ecosystem_structure",
        "name": "Ecosystem Structure and Function",
        "short_description": "Understanding how ecosystems are organized and how they function.",
        "sub_topics": [
          {
            "key": "ecosystem_components",
            "name": "Ecosystem Components",
            "short_description": "Learning the biological, chemical, and physical parts of ecosystems.",
            "example_tasks": [
              "Identify biological components: producers (plants, algae), consumers (herbivores, carnivores, omnivores), decomposers (bacteria, fungi)",
              "Identify abiotic components: water, minerals, sunlight, temperature, soil, air, pH",
              "Explain how components interact: producers use abiotic factors to make food, consumers eat producers/other consumers, decomposers recycle nutrients"
            ]
          },
          {
            "key": "ecosystem_productivity",
            "name": "Primary Productivity",
            "short_description": "Understanding the rate at which producers convert solar energy to chemical energy.",
            "example_tasks": [
              "Define primary productivity: rate at which producers create organic matter through photosynthesis",
              "Compare gross primary productivity (total energy captured) with net primary productivity (energy stored after producers' respiration)",
              "Identify most productive ecosystems: tropical rainforests and coral reefs (high productivity), deserts and tundra (low productivity)"
            ]
          },
          {
            "key": "ecosystem_resilience",
            "name": "Ecosystem Resilience and Stability",
            "short_description": "Learning how ecosystems respond to disturbances and maintain function.",
            "example_tasks": [
              "Define resilience: ability of ecosystem to recover after disturbance (fire, storm, drought)",
              "Explain relationship between biodiversity and stability: more diverse ecosystems are more stable (if one species declines, others can fill its role)",
              "Give examples of resilience: forest regrows after fire, grassland recovers from drought, coral reef recovers from bleaching (if conditions improve)"
            ]
          }
        ]
      },
      {
        "key": "biodiversity",
        "name": "Biodiversity",
        "short_description": "Understanding the variety of life at genetic, species, and ecosystem levels.",
        "sub_topics": [
          {
            "key": "levels_of_biodiversity",
            "name": "Levels of Biodiversity",
            "short_description": "Learning about genetic, species, and ecosystem diversity.",
            "example_tasks": [
              "Define genetic diversity: variation in genes within a species (different dog breeds, human variations)",
              "Define species diversity: number and variety of species in an area (tropical rainforests have highest)",
              "Define ecosystem diversity: variety of habitats and communities in a region (mountains with forests, meadows, streams)"
            ]
          },
          {
            "key": "importance_of_biodiversity",
            "name": "Importance of Biodiversity",
            "short_description": "Understanding ecological, economic, and aesthetic values of biodiversity.",
            "example_tasks": [
              "Explain ecological value: diverse ecosystems are more productive, stable, and resilient; provide ecosystem services",
              "Describe economic value: medicine from plants/animals, food crops, materials (wood, fibers), ecotourism",
              "Discuss aesthetic/cultural value: beauty, inspiration, recreation, spiritual significance, scientific knowledge"
            ]
          },
          {
            "key": "biodiversity_hotspots",
            "name": "Biodiversity Hotspots",
            "short_description": "Learning about regions with exceptional species diversity and endemism.",
            "example_tasks": [
              "Define biodiversity hotspot: region with high species diversity, many endemic species (found nowhere else), under threat",
              "Identify examples: Madagascar, tropical Andes, Mesoamerica, Caribbean islands, Philippines",
              "Explain why hotspots important: protecting these areas preserves disproportionately large numbers of species"
            ]
          },
          {
            "key": "threats_to_biodiversity",
            "name": "Threats to Biodiversity",
            "short_description": "Understanding human activities that reduce biodiversity.",
            "example_tasks": [
              "Identify major threats (HIPPCO): Habitat loss (deforestation, development), Invasive species, Pollution, Population growth, Climate change, Overharvesting",
              "Explain habitat loss as greatest threat: destroys homes and resources, fragments populations, reduces breeding success",
              "Describe invasive species impact: outcompete native species, lack natural predators, disrupt food webs (kudzu, zebra mussels, cane toads)"
            ]
          }
        ]
      },
      {
        "key": "ecosystem_services",
        "name": "Ecosystem Services",
        "short_description": "Understanding benefits that humans receive from healthy ecosystems.",
        "sub_topics": [
          {
            "key": "provisioning_services",
            "name": "Provisioning Services",
            "short_description": "Learning about resources ecosystems provide for human use.",
            "example_tasks": [
              "List provisioning services: food (crops, livestock, fish), fresh water, wood and fiber, fuel (wood, biofuels), medicines (plant compounds)",
              "Explain dependence: humans rely on ecosystems for basic needs, all food ultimately comes from ecosystems",
              "Give examples: forests provide wood and medicines, oceans provide fish, wetlands filter water for drinking"
            ]
          },
          {
            "key": "regulating_services",
            "name": "Regulating Services",
            "short_description": "Understanding how ecosystems regulate environmental conditions.",
            "example_tasks": [
              "Identify regulating services: climate regulation (forests absorb CO₂), water purification (wetlands filter pollutants), pollination (bees, butterflies), disease control, flood control",
              "Explain climate regulation: forests and oceans absorb carbon dioxide, reducing greenhouse effect",
              "Describe pollination importance: 75% of crops depend on animal pollinators, worth billions of dollars"
            ]
          },
          {
            "key": "supporting_cultural_services",
            "name": "Supporting and Cultural Services",
            "short_description": "Learning about fundamental ecosystem processes and non-material benefits.",
            "example_tasks": [
              "Define supporting services: nutrient cycling, soil formation, primary production, oxygen production - support all other services",
              "List cultural services: recreation (hiking, fishing), aesthetic beauty (national parks), spiritual significance (sacred sites), education and research",
              "Explain why protecting ecosystems benefits humans: ecosystem services worth trillions of dollars, impossible to replace with technology"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "environmental_issues_conservation",
    "name": "Environmental Issues and Conservation",
    "short_description": "Students explore major environmental challenges including climate change, pollution, habitat destruction, and resource depletion. This topic emphasizes human impact on ecosystems and strategies for conservation and sustainability.",
    "sub_topics": [
      {
        "key": "human_population_impact",
        "name": "Human Population and Impact",
        "short_description": "Understanding how human population growth affects Earth's resources and ecosystems.",
        "sub_topics": [
          {
            "key": "human_population_growth",
            "name": "Human Population Growth",
            "short_description": "Learning about exponential human population increase and demographic transition.",
            "example_tasks": [
              "Describe human population growth: slow for thousands of years, exponential increase in past 200 years (1 billion in 1800, 8 billion in 2022)",
              "Explain causes: improved medicine and sanitation (reduced death rates), increased food production, control of diseases",
              "Discuss demographic transition: developing countries (high birth/death rates) → transitioning (falling death rates) → developed (low birth/death rates)"
            ]
          },
          {
            "key": "ecological_footprint",
            "name": "Ecological Footprint",
            "short_description": "Understanding the measure of human demand on Earth's ecosystems.",
            "example_tasks": [
              "Define ecological footprint: amount of biologically productive land and water needed to support a person's lifestyle and absorb their waste",
              "Compare footprints: developed countries (large footprints, high consumption) vs developing countries (smaller footprints, lower consumption)",
              "Calculate personal footprint: consider transportation, food, housing, goods purchased; identify ways to reduce impact"
            ]
          },
          {
            "key": "resource_consumption",
            "name": "Resource Consumption",
            "short_description": "Learning about renewable vs nonrenewable resources and sustainable use.",
            "example_tasks": [
              "Compare renewable (replenish naturally: solar, wind, forests if managed) with nonrenewable (finite: fossil fuels, minerals, nuclear fuel)",
              "Explain sustainable use: using resources at rate they can be replenished, meeting present needs without compromising future generations",
              "Identify unsustainable practices: overfishing (depleting fish faster than reproduction), deforestation (cutting faster than regrowth), fossil fuel depletion"
            ]
          }
        ]
      },
      {
        "key": "climate_change",
        "name": "Climate Change",
        "short_description": "Understanding causes and effects of global climate change and potential solutions.",
        "sub_topics": [
          {
            "key": "greenhouse_effect",
            "name": "Greenhouse Effect and Global Warming",
            "short_description": "Learning how greenhouse gases trap heat in Earth's atmosphere.",
            "example_tasks": [
              "Explain greenhouse effect: sunlight reaches Earth → surface radiates heat → greenhouse gases (CO₂, methane, water vapor) trap heat → warms atmosphere",
              "Distinguish natural greenhouse effect (keeps Earth habitable) from enhanced greenhouse effect (human activities increase greenhouse gases, excess warming)",
              "Identify sources: burning fossil fuels (CO₂), agriculture (methane from livestock, rice paddies), deforestation (reduces CO₂ absorption)"
            ]
          },
          {
            "key": "evidence_for_climate_change",
            "name": "Evidence for Climate Change",
            "short_description": "Understanding data showing Earth's climate is changing.",
            "example_tasks": [
              "Identify evidence: rising global temperatures, melting glaciers and ice sheets, rising sea levels, ocean acidification, shifting species ranges, earlier spring events",
              "Interpret data: temperature graphs showing increase, CO₂ measurements from ice cores and Mauna Loa Observatory",
              "Explain ice core evidence: bubbles contain ancient atmosphere, show correlation between CO₂ and temperature over 800,000 years"
            ]
          },
          {
            "key": "climate_change_impacts",
            "name": "Impacts of Climate Change",
            "short_description": "Learning about effects on ecosystems, weather patterns, and human societies.",
            "example_tasks": [
              "Describe ecosystem impacts: coral bleaching, species extinctions, range shifts (species moving toward poles/higher elevations), phenology changes (timing of migration, flowering)",
              "Explain weather impacts: more extreme events (hurricanes, droughts, floods, heat waves), changing precipitation patterns",
              "Discuss human impacts: threats to food production, water scarcity, displacement of coastal populations, health risks (heat, disease spread)"
            ]
          },
          {
            "key": "climate_solutions",
            "name": "Addressing Climate Change",
            "short_description": "Understanding mitigation and adaptation strategies.",
            "example_tasks": [
              "Define mitigation: reducing greenhouse gas emissions (renewable energy, energy efficiency, electric vehicles, reducing deforestation, carbon capture)",
              "Define adaptation: adjusting to climate change effects (building sea walls, drought-resistant crops, changing agricultural practices)",
              "Discuss individual actions: reduce energy use, use public transportation, eat less meat, reduce waste, support climate policies"
            ]
          }
        ]
      },
      {
        "key": "pollution",
        "name": "Pollution",
        "short_description": "Understanding contamination of air, water, and land and its effects on organisms.",
        "sub_topics": [
          {
            "key": "air_pollution",
            "name": "Air Pollution",
            "short_description": "Learning about atmospheric contaminants and their health and environmental effects.",
            "example_tasks": [
              "Identify air pollutants: particulate matter (soot, smoke), carbon monoxide (incomplete combustion), sulfur dioxide (coal burning), nitrogen oxides (vehicle emissions), ozone (smog)",
              "Explain health effects: respiratory problems (asthma, bronchitis), cardiovascular disease, cancer, premature death",
              "Describe acid rain: sulfur and nitrogen oxides combine with water → sulfuric and nitric acid → damages forests, lakes, buildings"
            ]
          },
          {
            "key": "water_pollution",
            "name": "Water Pollution",
            "short_description": "Understanding contamination of surface and groundwater.",
            "example_tasks": [
              "Identify sources: point source (factory pipes, sewage treatment plants) vs nonpoint source (agricultural runoff, urban runoff - harder to control)",
              "List pollutants: sewage (bacteria, nutrients), chemicals (pesticides, industrial waste), sediment (erosion), heat (thermal pollution), plastics",
              "Explain eutrophication: excess nutrients (fertilizer runoff) → algal bloom → algae die → decomposition depletes oxygen → fish die (dead zone)"
            ]
          },
          {
            "key": "land_pollution_waste",
            "name": "Land Pollution and Waste",
            "short_description": "Learning about solid waste, hazardous materials, and landfills.",
            "example_tasks": [
              "Describe waste problems: landfills filling up, toxic chemicals leaching into groundwater, littering harms wildlife, plastic pollution persists for centuries",
              "Explain hazardous waste: toxic, flammable, corrosive, or radioactive materials requiring special handling (batteries, electronics, chemicals)",
              "Discuss reduce, reuse, recycle: reduce consumption and waste (most important), reuse items, recycle materials (saves resources and energy)"
            ]
          }
        ]
      },
      {
        "key": "habitat_loss_fragmentation",
        "name": "Habitat Loss and Fragmentation",
        "short_description": "Understanding how habitat destruction threatens biodiversity.",
        "sub_topics": [
          {
            "key": "deforestation",
            "name": "Deforestation",
            "short_description": "Learning about forest clearing and its ecological consequences.",
            "example_tasks": [
              "Identify causes: agriculture (cattle ranching, palm oil plantations), logging, development (roads, cities), mining",
              "Explain consequences: biodiversity loss (species extinctions), climate change (releases CO₂, reduces absorption), soil erosion, disrupts water cycle",
              "Describe tropical rainforest importance: highest biodiversity, stores carbon, produces oxygen, many undiscovered species and medicines"
            ]
          },
          {
            "key": "habitat_fragmentation",
            "name": "Habitat Fragmentation",
            "short_description": "Understanding how breaking habitats into small patches affects species.",
            "example_tasks": [
              "Explain fragmentation: large continuous habitat divided into smaller isolated patches by roads, agriculture, development",
              "Describe effects: smaller populations (increased inbreeding, extinction risk), edge effects (different conditions at edges), barriers to movement (gene flow reduced)",
              "Discuss wildlife corridors: connecting habitat patches allows animals to move between areas, increases genetic diversity, reduces extinction risk"
            ]
          },
          {
            "key": "habitat_restoration",
            "name": "Habitat Restoration",
            "short_description": "Learning about efforts to repair damaged ecosystems.",
            "example_tasks": [
              "Define restoration: returning ecosystem to pre-disturbance condition or improving degraded habitat",
              "Give examples: reforestation (planting trees), wetland restoration (removing drainage, replanting native plants), removing invasive species, dam removal (restore river flow)",
              "Discuss challenges: slow process, expensive, may not recover full original biodiversity, requires ongoing management"
            ]
          }
        ]
      },
      {
        "key": "conservation_strategies",
        "name": "Conservation Strategies",
        "short_description": "Understanding approaches to protecting biodiversity and ecosystems.",
        "sub_topics": [
          {
            "key": "protected_areas",
            "name": "Protected Areas",
            "short_description": "Learning about parks, reserves, and marine protected areas.",
            "example_tasks": [
              "Describe types: national parks (recreation and protection), wilderness areas (minimal human impact), wildlife refuges (protect specific species), marine reserves (protect ocean areas)",
              "Explain benefits: preserve biodiversity, protect endangered species, maintain ecosystem services, provide recreation and education",
              "Discuss limitations: not enough protected areas, many are small and isolated, illegal activities (poaching) still occur, need buffer zones and corridors"
            ]
          },
          {
            "key": "endangered_species_protection",
            "name": "Endangered Species Protection",
            "short_description": "Understanding laws and programs to prevent extinctions.",
            "example_tasks": [
              "Explain Endangered Species Act (U.S.): identifies threatened and endangered species, protects habitat, prohibits hunting/collecting, recovery plans",
              "Describe conservation strategies: captive breeding (California condor, black-footed ferret), reintroduction to wild, habitat protection, reducing threats",
              "Discuss success stories: bald eagle, gray whale, American alligator recovered from endangered status"
            ]
          },
          {
            "key": "sustainable_practices",
            "name": "Sustainable Practices",
            "short_description": "Learning about methods that meet human needs while protecting environment.",
            "example_tasks": [
              "Define sustainable agriculture: crop rotation, reduced pesticide/fertilizer use, organic farming, integrated pest management, agroforestry",
              "Describe sustainable fishing: catch limits, protecting breeding populations, avoiding bottom trawling, aquaculture (if managed properly)",
              "Explain sustainable forestry: selective cutting, replanting, protecting old-growth forests, certification programs (FSC label)"
            ]
          },
          {
            "key": "individual_actions",
            "name": "Individual and Community Actions",
            "short_description": "Understanding how personal choices contribute to conservation.",
            "example_tasks": [
              "List individual actions: reduce energy use, conserve water, reduce/reuse/recycle, eat sustainably, use public transportation, support conservation organizations",
              "Describe community actions: community gardens, habitat restoration projects, recycling programs, environmental education, advocacy for environmental policies",
              "Explain collective impact: individual choices add up, consumer demand drives business practices, voting supports environmental policies"
            ]
          }
        ]
      }
    ]
  }
]
