[
  {
    "key": "early_human_societies",
    "name": "Early Human Societies and the Agricultural Revolution",
    "short_description": "Students explore the transition from nomadic hunter-gatherer societies to settled agricultural communities, examining how the Neolithic Revolution transformed human civilization and led to the development of permanent settlements.",
    "sub_topics": [
      {
        "key": "paleolithic_era",
        "name": "Paleolithic Era and Hunter-Gatherers",
        "short_description": "Understanding the lifestyle, tools, and survival strategies of early humans during the Old Stone Age.",
        "sub_topics": [
          {
            "key": "hunter_gatherer_lifestyle",
            "name": "Hunter-Gatherer Lifestyle and Social Structure",
            "short_description": "Examining how early humans lived in small nomadic groups, their social organization, and survival methods.",
            "example_tasks": [
              "Describe three ways Paleolithic people obtained food and explain why they needed to move frequently",
              "Compare the daily life of a Paleolithic hunter-gatherer to your own daily life, identifying three major differences",
              "Analyze a cave painting from Lascaux, France, and explain what it reveals about Paleolithic culture and beliefs"
            ]
          },
          {
            "key": "paleolithic_tools_technology",
            "name": "Paleolithic Tools and Technology",
            "short_description": "Learning about stone tools, weapons, and technological innovations of early humans.",
            "example_tasks": [
              "Identify three types of Paleolithic tools and explain the purpose of each",
              "Explain how the development of fire changed human life during the Paleolithic era",
              "Create a timeline showing the progression of tool technology from simple stone tools to more complex implements"
            ]
          }
        ]
      },
      {
        "key": "neolithic_revolution",
        "name": "Neolithic Revolution and Agricultural Development",
        "short_description": "Analyzing the shift to agriculture and domestication of plants and animals, and its profound impact on human society.",
        "sub_topics": [
          {
            "key": "domestication_agriculture",
            "name": "Plant and Animal Domestication",
            "short_description": "Understanding how humans began to cultivate crops and domesticate animals for food and labor.",
            "example_tasks": [
              "Explain why the domestication of wheat and barley was significant for human civilization",
              "Compare the advantages and disadvantages of farming versus hunting and gathering",
              "Identify three animals domesticated during the Neolithic period and explain how each helped early farmers"
            ]
          },
          {
            "key": "permanent_settlements",
            "name": "Development of Permanent Settlements",
            "short_description": "Examining how agriculture enabled humans to establish permanent villages and towns.",
            "example_tasks": [
              "Describe three characteristics of Neolithic settlements like Çatalhöyük in Turkey",
              "Explain how permanent settlements led to population growth and new social structures",
              "Analyze archaeological evidence from a Neolithic village and draw conclusions about how people lived"
            ]
          },
          {
            "key": "social_changes_agriculture",
            "name": "Social and Economic Changes from Agriculture",
            "short_description": "Understanding how agriculture led to job specialization, social classes, and economic systems.",
            "example_tasks": [
              "Explain how surplus food production led to job specialization in Neolithic communities",
              "Describe how social inequality might have emerged in agricultural societies",
              "Create a diagram showing the relationship between agricultural surplus, population growth, and the development of specialized occupations"
            ]
          }
        ]
      },
      {
        "key": "characteristics_civilization",
        "name": "Characteristics of Civilization",
        "short_description": "Identifying and analyzing the key features that define a civilization, including cities, government, religion, writing, and art.",
        "sub_topics": [
          {
            "key": "eight_features_civilization",
            "name": "Eight Features of Civilization",
            "short_description": "Learning the defining characteristics that distinguish civilizations from simpler societies.",
            "example_tasks": [
              "List and define the eight key features of civilization (cities, organized government, complex religion, job specialization, social classes, arts and architecture, public works, writing)",
              "Explain why writing is considered essential for a society to be classified as a civilization",
              "Evaluate whether a specific ancient society qualifies as a civilization by examining which features it possessed"
            ]
          },
          {
            "key": "urban_development",
            "name": "Rise of Cities and Urban Centers",
            "short_description": "Understanding how and why the first cities emerged and their role in civilization development.",
            "example_tasks": [
              "Describe three reasons why cities developed in river valleys during the Bronze Age",
              "Compare a Neolithic village to an early city, identifying key differences in size, organization, and function",
              "Analyze the layout of an ancient city and explain how its design reflects the civilization's priorities and values"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "ancient_mesopotamia_egypt",
    "name": "Ancient Mesopotamia and Egypt",
    "short_description": "Students examine the rise of the world's first civilizations in the Fertile Crescent and Nile Valley, analyzing their governments, innovations, religious beliefs, and lasting contributions to human culture.",
    "sub_topics": [
      {
        "key": "mesopotamian_civilization",
        "name": "Mesopotamian Civilization and City-States",
        "short_description": "Exploring Sumer and other Mesopotamian societies between the Tigris and Euphrates rivers.",
        "sub_topics": [
          {
            "key": "sumerian_city_states",
            "name": "Sumerian City-States and Government",
            "short_description": "Understanding the political organization and governance of independent city-states like Ur and Uruk.",
            "example_tasks": [
              "Explain what a city-state is and why Mesopotamia was organized this way rather than as one unified country",
              "Describe the role of the lugal (king) in Sumerian city-states and how rulers claimed authority",
              "Compare and contrast two Mesopotamian city-states in terms of size, power, and cultural achievements"
            ]
          },
          {
            "key": "cuneiform_writing",
            "name": "Cuneiform Writing System",
            "short_description": "Learning about one of humanity's first writing systems and its importance for record-keeping and culture.",
            "example_tasks": [
              "Explain how cuneiform developed from pictographs to a more abstract writing system",
              "Describe three ways Mesopotamians used cuneiform writing in their daily lives and government",
              "Analyze a cuneiform tablet and identify what type of document it is (business record, law, story) based on context clues"
            ]
          },
          {
            "key": "mesopotamian_innovations",
            "name": "Mesopotamian Technological and Cultural Innovations",
            "short_description": "Examining key inventions including the wheel, irrigation, mathematics, and astronomy.",
            "example_tasks": [
              "Identify five major Mesopotamian innovations and explain how each improved daily life or trade",
              "Explain how Mesopotamian irrigation systems allowed agriculture to thrive in an arid climate",
              "Describe the Mesopotamian contributions to mathematics, including their base-60 number system that influences our time-keeping today"
            ]
          },
          {
            "key": "code_of_hammurabi",
            "name": "Code of Hammurabi and Law",
            "short_description": "Analyzing one of the earliest written law codes and its principles of justice.",
            "example_tasks": [
              "Explain the principle of 'an eye for an eye' in Hammurabi's Code and what it reveals about Babylonian values",
              "Analyze three specific laws from the Code of Hammurabi and determine whether they treated all people equally",
              "Compare Hammurabi's Code to modern American laws, identifying similarities and differences in how crimes are punished"
            ]
          }
        ]
      },
      {
        "key": "ancient_egypt",
        "name": "Ancient Egyptian Civilization",
        "short_description": "Studying the unified kingdom along the Nile River, its pharaohs, religious beliefs, and monumental achievements.",
        "sub_topics": [
          {
            "key": "geography_nile",
            "name": "Geography and the Nile River",
            "short_description": "Understanding how the Nile's predictable flooding enabled Egyptian civilization to flourish.",
            "example_tasks": [
              "Explain Herodotus's statement that 'Egypt is the gift of the Nile' using specific geographic evidence",
              "Describe how annual flooding of the Nile supported agriculture and why Egyptians could predict it",
              "Compare the challenges of farming in Egypt versus Mesopotamia based on their different river systems"
            ]
          },
          {
            "key": "pharaohs_government",
            "name": "Pharaohs and Egyptian Government",
            "short_description": "Examining the divine kingship of pharaohs and the structure of Egyptian bureaucracy.",
            "example_tasks": [
              "Explain why pharaohs were considered both political rulers and religious figures in ancient Egypt",
              "Describe the social pyramid of ancient Egypt, including the roles of pharaohs, priests, scribes, and farmers",
              "Analyze the accomplishments of a specific pharaoh (such as Hatshepsut, Ramses II, or Tutankhamun) and evaluate their impact on Egypt"
            ]
          },
          {
            "key": "egyptian_religion",
            "name": "Egyptian Religious Beliefs and Practices",
            "short_description": "Learning about polytheistic religion, gods and goddesses, and beliefs about the afterlife.",
            "example_tasks": [
              "Identify five major Egyptian gods (such as Ra, Osiris, Isis, Anubis, Horus) and explain their domains and importance",
              "Describe the Egyptian mummification process and explain why preserving the body was important for their religious beliefs",
              "Analyze passages from the Book of the Dead and explain what they reveal about Egyptian views of judgment and the afterlife"
            ]
          },
          {
            "key": "pyramids_monuments",
            "name": "Pyramids and Monumental Architecture",
            "short_description": "Examining the construction and purpose of pyramids, temples, and other massive structures.",
            "example_tasks": [
              "Explain the purpose of pyramids and why they were built as tombs for pharaohs",
              "Describe the engineering challenges of building the Great Pyramid of Giza and theories about construction methods",
              "Compare the Step Pyramid of Djoser to the Great Pyramid of Khufu, showing the evolution of pyramid design"
            ]
          },
          {
            "key": "hieroglyphic_writing",
            "name": "Hieroglyphic Writing and the Rosetta Stone",
            "short_description": "Understanding the Egyptian writing system and how it was deciphered in modern times.",
            "example_tasks": [
              "Describe the three types of symbols used in hieroglyphic writing (logograms, phonograms, determinatives)",
              "Explain how the Rosetta Stone helped scholars decipher hieroglyphics and why it was so important",
              "Write your name using hieroglyphic symbols and explain the process you used to translate it"
            ]
          }
        ]
      },
      {
        "key": "comparing_mesopotamia_egypt",
        "name": "Comparing Mesopotamian and Egyptian Civilizations",
        "short_description": "Analyzing similarities and differences between these two foundational river valley civilizations.",
        "sub_topics": [
          {
            "key": "political_differences",
            "name": "Political Organization Differences",
            "short_description": "Contrasting the city-state system of Mesopotamia with Egypt's unified kingdom.",
            "example_tasks": [
              "Compare the political organization of Mesopotamia (independent city-states) with Egypt (unified kingdom under pharaoh)",
              "Explain how geographic factors influenced whether these civilizations remained divided or united",
              "Evaluate which political system (city-states or unified kingdom) provided more stability and explain your reasoning"
            ]
          },
          {
            "key": "cultural_religious_differences",
            "name": "Cultural and Religious Comparisons",
            "short_description": "Examining different worldviews, religious practices, and cultural values between the civilizations.",
            "example_tasks": [
              "Compare Mesopotamian and Egyptian views of the afterlife and explain how geography influenced these beliefs",
              "Contrast the roles of priests and temples in Mesopotamia versus Egypt",
              "Analyze art and architecture from both civilizations to identify differences in aesthetic values and cultural priorities"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "ancient_greece",
    "name": "Ancient Greece",
    "short_description": "Students explore Greek city-states, the development of democracy in Athens, military society of Sparta, Persian and Peloponnesian Wars, Alexander the Great's conquests, and lasting Greek contributions to Western civilization in philosophy, arts, and science.",
    "sub_topics": [
      {
        "key": "greek_geography_city_states",
        "name": "Geography and the Greek City-States",
        "short_description": "Understanding how Greece's mountainous terrain led to the development of independent polis (city-states).",
        "sub_topics": [
          {
            "key": "geographic_influences",
            "name": "Geographic Influences on Greek Civilization",
            "short_description": "Analyzing how mountains, islands, and seas shaped Greek political and economic development.",
            "example_tasks": [
              "Explain how Greece's mountainous geography led to the development of independent city-states rather than one unified empire",
              "Describe three ways the Mediterranean Sea influenced Greek civilization, including trade and colonization",
              "Using a map, identify the locations of major Greek city-states and explain how their geographic positions affected their economies"
            ]
          },
          {
            "key": "polis_concept",
            "name": "The Polis and Greek Political Identity",
            "short_description": "Learning about the city-state as the fundamental political unit of Greek civilization.",
            "example_tasks": [
              "Define polis and explain its two main parts: the acropolis and agora",
              "Describe how Greeks identified primarily with their city-state rather than as 'Greeks,' using examples from Athens and Sparta",
              "Analyze why loyalty to one's polis was considered the highest civic virtue in ancient Greece"
            ]
          }
        ]
      },
      {
        "key": "athens_democracy",
        "name": "Athens and the Development of Democracy",
        "short_description": "Examining the evolution of Athenian government from monarchy through democracy, and the principles of citizen participation.",
        "sub_topics": [
          {
            "key": "athenian_democracy_development",
            "name": "Evolution of Athenian Democracy",
            "short_description": "Tracing the reforms of Solon, Cleisthenes, and Pericles that expanded democratic participation.",
            "example_tasks": [
              "Describe the reforms of Solon and explain how they addressed economic inequality in Athens",
              "Explain Cleisthenes' reorganization of Athens and why he is called the 'Father of Athenian Democracy'",
              "Analyze Pericles' statement that Athens is 'the school of Greece' and evaluate whether Athenian democracy lived up to this ideal"
            ]
          },
          {
            "key": "athenian_government_structure",
            "name": "Structure of Athenian Democratic Government",
            "short_description": "Understanding the Assembly, Council of 500, and courts, and how citizens participated directly.",
            "example_tasks": [
              "Describe the role and powers of the Athenian Assembly (Ecclesia) and explain who could participate",
              "Explain how the Council of 500 functioned and why Athenians used random selection (lottery) to choose members",
              "Compare Athenian direct democracy to American representative democracy, identifying three key differences"
            ]
          },
          {
            "key": "limits_athenian_democracy",
            "name": "Limitations and Exclusions in Athenian Democracy",
            "short_description": "Analyzing who was excluded from citizenship and democratic participation in Athens.",
            "example_tasks": [
              "Identify which groups were excluded from Athenian citizenship and political participation (women, slaves, foreigners)",
              "Calculate what percentage of Athens' population actually had democratic rights and explain your reasoning",
              "Evaluate whether ancient Athens should be considered a true democracy given its exclusion of most inhabitants"
            ]
          },
          {
            "key": "athenian_culture_golden_age",
            "name": "Athenian Golden Age and Cultural Achievements",
            "short_description": "Exploring Athens' cultural flourishing under Pericles, including art, architecture, and drama.",
            "example_tasks": [
              "Describe three major achievements of Athens during its Golden Age under Pericles",
              "Explain the significance of the Parthenon as both a religious temple and symbol of Athenian power",
              "Analyze how Athenian drama (tragedies and comedies) reflected democratic values and civic concerns"
            ]
          }
        ]
      },
      {
        "key": "sparta_military_society",
        "name": "Sparta and Military Society",
        "short_description": "Understanding Sparta's unique social system focused on military excellence, discipline, and state service.",
        "sub_topics": [
          {
            "key": "spartan_government_society",
            "name": "Spartan Government and Social Structure",
            "short_description": "Examining Sparta's oligarchic government and rigid social hierarchy.",
            "example_tasks": [
              "Describe Sparta's government structure, including the roles of two kings, the Council of Elders, and the Assembly",
              "Explain Sparta's social classes: Spartiates (full citizens), Perioeci (free non-citizens), and Helots (state-owned serfs)",
              "Analyze why Sparta maintained such a militaristic society, considering its need to control the helot population"
            ]
          },
          {
            "key": "spartan_education_training",
            "name": "Spartan Education and Military Training (Agoge)",
            "short_description": "Learning about the rigorous training system that shaped Spartan warriors from childhood.",
            "example_tasks": [
              "Describe the agoge system and explain how Spartan boys were trained from age 7 to become soldiers",
              "Compare the education of Spartan boys to Spartan girls, noting similarities and differences in physical training",
              "Evaluate the advantages and disadvantages of Sparta's educational system compared to Athens' focus on arts and philosophy"
            ]
          },
          {
            "key": "athens_sparta_comparison",
            "name": "Comparing Athens and Sparta",
            "short_description": "Contrasting the values, governments, and ways of life in Greece's two most powerful city-states.",
            "example_tasks": [
              "Create a comparison chart showing differences between Athens and Sparta in government, education, economy, and values",
              "Explain which city-state valued individual freedom more and which valued discipline and collective good",
              "Write a persuasive paragraph arguing whether you would prefer to live in Athens or Sparta, supporting your choice with specific evidence"
            ]
          }
        ]
      },
      {
        "key": "persian_wars",
        "name": "The Persian Wars",
        "short_description": "Analyzing the conflict between Greek city-states and the Persian Empire, including key battles and Greek unity.",
        "sub_topics": [
          {
            "key": "causes_persian_wars",
            "name": "Causes of the Persian Wars",
            "short_description": "Understanding why Persia attempted to conquer Greece and how the conflict began.",
            "example_tasks": [
              "Explain why the Ionian Revolt triggered Persian invasions of mainland Greece",
              "Describe Darius I's and Xerxes' motivations for attempting to conquer Greece",
              "Analyze how the Greek city-states' independence and Persian imperial expansion made conflict inevitable"
            ]
          },
          {
            "key": "major_battles_persian_wars",
            "name": "Major Battles of the Persian Wars",
            "short_description": "Examining key military engagements including Marathon, Thermopylae, Salamis, and Plataea.",
            "example_tasks": [
              "Describe the Battle of Marathon and explain how the outnumbered Athenians defeated the Persians",
              "Explain the significance of the Spartan stand at Thermopylae, including why it became legendary despite being a defeat",
              "Analyze how the Greek naval victory at Salamis proved decisive in the Persian Wars",
              "Create a timeline of the Persian Wars showing the major battles and their outcomes from 490-479 BCE"
            ]
          },
          {
            "key": "consequences_persian_wars",
            "name": "Consequences of the Persian Wars",
            "short_description": "Evaluating the impact of Greek victory on Athens' power and confidence.",
            "example_tasks": [
              "Explain how Athens emerged as the dominant Greek power after the Persian Wars",
              "Describe the formation of the Delian League and how it evolved into an Athenian empire",
              "Analyze how Greek victory over Persia influenced Greek confidence and cultural achievements during the Golden Age"
            ]
          }
        ]
      },
      {
        "key": "peloponnesian_war",
        "name": "The Peloponnesian War",
        "short_description": "Studying the devastating conflict between Athens and Sparta that weakened the Greek city-states.",
        "sub_topics": [
          {
            "key": "causes_peloponnesian_war",
            "name": "Causes and Outbreak of the Peloponnesian War",
            "short_description": "Understanding the rivalry between Athens and Sparta that led to war.",
            "example_tasks": [
              "Explain how Athens' growing power and control of the Delian League threatened Sparta",
              "Describe Thucydides' analysis of the 'real cause' of the war: Spartan fear of Athenian expansion",
              "Identify three specific incidents that escalated tensions and triggered the outbreak of war in 431 BCE"
            ]
          },
          {
            "key": "major_events_peloponnesian_war",
            "name": "Major Events and Turning Points",
            "short_description": "Examining key phases of the war and strategic decisions by both sides.",
            "example_tasks": [
              "Describe Pericles' strategy for Athens at the start of the war and why it ultimately failed",
              "Explain how the plague in Athens affected the course of the war and Athenian morale",
              "Analyze the disastrous Sicilian Expedition and its impact on Athens' ability to continue the war"
            ]
          },
          {
            "key": "outcomes_peloponnesian_war",
            "name": "Outcomes and Impact on Greece",
            "short_description": "Evaluating how the war weakened all Greek city-states and ended Athens' golden age.",
            "example_tasks": [
              "Describe the final defeat of Athens and the terms imposed by Sparta",
              "Explain how the Peloponnesian War weakened all Greek city-states, not just the losers",
              "Analyze whether the war had any 'winners' given the devastation it caused throughout Greece"
            ]
          }
        ]
      },
      {
        "key": "alexander_the_great",
        "name": "Alexander the Great and Hellenistic Culture",
        "short_description": "Examining Alexander's conquests, the spread of Greek culture, and the Hellenistic world that emerged.",
        "sub_topics": [
          {
            "key": "philip_macedon",
            "name": "Philip II of Macedon and Rise of Macedonia",
            "short_description": "Understanding how Macedonia unified Greece under its control.",
            "example_tasks": [
              "Explain how Philip II took advantage of Greek weakness after the Peloponnesian War",
              "Describe the military innovations Philip II introduced, including the Macedonian phalanx",
              "Analyze why Greek city-states failed to unite against the Macedonian threat until it was too late"
            ]
          },
          {
            "key": "alexander_conquests",
            "name": "Alexander's Military Campaigns",
            "short_description": "Tracing Alexander's conquest of the Persian Empire and expansion into Asia.",
            "example_tasks": [
              "Create a map showing the extent of Alexander's empire from Greece to India",
              "Describe three major battles (Granicus, Issus, Gaugamela) that enabled Alexander to defeat Persia",
              "Explain Alexander's military tactics and leadership qualities that made him so successful",
              "Analyze why Alexander's troops finally refused to march further east into India"
            ]
          },
          {
            "key": "hellenistic_culture",
            "name": "Hellenistic Culture and Legacy",
            "short_description": "Examining the blend of Greek and Eastern cultures that resulted from Alexander's conquests.",
            "example_tasks": [
              "Define 'Hellenistic' and explain how it differs from 'Hellenic' (classical Greek culture)",
              "Describe how Greek language and culture spread throughout Alexander's empire",
              "Analyze the cultural exchange between Greek and Eastern civilizations in Hellenistic cities like Alexandria, Egypt",
              "Explain how the division of Alexander's empire after his death affected the spread of Hellenistic culture"
            ]
          }
        ]
      },
      {
        "key": "greek_philosophy_science",
        "name": "Greek Philosophy and Scientific Thought",
        "short_description": "Exploring the contributions of Greek philosophers and scientists to Western intellectual tradition.",
        "sub_topics": [
          {
            "key": "socrates_plato_aristotle",
            "name": "The Great Greek Philosophers",
            "short_description": "Learning about Socrates, Plato, and Aristotle and their philosophical methods and ideas.",
            "example_tasks": [
              "Describe the Socratic Method and explain how Socrates used questioning to help people examine their beliefs",
              "Explain Plato's Theory of Forms and his vision of the ideal state in 'The Republic'",
              "Describe Aristotle's contributions to logic, science, and ethics, and explain why his works influenced thinking for centuries",
              "Compare the philosophical approaches of Socrates, Plato, and Aristotle, showing how each built on the previous thinker"
            ]
          },
          {
            "key": "greek_science_mathematics",
            "name": "Greek Contributions to Science and Mathematics",
            "short_description": "Examining advances in mathematics, astronomy, medicine, and scientific thinking.",
            "example_tasks": [
              "Describe Pythagoras' contributions to mathematics and explain the Pythagorean theorem",
              "Explain Hippocrates' approach to medicine and why he is called the 'Father of Medicine'",
              "Describe how Greek scientists like Aristarchus and Eratosthenes advanced understanding of astronomy and geography",
              "Analyze how the Greek emphasis on reason and observation laid foundations for modern scientific method"
            ]
          }
        ]
      },
      {
        "key": "greek_art_literature",
        "name": "Greek Art, Architecture, and Literature",
        "short_description": "Understanding Greek achievements in drama, epic poetry, architecture, and sculpture that influenced Western culture.",
        "sub_topics": [
          {
            "key": "greek_architecture",
            "name": "Greek Architecture and Sculpture",
            "short_description": "Examining architectural orders, temples, and idealized human form in sculpture.",
            "example_tasks": [
              "Identify and describe the three classical Greek architectural orders: Doric, Ionic, and Corinthian",
              "Explain the key features of Greek temples using the Parthenon as an example",
              "Analyze how Greek sculptors portrayed the idealized human form and why this was significant",
              "Describe how Greek architectural styles influenced later civilizations, including Rome and modern America"
            ]
          },
          {
            "key": "greek_drama_literature",
            "name": "Greek Drama and Epic Poetry",
            "short_description": "Learning about Greek theatrical traditions and epic poems like the Iliad and Odyssey.",
            "example_tasks": [
              "Explain the characteristics of Greek tragedy and comedy, including the use of masks and choruses",
              "Describe the themes explored in Homer's Iliad and Odyssey and their importance to Greek culture",
              "Analyze a scene from a Greek tragedy (such as Sophocles' Antigone or Oedipus Rex) to identify the moral dilemma presented",
              "Explain how Greek drama addressed civic issues and helped Athenian citizens think about justice and morality"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "ancient_rome",
    "name": "Ancient Rome",
    "short_description": "Students analyze the rise of Rome from republic to empire, Roman government and law, military expansion, cultural achievements, the spread of Christianity, and the eventual decline and fall of the Western Roman Empire.",
    "sub_topics": [
      {
        "key": "roman_republic",
        "name": "The Roman Republic",
        "short_description": "Understanding the establishment and structure of the Roman Republic, including its government, social classes, and expansion.",
        "sub_topics": [
          {
            "key": "founding_legends",
            "name": "Founding of Rome and Early Legends",
            "short_description": "Learning about Rome's legendary founding and transition from monarchy to republic.",
            "example_tasks": [
              "Retell the legend of Romulus and Remus and explain what it reveals about Roman values",
              "Explain why Romans overthrew their last king and established a republic in 509 BCE",
              "Describe the geographic advantages of Rome's location on the Tiber River and seven hills"
            ]
          },
          {
            "key": "republican_government",
            "name": "Structure of Republican Government",
            "short_description": "Examining the checks and balances in Roman government, including consuls, Senate, and assemblies.",
            "example_tasks": [
              "Describe the powers and limitations of Roman consuls and explain why there were two rather than one",
              "Explain the role of the Roman Senate and which social class dominated it",
              "Analyze how the Roman Republic's system of checks and balances prevented any one person from gaining too much power",
              "Compare the Roman Republic's government structure to the United States government, identifying similarities and differences"
            ]
          },
          {
            "key": "patricians_plebeians",
            "name": "Patricians and Plebeians: Social Conflict",
            "short_description": "Understanding class struggles and the gradual expansion of plebeian political rights.",
            "example_tasks": [
              "Compare the rights and privileges of patricians versus plebeians in early Republican Rome",
              "Describe the Conflict of the Orders and explain how plebeians gained political power over time",
              "Explain the importance of the Twelve Tables as Rome's first written law code and why plebeians demanded it",
              "Analyze the role of tribunes in protecting plebeian interests and their power of veto"
            ]
          },
          {
            "key": "roman_expansion_republic",
            "name": "Roman Military Expansion During the Republic",
            "short_description": "Tracing Rome's conquest of Italy and the Mediterranean world.",
            "example_tasks": [
              "Describe how Rome gradually conquered the Italian peninsula through military force and alliances",
              "Explain the causes and outcomes of the Punic Wars between Rome and Carthage",
              "Analyze Hannibal's invasion of Italy during the Second Punic War and why he ultimately failed",
              "Create a map showing the expansion of Roman territory from 500 BCE to 100 BCE"
            ]
          }
        ]
      },
      {
        "key": "crisis_and_transformation",
        "name": "Crisis of the Republic and Rise of Julius Caesar",
        "short_description": "Examining the social, economic, and political problems that destabilized the Republic and led to dictatorship.",
        "sub_topics": [
          {
            "key": "problems_late_republic",
            "name": "Problems of the Late Republic",
            "short_description": "Understanding economic inequality, military reforms, and political corruption that weakened republican government.",
            "example_tasks": [
              "Describe the economic problems caused by Rome's expansion, including the growth of latifundia (large estates) and displacement of small farmers",
              "Explain the reforms of the Gracchus brothers and why they were assassinated by Senate conservatives",
              "Analyze how Marius' military reforms changed the Roman army and soldiers' loyalty from the Republic to individual generals"
            ]
          },
          {
            "key": "julius_caesar",
            "name": "Julius Caesar and the End of the Republic",
            "short_description": "Analyzing Caesar's rise to power, dictatorship, and assassination.",
            "example_tasks": [
              "Describe the First Triumvirate and how Caesar, Pompey, and Crassus cooperated to gain power",
              "Explain Caesar's conquest of Gaul and how it increased his popularity and military strength",
              "Analyze the significance of Caesar crossing the Rubicon River and saying 'the die is cast'",
              "Describe the reasons conspirators gave for assassinating Caesar on the Ides of March (March 15, 44 BCE)",
              "Evaluate whether Caesar's assassination saved the Republic or ensured its destruction"
            ]
          }
        ]
      },
      {
        "key": "roman_empire",
        "name": "The Roman Empire",
        "short_description": "Studying the establishment of imperial rule under Augustus, Pax Romana, and the expansion and administration of the empire.",
        "sub_topics": [
          {
            "key": "augustus_principate",
            "name": "Augustus and the Foundation of the Empire",
            "short_description": "Understanding how Octavian became Augustus and transformed Rome into an empire while maintaining republican appearances.",
            "example_tasks": [
              "Explain how Octavian defeated Mark Antony and Cleopatra to become sole ruler of Rome",
              "Describe how Augustus maintained the appearance of republican government while holding real power",
              "Analyze the title 'Augustus' and other honors bestowed on Octavian and what they signified",
              "Evaluate Augustus' claim that he 'restored the Republic' - was this accurate or propaganda?"
            ]
          },
          {
            "key": "pax_romana",
            "name": "Pax Romana and Imperial Administration",
            "short_description": "Examining the period of relative peace and prosperity during the first two centuries of empire.",
            "example_tasks": [
              "Define Pax Romana and explain what made this two-century period relatively peaceful and stable",
              "Describe how Roman emperors governed such a vast empire, including the role of provincial governors and the military",
              "Explain the importance of Roman roads, aqueducts, and other infrastructure in maintaining the empire",
              "Analyze the benefits and costs of Pax Romana for conquered peoples living under Roman rule"
            ]
          },
          {
            "key": "roman_emperors",
            "name": "Notable Roman Emperors",
            "short_description": "Learning about significant emperors and their contributions or failures.",
            "example_tasks": [
              "Compare the rules of the 'Five Good Emperors' (Nerva, Trajan, Hadrian, Antoninus Pius, Marcus Aurelius) to earlier or later emperors",
              "Describe the reign of Nero and why he is remembered as one of Rome's worst emperors",
              "Explain Hadrian's Wall and what it reveals about Roman defensive strategy in Britain",
              "Analyze the challenges Marcus Aurelius faced, including wars and plague, despite being a philosopher-emperor"
            ]
          }
        ]
      },
      {
        "key": "roman_culture_achievements",
        "name": "Roman Culture and Achievements",
        "short_description": "Exploring Roman contributions to law, engineering, architecture, literature, and language that influenced Western civilization.",
        "sub_topics": [
          {
            "key": "roman_law",
            "name": "Roman Law and Legal Principles",
            "short_description": "Understanding the development of Roman law and its lasting influence on modern legal systems.",
            "example_tasks": [
              "Explain the concept of 'innocent until proven guilty' and other Roman legal principles still used today",
              "Describe the difference between civil law (for citizens) and the law of nations (for all people)",
              "Analyze how the Twelve Tables, Republic law, and later imperial law evolved over time",
              "Identify three principles from Roman law that influenced the American legal system"
            ]
          },
          {
            "key": "roman_engineering_architecture",
            "name": "Roman Engineering and Architecture",
            "short_description": "Examining Roman innovations in construction, including arches, domes, concrete, and monumental buildings.",
            "example_tasks": [
              "Explain how Romans used arches, vaults, and concrete to build massive structures like the Colosseum and Pantheon",
              "Describe the Roman aqueduct system and why it was an engineering marvel",
              "Analyze the architectural features of the Pantheon's dome and explain why it remains impressive today",
              "Compare Roman architecture (focusing on engineering and practicality) to Greek architecture (focusing on beauty and proportion)"
            ]
          },
          {
            "key": "roman_literature_language",
            "name": "Roman Literature and Latin Language",
            "short_description": "Learning about Roman writers, poets, and the spread of Latin throughout the empire.",
            "example_tasks": [
              "Identify major Roman writers (Virgil, Ovid, Cicero, Caesar) and describe their most famous works",
              "Explain how Virgil's Aeneid served as Roman national epic and promoted Augustus' rule",
              "Describe how Latin became the common language of the western Roman Empire",
              "Analyze how Latin evolved into modern Romance languages (Italian, French, Spanish, Portuguese, Romanian)"
            ]
          },
          {
            "key": "daily_life_rome",
            "name": "Daily Life in Ancient Rome",
            "short_description": "Understanding social structure, family life, entertainment, and living conditions in Roman society.",
            "example_tasks": [
              "Describe the structure of a typical Roman family, including the authority of the paterfamilias",
              "Explain the different types of entertainment Romans enjoyed, including gladiatorial games, chariot races, and theater",
              "Compare the living conditions of wealthy Romans (living in domus or villas) versus poor Romans (living in insulae)",
              "Analyze the role of slavery in Roman society and the economy"
            ]
          }
        ]
      },
      {
        "key": "rise_of_christianity",
        "name": "Rise of Christianity in the Roman Empire",
        "short_description": "Examining the origins of Christianity, its spread through the empire, periods of persecution, and eventual acceptance.",
        "sub_topics": [
          {
            "key": "origins_christianity",
            "name": "Origins of Christianity and Jesus of Nazareth",
            "short_description": "Understanding the life and teachings of Jesus in the context of Roman-controlled Judea.",
            "example_tasks": [
              "Describe the political and religious situation in Judea during Jesus' lifetime",
              "Explain the central teachings of Jesus as recorded in the Gospels",
              "Analyze why Jesus was crucified by Roman authorities around 30 CE",
              "Describe how Jesus' followers came to believe in his resurrection and began spreading his message"
            ]
          },
          {
            "key": "spread_christianity",
            "name": "Spread of Christianity Through the Empire",
            "short_description": "Learning how Christianity expanded from a small Jewish sect to a major religion across the Roman world.",
            "example_tasks": [
              "Describe Paul's role in spreading Christianity to gentiles (non-Jews) throughout the Roman Empire",
              "Explain why Christianity appealed to many people in the Roman Empire, including slaves and women",
              "Analyze how Roman roads, common language (Latin and Greek), and Pax Romana facilitated the spread of Christianity",
              "Create a map showing the spread of Christianity from Jerusalem throughout the Mediterranean world by 300 CE"
            ]
          },
          {
            "key": "persecution_to_acceptance",
            "name": "Christian Persecution and Constantine's Conversion",
            "short_description": "Understanding why Christians were persecuted and how Christianity became the empire's official religion.",
            "example_tasks": [
              "Explain why Roman authorities persecuted Christians, including their refusal to worship Roman gods and the emperor",
              "Describe the persecution under emperors like Nero and Diocletian",
              "Explain Constantine's conversion to Christianity and the Edict of Milan (313 CE) that granted religious tolerance",
              "Analyze how Christianity changed after Theodosius made it the official Roman religion in 380 CE"
            ]
          }
        ]
      },
      {
        "key": "decline_fall_rome",
        "name": "Decline and Fall of the Western Roman Empire",
        "short_description": "Analyzing the multiple factors that contributed to the weakening and eventual collapse of the Western Roman Empire in 476 CE.",
        "sub_topics": [
          {
            "key": "internal_problems",
            "name": "Internal Problems Weakening the Empire",
            "short_description": "Examining political instability, economic troubles, and social decay within the empire.",
            "example_tasks": [
              "Describe the political instability of the third century, when numerous emperors were assassinated by their own armies",
              "Explain the economic problems facing the late empire, including inflation, high taxes, and disrupted trade",
              "Analyze how the division of the empire into Eastern and Western halves affected its ability to defend itself",
              "Describe the decline of civic virtue and military discipline compared to earlier Roman periods"
            ]
          },
          {
            "key": "external_invasions",
            "name": "Germanic Invasions and Barbarian Migrations",
            "short_description": "Understanding how Germanic tribes and other groups crossed Roman borders and eventually established kingdoms.",
            "example_tasks": [
              "Explain why Germanic tribes began migrating into Roman territory, including pressure from the Huns",
              "Describe major invasions, including the Visigoths' sack of Rome in 410 CE and the Vandals' sack in 455 CE",
              "Analyze the Battle of Adrianople (378 CE) and its significance in showing Rome's military weakness",
              "Explain how Odoacer's deposition of the last Western Roman emperor Romulus Augustulus in 476 CE marked the traditional end of the Western Empire"
            ]
          },
          {
            "key": "multiple_causes_fall",
            "name": "Evaluating Multiple Causes of Rome's Fall",
            "short_description": "Analyzing and weighing various factors historians identify as contributing to Rome's decline.",
            "example_tasks": [
              "Create a chart listing internal and external factors that contributed to Rome's fall and evaluate which were most significant",
              "Explain why the Eastern Roman (Byzantine) Empire survived while the Western Empire fell",
              "Analyze different historical interpretations of Rome's fall (military defeat, economic collapse, moral decay, disease)",
              "Write an argument defending which factor you believe was most important in causing Rome's fall, supporting your claim with evidence"
            ]
          },
          {
            "key": "roman_legacy",
            "name": "Roman Legacy and Influence on Western Civilization",
            "short_description": "Understanding how Roman achievements continued to influence Europe and the world after the empire's fall.",
            "example_tasks": [
              "Identify five lasting Roman contributions to Western civilization (law, language, architecture, engineering, government)",
              "Explain how the Roman Catholic Church preserved Roman culture and learning during the Middle Ages",
              "Describe examples of Roman influence in American government, architecture, and language",
              "Analyze the concept of the 'fall' of Rome - did Roman civilization truly end in 476 CE or continue in modified forms?"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "ancient_asia",
    "name": "Ancient Asian Civilizations",
    "short_description": "Students explore the development of major civilizations in China and India, examining their philosophies, religions, political systems, cultural achievements, and lasting influences on Asian and world history.",
    "sub_topics": [
      {
        "key": "ancient_china",
        "name": "Ancient China and Dynastic Cycles",
        "short_description": "Understanding Chinese dynasties, philosophical traditions, and innovations from the Shang through the Han dynasty.",
        "sub_topics": [
          {
            "key": "early_chinese_dynasties",
            "name": "Early Chinese Dynasties: Shang and Zhou",
            "short_description": "Learning about the first documented Chinese dynasties and the concept of the Mandate of Heaven.",
            "example_tasks": [
              "Describe the Shang Dynasty's achievements, including bronze casting and oracle bones for divination",
              "Explain the concept of the Mandate of Heaven and how it justified dynastic change in China",
              "Analyze how the Zhou Dynasty's feudal system organized Chinese society",
              "Compare the Mandate of Heaven to the divine right of kings in European monarchies"
            ]
          },
          {
            "key": "confucianism_daoism",
            "name": "Chinese Philosophy: Confucianism and Daoism",
            "short_description": "Examining the teachings of Confucius and Laozi and their influence on Chinese culture and government.",
            "example_tasks": [
              "Explain Confucius' teachings about proper relationships, filial piety, and social harmony",
              "Describe the Daoist philosophy of living in harmony with nature and the concept of the Dao (the Way)",
              "Compare Confucian emphasis on social order and duty to Daoist emphasis on spontaneity and simplicity",
              "Analyze how Confucianism became the basis for Chinese government and education for over 2,000 years",
              "Explain the concept of yin and yang and its importance in Chinese thought"
            ]
          },
          {
            "key": "qin_dynasty",
            "name": "Qin Dynasty and Unification of China",
            "short_description": "Understanding how the Qin Dynasty unified China through legalism and standardization.",
            "example_tasks": [
              "Describe how Qin Shi Huangdi unified China by conquering rival states during the Warring States period",
              "Explain the legalist philosophy adopted by the Qin Dynasty and how it differed from Confucianism",
              "Analyze the standardization policies of the Qin (unified writing, currency, weights and measures, roads)",
              "Describe the construction of the Great Wall of China and the human cost involved",
              "Explain why the Qin Dynasty was so short-lived despite its achievements in unification"
            ]
          },
          {
            "key": "han_dynasty",
            "name": "Han Dynasty and Chinese Golden Age",
            "short_description": "Examining the long-lasting Han Dynasty and its cultural and technological achievements.",
            "example_tasks": [
              "Describe how the Han Dynasty established a stable government that lasted over 400 years",
              "Explain the civil service examination system and how it selected government officials based on Confucian learning",
              "Identify major Han Dynasty inventions and innovations (paper, the seismograph, improved iron tools, the wheelbarrow)",
              "Describe the Silk Road and its importance in connecting China to Central Asia, India, and Rome",
              "Analyze why the Han Dynasty is considered a golden age of Chinese civilization"
            ]
          },
          {
            "key": "chinese_achievements",
            "name": "Ancient Chinese Cultural and Technological Achievements",
            "short_description": "Understanding Chinese contributions to art, science, technology, and philosophy.",
            "example_tasks": [
              "Describe Chinese achievements in art, including silk weaving, jade carving, and landscape painting",
              "Explain Chinese innovations in technology that influenced the world (paper, gunpowder, compass, printing)",
              "Analyze Chinese traditional medicine and its different approach from Western medicine",
              "Compare Chinese writing system (logographic characters) to alphabetic writing systems"
            ]
          }
        ]
      },
      {
        "key": "ancient_india",
        "name": "Ancient Indian Civilizations and Religions",
        "short_description": "Exploring the Indus Valley civilization, the development of Hinduism and Buddhism, and the major Indian empires.",
        "sub_topics": [
          {
            "key": "indus_valley_civilization",
            "name": "Indus Valley Civilization",
            "short_description": "Learning about one of the world's earliest urban civilizations and its sophisticated planning.",
            "example_tasks": [
              "Describe the major cities of the Indus Valley civilization, including Mohenjo-Daro and Harappa",
              "Explain the evidence of urban planning found in Indus Valley cities (grid patterns, sewage systems, standardized bricks)",
              "Analyze why the Indus Valley civilization declined and eventually disappeared around 1900 BCE",
              "Compare the Indus Valley civilization to Mesopotamia and Egypt in terms of urban development"
            ]
          },
          {
            "key": "hinduism_development",
            "name": "Development of Hinduism",
            "short_description": "Understanding the beliefs, practices, and social structure of Hinduism.",
            "example_tasks": [
              "Explain the core Hindu beliefs in Brahman (universal spirit), dharma (duty), karma (actions and consequences), and reincarnation",
              "Describe the Hindu caste system (varnas) and how it organized Indian society",
              "Identify major Hindu deities (Brahma, Vishnu, Shiva) and their roles",
              "Analyze how the concept of karma and dharma influenced behavior in Hindu society",
              "Explain the goals of Hindu life: dharma, artha (wealth), kama (pleasure), and moksha (liberation)"
            ]
          },
          {
            "key": "buddhism_origins",
            "name": "Buddhism: Life and Teachings of the Buddha",
            "short_description": "Learning about Siddhartha Gautama and the fundamental teachings of Buddhism.",
            "example_tasks": [
              "Describe Siddhartha Gautama's life story and his journey from prince to enlightened Buddha",
              "Explain the Four Noble Truths that form the foundation of Buddhist teaching",
              "Describe the Eightfold Path as the Buddhist way to end suffering and achieve enlightenment",
              "Compare Buddhist rejection of the caste system to Hinduism's acceptance of it",
              "Analyze how Buddhism spread beyond India to other parts of Asia"
            ]
          },
          {
            "key": "mauryan_empire",
            "name": "Mauryan Empire and Ashoka",
            "short_description": "Examining India's first major empire and Emperor Ashoka's conversion to Buddhism.",
            "example_tasks": [
              "Describe how Chandragupta Maurya unified much of India into the first major Indian empire",
              "Explain Emperor Ashoka's conversion to Buddhism after witnessing the horrors of war",
              "Analyze Ashoka's edicts and policies that promoted Buddhist values like nonviolence and religious tolerance",
              "Evaluate Ashoka's reign as an example of how religious beliefs can influence political leadership"
            ]
          },
          {
            "key": "gupta_empire",
            "name": "Gupta Empire: India's Golden Age",
            "short_description": "Understanding the cultural and scientific achievements during India's classical period.",
            "example_tasks": [
              "Describe why the Gupta period is called India's golden age of culture and learning",
              "Identify major achievements in mathematics during the Gupta period (concept of zero, decimal system, pi calculation)",
              "Explain Gupta advances in astronomy, medicine, and metallurgy",
              "Describe the flowering of Sanskrit literature and Hindu art during the Gupta era",
              "Analyze how Gupta mathematical innovations influenced the development of mathematics worldwide"
            ]
          }
        ]
      },
      {
        "key": "silk_road_cultural_exchange",
        "name": "The Silk Road and Cultural Exchange",
        "short_description": "Understanding the trade networks connecting Asia, the Middle East, and Europe, and the exchange of goods, ideas, and religions.",
        "sub_topics": [
          {
            "key": "silk_road_routes",
            "name": "Silk Road Trade Routes and Commerce",
            "short_description": "Learning about the network of trade routes and the goods exchanged between civilizations.",
            "example_tasks": [
              "Describe the main routes of the Silk Road connecting China to the Mediterranean world",
              "Identify major goods traded along the Silk Road from China (silk, porcelain, tea, paper) and goods coming to China (gold, silver, precious stones, horses)",
              "Explain the role of Central Asian intermediaries in Silk Road trade",
              "Analyze how the Silk Road connected the major civilizations of the ancient world"
            ]
          },
          {
            "key": "cultural_diffusion_silk_road",
            "name": "Cultural and Religious Exchange",
            "short_description": "Understanding how ideas, religions, and technologies spread along trade routes.",
            "example_tasks": [
              "Describe how Buddhism spread from India to Central Asia, China, Korea, and Japan along the Silk Road",
              "Explain the diffusion of technologies like papermaking and gunpowder from China westward",
              "Analyze how the Silk Road facilitated cultural exchange between East and West",
              "Evaluate the statement that 'ideas traveled farther than goods' along the Silk Road"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "medieval_europe",
    "name": "Medieval Europe and Feudalism",
    "short_description": "Students examine the political, economic, and social structure of medieval European society, including the feudal system, the role of the Catholic Church, the Crusades, and the impact of the Black Death on European civilization.",
    "sub_topics": [
      {
        "key": "fall_rome_early_middle_ages",
        "name": "Fall of Rome and the Early Middle Ages",
        "short_description": "Understanding the transition from Roman civilization to medieval Europe and the role of Germanic kingdoms.",
        "sub_topics": [
          {
            "key": "germanic_kingdoms",
            "name": "Germanic Kingdoms and Charlemagne",
            "short_description": "Learning about the Franks and Charlemagne's attempt to revive the Roman Empire.",
            "example_tasks": [
              "Describe how Germanic tribes established kingdoms in former Roman territories after 476 CE",
              "Explain Charlemagne's achievements in uniting much of Western Europe and his coronation as Roman Emperor in 800 CE",
              "Analyze the Treaty of Verdun (843 CE) and how it divided Charlemagne's empire among his grandsons",
              "Evaluate Charlemagne's efforts to promote education and preserve classical learning during the Carolingian Renaissance"
            ]
          },
          {
            "key": "viking_magyar_muslim_invasions",
            "name": "Viking, Magyar, and Muslim Invasions",
            "short_description": "Understanding the threats and instability that led to the development of feudalism.",
            "example_tasks": [
              "Describe the Viking raids on European coastal areas and monasteries from the 800s to 1000s",
              "Explain how Magyar invasions from the east threatened central Europe",
              "Analyze how Muslim control of the Mediterranean disrupted trade and contributed to European isolation",
              "Evaluate how these invasions weakened centralized authority and led people to seek local protection"
            ]
          }
        ]
      },
      {
        "key": "feudal_system",
        "name": "The Feudal System",
        "short_description": "Examining the political, economic, and social structure that organized medieval society through reciprocal obligations.",
        "sub_topics": [
          {
            "key": "feudal_hierarchy",
            "name": "Feudal Hierarchy and Relationships",
            "short_description": "Understanding the lord-vassal relationship and the exchange of land for military service.",
            "example_tasks": [
              "Describe the feudal hierarchy from king to nobles to knights to peasants",
              "Explain the mutual obligations between lords and vassals in the feudal contract",
              "Define important feudal terms: fief (land grant), homage (ceremony of loyalty), fealty (oath of faithfulness)",
              "Analyze why feudalism developed as a response to the lack of strong central government",
              "Create a diagram showing the feudal pyramid and the exchange of land for loyalty and military service"
            ]
          },
          {
            "key": "manorialism",
            "name": "Manorialism and the Medieval Economy",
            "short_description": "Learning about the self-sufficient manor as the basic economic unit of medieval society.",
            "example_tasks": [
              "Describe the layout and organization of a typical medieval manor",
              "Explain the difference between feudalism (political/military system) and manorialism (economic system)",
              "Compare the lives and obligations of serfs versus free peasants on the manor",
              "Analyze why the manorial system was largely self-sufficient with little trade beyond the manor"
            ]
          },
          {
            "key": "knights_chivalry",
            "name": "Knights and the Code of Chivalry",
            "short_description": "Understanding the role of knights in medieval society and their code of conduct.",
            "example_tasks": [
              "Describe the training process for becoming a knight (page, squire, knight)",
              "Explain the ideals of chivalry and how knights were expected to behave toward nobles, the Church, and ladies",
              "Analyze the contrast between chivalric ideals and the actual violent behavior of many knights",
              "Describe medieval tournaments and their role in training knights and displaying martial skills"
            ]
          }
        ]
      },
      {
        "key": "medieval_church",
        "name": "The Catholic Church in Medieval Life",
        "short_description": "Examining the dominant role of the Church in medieval European religion, politics, education, and daily life.",
        "sub_topics": [
          {
            "key": "church_authority",
            "name": "Church Authority and Organization",
            "short_description": "Understanding the hierarchical structure of the Church and the power of the Pope.",
            "example_tasks": [
              "Describe the hierarchy of the Catholic Church from Pope to cardinals, bishops, and parish priests",
              "Explain how the Church influenced political affairs and sometimes clashed with kings over authority",
              "Analyze the conflict between Pope Gregory VII and Holy Roman Emperor Henry IV over lay investiture",
              "Describe the significance of excommunication and interdict as weapons the Church used against rulers"
            ]
          },
          {
            "key": "monasticism",
            "name": "Monasticism and Religious Life",
            "short_description": "Learning about monks, nuns, and their role in preserving knowledge and providing services.",
            "example_tasks": [
              "Describe the daily life of monks and nuns following the Rule of Saint Benedict",
              "Explain how monasteries preserved classical learning by copying manuscripts",
              "Analyze the various services monasteries provided to medieval society (schools, hospitals, food for travelers)",
              "Compare the contemplative life of monks to the active life of friars like the Franciscans and Dominicans"
            ]
          },
          {
            "key": "church_daily_life",
            "name": "The Church in Daily Medieval Life",
            "short_description": "Understanding how religion shaped every aspect of medieval people's lives.",
            "example_tasks": [
              "Describe the seven sacraments and their importance in a medieval Christian's life from birth to death",
              "Explain why the parish church was the center of village life in medieval Europe",
              "Analyze how Christian beliefs about sin, salvation, and the afterlife influenced medieval behavior",
              "Describe the role of saints, relics, and pilgrimages in medieval religious practice"
            ]
          }
        ]
      },
      {
        "key": "crusades",
        "name": "The Crusades",
        "short_description": "Analyzing the religious wars between Christians and Muslims for control of the Holy Land and their impact on Europe and the Middle East.",
        "sub_topics": [
          {
            "key": "causes_first_crusade",
            "name": "Causes and the First Crusade",
            "short_description": "Understanding why Europeans launched military expeditions to reclaim Jerusalem.",
            "example_tasks": [
              "Explain Pope Urban II's call for crusade in 1095 and the religious motivations he emphasized",
              "Describe additional motivations for joining the crusades (desire for land, wealth, adventure, forgiveness of sins)",
              "Analyze the success of the First Crusade in capturing Jerusalem in 1099",
              "Describe the establishment of Crusader States in the Middle East"
            ]
          },
          {
            "key": "later_crusades",
            "name": "Later Crusades and Outcomes",
            "short_description": "Examining subsequent crusades and the eventual Muslim reconquest of the Holy Land.",
            "example_tasks": [
              "Describe the Third Crusade and the conflict between Richard the Lionheart and Saladin",
              "Explain how the Fourth Crusade was diverted to attack Constantinople instead of Muslim territories",
              "Analyze why the crusades ultimately failed to maintain Christian control of the Holy Land",
              "Evaluate the Children's Crusade and what it reveals about crusading fervor"
            ]
          },
          {
            "key": "crusades_impact",
            "name": "Impact and Legacy of the Crusades",
            "short_description": "Understanding the long-term effects of the crusades on Europe, the Middle East, and Christian-Muslim relations.",
            "example_tasks": [
              "Describe how the crusades increased European contact with Byzantine and Islamic civilizations",
              "Explain how the crusades stimulated trade between Europe and the East",
              "Analyze the negative impacts of the crusades, including massacres, destruction, and lasting religious animosity",
              "Evaluate how the crusades strengthened the power of kings at the expense of feudal nobles",
              "Discuss how the crusades are remembered differently in Western and Islamic historical traditions"
            ]
          }
        ]
      },
      {
        "key": "medieval_culture_learning",
        "name": "Medieval Culture and Learning",
        "short_description": "Exploring intellectual life, education, architecture, and cultural achievements of the Middle Ages.",
        "sub_topics": [
          {
            "key": "medieval_universities",
            "name": "Rise of Universities and Scholasticism",
            "short_description": "Understanding the development of higher education and philosophical thought.",
            "example_tasks": [
              "Describe the establishment of medieval universities like Bologna, Paris, and Oxford",
              "Explain what students studied in medieval universities (trivium and quadrivium, theology, law, medicine)",
              "Define scholasticism and its attempt to reconcile faith and reason",
              "Analyze Thomas Aquinas's contributions to medieval philosophy and theology"
            ]
          },
          {
            "key": "gothic_architecture",
            "name": "Gothic Architecture and Cathedrals",
            "short_description": "Learning about the architectural innovations and symbolism of Gothic cathedrals.",
            "example_tasks": [
              "Identify key features of Gothic architecture: pointed arches, ribbed vaults, flying buttresses, stained glass",
              "Explain how Gothic architectural innovations allowed cathedrals to be built taller with large windows",
              "Analyze the religious symbolism and purpose of Gothic cathedrals as representations of heaven",
              "Describe famous Gothic cathedrals like Notre Dame de Paris or Chartres Cathedral"
            ]
          },
          {
            "key": "medieval_literature",
            "name": "Medieval Literature and Epic Poetry",
            "short_description": "Examining literary works that reflect medieval values and society.",
            "example_tasks": [
              "Describe the characteristics of medieval epic poems and romances",
              "Analyze themes in works like Beowulf, The Song of Roland, or Arthurian legends",
              "Explain how Geoffrey Chaucer's Canterbury Tales provides insight into medieval society",
              "Compare vernacular literature (written in local languages) to Latin literature in the Middle Ages"
            ]
          }
        ]
      },
      {
        "key": "late_middle_ages_crises",
        "name": "Late Middle Ages: Crisis and Change",
        "short_description": "Understanding the disasters and transformations that marked the decline of medieval civilization.",
        "sub_topics": [
          {
            "key": "black_death",
            "name": "The Black Death and Its Impact",
            "short_description": "Examining the devastating plague pandemic of the 14th century and its social consequences.",
            "example_tasks": [
              "Describe how the bubonic plague spread from Asia to Europe along trade routes in 1347-1351",
              "Explain the symptoms of the plague and medieval understanding of its causes",
              "Analyze the demographic impact: approximately one-third of Europe's population died",
              "Describe how the Black Death led to labor shortages and weakened the feudal system",
              "Explain social and psychological effects of the plague, including persecution of Jews and increased religious fanaticism"
            ]
          },
          {
            "key": "hundred_years_war",
            "name": "The Hundred Years' War",
            "short_description": "Understanding the long conflict between England and France and the rise of national identity.",
            "example_tasks": [
              "Explain the causes of the Hundred Years' War, including disputes over French succession and English territories",
              "Describe key battles like Crécy, Poitiers, and Agincourt where English longbowmen defeated French knights",
              "Analyze the role of Joan of Arc in inspiring French resistance and turning the tide of the war",
              "Evaluate how the war contributed to the decline of feudalism and the rise of national monarchies"
            ]
          },
          {
            "key": "decline_church_authority",
            "name": "Decline of Church Authority",
            "short_description": "Examining challenges to papal power including the Babylonian Captivity and Great Schism.",
            "example_tasks": [
              "Describe the Babylonian Captivity (1309-1377) when popes resided in Avignon under French influence",
              "Explain the Great Schism (1378-1417) when rival popes claimed authority simultaneously",
              "Analyze how these events weakened the Church's moral authority and spiritual prestige",
              "Describe early critics of the Church like John Wycliffe and Jan Hus who challenged Church practices"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "islamic_civilization",
    "name": "Islamic Civilization and the Middle East",
    "short_description": "Students explore the origins and spread of Islam, the accomplishments of Islamic civilization during its Golden Age, and Muslim contributions to science, mathematics, medicine, philosophy, and the arts.",
    "sub_topics": [
      {
        "key": "origins_islam",
        "name": "Origins and Beliefs of Islam",
        "short_description": "Understanding the life of Muhammad, the basic teachings of Islam, and the Quran.",
        "sub_topics": [
          {
            "key": "muhammad_prophet",
            "name": "Life of Muhammad and Founding of Islam",
            "short_description": "Learning about Muhammad's life in Mecca and Medina and his role as God's messenger.",
            "example_tasks": [
              "Describe Muhammad's early life in Mecca and his experience receiving revelations from Allah through the angel Gabriel",
              "Explain the significance of the Hijra (migration) from Mecca to Medina in 622 CE as the beginning of the Islamic calendar",
              "Analyze why Muhammad faced opposition from Meccan leaders and how he eventually returned to conquer Mecca",
              "Describe Muhammad's role as both religious leader and political/military leader in establishing the Islamic community"
            ]
          },
          {
            "key": "five_pillars",
            "name": "The Five Pillars of Islam",
            "short_description": "Understanding the fundamental practices and obligations of Muslim faith.",
            "example_tasks": [
              "List and explain the Five Pillars of Islam: shahada (declaration of faith), salat (prayer), zakat (charity), sawm (fasting), hajj (pilgrimage)",
              "Describe how Muslims practice daily prayers (salat) and the significance of praying toward Mecca",
              "Explain the importance of the hajj pilgrimage to Mecca and what pilgrims do during the journey",
              "Analyze how the Five Pillars create unity among Muslims worldwide regardless of cultural differences"
            ]
          },
          {
            "key": "quran_islamic_beliefs",
            "name": "The Quran and Core Islamic Beliefs",
            "short_description": "Learning about Islam's holy book and fundamental theological concepts.",
            "example_tasks": [
              "Explain Muslims' belief that the Quran is the literal word of God revealed to Muhammad",
              "Describe core Islamic beliefs: monotheism (one God/Allah), prophethood, judgment day, angels",
              "Compare Islamic beliefs about prophets, including Abraham, Moses, Jesus, and Muhammad as the final prophet",
              "Explain the concept of submission to Allah's will and what 'Islam' means"
            ]
          }
        ]
      },
      {
        "key": "islamic_expansion",
        "name": "Expansion of Islamic Empire",
        "short_description": "Examining the rapid spread of Islam across the Middle East, North Africa, and beyond through conquest and conversion.",
        "sub_topics": [
          {
            "key": "early_caliphates",
            "name": "The Early Caliphates",
            "short_description": "Understanding the leadership succession after Muhammad and territorial expansion.",
            "example_tasks": [
              "Explain what a caliph is and the role of the first four 'rightly guided caliphs' after Muhammad's death",
              "Describe how Muslim armies conquered Byzantine and Persian territories in the decades after Muhammad's death",
              "Create a map showing the extent of Islamic expansion under the Umayyad Caliphate (661-750 CE)",
              "Analyze reasons for the rapid success of Islamic expansion (military skill, weakness of enemies, appeal of Islamic message)"
            ]
          },
          {
            "key": "sunni_shia_split",
            "name": "Sunni-Shia Division",
            "short_description": "Understanding the origins of the major split within Islam over leadership succession.",
            "example_tasks": [
              "Explain the origins of the Sunni-Shia split following the death of Muhammad",
              "Describe the Sunni position that caliphs should be chosen by the community",
              "Describe the Shia position that leadership should remain in Muhammad's family through his cousin Ali",
              "Analyze how this initial political dispute evolved into broader theological and practice differences",
              "Identify regions where Sunni and Shia Muslims are predominant today"
            ]
          },
          {
            "key": "abbasid_caliphate",
            "name": "The Abbasid Caliphate and Baghdad",
            "short_description": "Learning about the dynasty that ushered in Islam's Golden Age.",
            "example_tasks": [
              "Describe how the Abbasids overthrew the Umayyads and moved the capital to Baghdad",
              "Explain why Baghdad became a major center of learning, culture, and trade",
              "Analyze how the Abbasid caliphs encouraged scholarship and translation of classical texts",
              "Describe the court of Harun al-Rashid as representative of Abbasid cultural sophistication"
            ]
          }
        ]
      },
      {
        "key": "islamic_golden_age",
        "name": "Islamic Golden Age: Cultural and Scientific Achievements",
        "short_description": "Exploring Muslim contributions to mathematics, science, medicine, philosophy, and the arts during the medieval period.",
        "sub_topics": [
          {
            "key": "islamic_mathematics_science",
            "name": "Mathematics and Scientific Advances",
            "short_description": "Understanding Muslim achievements in algebra, astronomy, chemistry, and other sciences.",
            "example_tasks": [
              "Describe al-Khwarizmi's contributions to mathematics, including algebra (the word comes from his work)",
              "Explain Islamic advances in astronomy, including improved astronomical tables and instruments like the astrolabe",
              "Analyze how Muslim scholars built upon Greek, Indian, and Persian knowledge",
              "Identify other important Muslim scientists like Ibn al-Haytham (optics) and al-Razi (chemistry and medicine)"
            ]
          },
          {
            "key": "islamic_medicine",
            "name": "Islamic Medicine and Hospitals",
            "short_description": "Learning about medical knowledge and practice in the Islamic world.",
            "example_tasks": [
              "Describe the contributions of physicians like Ibn Sina (Avicenna) whose medical encyclopedia was used in Europe for centuries",
              "Explain how Islamic hospitals were organized and provided free care to patients",
              "Analyze how Muslim doctors advanced knowledge of diseases, surgery, and pharmacology",
              "Compare Islamic medical knowledge to European medical practice during the same period"
            ]
          },
          {
            "key": "preservation_classical_knowledge",
            "name": "Preservation and Translation of Classical Knowledge",
            "short_description": "Understanding how Muslim scholars preserved Greek philosophy and science.",
            "example_tasks": [
              "Describe the House of Wisdom in Baghdad and its role as a center for translating Greek texts into Arabic",
              "Explain how Muslim scholars preserved works of Aristotle, Plato, and other Greek philosophers",
              "Analyze how this preserved knowledge later returned to Europe through Muslim Spain",
              "Evaluate the role of Muslim scholars like Averroes (Ibn Rushd) in commenting on and interpreting Aristotle"
            ]
          },
          {
            "key": "islamic_art_architecture",
            "name": "Islamic Art and Architecture",
            "short_description": "Examining distinctive features of Islamic artistic traditions.",
            "example_tasks": [
              "Describe key features of Islamic architecture: domes, minarets, arches, courtyards",
              "Explain the use of geometric patterns, arabesques, and calligraphy in Islamic art",
              "Analyze why Islamic art typically avoids depicting human or animal figures in religious contexts",
              "Describe famous examples of Islamic architecture like the Dome of the Rock, Alhambra, or Taj Mahal"
            ]
          },
          {
            "key": "islamic_literature_philosophy",
            "name": "Islamic Literature and Philosophy",
            "short_description": "Learning about literary works and philosophical thought in the Islamic world.",
            "example_tasks": [
              "Describe the importance of poetry in Islamic culture and examples like The Rubaiyat of Omar Khayyam",
              "Explain how Muslim philosophers tried to reconcile Islamic faith with Greek reason",
              "Analyze the global influence of stories from The Thousand and One Nights (Arabian Nights)",
              "Compare Islamic philosophy's treatment of reason and faith to European scholasticism"
            ]
          }
        ]
      },
      {
        "key": "islamic_trade_cities",
        "name": "Islamic Trade Networks and Urban Culture",
        "short_description": "Understanding how Muslim merchants connected Africa, Europe, and Asia, and the cosmopolitan nature of Islamic cities.",
        "sub_topics": [
          {
            "key": "trade_routes",
            "name": "Islamic Trade Networks",
            "short_description": "Examining how Muslim merchants dominated trade routes connecting three continents.",
            "example_tasks": [
              "Describe the trade routes controlled by Muslim merchants across the Mediterranean, Indian Ocean, and Silk Road",
              "Identify goods traded through Islamic networks (spices, textiles, precious metals, slaves, ideas)",
              "Explain how Islamic trade networks spread Islam to new regions like Southeast Asia and West Africa",
              "Analyze the role of Muslim merchants in cultural exchange between different civilizations"
            ]
          },
          {
            "key": "islamic_cities",
            "name": "Great Islamic Cities and Urban Life",
            "short_description": "Learning about major urban centers and cosmopolitan culture of the Islamic world.",
            "example_tasks": [
              "Describe the features of major Islamic cities like Baghdad, Cairo, Cordoba, and Damascus",
              "Explain the importance of the mosque as the center of Islamic city life",
              "Analyze the role of bazaars (markets/souks) in Islamic urban economies and social life",
              "Compare the size, sophistication, and diversity of medieval Islamic cities to European cities of the same period"
            ]
          }
        ]
      },
      {
        "key": "islamic_spain",
        "name": "Islamic Spain (Al-Andalus)",
        "short_description": "Examining Muslim rule in Iberia and the unique multicultural society that developed there.",
        "sub_topics": [
          {
            "key": "muslim_conquest_spain",
            "name": "Muslim Conquest and Rule of Spain",
            "short_description": "Understanding how Muslims controlled most of the Iberian Peninsula for centuries.",
            "example_tasks": [
              "Describe the Muslim conquest of Spain in 711 CE and the defeat of the Visigothic kingdom",
              "Explain why Muslim Spain (Al-Andalus) became one of the most advanced regions in medieval Europe",
              "Analyze the multicultural society of Al-Andalus where Muslims, Christians, and Jews coexisted",
              "Describe the Umayyad Caliphate of Cordoba and its cultural achievements"
            ]
          },
          {
            "key": "cordoba_cultural_center",
            "name": "Cordoba as a Center of Learning",
            "short_description": "Learning about the intellectual and cultural achievements of Muslim Spain.",
            "example_tasks": [
              "Describe Cordoba in the 10th century as one of the largest and most cultured cities in the world",
              "Explain the Great Mosque of Cordoba and its architectural significance",
              "Analyze how Muslim Spain served as a bridge for transmitting Islamic learning to Christian Europe",
              "Describe the translation schools where Arabic texts were translated into Latin"
            ]
          },
          {
            "key": "reconquista",
            "name": "The Reconquista and End of Muslim Spain",
            "short_description": "Understanding the gradual Christian reconquest of the Iberian Peninsula.",
            "example_tasks": [
              "Define the Reconquista as the centuries-long Christian effort to reclaim Iberia from Muslim rule",
              "Describe major stages of the Reconquista from the 8th to 15th centuries",
              "Explain the fall of Granada in 1492 as the end of Muslim political power in Spain",
              "Analyze the fate of Muslims and Jews in Spain after the Christian reconquest"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "african_civilizations",
    "name": "African Kingdoms and Civilizations",
    "short_description": "Students explore the rich history of African civilizations south of the Sahara, including the great trading empires of West Africa, East African city-states, and diverse African cultures, achievements, and contributions.",
    "sub_topics": [
      {
        "key": "west_african_empires",
        "name": "West African Trading Empires",
        "short_description": "Understanding the powerful kingdoms that grew wealthy from trans-Saharan trade in gold and salt.",
        "sub_topics": [
          {
            "key": "ghana_empire",
            "name": "Empire of Ghana",
            "short_description": "Learning about the earliest of the great West African trading empires.",
            "example_tasks": [
              "Describe Ghana's location between gold mines to the south and salt deposits to the north",
              "Explain how Ghana grew wealthy by taxing trade goods passing through its territory",
              "Analyze the system of silent bartering used in the gold trade to maintain secrecy about gold sources",
              "Describe the downfall of Ghana due to invasion by the Almoravids and loss of trade control"
            ]
          },
          {
            "key": "mali_empire",
            "name": "Empire of Mali",
            "short_description": "Examining the most famous West African empire and its greatest ruler, Mansa Musa.",
            "example_tasks": [
              "Describe how Sundiata Keita founded the Mali Empire in the 13th century",
              "Explain Mansa Musa's famous pilgrimage to Mecca in 1324 and its impact on Mali's reputation",
              "Analyze how Mansa Musa's generous gift-giving during his hajj revealed Mali's enormous wealth",
              "Describe Timbuktu as a major center of Islamic learning and trade under Mali's rule",
              "Evaluate the role of griots (oral historians) in preserving West African history and culture"
            ]
          },
          {
            "key": "songhai_empire",
            "name": "Songhai Empire",
            "short_description": "Understanding the largest of the West African empires and its sophisticated administration.",
            "example_tasks": [
              "Describe how Songhai emerged as the dominant power after Mali's decline",
              "Explain the accomplishments of leaders like Sunni Ali and Askia Muhammad",
              "Analyze the efficient government bureaucracy and legal system established by Askia Muhammad",
              "Describe the great cities of Songhai including Gao and Timbuktu",
              "Explain how the Moroccan invasion of 1591 led to Songhai's collapse"
            ]
          },
          {
            "key": "trans_saharan_trade",
            "name": "Trans-Saharan Trade Networks",
            "short_description": "Understanding the trade routes connecting West Africa to North Africa and the Mediterranean.",
            "example_tasks": [
              "Describe the trans-Saharan trade routes and the role of camel caravans in crossing the desert",
              "Explain the saying 'salt for gold, gold for salt' and why both commodities were valuable",
              "Analyze how Islam spread to West Africa through trade contacts with North African Muslims",
              "Identify other goods traded across the Sahara besides gold and salt (slaves, ivory, kola nuts, cloth)"
            ]
          }
        ]
      },
      {
        "key": "east_african_trade",
        "name": "East African City-States and Indian Ocean Trade",
        "short_description": "Examining the Swahili coast trading cities and their connections to the broader Indian Ocean world.",
        "sub_topics": [
          {
            "key": "swahili_city_states",
            "name": "Swahili City-States",
            "short_description": "Learning about the cosmopolitan trading cities along Africa's east coast.",
            "example_tasks": [
              "Describe major Swahili city-states like Kilwa, Mombasa, and Zanzibar",
              "Explain how Swahili culture blended African and Arab influences",
              "Analyze the development of the Swahili language as a blend of Bantu and Arabic",
              "Describe the architectural features of Swahili cities including coral stone buildings and mosques"
            ]
          },
          {
            "key": "indian_ocean_trade_network",
            "name": "Indian Ocean Trade Networks",
            "short_description": "Understanding how East African cities connected to trade routes spanning from Africa to China.",
            "example_tasks": [
              "Identify goods exported from East Africa (gold, ivory, enslaved people) and imports (cloth, porcelain, spices)",
              "Explain the role of monsoon winds in facilitating seasonal trade across the Indian Ocean",
              "Describe how Islam spread to East Africa through trade and intermarriage",
              "Analyze the multicultural nature of Swahili coastal cities with their diverse populations"
            ]
          },
          {
            "key": "great_zimbabwe",
            "name": "Great Zimbabwe",
            "short_description": "Learning about the impressive stone city in southeastern Africa and its trading kingdom.",
            "example_tasks": [
              "Describe the massive stone walls and structures of Great Zimbabwe built without mortar",
              "Explain how Great Zimbabwe controlled trade routes between the interior gold fields and coastal ports",
              "Analyze archaeological evidence of Great Zimbabwe's wealth and connections to distant places",
              "Evaluate theories about why Great Zimbabwe was eventually abandoned"
            ]
          }
        ]
      },
      {
        "key": "diverse_african_societies",
        "name": "Diverse African Societies and Cultures",
        "short_description": "Understanding the variety of political systems, social structures, and cultural practices across Africa.",
        "sub_topics": [
          {
            "key": "political_diversity",
            "name": "Political Organization in African Societies",
            "short_description": "Examining different forms of government from centralized kingdoms to stateless societies.",
            "example_tasks": [
              "Compare centralized kingdoms like Kongo to decentralized societies organized by kinship and age groups",
              "Describe the role of kinship and lineage in organizing many African societies",
              "Explain how age-grade systems functioned in some African cultures",
              "Analyze the diversity of political systems across Africa rather than viewing African politics as uniform"
            ]
          },
          {
            "key": "african_art_culture",
            "name": "African Art and Cultural Achievements",
            "short_description": "Learning about African artistic traditions, oral literature, and cultural practices.",
            "example_tasks": [
              "Describe the sophisticated bronze and brass sculptures of Benin and Ife civilizations",
              "Explain the role of masks and sculpture in African religious and cultural ceremonies",
              "Analyze the importance of oral tradition, including proverbs, folktales, and epic poems",
              "Describe African musical traditions and the role of drums and other instruments in community life"
            ]
          },
          {
            "key": "african_iron_agriculture",
            "name": "Iron Technology and Agricultural Development",
            "short_description": "Understanding how iron tools transformed African societies and enabled agricultural expansion.",
            "example_tasks": [
              "Describe the spread of iron-working technology across sub-Saharan Africa",
              "Explain how iron tools improved agricultural productivity and allowed clearing of forests",
              "Analyze the Bantu migrations and the spread of agriculture and iron technology across central and southern Africa",
              "Evaluate the impact of agricultural surplus on the development of trade and specialized crafts"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "precolumbian_americas",
    "name": "Pre-Columbian Civilizations of the Americas",
    "short_description": "Students examine the major civilizations that developed in the Americas before European contact, including the Maya, Aztec, and Inca empires, as well as diverse Native American societies across North America.",
    "sub_topics": [
      {
        "key": "maya_civilization",
        "name": "Maya Civilization",
        "short_description": "Understanding the achievements of the Maya in mathematics, astronomy, writing, and architecture in Mesoamerica.",
        "sub_topics": [
          {
            "key": "maya_city_states",
            "name": "Maya Political Organization and City-States",
            "short_description": "Learning about Maya cities like Tikal and Copán and their independent rule.",
            "example_tasks": [
              "Describe the political organization of Maya civilization as independent city-states rather than a unified empire",
              "Explain the role of Maya kings as both political rulers and religious leaders who claimed divine descent",
              "Identify major Maya cities and their locations in present-day Mexico, Guatemala, Belize, and Honduras",
              "Analyze how Maya city-states cooperated and competed through trade, alliances, and warfare"
            ]
          },
          {
            "key": "maya_achievements",
            "name": "Maya Mathematics, Astronomy, and Calendar",
            "short_description": "Examining Maya scientific and mathematical innovations.",
            "example_tasks": [
              "Explain the Maya number system including their use of zero and place value",
              "Describe Maya astronomical observations and accurate predictions of eclipses and planetary movements",
              "Analyze the complexity of the Maya calendar system with its 260-day and 365-day cycles",
              "Evaluate Maya achievements in mathematics and astronomy compared to other ancient civilizations"
            ]
          },
          {
            "key": "maya_writing_culture",
            "name": "Maya Writing and Cultural Achievements",
            "short_description": "Understanding Maya hieroglyphic writing and artistic accomplishments.",
            "example_tasks": [
              "Describe Maya hieroglyphic writing as one of the most sophisticated writing systems in the ancient Americas",
              "Explain what scholars have learned from Maya codices (folding books) that survived Spanish destruction",
              "Analyze Maya architecture, including pyramids, palaces, and ball courts",
              "Describe the Maya ball game and its religious and political significance"
            ]
          },
          {
            "key": "maya_decline",
            "name": "Maya Decline and Transformation",
            "short_description": "Examining theories about the collapse of Classic Maya civilization.",
            "example_tasks": [
              "Describe the mysterious collapse of southern Maya cities during the 9th century",
              "Analyze theories for Maya decline: drought, warfare, environmental degradation, overpopulation",
              "Explain that Maya people continued to live in the region and that Maya civilization transformed rather than disappeared",
              "Describe the persistence of Maya culture and language to the present day"
            ]
          }
        ]
      },
      {
        "key": "aztec_civilization",
        "name": "Aztec (Mexica) Civilization",
        "short_description": "Studying the powerful empire that dominated central Mexico from its capital at Tenochtitlan.",
        "sub_topics": [
          {
            "key": "aztec_empire_formation",
            "name": "Rise of the Aztec Empire",
            "short_description": "Understanding how the Mexica people built a powerful empire through military conquest and alliances.",
            "example_tasks": [
              "Describe the Aztec origin story and their migration to the Valley of Mexico",
              "Explain how the Aztecs founded Tenochtitlan on an island in Lake Texcoco in 1325",
              "Analyze how the Aztecs built their empire through the Triple Alliance and conquest of neighboring peoples",
              "Describe the tributary system where conquered peoples paid tribute to the Aztec emperor"
            ]
          },
          {
            "key": "tenochtitlan",
            "name": "Tenochtitlan: The Aztec Capital",
            "short_description": "Learning about the impressive city and its engineering achievements.",
            "example_tasks": [
              "Describe the size and sophistication of Tenochtitlan, one of the world's largest cities in 1500",
              "Explain the engineering of chinampas (floating gardens) for intensive agriculture",
              "Analyze the city's system of causeways, canals, and aqueducts",
              "Describe the Great Temple (Templo Mayor) at the center of Tenochtitlan and its religious significance"
            ]
          },
          {
            "key": "aztec_society_culture",
            "name": "Aztec Society and Culture",
            "short_description": "Understanding Aztec social hierarchy, education, and cultural practices.",
            "example_tasks": [
              "Describe the Aztec social hierarchy from the emperor to nobles, commoners, and slaves",
              "Explain the importance of military achievement in Aztec society for social advancement",
              "Analyze Aztec education systems that trained children for their future roles",
              "Describe Aztec art, including sculpture, featherwork, and codices (pictorial manuscripts)"
            ]
          },
          {
            "key": "aztec_religion",
            "name": "Aztec Religion and Human Sacrifice",
            "short_description": "Examining Aztec polytheistic beliefs and controversial ritual practices.",
            "example_tasks": [
              "Describe major Aztec gods including Huitzilopochtli (war/sun god) and Quetzalcoatl (feathered serpent)",
              "Explain Aztec beliefs about the need for human sacrifice to sustain the sun and prevent cosmic disaster",
              "Analyze how human sacrifice related to Aztec warfare and the capture of prisoners",
              "Evaluate different historical perspectives on the extent and meaning of Aztec human sacrifice"
            ]
          }
        ]
      },
      {
        "key": "inca_civilization",
        "name": "Inca Civilization",
        "short_description": "Examining the largest empire in pre-Columbian America, stretching along the Andes Mountains of South America.",
        "sub_topics": [
          {
            "key": "inca_empire_expansion",
            "name": "Formation and Expansion of the Inca Empire",
            "short_description": "Understanding how the Inca built and administered their vast empire.",
            "example_tasks": [
              "Describe the location and extent of the Inca Empire along the western coast of South America",
              "Explain how Pachacuti expanded the empire dramatically in the 15th century",
              "Analyze Inca strategies for incorporating conquered peoples into the empire",
              "Describe the mit'a system of labor taxation used to build public works"
            ]
          },
          {
            "key": "inca_government_administration",
            "name": "Inca Government and Administration",
            "short_description": "Learning about the centralized bureaucracy and efficient administration of the empire.",
            "example_tasks": [
              "Explain the role of the Sapa Inca as absolute ruler considered divine",
              "Describe how the Inca divided their empire into four quarters administered by officials",
              "Analyze the system of quipu (knotted strings) used for record-keeping without a writing system",
              "Evaluate the efficiency of Inca administration in controlling such a large and diverse empire"
            ]
          },
          {
            "key": "inca_engineering",
            "name": "Inca Engineering and Architecture",
            "short_description": "Examining impressive Inca construction techniques and infrastructure.",
            "example_tasks": [
              "Describe the extensive road system connecting the Inca Empire, totaling thousands of miles",
              "Explain Inca stone masonry techniques that fit massive stones together without mortar",
              "Analyze the architecture of Machu Picchu and theories about its purpose",
              "Describe Inca agricultural terracing and irrigation systems in the challenging Andean environment"
            ]
          },
          {
            "key": "inca_economy_society",
            "name": "Inca Economy and Social Structure",
            "short_description": "Understanding how Inca society was organized and the economy functioned.",
            "example_tasks": [
              "Describe the Inca social hierarchy with the Sapa Inca at the top and commoners at the bottom",
              "Explain the ayllu (extended family group) as the basic unit of Inca society",
              "Analyze the Inca economy based on reciprocal labor rather than money or markets",
              "Describe how the government controlled production and distribution of goods, including food storage in case of famine"
            ]
          }
        ]
      },
      {
        "key": "north_american_societies",
        "name": "Native American Societies in North America",
        "short_description": "Understanding the diverse cultures and ways of life of indigenous peoples across North America before European contact.",
        "sub_topics": [
          {
            "key": "southwest_cultures",
            "name": "Southwest Cultures: Pueblo and Others",
            "short_description": "Learning about agricultural societies adapted to arid environments.",
            "example_tasks": [
              "Describe the Ancestral Puebloans (Anasazi) and their cliff dwellings like Mesa Verde",
              "Explain agricultural techniques including irrigation that allowed farming in the Southwest desert",
              "Analyze the pueblo architecture and its advantages for defense and climate control",
              "Describe the sophisticated pottery and basket weaving of Southwest peoples"
            ]
          },
          {
            "key": "eastern_woodlands",
            "name": "Eastern Woodlands Peoples",
            "short_description": "Understanding societies living in the forests of eastern North America.",
            "example_tasks": [
              "Describe the Iroquois Confederacy and its system of representative government",
              "Explain the 'Three Sisters' agricultural system (corn, beans, squash) practiced in the Eastern Woodlands",
              "Analyze the political organization of the Iroquois League and its influence on later democratic ideas",
              "Describe housing styles like longhouses used by Iroquois peoples"
            ]
          },
          {
            "key": "great_plains_peoples",
            "name": "Great Plains Peoples",
            "short_description": "Learning about nomadic and semi-nomadic societies of the plains region.",
            "example_tasks": [
              "Describe the lifestyle of Plains peoples and their dependence on buffalo herds before European contact",
              "Explain how different Plains groups lived as nomadic hunters or sedentary farmers",
              "Analyze how the horse (introduced later by Europeans) transformed Plains Indian culture",
              "Describe the tipi as portable housing suited to nomadic life"
            ]
          },
          {
            "key": "pacific_northwest",
            "name": "Pacific Northwest Coastal Cultures",
            "short_description": "Understanding societies that developed rich cultures based on marine resources.",
            "example_tasks": [
              "Describe how abundant salmon and other resources allowed Northwest peoples to develop complex societies",
              "Explain the potlatch ceremony and its role in demonstrating wealth and status",
              "Analyze totem poles as artistic and cultural expressions telling family histories",
              "Describe the sophisticated woodworking and carving traditions of Pacific Northwest peoples"
            ]
          },
          {
            "key": "mound_builders",
            "name": "Mound Builders: Cahokia and Mississippian Culture",
            "short_description": "Learning about the complex societies that built massive earthen mounds in the Mississippi Valley.",
            "example_tasks": [
              "Describe Cahokia as the largest pre-Columbian city north of Mexico with a population in the tens of thousands",
              "Explain the purposes of different types of mounds (burial, temple, residential)",
              "Analyze evidence of Cahokia's extensive trade networks reaching across North America",
              "Evaluate theories about why Cahokia and other Mississippian cities were eventually abandoned"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "renaissance_reformation",
    "name": "Renaissance and Reformation",
    "short_description": "Students analyze the cultural rebirth and intellectual transformation of the Renaissance, the religious upheaval of the Protestant Reformation, and the Scientific Revolution's challenge to traditional authority and worldviews.",
    "sub_topics": [
      {
        "key": "italian_renaissance",
        "name": "The Italian Renaissance",
        "short_description": "Understanding the revival of classical learning, humanism, and artistic achievement in Italy.",
        "sub_topics": [
          {
            "key": "renaissance_origins",
            "name": "Origins and Characteristics of the Renaissance",
            "short_description": "Learning why the Renaissance began in Italy and its defining features.",
            "example_tasks": [
              "Explain why the Renaissance began in Italian city-states like Florence, Venice, and Milan",
              "Describe how Italy's urban wealth, classical heritage, and trade connections fostered cultural rebirth",
              "Define 'Renaissance' (rebirth) and explain what was being reborn (interest in classical Greco-Roman culture)",
              "Analyze the role of wealthy patrons like the Medici family in supporting Renaissance artists and scholars"
            ]
          },
          {
            "key": "humanism",
            "name": "Renaissance Humanism",
            "short_description": "Understanding the intellectual movement emphasizing human potential and classical studies.",
            "example_tasks": [
              "Define humanism and its focus on human achievement, dignity, and potential rather than solely religious concerns",
              "Explain the humanist emphasis on studying classical texts, rhetoric, history, and moral philosophy",
              "Describe the shift from medieval focus on the afterlife to Renaissance celebration of earthly existence",
              "Analyze how humanism influenced education with emphasis on liberal arts and classical languages"
            ]
          },
          {
            "key": "renaissance_art",
            "name": "Renaissance Art and Artists",
            "short_description": "Examining revolutionary artistic techniques and the works of master artists.",
            "example_tasks": [
              "Describe major innovations in Renaissance art: perspective, realism, use of light and shadow (chiaroscuro), human anatomy",
              "Analyze Leonardo da Vinci's works and his embodiment of the 'Renaissance man' ideal",
              "Describe Michelangelo's sculptures (David, Pietà) and Sistine Chapel ceiling paintings",
              "Explain Raphael's contributions including his idealized figures and balanced compositions",
              "Compare Renaissance art's realism and focus on humans to medieval art's stylized, religious focus"
            ]
          },
          {
            "key": "renaissance_literature",
            "name": "Renaissance Literature and Political Thought",
            "short_description": "Learning about writers who explored human nature and political power.",
            "example_tasks": [
              "Describe Machiavelli's 'The Prince' and his realistic analysis of political power",
              "Explain the controversial advice in Machiavelli's work about rulers prioritizing effectiveness over morality",
              "Analyze other Renaissance literature including Petrarch's sonnets and Dante's Divine Comedy",
              "Compare Renaissance secular literature to medieval religious texts"
            ]
          }
        ]
      },
      {
        "key": "northern_renaissance",
        "name": "The Northern Renaissance",
        "short_description": "Understanding how Renaissance ideas spread north of the Alps and took on distinct characteristics.",
        "sub_topics": [
          {
            "key": "northern_renaissance_characteristics",
            "name": "Characteristics of Northern Renaissance",
            "short_description": "Learning how the Renaissance manifested differently in Northern Europe.",
            "example_tasks": [
              "Describe how the Northern Renaissance retained stronger religious focus compared to Italian Renaissance",
              "Explain the emphasis on social reform and Christian piety in Northern humanist thought",
              "Analyze the importance of the printing press in spreading Renaissance ideas northward",
              "Compare Italian Renaissance focus on classical paganism to Northern focus on Christian reform"
            ]
          },
          {
            "key": "northern_artists",
            "name": "Northern Renaissance Artists",
            "short_description": "Examining artistic achievements in Flanders, Germany, and other northern regions.",
            "example_tasks": [
              "Describe Jan van Eyck's innovations in oil painting and realistic detail",
              "Analyze Albrecht Dürer's works combining German precision with Italian Renaissance techniques",
              "Explain Pieter Bruegel's paintings of peasant life and their social commentary",
              "Compare Northern Renaissance art (detailed realism, everyday scenes, religious themes) to Italian Renaissance art"
            ]
          },
          {
            "key": "erasmus_northern_humanism",
            "name": "Erasmus and Christian Humanism",
            "short_description": "Understanding the call for church reform through education and return to early Christian sources.",
            "example_tasks": [
              "Describe Erasmus's critique of church corruption and call for simple Christian piety",
              "Explain Erasmus's use of satire in works like 'The Praise of Folly' to criticize society and church",
              "Analyze Erasmus's Greek New Testament and its challenge to traditional Latin Vulgate",
              "Evaluate how Erasmus's calls for reform influenced but differed from the Protestant Reformation"
            ]
          }
        ]
      },
      {
        "key": "protestant_reformation",
        "name": "The Protestant Reformation",
        "short_description": "Examining the religious revolution that shattered Christian unity and transformed European society.",
        "sub_topics": [
          {
            "key": "causes_reformation",
            "name": "Causes of the Reformation",
            "short_description": "Understanding the problems in the Catholic Church that sparked reform movements.",
            "example_tasks": [
              "Describe corruption in the Catholic Church including simony (selling church offices) and nepotism",
              "Explain the sale of indulgences and why this practice angered reformers",
              "Analyze how printing press, literacy, and nationalism contributed to the Reformation's spread",
              "Evaluate the role of Renaissance humanism in questioning church authority and practices"
            ]
          },
          {
            "key": "martin_luther",
            "name": "Martin Luther and the German Reformation",
            "short_description": "Learning about Luther's challenge to Catholic doctrine and the beginning of Protestantism.",
            "example_tasks": [
              "Describe Martin Luther's spiritual crisis and his conclusion about salvation by faith alone",
              "Explain the Ninety-Five Theses (1517) and Luther's specific criticisms of indulgences",
              "Analyze Luther's key theological positions: sola fide (faith alone), sola scriptura (scripture alone), priesthood of all believers",
              "Describe Luther's refusal to recant at the Diet of Worms and his subsequent protection by German princes",
              "Evaluate the political and social factors that allowed Lutheranism to survive and spread in Germany"
            ]
          },
          {
            "key": "spread_protestantism",
            "name": "Spread of Protestant Ideas",
            "short_description": "Understanding how Protestant movements developed in different regions with local characteristics.",
            "example_tasks": [
              "Describe John Calvin's theology including predestination and his strict moral code",
              "Explain the establishment of Calvinist theocracy in Geneva, Switzerland",
              "Analyze the English Reformation and how it differed from the German Reformation (political rather than theological initially)",
              "Describe the formation of the Anglican Church under Henry VIII and Elizabeth I",
              "Explain the development of other Protestant groups like Anabaptists and their beliefs"
            ]
          },
          {
            "key": "catholic_reformation",
            "name": "Catholic Reformation (Counter-Reformation)",
            "short_description": "Examining the Catholic Church's response to Protestant challenges through reform and reaffirmation.",
            "example_tasks": [
              "Describe reforms initiated by the Council of Trent (1545-1563) to address corruption",
              "Explain how the Council of Trent reaffirmed traditional Catholic doctrines against Protestant beliefs",
              "Analyze the role of the Jesuits (Society of Jesus) in spreading Catholicism and combating Protestantism",
              "Describe the Roman Inquisition and Index of Forbidden Books as tools to prevent spread of Protestant ideas",
              "Evaluate whether the Catholic Reformation was primarily defensive reaction or genuine internal reform"
            ]
          },
          {
            "key": "religious_wars",
            "name": "Religious Wars and Conflicts",
            "short_description": "Understanding the violence and warfare sparked by religious divisions.",
            "example_tasks": [
              "Describe the devastating Thirty Years' War (1618-1648) as a religious and political conflict",
              "Explain the Peace of Westphalia (1648) and the principle of cuius regio, eius religio (ruler's religion determines the religion of the region)",
              "Analyze the French Wars of Religion including the St. Bartholomew's Day Massacre",
              "Evaluate the long-term impact of religious divisions on European politics and society"
            ]
          }
        ]
      },
      {
        "key": "scientific_revolution",
        "name": "The Scientific Revolution",
        "short_description": "Examining the transformation in scientific thinking that challenged traditional authority and established new methods of investigation.",
        "sub_topics": [
          {
            "key": "scientific_method",
            "name": "Development of Scientific Method",
            "short_description": "Understanding the new approach to investigating nature through observation and experimentation.",
            "example_tasks": [
              "Describe the key steps of the scientific method: observation, hypothesis, experimentation, conclusion",
              "Explain Francis Bacon's emphasis on empirical observation and inductive reasoning",
              "Analyze René Descartes' contributions to deductive reasoning and systematic doubt",
              "Compare the scientific method to medieval reliance on ancient authorities and religious texts"
            ]
          },
          {
            "key": "astronomy_revolution",
            "name": "Revolution in Astronomy",
            "short_description": "Learning how new discoveries overturned the geocentric model of the universe.",
            "example_tasks": [
              "Describe Copernicus's heliocentric theory and why it was controversial",
              "Explain Galileo's telescopic observations that supported the heliocentric model",
              "Analyze Galileo's conflict with the Catholic Church and his forced recantation",
              "Describe Kepler's laws of planetary motion and Newton's law of universal gravitation",
              "Evaluate how astronomy challenged religious and philosophical assumptions about Earth's place in the universe"
            ]
          },
          {
            "key": "medical_advances",
            "name": "Advances in Medicine and Anatomy",
            "short_description": "Understanding how direct observation improved medical knowledge.",
            "example_tasks": [
              "Describe Andreas Vesalius's pioneering work in human anatomy based on dissection",
              "Explain William Harvey's discovery of blood circulation",
              "Analyze how these discoveries challenged ancient medical authorities like Galen",
              "Evaluate the resistance to new medical ideas from traditional physicians"
            ]
          },
          {
            "key": "impact_scientific_revolution",
            "name": "Impact of the Scientific Revolution",
            "short_description": "Analyzing the broader cultural and intellectual consequences of scientific thinking.",
            "example_tasks": [
              "Explain how the Scientific Revolution challenged traditional sources of authority (church, ancient texts)",
              "Describe the founding of scientific societies and academies to share and verify discoveries",
              "Analyze how scientific thinking promoted ideas about progress and human ability to understand nature",
              "Evaluate connections between the Scientific Revolution and later Enlightenment thinking"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "age_of_exploration",
    "name": "Age of Exploration and European Expansion",
    "short_description": "Students examine the motivations, technologies, and consequences of European exploration, analyzing the Columbian Exchange, establishment of trading empires, and the devastating impact of European diseases and conquest on indigenous peoples.",
    "sub_topics": [
      {
        "key": "motives_exploration",
        "name": "Motives and Causes of European Exploration",
        "short_description": "Understanding why Europeans sought new routes to Asia and explored unknown territories.",
        "sub_topics": [
          {
            "key": "economic_motives",
            "name": "Economic Motivations: God, Gold, and Glory",
            "short_description": "Learning about the desire for wealth, trade routes, and prestige that drove exploration.",
            "example_tasks": [
              "Explain the Three Gs of exploration: God (spread Christianity), Gold (wealth and trade), Glory (national prestige and personal fame)",
              "Describe why Europeans sought direct sea routes to Asia for spices and other luxury goods",
              "Analyze how the fall of Constantinople (1453) motivated Europeans to find alternative routes to Asia",
              "Evaluate which motive (economic, religious, or political) was most important in driving exploration"
            ]
          },
          {
            "key": "technology_exploration",
            "name": "Technological Advances Enabling Exploration",
            "short_description": "Understanding the navigational tools and ship designs that made long voyages possible.",
            "example_tasks": [
              "Describe key technologies: compass, astrolabe, improved maps, and better shipbuilding",
              "Explain the advantages of the caravel ship design for long-distance ocean voyages",
              "Analyze how knowledge of wind patterns and ocean currents aided navigation",
              "Evaluate how advances in cartography (mapmaking) both enabled and resulted from exploration"
            ]
          }
        ]
      },
      {
        "key": "portuguese_exploration",
        "name": "Portuguese Exploration of Africa and Asia",
        "short_description": "Examining Portugal's pioneering role in exploration and establishment of a trading empire.",
        "sub_topics": [
          {
            "key": "prince_henry_navigator",
            "name": "Prince Henry the Navigator and African Exploration",
            "short_description": "Learning about Portugal's systematic exploration of the African coast.",
            "example_tasks": [
              "Describe Prince Henry's sponsorship of exploration and establishment of a navigation school",
              "Explain Portuguese motivations: finding sea route to Asia, accessing African gold, spreading Christianity",
              "Analyze how Portuguese established trading posts along the African coast",
              "Describe the Portuguese slave trade from West Africa and its expansion"
            ]
          },
          {
            "key": "portuguese_asia",
            "name": "Portuguese Route to Asia and Trading Empire",
            "short_description": "Understanding how Portugal reached India and established a maritime empire.",
            "example_tasks": [
              "Describe Bartolomeu Dias's voyage around the southern tip of Africa (Cape of Good Hope) in 1488",
              "Explain Vasco da Gama's successful voyage to India in 1498 and its significance",
              "Analyze Portuguese establishment of trading posts in India, Southeast Asia, and East Asia",
              "Evaluate how Portugal's small population limited its ability to establish large colonies versus trading posts"
            ]
          }
        ]
      },
      {
        "key": "spanish_exploration",
        "name": "Spanish Exploration and Conquest of the Americas",
        "short_description": "Examining Spain's sponsorship of Columbus and subsequent conquest of vast American territories.",
        "sub_topics": [
          {
            "key": "columbus_voyages",
            "name": "Columbus and the 'Discovery' of the Americas",
            "short_description": "Understanding Columbus's voyages and their world-changing consequences.",
            "example_tasks": [
              "Describe Columbus's goal of reaching Asia by sailing west and why he believed this was possible",
              "Explain why Queen Isabella of Spain agreed to sponsor Columbus's voyage in 1492",
              "Analyze Columbus's four voyages and his continued belief he had reached Asia",
              "Evaluate the term 'discovery' and why it's problematic given millions already lived in the Americas",
              "Describe the Treaty of Tordesillas (1494) dividing newly discovered lands between Spain and Portugal"
            ]
          },
          {
            "key": "spanish_conquistadors",
            "name": "Spanish Conquistadors and Conquest",
            "short_description": "Learning about the Spanish conquest of major American civilizations.",
            "example_tasks": [
              "Describe Hernán Cortés's conquest of the Aztec Empire (1519-1521) with only a few hundred soldiers",
              "Explain factors that enabled Spanish success: guns, horses, steel weapons, indigenous allies, and disease",
              "Analyze Francisco Pizarro's conquest of the Inca Empire in the 1530s",
              "Describe the encomienda system that granted conquistadors control over indigenous labor",
              "Evaluate the brutality of Spanish conquest and the moral debates it sparked (Las Casas vs. Sepúlveda)"
            ]
          },
          {
            "key": "spanish_colonial_empire",
            "name": "Spanish Colonial Empire",
            "short_description": "Understanding how Spain administered its vast American territories.",
            "example_tasks": [
              "Describe the organization of Spanish colonies into viceroyalties (New Spain, Peru, etc.)",
              "Explain the social hierarchy in Spanish colonies with peninsulares (Spanish-born) at the top",
              "Analyze the role of Catholic missions in converting indigenous peoples",
              "Describe the extraction of silver and gold from American mines using forced indigenous labor"
            ]
          }
        ]
      },
      {
        "key": "columbian_exchange",
        "name": "The Columbian Exchange",
        "short_description": "Analyzing the massive exchange of plants, animals, diseases, and ideas between hemispheres.",
        "sub_topics": [
          {
            "key": "biological_exchanges",
            "name": "Exchange of Plants, Animals, and Foods",
            "short_description": "Understanding what crossed the Atlantic and transformed diets and agriculture globally.",
            "example_tasks": [
              "Identify major foods that traveled from the Americas to Europe/Africa/Asia: corn, potatoes, tomatoes, cacao, tobacco",
              "Identify major items that traveled from Europe/Africa/Asia to Americas: wheat, sugar, horses, cattle, pigs",
              "Explain how the potato and corn increased food supplies and populations in Europe and Asia",
              "Analyze how the exchange of crops and animals transformed agriculture and diets on both sides of the Atlantic",
              "Describe the environmental impact of introducing new species to different ecosystems"
            ]
          },
          {
            "key": "disease_exchange",
            "name": "Disease Exchange and Demographic Catastrophe",
            "short_description": "Examining the devastating impact of Old World diseases on indigenous American populations.",
            "example_tasks": [
              "Describe how European diseases (smallpox, measles, typhus, influenza) decimated Native American populations",
              "Explain why Native Americans had no immunity to these diseases while Europeans had built up resistance",
              "Analyze estimates that 50-90% of indigenous populations died within a century of contact",
              "Evaluate how disease was the most significant factor in Spanish conquest success",
              "Describe the theory that syphilis may have traveled from Americas to Europe as part of the exchange"
            ]
          },
          {
            "key": "cultural_exchanges",
            "name": "Cultural and Technological Exchanges",
            "short_description": "Understanding the exchange of ideas, technologies, and cultural practices.",
            "example_tasks": [
              "Describe how European horses transformed Native American cultures, particularly on the Great Plains",
              "Explain the spread of Christianity to the Americas through missions and forced conversion",
              "Analyze how European concepts of land ownership conflicted with indigenous communal land use",
              "Evaluate both positive and devastating aspects of the Columbian Exchange for different groups"
            ]
          }
        ]
      },
      {
        "key": "other_european_exploration",
        "name": "English, French, and Dutch Exploration",
        "short_description": "Examining how other European powers joined the competition for colonies and trade routes.",
        "sub_topics": [
          {
            "key": "northwest_passage",
            "name": "Search for the Northwest Passage",
            "short_description": "Learning about attempts to find a northern route through North America to Asia.",
            "example_tasks": [
              "Explain why England and France sought a Northwest Passage through North America",
              "Describe voyages of explorers like John Cabot, Jacques Cartier, and Henry Hudson",
              "Analyze why the search for the Northwest Passage failed but led to claims in North America",
              "Evaluate how these explorations established territorial claims for future colonization"
            ]
          },
          {
            "key": "trading_companies",
            "name": "Joint-Stock Companies and Trading Empires",
            "short_description": "Understanding how private companies established trading networks and colonies.",
            "example_tasks": [
              "Describe the formation of joint-stock companies like the Dutch East India Company and English East India Company",
              "Explain how these companies combined private investment with government-granted monopolies",
              "Analyze Dutch success in controlling the spice trade in Southeast Asia",
              "Compare the Dutch/English model of trading companies to Spanish/Portuguese direct government control"
            ]
          }
        ]
      },
      {
        "key": "impact_on_indigenous",
        "name": "Impact on Indigenous Peoples",
        "short_description": "Analyzing the profound and often devastating consequences of European contact for native populations.",
        "sub_topics": [
          {
            "key": "population_decline",
            "name": "Population Collapse and Its Causes",
            "short_description": "Understanding the demographic catastrophe that befell indigenous peoples.",
            "example_tasks": [
              "Describe the multiple causes of indigenous population decline: disease, warfare, forced labor, famine",
              "Analyze regional variations in population loss across different parts of the Americas",
              "Explain how population loss disrupted indigenous societies, agriculture, and culture",
              "Evaluate long-term demographic consequences that lasted for centuries"
            ]
          },
          {
            "key": "indigenous_resistance",
            "name": "Indigenous Resistance and Adaptation",
            "short_description": "Learning how native peoples resisted, adapted to, and sometimes cooperated with Europeans.",
            "example_tasks": [
              "Describe examples of indigenous military resistance to European conquest",
              "Explain how some indigenous groups formed alliances with Europeans against rival native groups",
              "Analyze indigenous adoption of European technologies like horses and metal tools",
              "Evaluate the survival and persistence of indigenous cultures despite colonization pressures"
            ]
          },
          {
            "key": "cultural_destruction",
            "name": "Cultural and Religious Suppression",
            "short_description": "Understanding European efforts to eliminate indigenous religions, languages, and cultures.",
            "example_tasks": [
              "Describe Spanish destruction of Aztec and Maya codices and temples",
              "Explain forced conversion to Christianity and suppression of indigenous religions",
              "Analyze the encomienda and later hacienda systems that exploited indigenous labor",
              "Evaluate Bartolomé de Las Casas's defense of indigenous peoples and advocacy for their rights"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "colonial_americas",
    "name": "Colonial Americas and Atlantic World",
    "short_description": "Students examine the establishment of European colonies in North and South America, the development of the Atlantic slave trade, triangular trade networks, and the emergence of distinct colonial societies and economies.",
    "sub_topics": [
      {
        "key": "spanish_colonies",
        "name": "Spanish Colonial System in the Americas",
        "short_description": "Understanding Spanish colonial administration, economy, and society in detail.",
        "sub_topics": [
          {
            "key": "colonial_administration",
            "name": "Spanish Colonial Government and Administration",
            "short_description": "Learning how Spain governed its vast American empire.",
            "example_tasks": [
              "Describe the Council of the Indies and its role in overseeing Spanish colonies from Spain",
              "Explain the viceroyalty system dividing colonies into large administrative regions",
              "Analyze the role of audiencias (courts) in colonial governance",
              "Describe how Spain maintained tight control over colonial trade and economics through mercantilism"
            ]
          },
          {
            "key": "colonial_economy",
            "name": "Colonial Economy: Mining and Agriculture",
            "short_description": "Understanding how Spain extracted wealth from its colonies.",
            "example_tasks": [
              "Describe the importance of silver mining, particularly the Potosí mine in Bolivia",
              "Explain the mita system of forced indigenous labor in mines",
              "Analyze the hacienda system of large agricultural estates",
              "Evaluate how the flow of American silver affected the Spanish and global economy"
            ]
          },
          {
            "key": "caste_system",
            "name": "Spanish Colonial Social Hierarchy and Caste System",
            "short_description": "Examining the complex social stratification in Spanish colonies based on race and birth.",
            "example_tasks": [
              "Describe the caste system hierarchy: peninsulares, creoles, mestizos, mulattoes, indigenous peoples, enslaved Africans",
              "Explain why peninsulares (born in Spain) held the highest positions despite being outnumbered",
              "Analyze resentment among creoles (American-born Spanish) over being excluded from top positions",
              "Describe how racial mixing created complex categories and social mobility challenges"
            ]
          }
        ]
      },
      {
        "key": "british_colonies",
        "name": "British Colonies in North America",
        "short_description": "Examining the establishment and development of English colonies that became the United States.",
        "sub_topics": [
          {
            "key": "early_settlements",
            "name": "Early English Settlements: Jamestown and Plymouth",
            "short_description": "Learning about the first permanent English colonies and their struggles.",
            "example_tasks": [
              "Describe the founding of Jamestown in 1607 and the colonists' initial struggles with disease, starvation, and conflict",
              "Explain how tobacco cultivation saved Jamestown's economy and attracted more settlers",
              "Analyze the Pilgrims' founding of Plymouth in 1620 and their motivations for religious freedom",
              "Compare the economic motivations of Jamestown to the religious motivations of Plymouth"
            ]
          },
          {
            "key": "regional_differences",
            "name": "Regional Differences: New England, Middle, and Southern Colonies",
            "short_description": "Understanding how geography and purpose created distinct colonial regions.",
            "example_tasks": [
              "Describe New England colonies' economy based on fishing, shipbuilding, trade, and small farms",
              "Explain the Middle Colonies' diversity and economy based on grain farming and trade",
              "Analyze Southern colonies' plantation economy based on tobacco, rice, and indigo with enslaved labor",
              "Compare Puritan religious dominance in New England to religious diversity in Middle Colonies",
              "Create a chart comparing the three colonial regions in terms of economy, society, and religion"
            ]
          },
          {
            "key": "colonial_government",
            "name": "Development of Colonial Self-Government",
            "short_description": "Learning about representative assemblies and growing colonial autonomy.",
            "example_tasks": [
              "Describe the Virginia House of Burgesses (1619) as the first representative assembly in the colonies",
              "Explain the Mayflower Compact as an early example of self-government and social contract",
              "Analyze how colonial assemblies gradually gained power over taxation and legislation",
              "Evaluate the principle of 'no taxation without representation' that developed in colonial politics"
            ]
          },
          {
            "key": "native_relations",
            "name": "Relations Between Colonists and Native Americans",
            "short_description": "Understanding cooperation, conflict, and changing power dynamics.",
            "example_tasks": [
              "Describe early cooperation between colonists and Native Americans, including trade and the first Thanksgiving",
              "Explain conflicts over land, including King Philip's War (1675-1676) in New England",
              "Analyze how European diseases, warfare, and land loss devastated Native American populations",
              "Evaluate different colonial approaches to Native Americans (Spanish missions, French trade partnerships, English displacement)"
            ]
          }
        ]
      },
      {
        "key": "french_dutch_colonies",
        "name": "French and Dutch Colonies",
        "short_description": "Examining other European colonial ventures in North America and the Caribbean.",
        "sub_topics": [
          {
            "key": "new_france",
            "name": "New France and the Fur Trade",
            "short_description": "Understanding French colonization focused on trade rather than large-scale settlement.",
            "example_tasks": [
              "Describe the French colony of New France, including Quebec and the St. Lawrence River region",
              "Explain the French focus on fur trading and alliance-building with Native American tribes",
              "Analyze why New France remained sparsely populated compared to British colonies",
              "Describe French exploration and claims from Canada through the Great Lakes to Louisiana"
            ]
          },
          {
            "key": "new_netherland",
            "name": "Dutch Colony of New Netherland",
            "short_description": "Learning about Dutch colonization and trade in North America.",
            "example_tasks": [
              "Describe the Dutch colony of New Netherland centered on the Hudson River and New Amsterdam (later New York)",
              "Explain the Dutch West India Company's role in establishing the colony for trade",
              "Analyze why the Dutch colony was religiously tolerant and ethnically diverse",
              "Describe the English takeover of New Netherland in 1664"
            ]
          }
        ]
      },
      {
        "key": "atlantic_slave_trade",
        "name": "Atlantic Slave Trade",
        "short_description": "Examining the forced migration of millions of Africans and the development of the plantation slavery system.",
        "sub_topics": [
          {
            "key": "origins_slave_trade",
            "name": "Origins and Growth of the Atlantic Slave Trade",
            "short_description": "Understanding why Europeans turned to African slavery for colonial labor.",
            "example_tasks": [
              "Explain why Europeans initially used enslaved Africans: indigenous population decline, immunity to European diseases, experience with tropical agriculture",
              "Describe the growth of the slave trade from the 1500s through the 1800s",
              "Analyze the role of European, African, and American participants in the slave trade",
              "Evaluate estimates that 12-15 million Africans were forcibly transported to the Americas"
            ]
          },
          {
            "key": "middle_passage",
            "name": "The Middle Passage",
            "short_description": "Learning about the horrific ocean voyage that enslaved Africans endured.",
            "example_tasks": [
              "Describe the brutal conditions of the Middle Passage: overcrowding, disease, violence, inadequate food and water",
              "Explain that approximately 15-20% of enslaved Africans died during the voyage",
              "Analyze resistance by enslaved people during the Middle Passage, including rebellions and suicide",
              "Evaluate the Middle Passage as one of history's greatest atrocities and forced migrations"
            ]
          },
          {
            "key": "african_impact",
            "name": "Impact on Africa",
            "short_description": "Understanding how the slave trade affected African societies and economies.",
            "example_tasks": [
              "Describe how the slave trade disrupted African societies and economies",
              "Explain the role of African kingdoms and merchants in capturing and selling enslaved people",
              "Analyze how the slave trade increased warfare between African states competing for captives",
              "Evaluate long-term demographic, economic, and social impacts on African societies"
            ]
          },
          {
            "key": "slavery_in_americas",
            "name": "Slavery in the Americas",
            "short_description": "Examining the harsh conditions and resistance of enslaved people in colonial plantations.",
            "example_tasks": [
              "Describe the brutal working conditions on sugar, tobacco, rice, and cotton plantations",
              "Explain slave codes that legally defined enslaved people as property with no rights",
              "Analyze various forms of resistance: work slowdowns, sabotage, escape, rebellion",
              "Describe major slave revolts like the Stono Rebellion (1739) and Haitian Revolution (1791-1804)",
              "Evaluate how slavery shaped colonial economies and social structures"
            ]
          }
        ]
      },
      {
        "key": "triangular_trade",
        "name": "Triangular Trade and Atlantic Economy",
        "short_description": "Understanding the interconnected trading system linking Europe, Africa, and the Americas.",
        "sub_topics": [
          {
            "key": "trade_routes",
            "name": "Routes and Goods of Triangular Trade",
            "short_description": "Learning about the three-leg trading system across the Atlantic.",
            "example_tasks": [
              "Describe the three legs of triangular trade: Europe to Africa (manufactured goods), Africa to Americas (enslaved people), Americas to Europe (sugar, tobacco, cotton)",
              "Explain how each leg of the triangle was profitable for European traders and merchants",
              "Analyze how mercantilism motivated colonial powers to control this trade",
              "Create a diagram showing the flow of goods and people in the triangular trade system"
            ]
          },
          {
            "key": "mercantilism",
            "name": "Mercantilism and Colonial Economic Policy",
            "short_description": "Understanding the economic theory that colonies existed to benefit the mother country.",
            "example_tasks": [
              "Define mercantilism and its goal of accumulating gold and silver through favorable trade balances",
              "Explain how mother countries restricted colonial trade to benefit themselves",
              "Describe Navigation Acts and similar laws controlling colonial commerce",
              "Analyze colonial resentment of mercantilist restrictions on their economic freedom"
            ]
          }
        ]
      },
      {
        "key": "colonial_culture",
        "name": "Colonial Culture and Society",
        "short_description": "Examining social structures, cultural exchange, and daily life in colonial societies.",
        "sub_topics": [
          {
            "key": "social_structure",
            "name": "Social Hierarchies in Colonial Societies",
            "short_description": "Understanding class, race, and status in different colonial regions.",
            "example_tasks": [
              "Describe social hierarchies in different colonial regions based on race, wealth, and birth",
              "Explain the emergence of new racial and ethnic identities through mixing of European, African, and indigenous peoples",
              "Analyze opportunities and restrictions for different social groups (women, free blacks, indentured servants, enslaved people)",
              "Compare social mobility in different colonial systems"
            ]
          },
          {
            "key": "cultural_exchange",
            "name": "Cultural Exchange and Creolization",
            "short_description": "Learning about the blending of European, African, and indigenous cultures.",
            "example_tasks": [
              "Describe how African, European, and indigenous cultures blended in food, music, religion, and language",
              "Explain the development of creole languages and syncretic religions",
              "Analyze African cultural retention and adaptation in the Americas",
              "Evaluate the creation of new, distinctly American cultures different from any single source"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "absolute_monarchies_revolutions",
    "name": "Absolute Monarchies and Early Revolutions",
    "short_description": "Students examine the age of absolutism in Europe, analyzing how monarchs claimed unlimited power, the resistance movements that challenged royal authority, and the English revolutions that established constitutional limitations on government.",
    "sub_topics": [
      {
        "key": "age_absolutism",
        "name": "The Age of Absolutism",
        "short_description": "Understanding the theory and practice of absolute monarchy in European states.",
        "sub_topics": [
          {
            "key": "divine_right",
            "name": "Theory of Divine Right of Kings",
            "short_description": "Learning the ideological justification for absolute royal power.",
            "example_tasks": [
              "Define divine right of kings as the belief that monarchs received their authority directly from God",
              "Explain how divine right theory made challenging the king equivalent to challenging God",
              "Analyze how monarchs used divine right claims to justify absolute power and resist limitations",
              "Compare divine right theory to earlier medieval ideas about shared power between kings and nobles"
            ]
          },
          {
            "key": "louis_xiv",
            "name": "Louis XIV and Absolutism in France",
            "short_description": "Examining France under the Sun King as the model of absolute monarchy.",
            "example_tasks": [
              "Describe Louis XIV's statement 'L'état, c'est moi' (I am the state) and what it reveals about his power",
              "Explain how Louis XIV centralized power by weakening the nobility and controlling the government",
              "Analyze the construction and purpose of the Palace of Versailles as a symbol and tool of royal power",
              "Describe how Louis XIV controlled the French economy through mercantilism and his finance minister Colbert",
              "Evaluate the costs and benefits of Louis XIV's absolutism for France"
            ]
          },
          {
            "key": "other_absolute_monarchs",
            "name": "Absolutism in Other European States",
            "short_description": "Understanding absolute rule in Spain, Austria, Prussia, and Russia.",
            "example_tasks": [
              "Describe Philip II of Spain and his centralized control of a global empire",
              "Explain how the Habsburgs of Austria consolidated power over diverse territories",
              "Analyze Peter the Great's westernization and modernization of Russia while maintaining absolute rule",
              "Compare different models of absolutism across European states"
            ]
          }
        ]
      },
      {
        "key": "english_civil_war",
        "name": "English Civil War",
        "short_description": "Examining the conflict between Parliament and King Charles I that led to civil war and execution of the monarch.",
        "sub_topics": [
          {
            "key": "causes_civil_war",
            "name": "Causes of the English Civil War",
            "short_description": "Understanding the religious, political, and economic tensions that led to war.",
            "example_tasks": [
              "Describe conflicts between Charles I and Parliament over taxation and royal authority",
              "Explain religious tensions between the Anglican Church, Puritans, and Catholics",
              "Analyze Charles I's attempt to rule without Parliament for eleven years (1629-1640)",
              "Evaluate how Charles I's belief in divine right conflicted with Parliament's claims to power"
            ]
          },
          {
            "key": "course_civil_war",
            "name": "The Civil War and Oliver Cromwell",
            "short_description": "Learning about the military conflict between Royalists and Parliamentarians.",
            "example_tasks": [
              "Describe the division between Cavaliers (supporters of the king) and Roundheads (supporters of Parliament)",
              "Explain Oliver Cromwell's role as military leader of the parliamentary forces",
              "Analyze the trial and execution of Charles I in 1649 as an unprecedented act",
              "Describe Cromwell's rule as Lord Protector and his establishment of a Puritan commonwealth"
            ]
          },
          {
            "key": "restoration",
            "name": "Restoration of the Monarchy",
            "short_description": "Understanding the return of the Stuart kings after Cromwell's death.",
            "example_tasks": [
              "Explain why the monarchy was restored in 1660 with Charles II after Cromwell's death",
              "Describe the reign of James II and fears of Catholic absolutism",
              "Analyze tensions between king and Parliament that continued after the Restoration",
              "Evaluate whether the English Civil War permanently changed the balance of power"
            ]
          }
        ]
      },
      {
        "key": "glorious_revolution",
        "name": "The Glorious Revolution",
        "short_description": "Examining England's bloodless revolution that established constitutional monarchy and parliamentary supremacy.",
        "sub_topics": [
          {
            "key": "causes_glorious_revolution",
            "name": "Causes and Events of 1688",
            "short_description": "Understanding why Parliament invited William and Mary to take the throne.",
            "example_tasks": [
              "Describe James II's pro-Catholic policies that alarmed Protestant Parliament",
              "Explain why Parliament invited William of Orange and Mary to invade England",
              "Analyze why James II fled without fighting, making this a 'bloodless' revolution",
              "Evaluate the significance of Parliament choosing the monarch rather than accepting hereditary succession"
            ]
          },
          {
            "key": "english_bill_rights",
            "name": "English Bill of Rights (1689)",
            "short_description": "Learning about the document that limited royal power and established parliamentary rights.",
            "example_tasks": [
              "Describe key provisions of the English Bill of Rights: regular parliaments, free elections, freedom of speech in Parliament, no taxation without parliamentary consent",
              "Explain how the Bill of Rights established constitutional monarchy with real power in Parliament",
              "Analyze specific rights protected, such as the right to petition and prohibition of cruel punishment",
              "Compare the English Bill of Rights to later American Bill of Rights and identify influences"
            ]
          },
          {
            "key": "significance_glorious_revolution",
            "name": "Significance and Legacy",
            "short_description": "Understanding the long-term impact on British government and political thought.",
            "example_tasks": [
              "Evaluate how the Glorious Revolution established the principle that government power comes from consent of the governed",
              "Explain John Locke's political philosophy and how the Glorious Revolution reflected his ideas",
              "Analyze how the Glorious Revolution influenced later democratic revolutions, especially the American Revolution",
              "Describe the development of cabinet government and the prime minister system after 1688"
            ]
          }
        ]
      },
      {
        "key": "conflict_absolutism_constitutionalism",
        "name": "Comparing Absolutism and Constitutionalism",
        "short_description": "Analyzing the contrast between unlimited royal power and government limited by law and representative bodies.",
        "sub_topics": [
          {
            "key": "characteristics_comparison",
            "name": "Characteristics of Each System",
            "short_description": "Understanding the defining features of absolute versus constitutional government.",
            "example_tasks": [
              "Create a comparison chart showing key differences between absolutism and constitutionalism",
              "Explain how absolutism concentrated power in the monarch while constitutionalism divided it",
              "Analyze the role of law: absolute monarchs claimed to be above law while constitutional systems subjected rulers to law",
              "Compare France under Louis XIV (absolutism) to England after 1688 (constitutionalism)"
            ]
          },
          {
            "key": "long_term_impact",
            "name": "Long-term Political Development",
            "short_description": "Evaluating which system proved more stable and influential.",
            "example_tasks": [
              "Analyze why constitutionalism proved more adaptable to changing circumstances",
              "Explain how absolutism eventually collapsed in violent revolutions (France, Russia)",
              "Evaluate the influence of English constitutionalism on American and other democratic systems",
              "Describe the gradual spread of constitutional limitations on government power"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "enlightenment",
    "name": "The Enlightenment",
    "short_description": "Students explore the Age of Reason, examining Enlightenment thinkers' emphasis on reason, science, individual rights, and social progress, and analyzing how these ideas challenged traditional authority and inspired political revolutions.",
    "sub_topics": [
      {
        "key": "enlightenment_origins",
        "name": "Origins and Characteristics of the Enlightenment",
        "short_description": "Understanding the intellectual movement that emphasized reason, science, and progress.",
        "sub_topics": [
          {
            "key": "foundations_enlightenment",
            "name": "Intellectual Foundations",
            "short_description": "Learning what preceded and enabled the Enlightenment.",
            "example_tasks": [
              "Explain how the Scientific Revolution provided a model for using reason to understand the world",
              "Describe how the printing press enabled rapid spread of new ideas",
              "Analyze the growth of literacy and educated middle class interested in new ideas",
              "Evaluate the role of salons and coffeehouses as venues for intellectual discussion"
            ]
          },
          {
            "key": "core_enlightenment_ideas",
            "name": "Core Enlightenment Principles",
            "short_description": "Understanding the key beliefs that defined Enlightenment thinking.",
            "example_tasks": [
              "Define the Enlightenment emphasis on reason as the primary source of authority and legitimacy",
              "Explain the belief in natural law governing human affairs, discoverable through reason",
              "Describe faith in progress and the perfectibility of human society",
              "Analyze the emphasis on individual rights and human dignity",
              "Evaluate how these ideas challenged traditional sources of authority (monarchy, church, tradition)"
            ]
          }
        ]
      },
      {
        "key": "enlightenment_thinkers",
        "name": "Major Enlightenment Philosophers",
        "short_description": "Examining the ideas of key thinkers who shaped Enlightenment thought.",
        "sub_topics": [
          {
            "key": "john_locke",
            "name": "John Locke: Natural Rights and Social Contract",
            "short_description": "Understanding Locke's influential political philosophy.",
            "example_tasks": [
              "Explain Locke's concept of natural rights: life, liberty, and property",
              "Describe Locke's social contract theory: people agree to government to protect their rights",
              "Analyze Locke's argument that people have the right to overthrow unjust governments",
              "Evaluate how Locke's ideas influenced the American Declaration of Independence",
              "Compare Locke's optimistic view of human nature to earlier pessimistic views"
            ]
          },
          {
            "key": "montesquieu",
            "name": "Montesquieu: Separation of Powers",
            "short_description": "Learning about checks and balances in government.",
            "example_tasks": [
              "Describe Montesquieu's analysis of different forms of government in 'The Spirit of the Laws'",
              "Explain his theory of separation of powers into legislative, executive, and judicial branches",
              "Analyze how separation of powers prevents tyranny through checks and balances",
              "Evaluate the influence of Montesquieu's ideas on the United States Constitution",
              "Compare Montesquieu's system to absolute monarchy with concentrated power"
            ]
          },
          {
            "key": "rousseau",
            "name": "Jean-Jacques Rousseau: Popular Sovereignty",
            "short_description": "Understanding Rousseau's democratic philosophy and general will.",
            "example_tasks": [
              "Explain Rousseau's famous statement that 'man is born free, and everywhere he is in chains'",
              "Describe Rousseau's concept of the general will and popular sovereignty",
              "Analyze Rousseau's social contract theory emphasizing direct democracy",
              "Evaluate how Rousseau's ideas influenced the French Revolution",
              "Compare Rousseau's emphasis on equality to Locke's emphasis on individual rights"
            ]
          },
          {
            "key": "voltaire",
            "name": "Voltaire: Religious Tolerance and Freedom of Speech",
            "short_description": "Learning about criticism of church power and advocacy for civil liberties.",
            "example_tasks": [
              "Describe Voltaire's satirical criticism of religious intolerance and church corruption",
              "Explain Voltaire's famous statement about defending others' right to speak even when disagreeing",
              "Analyze Voltaire's promotion of deism (belief in a creator who doesn't intervene) over organized religion",
              "Evaluate Voltaire's influence on ideals of free speech and religious freedom"
            ]
          },
          {
            "key": "other_enlightenment_thinkers",
            "name": "Other Enlightenment Philosophers",
            "short_description": "Understanding contributions of additional key thinkers.",
            "example_tasks": [
              "Describe Adam Smith's economic philosophy of free markets and the 'invisible hand' in 'The Wealth of Nations'",
              "Explain Cesare Beccaria's arguments against torture and for fair criminal justice",
              "Analyze Mary Wollstonecraft's 'A Vindication of the Rights of Woman' as early feminist thought",
              "Evaluate Denis Diderot's Encyclopedia as an attempt to organize and spread Enlightenment knowledge"
            ]
          }
        ]
      },
      {
        "key": "enlightenment_impact",
        "name": "Impact of Enlightenment Ideas",
        "short_description": "Analyzing how Enlightenment thought influenced politics, society, and culture.",
        "sub_topics": [
          {
            "key": "enlightened_despots",
            "name": "Enlightened Despotism",
            "short_description": "Understanding monarchs who claimed to rule by Enlightenment principles.",
            "example_tasks": [
              "Define enlightened despotism as absolute rule supposedly guided by reason and serving the people",
              "Describe reforms of enlightened despots like Frederick II of Prussia and Catherine the Great of Russia",
              "Analyze whether these rulers genuinely embraced Enlightenment ideals or used them as propaganda",
              "Evaluate the contradiction between enlightened principles and continued absolute power"
            ]
          },
          {
            "key": "influence_revolutions",
            "name": "Influence on Democratic Revolutions",
            "short_description": "Learning how Enlightenment ideas inspired revolutionary movements.",
            "example_tasks": [
              "Explain how Enlightenment ideas of natural rights and popular sovereignty justified revolution",
              "Describe specific Enlightenment concepts visible in the American Declaration of Independence",
              "Analyze how French revolutionaries drew on Enlightenment philosophy",
              "Evaluate the transformation of philosophical ideas into political action"
            ]
          },
          {
            "key": "social_reform",
            "name": "Social and Religious Impact",
            "short_description": "Understanding how Enlightenment challenged traditional social hierarchies and religious authority.",
            "example_tasks": [
              "Describe the rise of religious skepticism and deism among educated elites",
              "Explain challenges to traditional justifications for social inequality",
              "Analyze early arguments for religious tolerance and separation of church and state",
              "Evaluate the emergence of debates about slavery, women's rights, and education"
            ]
          }
        ]
      },
      {
        "key": "limits_enlightenment",
        "name": "Limitations and Criticisms of the Enlightenment",
        "short_description": "Examining who was excluded from Enlightenment ideals and critiques of its principles.",
        "sub_topics": [
          {
            "key": "exclusions",
            "name": "Who Was Left Out of Enlightenment Ideals",
            "short_description": "Understanding that Enlightenment thinkers often excluded women, non-Europeans, and the poor.",
            "example_tasks": [
              "Analyze how most Enlightenment thinkers limited natural rights to property-owning men",
              "Describe how many Enlightenment figures held racist views about non-European peoples",
              "Explain how women were excluded from political participation despite talk of universal rights",
              "Evaluate the contradiction between universal principles and exclusionary practices",
              "Describe early critics like Mary Wollstonecraft who pointed out these contradictions"
            ]
          },
          {
            "key": "romantic_reaction",
            "name": "Romantic Reaction to Enlightenment",
            "short_description": "Learning about later criticism that reason alone was insufficient.",
            "example_tasks": [
              "Describe the Romantic movement's emphasis on emotion, intuition, and individual creativity",
              "Explain Romantic criticism that Enlightenment overvalued reason and undervalued feeling",
              "Analyze Romantic appreciation for nature, tradition, and the supernatural that Enlightenment dismissed",
              "Compare Enlightenment universalism to Romantic nationalism and appreciation of cultural diversity"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "american_revolution",
    "name": "The American Revolution",
    "short_description": "Students analyze the causes of colonial rebellion against Britain, major events of the Revolutionary War, the Declaration of Independence, the challenges of creating a new nation, and the Constitution's framework for government.",
    "sub_topics": [
      {
        "key": "causes_american_revolution",
        "name": "Causes of the American Revolution",
        "short_description": "Understanding the growing tensions between Britain and its American colonies.",
        "sub_topics": [
          {
            "key": "french_indian_war",
            "name": "French and Indian War and Its Aftermath",
            "short_description": "Learning how this conflict changed British policy toward the colonies.",
            "example_tasks": [
              "Describe the French and Indian War (1754-1763) as part of the global Seven Years' War",
              "Explain how British victory gave Britain control of North America east of the Mississippi",
              "Analyze Britain's war debt and decision to tax colonies to help pay for it",
              "Describe the Proclamation of 1763 prohibiting colonial settlement west of the Appalachians and colonial anger about it"
            ]
          },
          {
            "key": "taxation_without_representation",
            "name": "Taxation Without Representation",
            "short_description": "Understanding colonial resistance to British taxation.",
            "example_tasks": [
              "Explain the colonial slogan 'No taxation without representation' and what it meant",
              "Describe the Sugar Act (1764) and Stamp Act (1765) as early attempts to tax colonies",
              "Analyze colonial argument that only their own assemblies could tax them, not distant Parliament",
              "Describe colonial protests including boycotts, petitions, and the Stamp Act Congress",
              "Explain the Townshend Acts (1767) and continued colonial resistance"
            ]
          },
          {
            "key": "escalating_tensions",
            "name": "Escalating Conflicts and Violence",
            "short_description": "Learning about events that pushed colonies toward rebellion.",
            "example_tasks": [
              "Describe the Boston Massacre (1770) and how it was used as propaganda against Britain",
              "Explain the Boston Tea Party (1773) as protest against the Tea Act",
              "Analyze the Intolerable Acts (1774) as British punishment of Massachusetts",
              "Describe the First Continental Congress (1774) as a unified colonial response",
              "Evaluate how each British action provoked stronger colonial reaction"
            ]
          }
        ]
      },
      {
        "key": "revolutionary_war",
        "name": "The Revolutionary War",
        "short_description": "Examining the military conflict between Britain and the thirteen colonies.",
        "sub_topics": [
          {
            "key": "beginning_war",
            "name": "Beginning of the War: Lexington and Concord",
            "short_description": "Understanding how armed conflict began in Massachusetts.",
            "example_tasks": [
              "Describe the battles of Lexington and Concord (April 1775) as the 'shot heard round the world'",
              "Explain British goals of seizing colonial weapons and arresting rebel leaders",
              "Analyze Paul Revere's ride and colonial preparedness through the militia system",
              "Describe the Second Continental Congress's response, including creating the Continental Army"
            ]
          },
          {
            "key": "declaration_independence",
            "name": "Declaration of Independence",
            "short_description": "Learning about the document that announced American independence.",
            "example_tasks": [
              "Explain Thomas Paine's 'Common Sense' (1776) and its argument for independence",
              "Describe Thomas Jefferson as primary author of the Declaration of Independence",
              "Analyze key sections: preamble on natural rights, list of grievances against George III, declaration of independence",
              "Identify Enlightenment ideas in the Declaration, particularly from John Locke",
              "Evaluate the Declaration's statement that 'all men are created equal' given existence of slavery",
              "Explain the significance of July 4, 1776, as the date of American independence"
            ]
          },
          {
            "key": "major_battles_campaigns",
            "name": "Major Battles and Campaigns",
            "short_description": "Understanding key military events of the war.",
            "example_tasks": [
              "Describe early American defeats and Washington's surprise victories at Trenton and Princeton",
              "Explain the significance of the Battle of Saratoga (1777) as a turning point",
              "Analyze the harsh winter at Valley Forge (1777-1778) and the Continental Army's survival",
              "Describe the final British defeat at Yorktown (1781)",
              "Create a timeline of major battles showing the progression of the war"
            ]
          },
          {
            "key": "challenges_advantages",
            "name": "Challenges and Advantages of Both Sides",
            "short_description": "Analyzing strengths and weaknesses of American and British forces.",
            "example_tasks": [
              "Compare British advantages (professional army, navy, wealth) to American advantages (fighting on home territory, motivation, knowledge of terrain)",
              "Explain American disadvantages: shortage of supplies, untrained troops, weak central authority",
              "Analyze George Washington's leadership in holding the army together despite defeats",
              "Describe the role of foreign allies, especially France, in American victory",
              "Evaluate why Britain ultimately failed despite superior military power"
            ]
          },
          {
            "key": "treaty_paris",
            "name": "Treaty of Paris (1783)",
            "short_description": "Understanding how the war ended and what America gained.",
            "example_tasks": [
              "Describe the terms of the Treaty of Paris recognizing American independence",
              "Explain the new boundaries of the United States extending to the Mississippi River",
              "Analyze British agreement to remove troops and return property",
              "Evaluate the generous terms America received, partly due to European diplomacy"
            ]
          }
        ]
      },
      {
        "key": "creating_new_nation",
        "name": "Creating a New Nation",
        "short_description": "Examining challenges of establishing a government after independence.",
        "sub_topics": [
          {
            "key": "articles_confederation",
            "name": "Articles of Confederation",
            "short_description": "Understanding America's first constitution and its weaknesses.",
            "example_tasks": [
              "Describe the Articles of Confederation as a loose alliance of independent states",
              "Explain weaknesses: no executive, no federal courts, no power to tax, unanimous consent for amendments",
              "Analyze problems these weaknesses caused: inability to pay debts, no common currency, difficulty making decisions",
              "Describe Shays' Rebellion (1786-1787) as evidence the Articles were too weak",
              "Evaluate why Americans initially created such a weak national government (fear of tyranny)"
            ]
          },
          {
            "key": "constitutional_convention",
            "name": "Constitutional Convention (1787)",
            "short_description": "Learning about the creation of the U.S. Constitution.",
            "example_tasks": [
              "Describe the decision to revise but ultimately replace the Articles of Confederation",
              "Explain major compromises: Great Compromise (bicameral legislature), Three-Fifths Compromise (counting enslaved people), Electoral College",
              "Analyze the system of federalism dividing power between national and state governments",
              "Describe checks and balances based on Montesquieu's ideas",
              "Evaluate the Constitutional Convention as a significant achievement in creating a lasting framework"
            ]
          },
          {
            "key": "ratification_debate",
            "name": "Ratification Debate: Federalists vs. Anti-Federalists",
            "short_description": "Understanding the debate over whether to ratify the Constitution.",
            "example_tasks": [
              "Explain Federalist arguments: need for stronger central government, protection of property, prevention of mob rule",
              "Describe Anti-Federalist concerns: Constitution gave too much power to national government, lacked bill of rights, favored elite",
              "Analyze the Federalist Papers by Hamilton, Madison, and Jay as arguments for ratification",
              "Explain how promise of a Bill of Rights helped achieve ratification",
              "Evaluate both sides' concerns as legitimate fears about power and liberty"
            ]
          },
          {
            "key": "bill_of_rights",
            "name": "Bill of Rights (1791)",
            "short_description": "Learning about the first ten amendments protecting individual liberties.",
            "example_tasks": [
              "Describe why a Bill of Rights was added to satisfy Anti-Federalist concerns",
              "Explain key rights protected: freedom of religion, speech, press, assembly, petition (1st Amendment)",
              "Describe other important amendments: right to bear arms (2nd), protection against unreasonable search (4th), due process (5th), trial rights (6-8)",
              "Analyze the 10th Amendment reserving powers to states and people",
              "Evaluate how the Bill of Rights has protected liberty throughout American history"
            ]
          }
        ]
      },
      {
        "key": "revolution_significance",
        "name": "Significance and Limitations of the Revolution",
        "short_description": "Analyzing the Revolution's impact and who benefited from independence.",
        "sub_topics": [
          {
            "key": "revolutionary_ideals",
            "name": "Revolutionary Ideals and Their Application",
            "short_description": "Understanding the gap between revolutionary rhetoric and reality.",
            "example_tasks": [
              "Analyze the Declaration's claim that 'all men are created equal' and who was excluded",
              "Describe how women, enslaved people, Native Americans, and propertyless men gained little from independence",
              "Explain how slavery continued despite language about liberty and equality",
              "Evaluate the contradiction between revolutionary ideals and continuing inequality"
            ]
          },
          {
            "key": "global_influence",
            "name": "Global Influence of the American Revolution",
            "short_description": "Learning how the Revolution inspired other movements worldwide.",
            "example_tasks": [
              "Describe the American Revolution as the first successful colonial rebellion",
              "Explain how American ideas influenced the French Revolution",
              "Analyze the inspiration American independence provided to Latin American independence movements",
              "Evaluate the Revolution's role in spreading Enlightenment ideals about rights and self-government"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "french_revolution_napoleon",
    "name": "French Revolution and Napoleonic Era",
    "short_description": "Students examine the causes and phases of the French Revolution, the Reign of Terror, Napoleon's rise to power and empire, and the Congress of Vienna's attempt to restore order and balance of power in Europe.",
    "sub_topics": [
      {
        "key": "causes_french_revolution",
        "name": "Causes of the French Revolution",
        "short_description": "Understanding the social, economic, and political problems that led to revolution in 1789.",
        "sub_topics": [
          {
            "key": "old_regime",
            "name": "The Old Regime and Three Estates",
            "short_description": "Learning about France's rigid social hierarchy and inequality.",
            "example_tasks": [
              "Describe the three estates: First Estate (clergy), Second Estate (nobility), Third Estate (everyone else - 97% of population)",
              "Explain the privileges of the First and Second Estates: exemption from most taxes, special legal rights",
              "Analyze resentment of the Third Estate, especially the bourgeoisie (middle class), over inequality",
              "Compare the wealth and power of different groups within the Third Estate",
              "Evaluate how the estate system created fundamental unfairness in French society"
            ]
          },
          {
            "key": "financial_crisis",
            "name": "Economic Problems and Financial Crisis",
            "short_description": "Understanding France's debt crisis and failed attempts at reform.",
            "example_tasks": [
              "Describe France's massive debt from wars, including support for the American Revolution",
              "Explain how the tax system placed burdens on the Third Estate while nobles and clergy paid little",
              "Analyze Louis XVI's failed attempts to tax the nobility and their resistance",
              "Describe the calling of the Estates-General in 1789 as a desperate measure to solve the crisis",
              "Evaluate how financial problems exposed deeper issues of political power and inequality"
            ]
          },
          {
            "key": "enlightenment_influence",
            "name": "Influence of Enlightenment Ideas",
            "short_description": "Learning how Enlightenment philosophy inspired demands for change.",
            "example_tasks": [
              "Explain how Enlightenment ideas about natural rights and popular sovereignty challenged absolute monarchy",
              "Describe how the success of the American Revolution inspired French reformers",
              "Analyze the spread of revolutionary ideas through books, pamphlets, and salons",
              "Evaluate the role of Enlightenment thinkers like Rousseau and Voltaire in shaping revolutionary thought"
            ]
          }
        ]
      },
      {
        "key": "phases_revolution",
        "name": "Phases of the French Revolution",
        "short_description": "Examining the Revolution's progression from moderate reform to radical violence.",
        "sub_topics": [
          {
            "key": "moderate_phase",
            "name": "Moderate Phase: National Assembly (1789-1791)",
            "short_description": "Understanding early revolutionary reforms and the constitutional monarchy.",
            "example_tasks": [
              "Describe the Tennis Court Oath when Third Estate representatives vowed to create a constitution",
              "Explain the storming of the Bastille (July 14, 1789) as a symbolic revolutionary moment",
              "Analyze the Declaration of the Rights of Man and of the Citizen and its Enlightenment principles",
              "Describe the abolition of feudalism and end of special privileges for nobles and clergy",
              "Explain the Constitution of 1791 establishing a limited constitutional monarchy",
              "Evaluate the Women's March on Versailles and women's participation in the Revolution"
            ]
          },
          {
            "key": "radical_phase",
            "name": "Radical Phase: The Republic and Reign of Terror (1792-1794)",
            "short_description": "Learning about the Revolution's violent turn and execution of the king.",
            "example_tasks": [
              "Describe the overthrow of the monarchy and establishment of the French Republic in 1792",
              "Explain the trial and execution of Louis XVI in January 1793",
              "Analyze the rise of the radical Jacobins led by Maximilien Robespierre",
              "Describe the Reign of Terror: mass executions by guillotine, suppression of dissent, de-Christianization",
              "Explain the Committee of Public Safety and its dictatorial powers",
              "Analyze how fear of counter-revolution and foreign invasion radicalized the Revolution",
              "Describe the execution of Robespierre in July 1794 (Thermidorian Reaction) ending the Terror"
            ]
          },
          {
            "key": "directory_period",
            "name": "The Directory (1795-1799)",
            "short_description": "Understanding the weak government that followed the Terror.",
            "example_tasks": [
              "Describe the Directory as a five-man executive attempting to restore stability",
              "Explain problems facing the Directory: economic crisis, political instability, corruption",
              "Analyze continued conflicts between royalists wanting monarchy and radicals wanting more reform",
              "Evaluate how the Directory's weakness created opportunity for military takeover"
            ]
          }
        ]
      },
      {
        "key": "napoleon_rise",
        "name": "Napoleon Bonaparte's Rise to Power",
        "short_description": "Examining how a military general became Emperor of France.",
        "sub_topics": [
          {
            "key": "military_success",
            "name": "Napoleon's Military Career and Popularity",
            "short_description": "Learning how military victories made Napoleon a national hero.",
            "example_tasks": [
              "Describe Napoleon's successful military campaigns in Italy and Egypt",
              "Explain how military success and personal charisma made Napoleon popular",
              "Analyze Napoleon's political skills and ability to manipulate public opinion",
              "Evaluate how French desire for stability after years of chaos helped Napoleon"
            ]
          },
          {
            "key": "coup_consulate",
            "name": "Coup d'État and The Consulate",
            "short_description": "Understanding Napoleon's seizure of power in 1799.",
            "example_tasks": [
              "Describe the coup of 18 Brumaire (November 1799) that overthrew the Directory",
              "Explain Napoleon's position as First Consul with near-dictatorial powers",
              "Analyze the Constitution of 1800 that gave appearance of democracy while concentrating power",
              "Describe domestic reforms: Napoleonic Code, Concordat with Catholic Church, public education, Bank of France",
              "Evaluate whether Napoleon preserved revolutionary gains or betrayed revolutionary ideals"
            ]
          },
          {
            "key": "emperor_napoleon",
            "name": "Napoleon Crowns Himself Emperor",
            "short_description": "Learning about Napoleon's transformation from consul to emperor.",
            "example_tasks": [
              "Describe Napoleon's coronation as Emperor in 1804 and his crowning of himself",
              "Explain how Napoleon established a new nobility and imperial court",
              "Analyze the plebiscites (votes) Napoleon used to legitimize his power",
              "Evaluate how far France had traveled from 1789's ideals of liberty and equality"
            ]
          }
        ]
      },
      {
        "key": "napoleonic_empire",
        "name": "Napoleon's Empire and Wars",
        "short_description": "Examining Napoleon's conquest of most of Europe and eventual defeat.",
        "sub_topics": [
          {
            "key": "military_conquests",
            "name": "Napoleon's Military Campaigns and Empire",
            "short_description": "Understanding the extent of French domination of Europe.",
            "example_tasks": [
              "Describe Napoleon's major military victories: Austerlitz, Jena, Wagram",
              "Explain the extent of the French Empire by 1810, controlling most of continental Europe",
              "Analyze Napoleon's placement of family members as rulers of conquered territories",
              "Describe the Continental System attempting to blockade Britain economically",
              "Evaluate Napoleon's military genius and innovative tactics"
            ]
          },
          {
            "key": "napoleonic_code",
            "name": "Napoleonic Code and Reforms",
            "short_description": "Learning about Napoleon's lasting legal and administrative reforms.",
            "example_tasks": [
              "Describe the Napoleonic Code as comprehensive legal system based on Enlightenment principles",
              "Explain key features: equality before the law, religious toleration, property rights, career open to talent",
              "Analyze limitations: reinforced patriarchal authority, limited women's rights, restored slavery in colonies",
              "Evaluate the Code's lasting influence as it spread across Europe and Latin America"
            ]
          },
          {
            "key": "resistance_nationalism",
            "name": "Resistance and Rise of Nationalism",
            "short_description": "Understanding how Napoleon's conquests sparked nationalist movements.",
            "example_tasks": [
              "Explain how French occupation created resentment and nationalist reactions in conquered territories",
              "Describe guerrilla warfare in Spain against French occupation",
              "Analyze how Napoleon inadvertently spread revolutionary and nationalist ideas across Europe",
              "Evaluate the awakening of national consciousness in Germany, Italy, and other regions"
            ]
          },
          {
            "key": "napoleon_downfall",
            "name": "Napoleon's Downfall",
            "short_description": "Examining the disasters that ended Napoleon's empire.",
            "example_tasks": [
              "Describe the disastrous invasion of Russia in 1812 and loss of most of the Grand Army",
              "Explain the Battle of Leipzig (1813) where allied forces defeated Napoleon",
              "Analyze Napoleon's first abdication and exile to Elba in 1814",
              "Describe the Hundred Days: Napoleon's return, final defeat at Waterloo (1815), and exile to St. Helena",
              "Evaluate factors in Napoleon's defeat: overextension, nationalism, coalition of enemies"
            ]
          }
        ]
      },
      {
        "key": "congress_of_vienna",
        "name": "Congress of Vienna and Restoration",
        "short_description": "Understanding the attempt to restore stability and prevent future revolutions.",
        "sub_topics": [
          {
            "key": "vienna_settlement",
            "name": "The Congress of Vienna (1814-1815)",
            "short_description": "Learning about the peace settlement after Napoleon's defeat.",
            "example_tasks": [
              "Describe the major powers at Vienna: Austria, Prussia, Russia, Britain, France",
              "Explain the role of Austrian minister Metternich in shaping the settlement",
              "Analyze the principle of legitimacy: restoring legitimate monarchs to their thrones",
              "Describe territorial changes creating a balance of power to prevent future French aggression",
              "Evaluate whether the Congress succeeded in creating lasting peace"
            ]
          },
          {
            "key": "conservative_reaction",
            "name": "Conservative Reaction and Holy Alliance",
            "short_description": "Understanding attempts to suppress revolutionary and liberal movements.",
            "example_tasks": [
              "Explain conservatism's emphasis on tradition, order, and gradual change versus revolution",
              "Describe the Holy Alliance and Concert of Europe as systems to maintain the Vienna settlement",
              "Analyze Metternich's use of censorship and repression to prevent liberal and nationalist movements",
              "Evaluate how the Congress of Vienna temporarily suppressed but couldn't eliminate demands for change"
            ]
          },
          {
            "key": "revolutionary_legacy",
            "name": "Legacy of the French Revolution",
            "short_description": "Analyzing the Revolution's lasting impact on Europe and the world.",
            "example_tasks": [
              "Evaluate the Revolution's success in ending absolute monarchy and noble privilege in France",
              "Describe the spread of revolutionary ideals: nationalism, liberalism, popular sovereignty",
              "Analyze how the Revolution inspired future democratic and nationalist movements",
              "Compare revolutionary ideals to actual outcomes, including violence and dictatorship",
              "Evaluate historians' debates about whether the Revolution's benefits outweighed its costs"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "latin_american_independence",
    "name": "Latin American Independence Movements",
    "short_description": "Students examine the struggles for independence across Latin America, analyzing the roles of key leaders like Simón Bolívar and José de San Martín, and the challenges facing newly independent nations.",
    "sub_topics": [
      {
        "key": "causes_latin_independence",
        "name": "Causes of Latin American Independence Movements",
        "short_description": "Understanding why Spanish and Portuguese colonies sought independence.",
        "sub_topics": [
          {
            "key": "social_inequalities",
            "name": "Social and Racial Hierarchies",
            "short_description": "Learning about colonial social structures that created resentment.",
            "example_tasks": [
              "Describe the social hierarchy: peninsulares at top, then creoles, mestizos, mulattoes, indigenous peoples, enslaved Africans",
              "Explain creole resentment despite being wealthy - excluded from top government positions reserved for peninsulares",
              "Analyze how the vast majority of the population (indigenous, mixed-race, enslaved) had few rights",
              "Evaluate how social inequality created tensions that independence movements could exploit"
            ]
          },
          {
            "key": "enlightenment_revolutions",
            "name": "Influence of Enlightenment and Other Revolutions",
            "short_description": "Understanding how ideas and examples inspired independence movements.",
            "example_tasks": [
              "Explain how Enlightenment ideas about natural rights and self-government spread to Latin America",
              "Describe the inspiration of the American Revolution as successful colonial independence",
              "Analyze how the French Revolution and Haitian Revolution demonstrated possibility of overthrowing existing order",
              "Evaluate the role of educated creoles in reading and spreading revolutionary ideas"
            ]
          },
          {
            "key": "napoleonic_wars_opportunity",
            "name": "Napoleonic Wars Create Opportunity",
            "short_description": "Learning how Napoleon's conquest of Spain weakened colonial control.",
            "example_tasks": [
              "Describe how Napoleon's invasion of Spain (1808) created a power vacuum",
              "Explain how colonial elites initially claimed loyalty to the Spanish king while establishing self-government",
              "Analyze how prolonged instability in Spain gave colonies time to organize independence movements",
              "Evaluate the timing: why independence movements succeeded in early 1800s but not earlier"
            ]
          }
        ]
      },
      {
        "key": "independence_movements",
        "name": "Major Independence Movements and Leaders",
        "short_description": "Examining the struggles in different regions of Latin America.",
        "sub_topics": [
          {
            "key": "haitian_revolution",
            "name": "Haitian Revolution",
            "short_description": "Understanding the only successful slave revolution in history.",
            "example_tasks": [
              "Describe Haiti (Saint-Domingue) as France's wealthiest colony based on sugar and slavery",
              "Explain Toussaint L'Ouverture's leadership of the slave rebellion beginning in 1791",
              "Analyze the revolution's progression through conflicts with France, Spain, and Britain",
              "Describe Haiti's declaration of independence in 1804 as the first independent nation in Latin America",
              "Evaluate the Haitian Revolution's significance as a successful slave revolt and its limited influence due to fear"
            ]
          },
          {
            "key": "mexican_independence",
            "name": "Mexican Independence",
            "short_description": "Learning about Mexico's path to independence through popular and elite movements.",
            "example_tasks": [
              "Describe Father Miguel Hidalgo's Grito de Dolores (1810) calling for independence and social reform",
              "Explain the popular uprising of indigenous and mestizo peoples fighting for land reform",
              "Analyze why creole elites initially opposed Hidalgo's movement due to its radical social goals",
              "Describe how conservative creoles under Agustín de Iturbide achieved independence (1821) to prevent social change",
              "Evaluate Mexico's achievement of independence but failure to address social inequality"
            ]
          },
          {
            "key": "simon_bolivar",
            "name": "Simón Bolívar and Northern South America",
            "short_description": "Examining 'The Liberator' and his campaigns for independence.",
            "example_tasks": [
              "Describe Simón Bolívar's background as wealthy Venezuelan creole inspired by Enlightenment ideals",
              "Explain Bolívar's military campaigns liberating Venezuela, Colombia, Ecuador, Peru, and Bolivia",
              "Analyze Bolívar's dream of a united Gran Colombia and why it failed",
              "Describe Bolívar's disillusionment late in life as new nations fell into dictatorship and chaos",
              "Evaluate Bolívar's legacy as 'The Liberator' of South America"
            ]
          },
          {
            "key": "san_martin",
            "name": "José de San Martín and Southern South America",
            "short_description": "Learning about independence in Argentina, Chile, and Peru.",
            "example_tasks": [
              "Describe José de San Martín's leadership of Argentine independence",
              "Explain his bold strategy of crossing the Andes to liberate Chile",
              "Analyze San Martín's cooperation with Bolívar in liberating Peru",
              "Describe San Martín's mysterious withdrawal from public life after meeting with Bolívar",
              "Compare San Martín's and Bolívar's approaches and personalities"
            ]
          },
          {
            "key": "brazilian_independence",
            "name": "Brazilian Independence",
            "short_description": "Understanding Brazil's unique peaceful transition from Portuguese colony to independent empire.",
            "example_tasks": [
              "Describe how the Portuguese royal family fled to Brazil during Napoleonic Wars",
              "Explain Prince Pedro's declaration of Brazilian independence in 1822",
              "Analyze why Brazilian independence was relatively peaceful compared to Spanish America",
              "Describe Brazil's maintenance of monarchy (empire) until 1889 while Spanish America became republics",
              "Evaluate factors making Brazil's path to independence unique"
            ]
          }
        ]
      },
      {
        "key": "challenges_new_nations",
        "name": "Challenges Facing New Latin American Nations",
        "short_description": "Analyzing the difficulties of establishing stable governments and economies.",
        "sub_topics": [
          {
            "key": "political_instability",
            "name": "Political Instability and Caudillos",
            "short_description": "Understanding the pattern of military strongmen and frequent coups.",
            "example_tasks": [
              "Define caudillo as a military strongman who ruled through personal power rather than institutions",
              "Explain why new nations lacked experience with democratic self-government",
              "Analyze conflicts between liberal and conservative factions over church power, federalism, and social reform",
              "Describe the cycle of constitutions, coups, and dictatorships in many countries",
              "Evaluate why political stability proved so difficult to achieve"
            ]
          },
          {
            "key": "economic_problems",
            "name": "Economic Challenges",
            "short_description": "Learning about economic difficulties facing newly independent nations.",
            "example_tasks": [
              "Describe damage from years of warfare: destroyed infrastructure, disrupted trade, depopulation",
              "Explain continued economic dependence on exporting raw materials to Europe",
              "Analyze how wars created large debts and financial instability",
              "Evaluate why political instability discouraged economic development and investment"
            ]
          },
          {
            "key": "social_continuity",
            "name": "Limited Social Change",
            "short_description": "Understanding how independence changed little for most people.",
            "example_tasks": [
              "Analyze how creole elites replaced peninsulares but social hierarchies remained largely unchanged",
              "Describe continued oppression of indigenous peoples and people of African descent",
              "Explain that most independence movements were led by elites seeking political power, not social revolution",
              "Evaluate the gap between revolutionary rhetoric about equality and continued social inequality",
              "Compare Latin American independence to other revolutions in terms of social transformation"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "industrial_revolution",
    "name": "Industrial Revolution",
    "short_description": "Students examine the transformation from agricultural to industrial economies, technological innovations, urbanization, changing working conditions, and the social and environmental consequences of industrialization.",
    "sub_topics": [
      {
        "key": "origins_industrial_revolution",
        "name": "Origins and Causes of the Industrial Revolution",
        "short_description": "Understanding why the Industrial Revolution began in Britain in the late 1700s.",
        "sub_topics": [
          {
            "key": "agricultural_revolution",
            "name": "Agricultural Revolution as Foundation",
            "short_description": "Learning how improved farming created conditions for industrialization.",
            "example_tasks": [
              "Describe innovations in farming: crop rotation, selective breeding, new tools like the seed drill",
              "Explain how enclosure movement consolidated small farms into larger, more efficient estates",
              "Analyze how agricultural improvements increased food production and population",
              "Evaluate how fewer farmers were needed, creating labor available for factory work"
            ]
          },
          {
            "key": "british_advantages",
            "name": "Why Britain First?",
            "short_description": "Understanding unique conditions that gave Britain advantages.",
            "example_tasks": [
              "Describe Britain's natural resources: abundant coal and iron ore deposits",
              "Explain Britain's extensive colonial empire providing raw materials and markets",
              "Analyze political stability, strong banking system, and culture supporting entrepreneurship",
              "Describe Britain's transportation advantages: rivers, canals, and as an island nation",
              "Evaluate how multiple factors combined to make Britain the birthplace of industrialization"
            ]
          }
        ]
      },
      {
        "key": "technological_innovations",
        "name": "Technological Innovations and Industries",
        "short_description": "Examining key inventions that transformed production and transportation.",
        "sub_topics": [
          {
            "key": "textile_industry",
            "name": "Textile Industry Innovations",
            "short_description": "Learning about inventions that revolutionized cloth production.",
            "example_tasks": [
              "Describe the spinning jenny, water frame, and spinning mule increasing yarn production",
              "Explain the power loom mechanizing weaving",
              "Analyze how textile innovations created demand for cotton from American South and British colonies",
              "Evaluate textiles as the leading industry of the early Industrial Revolution",
              "Compare hand production to factory production in terms of speed and efficiency"
            ]
          },
          {
            "key": "steam_power",
            "name": "Steam Engine and Power Revolution",
            "short_description": "Understanding how steam power transformed manufacturing and transportation.",
            "example_tasks": [
              "Describe James Watt's improvements to the steam engine in the 1760s-1770s",
              "Explain how steam power freed factories from needing to be located near water",
              "Analyze applications of steam power in textile mills, mining, and iron production",
              "Evaluate the steam engine as the most important single invention of the Industrial Revolution"
            ]
          },
          {
            "key": "iron_steel",
            "name": "Iron and Steel Production",
            "short_description": "Learning about advances in metallurgy that provided materials for machines and construction.",
            "example_tasks": [
              "Describe new methods of iron production using coal (coke) instead of charcoal",
              "Explain the Bessemer process (1850s) for mass-producing steel",
              "Analyze how stronger, cheaper iron and steel enabled building of machines, railroads, and bridges",
              "Evaluate iron and steel as fundamental to industrial infrastructure"
            ]
          },
          {
            "key": "transportation_revolution",
            "name": "Transportation Revolution",
            "short_description": "Examining innovations in moving goods and people.",
            "example_tasks": [
              "Describe the development of railroads and George Stephenson's Rocket locomotive (1829)",
              "Explain how railroads reduced transportation costs and time dramatically",
              "Analyze Robert Fulton's steamboat and its impact on river and ocean transport",
              "Evaluate how improved transportation created national and international markets",
              "Create a timeline showing progression from canals to railroads to steamships"
            ]
          },
          {
            "key": "communication_innovations",
            "name": "Communication Innovations",
            "short_description": "Learning about technologies that speeded communication.",
            "example_tasks": [
              "Describe Samuel Morse's telegraph (1840s) and its use of electrical signals",
              "Explain how the telegraph enabled near-instantaneous long-distance communication",
              "Analyze the impact of faster communication on business, journalism, and government",
              "Evaluate how communication and transportation innovations worked together to shrink distances"
            ]
          }
        ]
      },
      {
        "key": "factory_system",
        "name": "The Factory System and Working Conditions",
        "short_description": "Understanding how industrialization changed where and how people worked.",
        "sub_topics": [
          {
            "key": "rise_factories",
            "name": "Rise of the Factory System",
            "short_description": "Learning about the shift from home production to centralized factories.",
            "example_tasks": [
              "Compare cottage industry (home-based production) to factory system (centralized production with machines)",
              "Explain advantages of factories: specialization, efficiency, economies of scale",
              "Describe how factories required workers to maintain machines' pace rather than their own",
              "Analyze how factory discipline differed from agricultural work rhythms"
            ]
          },
          {
            "key": "working_conditions",
            "name": "Working Conditions in Factories and Mines",
            "short_description": "Understanding the harsh realities of industrial labor.",
            "example_tasks": [
              "Describe typical working conditions: 12-16 hour days, six days per week, dangerous machinery, poor ventilation",
              "Explain the use of child labor in factories and mines, often in the most dangerous jobs",
              "Analyze specific hazards in textile mills, coal mines, and iron works",
              "Describe testimony from parliamentary investigations documenting abusive conditions",
              "Evaluate the human cost of rapid industrialization"
            ]
          },
          {
            "key": "child_labor",
            "name": "Child Labor",
            "short_description": "Examining the widespread employment of children in industrial work.",
            "example_tasks": [
              "Describe how children as young as 5-6 worked in factories and mines",
              "Explain economic reasons families sent children to work: low wages required multiple incomes",
              "Analyze specific jobs children performed: crawling in mine tunnels, operating textile machines, chimney sweeping",
              "Describe gradual reform through Factory Acts limiting child labor",
              "Evaluate changing attitudes about childhood and education during this period"
            ]
          }
        ]
      },
      {
        "key": "urbanization",
        "name": "Urbanization and Social Changes",
        "short_description": "Examining the massive migration from countryside to cities and resulting problems.",
        "sub_topics": [
          {
            "key": "growth_cities",
            "name": "Rapid Urban Growth",
            "short_description": "Understanding the dramatic increase in city populations.",
            "example_tasks": [
              "Describe the massive population growth of industrial cities like Manchester, Birmingham, and London",
              "Explain push factors (enclosure, agricultural changes) and pull factors (factory jobs) causing rural-urban migration",
              "Analyze the speed of urban growth overwhelming existing infrastructure",
              "Create graphs showing population changes in major industrial cities 1750-1850"
            ]
          },
          {
            "key": "urban_problems",
            "name": "Problems of Industrial Cities",
            "short_description": "Learning about the challenges of rapid, unplanned urbanization.",
            "example_tasks": [
              "Describe overcrowded, poorly built housing in working-class neighborhoods",
              "Explain lack of sanitation: no running water, primitive sewage, accumulation of waste",
              "Analyze disease outbreaks including cholera epidemics due to contaminated water",
              "Describe air and water pollution from factories",
              "Evaluate life expectancy differences between wealthy and poor urban neighborhoods"
            ]
          },
          {
            "key": "new_social_classes",
            "name": "Emergence of New Social Classes",
            "short_description": "Understanding how industrialization created industrial middle class and working class.",
            "example_tasks": [
              "Describe the industrial middle class (bourgeoisie): factory owners, merchants, professionals",
              "Explain the industrial working class (proletariat): factory workers with few skills and low wages",
              "Analyze class tensions between wealthy factory owners and poor workers",
              "Compare social mobility in industrial society to traditional agricultural society",
              "Evaluate Karl Marx's analysis of class conflict between bourgeoisie and proletariat"
            ]
          }
        ]
      },
      {
        "key": "responses_industrialization",
        "name": "Responses to Industrialization",
        "short_description": "Examining how people and governments reacted to industrial problems.",
        "sub_topics": [
          {
            "key": "labor_movements",
            "name": "Labor Unions and Worker Organization",
            "short_description": "Learning about workers' collective action to improve conditions.",
            "example_tasks": [
              "Describe early attempts to form labor unions despite laws prohibiting them",
              "Explain tactics workers used: strikes, collective bargaining, political action",
              "Analyze government and business resistance to unions",
              "Describe gradual legalization and acceptance of unions in later 19th century",
              "Evaluate unions' role in achieving better wages, hours, and working conditions"
            ]
          },
          {
            "key": "reform_movements",
            "name": "Reform Movements and Factory Legislation",
            "short_description": "Understanding government intervention to address industrial abuses.",
            "example_tasks": [
              "Describe British Factory Acts gradually limiting working hours and child labor",
              "Explain public health reforms: sanitation systems, clean water, housing regulations",
              "Analyze the role of reformers documenting abuses and demanding change",
              "Evaluate the shift from laissez-faire (no government intervention) to regulated capitalism"
            ]
          },
          {
            "key": "luddites",
            "name": "Luddites and Machine Breaking",
            "short_description": "Learning about violent resistance to new technology.",
            "example_tasks": [
              "Describe the Luddite movement of British textile workers destroying machines (1811-1816)",
              "Explain Luddite fears that machines would eliminate their jobs and skills",
              "Analyze government's harsh response: making machine-breaking a capital offense",
              "Evaluate whether Luddites were simply opposing progress or defending their livelihoods"
            ]
          },
          {
            "key": "socialist_responses",
            "name": "Socialist and Communist Responses",
            "short_description": "Understanding radical critiques of industrial capitalism.",
            "example_tasks": [
              "Describe utopian socialists like Robert Owen who created model communities",
              "Explain Karl Marx and Friedrich Engels's 'Communist Manifesto' (1848) calling for workers to overthrow capitalism",
              "Analyze Marx's critique of capitalism: exploitation of workers, alienation, class struggle",
              "Compare utopian socialism (reform capitalism) to Marxism (revolutionary overthrow)",
              "Evaluate influence of socialist thought on later labor movements and political parties"
            ]
          }
        ]
      },
      {
        "key": "spread_industrialization",
        "name": "Spread of Industrialization",
        "short_description": "Examining how industrialization spread from Britain to other regions.",
        "sub_topics": [
          {
            "key": "continental_europe",
            "name": "Industrialization in Continental Europe",
            "short_description": "Learning about industrial development in Belgium, France, Germany, and other European nations.",
            "example_tasks": [
              "Describe Belgium as the first continental nation to industrialize, borrowing British technology",
              "Explain Germany's rapid industrialization in late 19th century, eventually surpassing Britain",
              "Analyze why France industrialized more slowly due to political instability and different economic structure",
              "Compare government's role in promoting industrialization across different nations"
            ]
          },
          {
            "key": "united_states",
            "name": "American Industrialization",
            "short_description": "Understanding the United States' industrial development.",
            "example_tasks": [
              "Describe American advantages: vast natural resources, growing population, political stability",
              "Explain the role of railroads in linking the continent and creating national markets",
              "Analyze American innovations including interchangeable parts and assembly line production",
              "Evaluate how American industrialization differed from British model"
            ]
          },
          {
            "key": "uneven_development",
            "name": "Uneven Global Development",
            "short_description": "Understanding why some regions industrialized while others remained agricultural.",
            "example_tasks": [
              "Analyze factors needed for industrialization: capital, resources, labor, technology, political stability",
              "Explain why Latin America, Africa, and much of Asia remained primarily agricultural",
              "Describe the emerging gap between industrialized and non-industrialized regions",
              "Evaluate how industrialization created or widened global inequalities"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "imperialism_colonialism",
    "name": "Imperialism and Colonialism in the 19th Century",
    "short_description": "Students analyze the European and American expansion and colonization of Africa, Asia, and the Pacific, examining economic and political motivations, the ideology of the 'civilizing mission,' resistance movements, and the lasting impacts of imperialism.",
    "sub_topics": [
      {
        "key": "causes_new_imperialism",
        "name": "Causes of the New Imperialism",
        "short_description": "Understanding why industrialized nations sought colonies in the late 19th century.",
        "sub_topics": [
          {
            "key": "economic_motives",
            "name": "Economic Motivations",
            "short_description": "Learning about industrial nations' need for resources and markets.",
            "example_tasks": [
              "Explain the need for raw materials (rubber, oil, minerals, cotton) to supply industrial production",
              "Describe the search for new markets to sell manufactured goods",
              "Analyze the desire for profitable investment opportunities for surplus capital",
              "Evaluate how economic competition between industrial powers drove imperial expansion"
            ]
          },
          {
            "key": "political_strategic_motives",
            "name": "Political and Strategic Motivations",
            "short_description": "Understanding power politics and national prestige as drivers of imperialism.",
            "example_tasks": [
              "Describe nationalism and competition for national glory and prestige",
              "Explain strategic interests: naval bases, coaling stations, protecting trade routes",
              "Analyze the concept of 'balance of power' and fear of rivals gaining advantages",
              "Evaluate how military technology (steamships, railways, machine guns) made conquest easier"
            ]
          },
          {
            "key": "ideological_justifications",
            "name": "Ideological Justifications",
            "short_description": "Examining racist and paternalistic ideas used to justify imperialism.",
            "example_tasks": [
              "Describe Social Darwinism and its misapplication to justify European superiority",
              "Explain the 'White Man's Burden' concept and the supposed duty to 'civilize' others",
              "Analyze religious motivations: spreading Christianity to 'heathen' peoples",
              "Evaluate Rudyard Kipling's poem 'The White Man's Burden' as expression of imperialist ideology",
              "Critique the racism underlying claims of European superiority and the 'civilizing mission'"
            ]
          }
        ]
      },
      {
        "key": "scramble_for_africa",
        "name": "The Scramble for Africa",
        "short_description": "Examining the rapid European colonization of nearly all of Africa.",
        "sub_topics": [
          {
            "key": "before_scramble",
            "name": "Africa Before the Scramble",
            "short_description": "Understanding that in 1880, Europeans controlled only small coastal areas of Africa.",
            "example_tasks": [
              "Describe the limited European presence in Africa before 1880: coastal trading posts",
              "Explain why Europeans had not penetrated the interior: disease, African resistance, lack of economic incentive",
              "Analyze how technological changes (quinine, steamships, railroads, repeating rifles) enabled conquest",
              "Evaluate Africa's diverse political organizations: kingdoms, empires, chiefdoms, stateless societies"
            ]
          },
          {
            "key": "berlin_conference",
            "name": "Berlin Conference (1884-1885)",
            "short_description": "Learning about European powers dividing Africa among themselves.",
            "example_tasks": [
              "Describe the Berlin Conference where European powers set rules for claiming African territory",
              "Explain that no African representatives were present at this conference about their continent",
              "Analyze principles established: effective occupation, notification of claims, free trade",
              "Evaluate how arbitrary borders divided ethnic groups and combined rival groups, causing lasting problems"
            ]
          },
          {
            "key": "methods_conquest",
            "name": "Methods of European Conquest",
            "short_description": "Understanding how Europeans achieved military domination.",
            "example_tasks": [
              "Describe technological advantages: machine guns (Maxim gun), repeating rifles, artillery",
              "Explain tactics of divide and rule: exploiting African rivalries, recruiting African soldiers",
              "Analyze the role of European diseases decimating some African populations",
              "Describe specific conquests showing European military advantages"
            ]
          },
          {
            "key": "african_resistance",
            "name": "African Resistance to Colonization",
            "short_description": "Learning about African efforts to resist European conquest.",
            "example_tasks": [
              "Describe the Zulu resistance under Shaka and later leaders against British conquest",
              "Explain the Ashanti resistance in West Africa against British expansion",
              "Analyze Ethiopia's successful defeat of Italy at the Battle of Adwa (1896), remaining independent",
              "Describe the Maji Maji Rebellion in German East Africa",
              "Evaluate why most resistance ultimately failed but showed African agency and determination"
            ]
          },
          {
            "key": "colonial_rule_africa",
            "name": "Systems of Colonial Rule",
            "short_description": "Understanding different approaches to governing African colonies.",
            "example_tasks": [
              "Compare direct rule (French model: replacing local rulers with French officials) to indirect rule (British model: governing through traditional rulers)",
              "Describe paternalism: treating Africans as children needing European guidance",
              "Explain economic exploitation: forced labor, cash crop production, resource extraction",
              "Analyze how colonial policies disrupted traditional African societies and economies",
              "Evaluate the dual legal systems: one for Europeans, another for Africans"
            ]
          }
        ]
      },
      {
        "key": "imperialism_asia",
        "name": "Imperialism in Asia",
        "short_description": "Examining European and American expansion in Asia and Asian responses.",
        "sub_topics": [
          {
            "key": "india_british_raj",
            "name": "British India and the Raj",
            "short_description": "Learning about the jewel of the British Empire.",
            "example_tasks": [
              "Describe how the British East India Company gradually gained control of India",
              "Explain the Sepoy Mutiny/Indian Rebellion of 1857 and its causes",
              "Analyze the establishment of direct British rule (the Raj) after 1858",
              "Describe economic exploitation: textile industry destroyed, raw materials extracted, Indian market for British goods",
              "Evaluate both negative impacts (economic exploitation, famines, racism) and British claims of positive modernization"
            ]
          },
          {
            "key": "china_imperialism",
            "name": "Imperialism in China",
            "short_description": "Understanding Western penetration of China through unequal treaties.",
            "example_tasks": [
              "Describe the Opium Wars (1839-1842, 1856-1860) forcing China to open to British trade",
              "Explain the Treaty of Nanjing and the system of unequal treaties and spheres of influence",
              "Analyze the Taiping Rebellion (1850-1864) as both internal crisis and response to Western intrusion",
              "Describe the Boxer Rebellion (1899-1901) as violent anti-foreign, anti-Christian uprising",
              "Evaluate China's semi-colonization: never fully colonized but carved into spheres of influence"
            ]
          },
          {
            "key": "japan_modernization",
            "name": "Japan's Modernization and Imperial Expansion",
            "short_description": "Learning about Japan's unique response to Western imperialism.",
            "example_tasks": [
              "Describe Commodore Perry's 1853 expedition forcing Japan to open to trade",
              "Explain the Meiji Restoration (1868) and Japan's rapid modernization program",
              "Analyze Japan's strategy: 'learn from the West to resist the West'",
              "Describe Japan's own imperial expansion: defeating China (1895), defeating Russia (1905), annexing Korea (1910)",
              "Evaluate Japan as the only Asian nation to successfully modernize and become an imperial power"
            ]
          },
          {
            "key": "southeast_asia_pacific",
            "name": "Southeast Asia and the Pacific",
            "short_description": "Understanding colonization of Southeast Asia and Pacific islands.",
            "example_tasks": [
              "Describe British control of Burma and Malaya, French control of Indochina, Dutch control of Indonesia",
              "Explain American acquisition of the Philippines after Spanish-American War (1898)",
              "Analyze different colonial economies: plantation agriculture, resource extraction, trade",
              "Describe only Siam (Thailand) maintaining independence through skillful diplomacy"
            ]
          }
        ]
      },
      {
        "key": "impact_imperialism",
        "name": "Impact of Imperialism",
        "short_description": "Analyzing the effects of colonialism on colonized peoples and imperial powers.",
        "sub_topics": [
          {
            "key": "economic_impact",
            "name": "Economic Impact on Colonies",
            "short_description": "Understanding how colonial economies were structured to benefit imperial powers.",
            "example_tasks": [
              "Describe the extraction of raw materials while preventing local industrial development",
              "Explain how colonies were forced to buy manufactured goods from the colonizing country",
              "Analyze the introduction of cash crop agriculture and its effects on food security",
              "Evaluate long-term economic dependency created by colonial economic structures"
            ]
          },
          {
            "key": "social_cultural_impact",
            "name": "Social and Cultural Impact",
            "short_description": "Learning about disruption of traditional societies and cultural changes.",
            "example_tasks": [
              "Describe the imposition of European languages, education systems, and laws",
              "Explain missionary activities and conversion to Christianity",
              "Analyze racism and segregation in colonial societies",
              "Evaluate the disruption of traditional authority structures and social hierarchies",
              "Describe the emergence of Western-educated elite who would later lead independence movements"
            ]
          },
          {
            "key": "positive_negative_debate",
            "name": "Debating the Legacy of Imperialism",
            "short_description": "Examining different perspectives on imperialism's effects.",
            "example_tasks": [
              "Analyze imperialist claims of benefits: railroads, schools, hospitals, modern technology, ending slavery",
              "Describe anti-imperialist critique: exploitation, cultural destruction, violence, racism, underdevelopment",
              "Evaluate the concept of the 'dual mandate': developing colonies while benefiting imperial power",
              "Compare colonial apologists' views to modern historians' assessments",
              "Formulate your own evidence-based judgment about imperialism's net impact"
            ]
          },
          {
            "key": "anti_colonial_resistance",
            "name": "Early Anti-Colonial Resistance and Nationalism",
            "short_description": "Understanding how imperialism sparked nationalist movements.",
            "example_tasks": [
              "Describe the emergence of nationalist movements demanding independence or self-rule",
              "Explain the role of Western-educated elites in articulating nationalist demands",
              "Analyze how imperialism ironically fostered national consciousness by uniting diverse groups against foreign rule",
              "Evaluate early nationalist organizations like Indian National Congress (1885)"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "reform_movements_19th_century",
    "name": "Reform Movements of the 19th Century",
    "short_description": "Students examine major social reform movements including abolition of slavery, women's rights, education reform, labor rights, and other efforts to address social problems in industrial societies.",
    "sub_topics": [
      {
        "key": "abolition_movement",
        "name": "Abolition of Slavery",
        "short_description": "Understanding the movement to end slavery in the Americas and globally.",
        "sub_topics": [
          {
            "key": "antislavery_arguments",
            "name": "Arguments Against Slavery",
            "short_description": "Learning about moral, religious, and political cases for abolition.",
            "example_tasks": [
              "Describe religious arguments: slavery contradicts Christian teaching about human dignity",
              "Explain Enlightenment arguments based on natural rights and human equality",
              "Analyze economic arguments: free labor more efficient than slave labor",
              "Evaluate powerful slave narratives and testimonies exposing slavery's brutality"
            ]
          },
          {
            "key": "british_abolition",
            "name": "British Abolition Movement",
            "short_description": "Understanding how Britain ended slavery in its empire.",
            "example_tasks": [
              "Describe William Wilberforce and other abolitionists' long campaign in Parliament",
              "Explain the 1807 ban on the slave trade and 1833 abolition of slavery in British Empire",
              "Analyze tactics: petitions, boycotts, slave narratives, parliamentary debate",
              "Evaluate Britain's subsequent role in suppressing the international slave trade"
            ]
          },
          {
            "key": "american_abolition",
            "name": "Abolition in the United States",
            "short_description": "Learning about the longer, more conflicted American path to abolition.",
            "example_tasks": [
              "Describe the growing abolitionist movement: William Lloyd Garrison, Frederick Douglass, Harriet Tubman",
              "Explain sectional conflict between free North and slave South",
              "Analyze the role of the Civil War (1861-1865) in ending slavery",
              "Describe the Emancipation Proclamation (1863) and 13th Amendment (1865)",
              "Evaluate the difference between legal freedom and actual equality after emancipation"
            ]
          },
          {
            "key": "abolition_elsewhere",
            "name": "Abolition in Latin America and Elsewhere",
            "short_description": "Understanding the gradual end of slavery across the Americas.",
            "example_tasks": [
              "Describe early abolition in Haiti after the revolution (1804)",
              "Explain gradual abolition in Spanish American republics during independence era",
              "Analyze Brazil as last Western nation to abolish slavery (1888)",
              "Evaluate the global trend toward abolition despite resistance from slave-owning interests"
            ]
          }
        ]
      },
      {
        "key": "womens_rights_movement",
        "name": "Women's Rights Movement",
        "short_description": "Examining the struggle for women's political, legal, and economic equality.",
        "sub_topics": [
          {
            "key": "legal_restrictions",
            "name": "Legal and Social Restrictions on Women",
            "short_description": "Understanding women's subordinate status in 19th century society.",
            "example_tasks": [
              "Describe legal restrictions: no voting rights, limited property rights, few educational opportunities",
              "Explain the doctrine of 'separate spheres': men in public life, women confined to domestic roles",
              "Analyze economic dependence: limited job opportunities, lower wages for same work",
              "Evaluate how industrialization changed women's work but maintained inequality"
            ]
          },
          {
            "key": "early_feminists",
            "name": "Early Feminist Thinkers and Activists",
            "short_description": "Learning about pioneers who demanded women's rights.",
            "example_tasks": [
              "Describe Mary Wollstonecraft's 'A Vindication of the Rights of Woman' (1792) as foundational feminist text",
              "Explain the Seneca Falls Convention (1848) and the Declaration of Sentiments",
              "Analyze arguments for women's rights based on Enlightenment principles of equality",
              "Describe leaders like Elizabeth Cady Stanton, Lucretia Mott, and Susan B. Anthony"
            ]
          },
          {
            "key": "suffrage_movement",
            "name": "Women's Suffrage Movement",
            "short_description": "Understanding the campaign for women's voting rights.",
            "example_tasks": [
              "Describe suffragist tactics: petitions, demonstrations, civil disobedience",
              "Explain arguments for and against women's suffrage",
              "Analyze British suffragettes' increasingly militant tactics in early 20th century",
              "Describe gradual achievement of voting rights in different countries (New Zealand 1893, Britain 1918-1928, US 1920)",
              "Evaluate why women's suffrage took so long to achieve despite democratic rhetoric"
            ]
          },
          {
            "key": "other_womens_rights",
            "name": "Other Women's Rights Issues",
            "short_description": "Learning about demands beyond suffrage.",
            "example_tasks": [
              "Describe campaigns for married women's property rights",
              "Explain demands for equal access to education and professions",
              "Analyze the movement for reproductive rights and family planning",
              "Evaluate connections between women's rights and other reform movements"
            ]
          }
        ]
      },
      {
        "key": "education_reform",
        "name": "Education Reform",
        "short_description": "Understanding the movement to expand access to public education.",
        "sub_topics": [
          {
            "key": "expansion_public_education",
            "name": "Growth of Public Education Systems",
            "short_description": "Learning about the development of free, compulsory schooling.",
            "example_tasks": [
              "Describe the gradual establishment of free public elementary schools",
              "Explain arguments for universal education: informed citizenship, economic development, social mobility",
              "Analyze the expansion of compulsory attendance laws",
              "Evaluate how public education both promoted opportunity and reinforced social hierarchies"
            ]
          },
          {
            "key": "education_reformers",
            "name": "Education Reformers and Innovations",
            "short_description": "Understanding new educational philosophies and methods.",
            "example_tasks": [
              "Describe Horace Mann's advocacy for common schools in America",
              "Explain innovations in teaching methods and curriculum",
              "Analyze debates about education's purposes: practical skills versus classical learning",
              "Evaluate the gradual increase in literacy rates due to expanded schooling"
            ]
          }
        ]
      },
      {
        "key": "temperance_reform",
        "name": "Temperance Movement",
        "short_description": "Examining campaigns to reduce or prohibit alcohol consumption.",
        "sub_topics": [
          {
            "key": "temperance_arguments",
            "name": "Arguments for Temperance",
            "short_description": "Understanding why reformers targeted alcohol.",
            "example_tasks": [
              "Describe concerns about alcohol's effects: domestic violence, poverty, health problems, loss of productivity",
              "Explain religious and moral arguments against drinking",
              "Analyze women's leadership in temperance movement linking alcohol to family welfare",
              "Evaluate temperance as part of broader effort to reform individual morality and behavior"
            ]
          }
        ]
      },
      {
        "key": "prison_reform",
        "name": "Prison and Criminal Justice Reform",
        "short_description": "Understanding efforts to make punishment more humane.",
        "sub_topics": [
          {
            "key": "prison_reform_goals",
            "name": "Goals of Prison Reform",
            "short_description": "Learning about changing ideas about punishment.",
            "example_tasks": [
              "Describe reform goals: rehabilitation rather than just punishment, ending torture and harsh physical punishment",
              "Explain Enlightenment influence: Cesare Beccaria's arguments against torture and for proportional punishment",
              "Analyze the development of the penitentiary system designed to reform criminals",
              "Evaluate the gap between reform ideals and actual prison conditions"
            ]
          }
        ]
      },
      {
        "key": "interconnected_reforms",
        "name": "Interconnections Among Reform Movements",
        "short_description": "Understanding how different reform causes were related.",
        "sub_topics": [
          {
            "key": "common_themes",
            "name": "Common Themes and Activists",
            "short_description": "Analyzing shared ideas and overlap among movements.",
            "example_tasks": [
              "Describe how many reformers participated in multiple movements (abolition, women's rights, temperance)",
              "Explain common themes: expanding democracy, ending oppression, applying Enlightenment ideals",
              "Analyze the role of religious motivations in many reform movements",
              "Evaluate reform movements as responses to problems created by industrialization and urbanization",
              "Compare optimistic belief in progress and perfectibility among 19th century reformers"
            ]
          }
        ]
      }
    ]
  }
]
