[
  {
    "key": "digital_citizenship_online_safety",
    "name": "Digital Citizenship and Online Safety",
    "short_description": "Students develop responsible digital behaviors, understand online safety principles, protect personal information, and navigate digital environments ethically and securely.",
    "sub_topics": [
      {
        "key": "digital_literacy_basics",
        "name": "Digital Literacy Fundamentals",
        "short_description": "Understanding basic digital skills, evaluating online information, and using technology effectively for learning and communication.",
        "sub_topics": [
          {
            "key": "information_evaluation",
            "name": "Evaluating Online Information",
            "short_description": "Critically assessing credibility, accuracy, and bias of digital content and sources.",
            "example_tasks": [
              "Compare three websites about the same topic and identify which sources are most credible based on author credentials, publication date, and evidence provided",
              "Identify signs of misinformation in a social media post by checking facts against reliable sources and analyzing the purpose of the content",
              "Create a checklist of criteria for evaluating website reliability including domain type, author expertise, citation of sources, and potential bias"
            ]
          },
          {
            "key": "digital_footprint_awareness",
            "name": "Digital Footprint and Online Reputation",
            "short_description": "Understanding how online actions create a permanent digital footprint and impact future opportunities.",
            "example_tasks": [
              "Research your own digital footprint by searching your name online and documenting what information is publicly available about you",
              "Analyze case studies of how social media posts have positively or negatively affected people's college admissions or job opportunities",
              "Create a presentation about strategies for managing your online reputation including privacy settings, appropriate posting, and professional profiles"
            ]
          },
          {
            "key": "digital_communication_etiquette",
            "name": "Digital Communication and Netiquette",
            "short_description": "Practicing appropriate, respectful, and effective communication in digital environments.",
            "example_tasks": [
              "Rewrite inappropriate emails or messages to demonstrate proper tone, grammar, and professionalism for different contexts (teacher, friend, employer)",
              "Participate in an online discussion forum following netiquette rules including staying on topic, being respectful, and citing sources",
              "Create a guide for effective video conferencing including proper setup, background, attire, and participation etiquette"
            ]
          }
        ]
      },
      {
        "key": "cybersecurity_awareness",
        "name": "Cybersecurity Awareness and Protection",
        "short_description": "Identifying online threats, implementing security measures, and protecting devices and personal information from cyber attacks.",
        "sub_topics": [
          {
            "key": "password_security",
            "name": "Password Security and Authentication",
            "short_description": "Creating strong passwords, using password managers, and implementing multi-factor authentication.",
            "example_tasks": [
              "Evaluate password strength by testing passwords in a password checker tool and identifying characteristics that make passwords strong or weak",
              "Set up two-factor authentication on a school account and explain how this additional security layer protects against unauthorized access",
              "Create a secure password strategy using passphrases, password managers, and unique passwords for different accounts while avoiding common mistakes"
            ]
          },
          {
            "key": "phishing_scam_recognition",
            "name": "Phishing and Scam Recognition",
            "short_description": "Identifying fraudulent emails, messages, and websites designed to steal information or money.",
            "example_tasks": [
              "Analyze sample phishing emails and identify red flags such as suspicious sender addresses, urgent language, grammatical errors, and suspicious links",
              "Create an educational poster warning peers about common online scams targeting middle school students including fake giveaways and impersonation",
              "Practice safe link verification by hovering over hyperlinks, checking URLs before clicking, and using website security indicators like HTTPS"
            ]
          },
          {
            "key": "malware_protection",
            "name": "Malware and Device Protection",
            "short_description": "Understanding malware types, using antivirus software, and maintaining secure devices.",
            "example_tasks": [
              "Research different types of malware (viruses, trojans, ransomware, spyware) and create a chart comparing how each works and how to prevent infection",
              "Perform a security audit on a school computer by checking for software updates, antivirus status, and firewall settings",
              "Develop a monthly device maintenance checklist including software updates, antivirus scans, backup procedures, and security setting reviews"
            ]
          }
        ]
      },
      {
        "key": "privacy_personal_information",
        "name": "Privacy and Personal Information Protection",
        "short_description": "Understanding privacy rights, managing personal data, and controlling information shared online.",
        "sub_topics": [
          {
            "key": "privacy_settings_management",
            "name": "Privacy Settings and Controls",
            "short_description": "Configuring privacy settings on social media, apps, and devices to limit data sharing.",
            "example_tasks": [
              "Audit privacy settings on a social media account and adjust who can see posts, contact information, and location data",
              "Compare privacy policies of three popular apps to identify what data they collect, how they use it, and who they share it with",
              "Create a guide for configuring smartphone privacy settings including location services, app permissions, and data sharing options"
            ]
          },
          {
            "key": "data_collection_tracking",
            "name": "Online Tracking and Data Collection",
            "short_description": "Understanding how websites and companies track online behavior and collect user data.",
            "example_tasks": [
              "Install a browser extension that blocks trackers and analyze how many trackers are present on popular websites you visit",
              "Research how cookies work and demonstrate clearing browser cookies while explaining the difference between session and tracking cookies",
              "Investigate how targeted advertising works by examining ads you see online and identifying what data might have been used to select them"
            ]
          },
          {
            "key": "safe_information_sharing",
            "name": "Safe Sharing of Personal Information",
            "short_description": "Making informed decisions about what personal information to share online and with whom.",
            "example_tasks": [
              "Create a decision flowchart for determining whether it's safe to share specific types of information (name, age, school, address, photos) in different online contexts",
              "Analyze Terms of Service agreements from websites used by middle schoolers and identify concerning data collection or sharing practices",
              "Role-play scenarios where strangers online request personal information and practice appropriate responses including blocking and reporting"
            ]
          }
        ]
      },
      {
        "key": "ethical_responsible_use",
        "name": "Ethical and Responsible Technology Use",
        "short_description": "Understanding intellectual property, avoiding plagiarism, respecting others' work, and using technology ethically.",
        "sub_topics": [
          {
            "key": "copyright_fair_use",
            "name": "Copyright and Fair Use",
            "short_description": "Understanding copyright law, fair use guidelines, and proper attribution of digital content.",
            "example_tasks": [
              "Determine whether specific scenarios represent fair use of copyrighted material in educational projects by applying the four fair use factors",
              "Create a multimedia project properly citing images, music, and video clips while using Creative Commons or public domain resources",
              "Research copyright laws related to downloading music, movies, and software and present the legal and ethical implications of piracy"
            ]
          },
          {
            "key": "plagiarism_citation",
            "name": "Plagiarism Prevention and Citation",
            "short_description": "Avoiding plagiarism by properly citing sources and creating original work.",
            "example_tasks": [
              "Rewrite plagiarized paragraphs to demonstrate proper paraphrasing and citation of sources in MLA or APA format",
              "Use plagiarism detection tools to check written work and understand how to correctly incorporate and cite source material",
              "Create a bibliography for a research project including websites, books, videos, and images with proper formatting and attribution"
            ]
          },
          {
            "key": "cyberbullying_digital_respect",
            "name": "Cyberbullying Prevention and Digital Respect",
            "short_description": "Recognizing cyberbullying, responding appropriately, and treating others respectfully online.",
            "example_tasks": [
              "Analyze case studies of cyberbullying incidents and identify appropriate responses for targets, witnesses, and platforms",
              "Create an anti-cyberbullying campaign for your school including posters, videos, or presentations about recognizing and reporting bullying",
              "Practice being an upstander by role-playing scenarios where you witness mean or inappropriate online behavior and choose supportive responses"
            ]
          },
          {
            "key": "social_impact_technology",
            "name": "Social Impact of Technology",
            "short_description": "Understanding how technology affects society, equity, accessibility, and environmental sustainability.",
            "example_tasks": [
              "Research the digital divide and present how unequal access to technology affects educational and economic opportunities",
              "Investigate accessibility features in technology (screen readers, closed captions, voice control) and test how well websites accommodate users with disabilities",
              "Analyze the environmental impact of technology including e-waste, energy consumption, and sustainable computing practices"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "computer_systems_hardware",
    "name": "Computer Systems and Hardware",
    "short_description": "Students learn about computer components, how hardware and software interact, operating system functions, file organization, and basic troubleshooting techniques.",
    "sub_topics": [
      {
        "key": "hardware_components",
        "name": "Computer Hardware Components",
        "short_description": "Understanding the function of internal and external computer components and how they work together.",
        "sub_topics": [
          {
            "key": "internal_components",
            "name": "Internal Hardware Components",
            "short_description": "Identifying and understanding the purpose of components inside a computer case.",
            "example_tasks": [
              "Label a diagram of the inside of a computer identifying the CPU, motherboard, RAM, hard drive, power supply, and graphics card",
              "Research the function of the CPU and explain how clock speed, cores, and cache affect computer performance",
              "Compare specifications of two computers (RAM, storage, processor) and determine which would be better for specific tasks like gaming, video editing, or word processing"
            ]
          },
          {
            "key": "input_output_devices",
            "name": "Input and Output Devices",
            "short_description": "Understanding devices used to input data into computers and receive output from them.",
            "example_tasks": [
              "Create a chart categorizing computer peripherals as input devices (keyboard, mouse, scanner, microphone) or output devices (monitor, printer, speakers)",
              "Test different input methods (keyboard, touchscreen, voice recognition, gesture control) and compare their efficiency for different tasks",
              "Design an adaptive technology solution for someone with limited mobility by researching and proposing appropriate input and output devices"
            ]
          },
          {
            "key": "storage_devices",
            "name": "Storage Devices and Memory",
            "short_description": "Understanding different types of storage, the difference between storage and memory, and data capacity units.",
            "example_tasks": [
              "Compare and contrast RAM (temporary memory) and hard drive storage (permanent storage) explaining why both are needed in a computer system",
              "Calculate storage capacity needs by determining how many photos, songs, or documents can fit on devices with different capacities (GB vs TB)",
              "Research the differences between HDD and SSD storage and explain the advantages and disadvantages of each type"
            ]
          }
        ]
      },
      {
        "key": "operating_systems",
        "name": "Operating Systems and Software",
        "short_description": "Understanding the role of operating systems, types of software, and how software and hardware interact.",
        "sub_topics": [
          {
            "key": "os_functions",
            "name": "Operating System Functions",
            "short_description": "Understanding what operating systems do and how they manage computer resources.",
            "example_tasks": [
              "Identify the operating system on classroom computers (Windows, macOS, Chrome OS, Linux) and list its key features and interface elements",
              "Use Task Manager or Activity Monitor to observe how the operating system manages running processes, memory usage, and CPU allocation",
              "Research and compare three major operating systems explaining their typical uses, advantages, and disadvantages"
            ]
          },
          {
            "key": "software_types",
            "name": "Types of Software",
            "short_description": "Distinguishing between system software, application software, and understanding software licensing.",
            "example_tasks": [
              "Create a categorized inventory of software on a school computer separating system software, productivity applications, and specialized programs",
              "Compare proprietary software, freeware, shareware, and open-source software using examples and explaining licensing differences",
              "Research software version numbers and update processes, then demonstrate checking for and installing software updates"
            ]
          },
          {
            "key": "installing_software",
            "name": "Software Installation and Management",
            "short_description": "Understanding how to safely install, update, and uninstall software applications.",
            "example_tasks": [
              "Follow installation procedures for approved educational software including reading permissions, choosing installation options, and verifying successful installation",
              "Use application management tools to view installed programs, check version numbers, and safely uninstall unnecessary applications",
              "Create a guide for recognizing legitimate software downloads versus potentially harmful fake downloads or bundled software"
            ]
          }
        ]
      },
      {
        "key": "file_management",
        "name": "File Management and Organization",
        "short_description": "Organizing files and folders, understanding file types and extensions, and managing digital storage efficiently.",
        "sub_topics": [
          {
            "key": "folder_structure",
            "name": "File and Folder Organization",
            "short_description": "Creating logical folder structures and organizing digital files for easy retrieval.",
            "example_tasks": [
              "Design and implement a folder structure for school work organized by subject, year, and assignment type",
              "Practice using file management operations including creating folders, moving files, renaming items, and using search functions",
              "Audit a disorganized collection of files and reorganize them into a logical structure with descriptive folder and file names"
            ]
          },
          {
            "key": "file_types_extensions",
            "name": "File Types and Extensions",
            "short_description": "Understanding different file formats, their uses, and how to work with various file types.",
            "example_tasks": [
              "Create a reference guide of common file extensions (.docx, .pdf, .jpg, .mp4, .xlsx) explaining what each type is used for and which programs open them",
              "Convert files between different formats (image to PDF, document to PDF, video formats) and explain when and why format conversion is necessary",
              "Identify appropriate file formats for different purposes such as sharing documents, preserving image quality, or reducing file size"
            ]
          },
          {
            "key": "backup_recovery",
            "name": "Backup and File Recovery",
            "short_description": "Understanding the importance of backups and implementing strategies to protect important data.",
            "example_tasks": [
              "Demonstrate backing up important files to cloud storage or external drive and explain the 3-2-1 backup rule",
              "Practice recovering accidentally deleted files from the recycle bin or cloud storage trash folders",
              "Create a personal backup plan including what files to backup, how often, where to store backups, and how to test restoration"
            ]
          },
          {
            "key": "cloud_storage",
            "name": "Cloud Storage and Synchronization",
            "short_description": "Using cloud storage services to store, share, and synchronize files across devices.",
            "example_tasks": [
              "Set up a cloud storage account (Google Drive, OneDrive, Dropbox) and organize school files with appropriate folder sharing permissions",
              "Share a document via cloud storage with specific permissions (view only, comment, edit) and collaborate on a group project",
              "Compare cloud storage versus local storage discussing advantages like accessibility and synchronization versus disadvantages like internet dependency and privacy"
            ]
          }
        ]
      },
      {
        "key": "basic_troubleshooting",
        "name": "Basic Troubleshooting and Maintenance",
        "short_description": "Identifying common computer problems, applying systematic troubleshooting methods, and performing routine maintenance.",
        "sub_topics": [
          {
            "key": "problem_solving_steps",
            "name": "Systematic Troubleshooting Process",
            "short_description": "Using a methodical approach to identify and resolve computer issues.",
            "example_tasks": [
              "Apply a troubleshooting flowchart to diagnose why a computer won't start, checking power, connections, and error messages systematically",
              "Document a computer problem including symptoms, steps already tried, error messages, and eventual solution for future reference",
              "Practice the basic troubleshooting mantra of 'restart, reconnect, research' to solve common issues like frozen programs or connectivity problems"
            ]
          },
          {
            "key": "common_issues",
            "name": "Common Hardware and Software Issues",
            "short_description": "Recognizing and resolving frequently encountered computer problems.",
            "example_tasks": [
              "Troubleshoot common software issues including programs freezing, slow performance, and application crashes using task manager and restart procedures",
              "Diagnose and fix simple connectivity problems with peripherals like printers, mice, or external drives by checking cables and drivers",
              "Research solutions to error messages by searching online technical support forums and evaluating which solutions are safe and applicable"
            ]
          },
          {
            "key": "system_maintenance",
            "name": "System Maintenance and Optimization",
            "short_description": "Performing regular maintenance tasks to keep computers running efficiently.",
            "example_tasks": [
              "Create and follow a monthly computer maintenance schedule including disk cleanup, update checks, and clearing temporary files",
              "Use built-in system tools to optimize performance such as defragmentation (HDD), disk cleanup, and startup program management",
              "Monitor computer performance using system monitoring tools and identify processes or programs consuming excessive resources"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "networks_internet_technologies",
    "name": "Networks and Internet Technologies",
    "short_description": "Students explore network fundamentals, internet architecture, communication protocols, wireless technologies, and how data travels across networks.",
    "sub_topics": [
      {
        "key": "network_fundamentals",
        "name": "Network Fundamentals and Types",
        "short_description": "Understanding what networks are, different network types, and basic networking concepts.",
        "sub_topics": [
          {
            "key": "network_types",
            "name": "Types of Networks",
            "short_description": "Distinguishing between LAN, WAN, and other network configurations.",
            "example_tasks": [
              "Create a diagram comparing LAN (Local Area Network) in a school versus WAN (Wide Area Network) connecting multiple schools, labeling components",
              "Identify examples of different network types in daily life such as home Wi-Fi (LAN), cellular networks (WAN), and the internet",
              "Design a network plan for a small business determining whether devices should be on the same LAN and how to connect to the internet"
            ]
          },
          {
            "key": "network_components",
            "name": "Network Hardware Components",
            "short_description": "Understanding routers, switches, modems, and other networking equipment.",
            "example_tasks": [
              "Label a home or school network diagram identifying the modem, router, switch, access points, and connected devices",
              "Explain the difference between a modem (connects to ISP) and a router (creates local network and manages traffic)",
              "Research and compare wired network components (Ethernet cables, network switches) versus wireless components (Wi-Fi routers, access points)"
            ]
          },
          {
            "key": "network_topologies",
            "name": "Network Topologies and Structures",
            "short_description": "Understanding how devices can be arranged and connected in networks.",
            "example_tasks": [
              "Draw and label different network topologies (star, bus, ring, mesh) explaining advantages and disadvantages of each",
              "Identify the topology used in your school network and explain why that structure was chosen",
              "Simulate network topology failures and predict which connections would be affected in different topology types"
            ]
          }
        ]
      },
      {
        "key": "internet_architecture",
        "name": "Internet Architecture and Protocols",
        "short_description": "Understanding how the internet works, client-server models, and communication protocols.",
        "sub_topics": [
          {
            "key": "how_internet_works",
            "name": "How the Internet Works",
            "short_description": "Understanding the global network of networks and how data travels across the internet.",
            "example_tasks": [
              "Trace the path of data from your computer to a website using tools like traceroute and explain each hop in the journey",
              "Research and create an infographic showing how data travels from a user's device through ISPs, backbone networks, and servers",
              "Explain using an analogy how the internet is a 'network of networks' with no central control point"
            ]
          },
          {
            "key": "ip_addresses_dns",
            "name": "IP Addresses and Domain Name System",
            "short_description": "Understanding how devices are identified on networks and how domain names work.",
            "example_tasks": [
              "Find the IP address of your computer and explain the difference between public and private IP addresses",
              "Use DNS lookup tools to find the IP address associated with a domain name and explain how DNS translates human-readable names",
              "Compare IPv4 and IPv6 addressing systems including address format, total available addresses, and why IPv6 is needed"
            ]
          },
          {
            "key": "protocols_tcp_ip",
            "name": "Network Protocols and TCP/IP",
            "short_description": "Understanding communication rules and the protocol stack that enables internet communication.",
            "example_tasks": [
              "Explain the difference between TCP (reliable delivery) and UDP (faster but less reliable) and give examples of when each is used",
              "Diagram the TCP/IP protocol stack layers (Application, Transport, Internet, Network Access) and explain the role of each layer",
              "Research common protocols (HTTP, HTTPS, FTP, SMTP, DNS) and explain what each is used for in network communication"
            ]
          },
          {
            "key": "client_server_model",
            "name": "Client-Server Model",
            "short_description": "Understanding how clients request services and servers provide them in networked systems.",
            "example_tasks": [
              "Identify client and server roles in common online activities like browsing websites, sending email, or streaming video",
              "Simulate client-server communication by having one computer request a webpage and another serve the HTML files",
              "Compare client-server architecture to peer-to-peer networks explaining advantages and use cases for each model"
            ]
          }
        ]
      },
      {
        "key": "connectivity_wireless",
        "name": "Connectivity and Wireless Technologies",
        "short_description": "Understanding how devices connect to networks including wireless technologies and troubleshooting connections.",
        "sub_topics": [
          {
            "key": "wifi_wireless",
            "name": "Wi-Fi and Wireless Networking",
            "short_description": "Understanding how wireless networks function, security, and configuration.",
            "example_tasks": [
              "Connect a device to a Wi-Fi network and explain the authentication process including SSID, password, and encryption types (WPA2, WPA3)",
              "Compare 2.4GHz and 5GHz Wi-Fi bands including range, speed, and interference characteristics",
              "Research wireless security best practices including strong passwords, hiding SSID, MAC filtering, and guest network setup"
            ]
          },
          {
            "key": "bluetooth_mobile",
            "name": "Bluetooth and Mobile Connectivity",
            "short_description": "Understanding short-range wireless technologies and mobile network connections.",
            "example_tasks": [
              "Pair a Bluetooth device with a computer or phone and explain the pairing process and when Bluetooth is preferable to Wi-Fi",
              "Compare different mobile data technologies (3G, 4G, 5G) in terms of speed, latency, and typical uses",
              "Investigate how mobile hotspots work and set up a device to share its mobile data connection with other devices"
            ]
          },
          {
            "key": "connection_troubleshooting",
            "name": "Network Troubleshooting",
            "short_description": "Diagnosing and resolving common network connectivity issues.",
            "example_tasks": [
              "Troubleshoot why a device cannot connect to Wi-Fi by checking network availability, password, airplane mode, and network adapter settings",
              "Use network diagnostic tools like ping and ipconfig/ifconfig to test connectivity and identify where connection problems occur",
              "Create a troubleshooting flowchart for network issues including checking physical connections, restarting router/modem, and contacting ISP"
            ]
          }
        ]
      },
      {
        "key": "web_technologies",
        "name": "Web Technologies and Services",
        "short_description": "Understanding how web browsers work, web protocols, and internet services.",
        "sub_topics": [
          {
            "key": "browsers_urls",
            "name": "Web Browsers and URLs",
            "short_description": "Understanding browser functions, URL structure, and how web pages are requested and displayed.",
            "example_tasks": [
              "Dissect a URL identifying the protocol (https://), domain name, path, and parameters, explaining what each part means",
              "Compare different web browsers (Chrome, Firefox, Safari, Edge) in terms of features, speed, and privacy options",
              "Use browser developer tools to view the HTTP requests and responses when loading a webpage"
            ]
          },
          {
            "key": "http_https",
            "name": "HTTP and HTTPS Protocols",
            "short_description": "Understanding web communication protocols and the importance of secure connections.",
            "example_tasks": [
              "Identify secure (HTTPS) versus unsecure (HTTP) websites and explain why encryption is important for sensitive information",
              "View SSL certificate information for a website and interpret what the certificate tells you about the site's identity and security",
              "Research how HTTPS works including the role of encryption, certificates, and why browsers warn about insecure sites"
            ]
          },
          {
            "key": "internet_services",
            "name": "Internet Services and Applications",
            "short_description": "Understanding common internet services like email, file transfer, and streaming.",
            "example_tasks": [
              "Map out how email works from sender to recipient including SMTP (sending), POP3/IMAP (receiving), and mail servers",
              "Compare different methods of file sharing including email attachments, FTP, cloud storage, and peer-to-peer explaining trade-offs",
              "Investigate how streaming services deliver video content including buffering, adaptive bitrate, and bandwidth requirements"
            ]
          },
          {
            "key": "bandwidth_performance",
            "name": "Bandwidth and Network Performance",
            "short_description": "Understanding factors that affect internet speed and network performance.",
            "example_tasks": [
              "Test internet connection speed using online speed test tools and interpret download speed, upload speed, and latency results",
              "Calculate how long it would take to download files of different sizes at various connection speeds",
              "Identify factors affecting network performance such as bandwidth limitations, network congestion, distance from router, and simultaneous users"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "intro_programming_concepts",
    "name": "Introduction to Programming Concepts",
    "short_description": "Students develop computational thinking skills, understand fundamental programming concepts like algorithms, variables, and data types, and learn problem decomposition.",
    "sub_topics": [
      {
        "key": "computational_thinking",
        "name": "Computational Thinking",
        "short_description": "Developing problem-solving approaches including decomposition, pattern recognition, abstraction, and algorithm design.",
        "sub_topics": [
          {
            "key": "problem_decomposition",
            "name": "Problem Decomposition",
            "short_description": "Breaking complex problems into smaller, manageable sub-problems.",
            "example_tasks": [
              "Break down the task of making a peanut butter and jelly sandwich into individual steps detailed enough for someone who has never seen one",
              "Decompose a complex problem like planning a class party into smaller tasks such as choosing a date, creating a guest list, and selecting food",
              "Analyze a video game and identify the smaller sub-systems that work together such as character movement, scoring, collision detection, and level design"
            ]
          },
          {
            "key": "pattern_recognition",
            "name": "Pattern Recognition",
            "short_description": "Identifying similarities and patterns in problems to develop general solutions.",
            "example_tasks": [
              "Identify patterns in number sequences and write a rule to generate the next number or any number in the sequence",
              "Compare multiple similar problems (calculating areas of different shapes) and recognize the common pattern of multiplying dimensions",
              "Analyze repeated behaviors in daily routines and identify patterns that could be automated with technology"
            ]
          },
          {
            "key": "abstraction",
            "name": "Abstraction",
            "short_description": "Focusing on important information while ignoring irrelevant details.",
            "example_tasks": [
              "Create a subway map showing only station connections and lines, demonstrating abstraction by removing geographic detail",
              "Design an abstract model of a school showing only classrooms and how students move between them, ignoring furniture and decorations",
              "Compare a photograph to a simple icon of the same object explaining what details were abstracted away and why"
            ]
          },
          {
            "key": "algorithm_design",
            "name": "Algorithm Design",
            "short_description": "Creating step-by-step procedures to solve problems effectively.",
            "example_tasks": [
              "Write an algorithm for finding the largest number in a list of numbers, testing it with different examples",
              "Create a flowchart algorithm for deciding what to wear based on the weather and daily activities",
              "Design an algorithm to sort a deck of cards and compare it to other sorting methods discussing efficiency"
            ]
          }
        ]
      },
      {
        "key": "algorithms_intro",
        "name": "Algorithms and Pseudocode",
        "short_description": "Understanding what algorithms are, writing pseudocode, and analyzing algorithm efficiency.",
        "sub_topics": [
          {
            "key": "algorithm_basics",
            "name": "Algorithm Fundamentals",
            "short_description": "Understanding the properties of algorithms including input, output, definiteness, and finiteness.",
            "example_tasks": [
              "Evaluate whether a set of instructions constitutes a valid algorithm by checking for clear steps, defined inputs/outputs, and guaranteed termination",
              "Compare two algorithms that solve the same problem in different ways and discuss which is more efficient or easier to understand",
              "Identify algorithms in everyday life such as recipes, assembly instructions, or directions and analyze their components"
            ]
          },
          {
            "key": "pseudocode_writing",
            "name": "Writing Pseudocode",
            "short_description": "Expressing algorithms in plain language before coding them.",
            "example_tasks": [
              "Write pseudocode for calculating the average of three test scores including input, processing, and output steps",
              "Translate a written description of a process into structured pseudocode using keywords like BEGIN, END, IF, THEN, WHILE",
              "Convert pseudocode into a flowchart and vice versa to practice multiple ways of representing algorithms"
            ]
          },
          {
            "key": "flowcharts",
            "name": "Flowcharts and Visual Algorithms",
            "short_description": "Representing algorithms visually using flowchart symbols and conventions.",
            "example_tasks": [
              "Create a flowchart for an algorithm using proper symbols for start/end (oval), process (rectangle), decision (diamond), and flow (arrows)",
              "Trace through a flowchart with sample data to verify it produces the correct output",
              "Design a flowchart for a game or interactive program showing different paths based on user choices"
            ]
          },
          {
            "key": "algorithm_efficiency",
            "name": "Algorithm Efficiency and Comparison",
            "short_description": "Understanding that different algorithms can solve the same problem with varying efficiency.",
            "example_tasks": [
              "Compare linear search versus binary search by counting how many steps each takes to find a number in a sorted list",
              "Analyze two sorting algorithms (like bubble sort and selection sort) and discuss trade-offs between simplicity and speed",
              "Measure how algorithm efficiency changes as input size increases by testing with lists of different lengths"
            ]
          }
        ]
      },
      {
        "key": "variables_data_types",
        "name": "Variables and Data Types",
        "short_description": "Understanding variables as containers for data and different types of data that programs use.",
        "sub_topics": [
          {
            "key": "variable_concepts",
            "name": "Variable Concepts and Naming",
            "short_description": "Understanding what variables are, how they store data, and conventions for naming them.",
            "example_tasks": [
              "Explain the concept of a variable as a labeled box that holds a value that can change during program execution",
              "Evaluate variable names for clarity and convention (descriptive, camelCase or snake_case, no spaces, meaningful)",
              "Practice declaring and initializing variables with appropriate names for different purposes like score, userName, or totalPrice"
            ]
          },
          {
            "key": "data_types_intro",
            "name": "Introduction to Data Types",
            "short_description": "Understanding different categories of data including integers, floats, strings, and booleans.",
            "example_tasks": [
              "Categorize values as integers (whole numbers), floats (decimals), strings (text), or booleans (true/false) and explain differences",
              "Predict what happens when you try to perform mathematical operations with different data types like adding a number to a string",
              "Choose appropriate data types for storing different kinds of information such as age (integer), name (string), or price (float)"
            ]
          },
          {
            "key": "type_conversion",
            "name": "Type Conversion and Casting",
            "short_description": "Converting between different data types when needed in programs.",
            "example_tasks": [
              "Convert user input from a string to an integer or float to perform calculations with it",
              "Practice converting between types and identify situations where conversion fails or produces unexpected results",
              "Debug programs where type mismatches cause errors and fix them with appropriate type conversions"
            ]
          }
        ]
      },
      {
        "key": "operators_expressions",
        "name": "Operators and Expressions",
        "short_description": "Using arithmetic, comparison, and logical operators to create expressions and make calculations.",
        "sub_topics": [
          {
            "key": "arithmetic_operators",
            "name": "Arithmetic Operators",
            "short_description": "Performing mathematical calculations using addition, subtraction, multiplication, division, and modulus.",
            "example_tasks": [
              "Write expressions using +, -, *, /, and % operators and predict results following order of operations",
              "Use the modulus operator (%) to determine if numbers are even or odd or to find remainders",
              "Create expressions that solve practical problems like calculating total cost with tax or converting temperatures"
            ]
          },
          {
            "key": "comparison_operators",
            "name": "Comparison and Relational Operators",
            "short_description": "Comparing values using operators like equal to, greater than, and less than.",
            "example_tasks": [
              "Write expressions using comparison operators (==, !=, <, >, <=, >=) and evaluate them as true or false",
              "Create conditions for decision-making such as checking if a score is passing or if age is appropriate for a rating",
              "Debug common mistakes like using = instead of == for comparison or confusing the order of operands"
            ]
          },
          {
            "key": "logical_operators",
            "name": "Logical Operators",
            "short_description": "Combining conditions using AND, OR, and NOT to create complex logic.",
            "example_tasks": [
              "Combine multiple conditions using AND, OR, and NOT operators to create complex decision logic",
              "Create truth tables showing all possible outcomes when combining boolean values with logical operators",
              "Write compound conditions for real scenarios like 'user is a teenager AND has parental permission' for website access"
            ]
          },
          {
            "key": "string_operations",
            "name": "String Operations",
            "short_description": "Manipulating text including concatenation, length, and accessing characters.",
            "example_tasks": [
              "Concatenate strings together using the + operator to build sentences or messages from parts",
              "Find the length of strings and access individual characters by position (indexing)",
              "Practice string methods like converting to uppercase/lowercase, finding substrings, or replacing text"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "block_visual_programming",
    "name": "Block-Based and Visual Programming",
    "short_description": "Students learn programming fundamentals through visual coding environments like Scratch, focusing on sequences, loops, conditionals, and creating interactive projects.",
    "sub_topics": [
      {
        "key": "scratch_basics",
        "name": "Scratch Programming Basics",
        "short_description": "Getting started with Scratch, understanding the interface, sprites, and basic block categories.",
        "sub_topics": [
          {
            "key": "scratch_interface",
            "name": "Scratch Interface and Environment",
            "short_description": "Navigating the Scratch editor including stage, sprite area, blocks palette, and scripts area.",
            "example_tasks": [
              "Create a Scratch account and explore the interface identifying the stage, sprite list, blocks palette, and scripts area",
              "Add sprites from the library and upload custom sprites, then position them on the stage using coordinates",
              "Explore different block categories (Motion, Looks, Sound, Events, Control, Sensing, Operators, Variables) and understand their purposes"
            ]
          },
          {
            "key": "sprites_costumes",
            "name": "Sprites, Costumes, and Backdrops",
            "short_description": "Creating and customizing sprites, using costumes for animation, and changing backdrops.",
            "example_tasks": [
              "Create a custom sprite using the paint editor and design multiple costumes to create an animation effect",
              "Import sprites and edit their costumes to create different appearances or animation frames",
              "Change backdrops to create different scenes or levels in a project using backdrop switching blocks"
            ]
          },
          {
            "key": "coordinate_system",
            "name": "Coordinate System and Movement",
            "short_description": "Understanding the Scratch coordinate grid and using it to position and move sprites.",
            "example_tasks": [
              "Use the coordinate grid to precisely position sprites at specific x and y locations on the stage",
              "Program a sprite to move to specific coordinates or change position by relative amounts",
              "Create a program where a sprite follows the mouse pointer or moves to random positions using coordinates"
            ]
          }
        ]
      },
      {
        "key": "sequence_events",
        "name": "Sequences and Events",
        "short_description": "Creating programs that execute blocks in order and respond to events like clicks or key presses.",
        "sub_topics": [
          {
            "key": "sequential_execution",
            "name": "Sequential Execution",
            "short_description": "Understanding that blocks execute in order from top to bottom.",
            "example_tasks": [
              "Create a simple animation sequence where a sprite changes position, size, and color in a specific order",
              "Debug a program where blocks are out of order causing incorrect behavior and fix the sequence",
              "Write a script that tells a story with sequential dialogue using say blocks"
            ]
          },
          {
            "key": "event_blocks",
            "name": "Event-Driven Programming",
            "short_description": "Using event blocks to start scripts when specific events occur.",
            "example_tasks": [
              "Program sprites to respond to the green flag click, key presses, sprite clicks, and backdrop changes",
              "Create an interactive program where different keys trigger different sprite actions or sounds",
              "Use broadcast messages to make sprites communicate and coordinate their actions"
            ]
          },
          {
            "key": "timing_synchronization",
            "name": "Timing and Synchronization",
            "short_description": "Controlling timing with wait blocks and synchronizing multiple sprites.",
            "example_tasks": [
              "Add wait blocks to control the pace of animations and create pauses between actions",
              "Synchronize two sprites to perform a choreographed sequence using broadcasts and wait blocks",
              "Create a countdown timer using wait blocks and changing number displays"
            ]
          }
        ]
      },
      {
        "key": "loops_iteration",
        "name": "Loops and Iteration",
        "short_description": "Using repeat, forever, and conditional loops to execute code multiple times.",
        "sub_topics": [
          {
            "key": "repeat_loops",
            "name": "Repeat Loops",
            "short_description": "Using repeat blocks to execute code a specific number of times.",
            "example_tasks": [
              "Create a square by using a repeat 4 block that moves forward and turns 90 degrees",
              "Program a sprite to bounce around the screen a specific number of times using repeat loops",
              "Use nested repeat loops to create patterns or grids of shapes"
            ]
          },
          {
            "key": "forever_loops",
            "name": "Forever Loops",
            "short_description": "Creating continuous behaviors that run throughout the program.",
            "example_tasks": [
              "Make a sprite continuously follow the mouse pointer using a forever loop with go to mouse-pointer blocks",
              "Create scrolling backgrounds or moving obstacles that loop continuously",
              "Program a sprite to constantly check for collisions or boundary conditions in a forever loop"
            ]
          },
          {
            "key": "conditional_loops",
            "name": "Conditional Loops (Repeat Until)",
            "short_description": "Repeating code until a specific condition becomes true.",
            "example_tasks": [
              "Use repeat until blocks to make a sprite move until it reaches a specific position or touches another sprite",
              "Create a game where an action repeats until a score reaches a target value",
              "Program a searching behavior where a sprite moves randomly until it finds another sprite or color"
            ]
          }
        ]
      },
      {
        "key": "conditionals_decisions",
        "name": "Conditionals and Decision Making",
        "short_description": "Using if and if-else blocks to make decisions based on conditions.",
        "sub_topics": [
          {
            "key": "if_statements",
            "name": "If Statements",
            "short_description": "Executing code only when a condition is true.",
            "example_tasks": [
              "Program a sprite to change costume or play a sound if it touches the edge or another sprite",
              "Create an interactive program where clicking on sprites triggers different actions using if touching mouse-pointer",
              "Use if statements to check sensing conditions like key pressed, answer to questions, or color detection"
            ]
          },
          {
            "key": "if_else_statements",
            "name": "If-Else Statements",
            "short_description": "Choosing between two different actions based on a condition.",
            "example_tasks": [
              "Create a game where a sprite says 'Correct!' or 'Try again' based on whether the user's answer matches the right answer",
              "Program a character to move right if the right arrow is pressed, else move left if the left arrow is pressed",
              "Make a sprite bounce off edges by checking if it's touching the edge and changing direction accordingly"
            ]
          },
          {
            "key": "nested_conditionals",
            "name": "Nested Conditionals",
            "short_description": "Placing conditionals inside other conditionals for complex decision trees.",
            "example_tasks": [
              "Create a multi-choice quiz where nested if-else blocks check multiple possible answers",
              "Program game logic with nested conditionals like checking if touching an enemy AND if the player has a shield",
              "Build a decision tree for classifying objects based on multiple characteristics using nested if statements"
            ]
          },
          {
            "key": "boolean_logic",
            "name": "Boolean Operators and Complex Conditions",
            "short_description": "Combining conditions using AND, OR, and NOT operators.",
            "example_tasks": [
              "Use AND blocks to create conditions that require multiple things to be true simultaneously",
              "Use OR blocks to trigger actions when any of several conditions is true",
              "Combine NOT operators to reverse conditions or check for the absence of something"
            ]
          }
        ]
      },
      {
        "key": "variables_lists_scratch",
        "name": "Variables and Lists in Scratch",
        "short_description": "Creating and using variables to store data and lists to store collections of items.",
        "sub_topics": [
          {
            "key": "creating_variables",
            "name": "Creating and Using Variables",
            "short_description": "Making variables to store scores, names, or other changing data.",
            "example_tasks": [
              "Create a score variable and program it to increase when the player catches objects or completes challenges",
              "Use a timer variable that counts up or down during gameplay",
              "Store user input in a variable and use it later in the program for personalization"
            ]
          },
          {
            "key": "variable_scope",
            "name": "Variable Scope (For All Sprites vs For This Sprite Only)",
            "short_description": "Understanding when variables should be global or sprite-specific.",
            "example_tasks": [
              "Create global variables that all sprites can access like a game score or level number",
              "Create sprite-specific variables for properties unique to each sprite like health or speed",
              "Debug problems caused by using the wrong variable scope and fix by changing to appropriate scope"
            ]
          },
          {
            "key": "lists_basics",
            "name": "Introduction to Lists",
            "short_description": "Creating lists to store multiple values and accessing list items.",
            "example_tasks": [
              "Create a list to store quiz questions or vocabulary words and access them one at a time",
              "Add items to a list during program execution like collecting objects or recording high scores",
              "Use list operations like getting item number, length of list, and checking if list contains an item"
            ]
          },
          {
            "key": "list_iteration",
            "name": "Iterating Through Lists",
            "short_description": "Using loops to process all items in a list.",
            "example_tasks": [
              "Loop through a list of questions displaying each one and checking the user's answer",
              "Process all items in a list to find the maximum value, sum all values, or search for a specific item",
              "Create a program that randomly selects items from a list without repeating using list manipulation"
            ]
          }
        ]
      },
      {
        "key": "interactive_projects",
        "name": "Interactive Projects and Games",
        "short_description": "Combining programming concepts to create games, stories, and interactive experiences.",
        "sub_topics": [
          {
            "key": "game_design_basics",
            "name": "Game Design Fundamentals",
            "short_description": "Planning and implementing basic game mechanics like goals, scoring, and levels.",
            "example_tasks": [
              "Design a simple collection game where the player moves a sprite to collect objects while avoiding obstacles",
              "Create a quiz game with multiple questions, score tracking, and feedback for correct and incorrect answers",
              "Build a platformer-style game with jumping, collision detection, and level completion"
            ]
          },
          {
            "key": "user_input_interaction",
            "name": "User Input and Interaction",
            "short_description": "Creating programs that respond to keyboard, mouse, and voice input.",
            "example_tasks": [
              "Create a drawing program that follows the mouse and changes pen color based on key presses",
              "Program character movement controlled by arrow keys or WASD with smooth acceleration and stopping",
              "Use the ask block to get text input from users and respond appropriately based on their answers"
            ]
          },
          {
            "key": "sound_animation",
            "name": "Sound and Animation",
            "short_description": "Adding sound effects, music, and animations to enhance projects.",
            "example_tasks": [
              "Add background music and sound effects that play during specific game events or user actions",
              "Create smooth sprite animations using costume changes, glide blocks, and graphic effects",
              "Use sound sensors or timing to create music visualization or rhythm-based interactions"
            ]
          },
          {
            "key": "clones_advanced",
            "name": "Clones and Advanced Techniques",
            "short_description": "Using clones to create multiple instances of sprites dynamically.",
            "example_tasks": [
              "Create clones of sprites to generate multiple enemies, projectiles, or collectible items during gameplay",
              "Program clones to have individual behaviors while being created and deleted dynamically",
              "Build a particle system using clones to create effects like explosions, rain, or stars"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "python_fundamentals",
    "name": "Python Programming Fundamentals",
    "short_description": "Students learn Python syntax, work with variables and data types, use input/output functions, and write simple programs using a text-based programming language.",
    "sub_topics": [
      {
        "key": "python_setup_basics",
        "name": "Python Setup and Development Environment",
        "short_description": "Setting up Python, understanding the interpreter, using IDEs, and writing first programs.",
        "sub_topics": [
          {
            "key": "python_installation",
            "name": "Installing and Running Python",
            "short_description": "Installing Python, using IDLE or other IDEs, and running Python programs.",
            "example_tasks": [
              "Install Python on your computer and verify the installation by checking the version in the command line using python --version",
              "Write and run your first Python program that prints 'Hello, World!' using IDLE or another Python IDE",
              "Compare running Python programs in interactive mode (typing commands one at a time) versus script mode (writing and executing files)"
            ]
          },
          {
            "key": "python_ides",
            "name": "Python Development Environments",
            "short_description": "Using different Python IDEs and online coding platforms for development.",
            "example_tasks": [
              "Explore different Python IDEs (IDLE, PyCharm, VS Code, Thonny) and identify features like syntax highlighting, error detection, and debugging tools",
              "Use an online Python platform like Replit or Trinket to write and run Python code without local installation",
              "Practice using the interactive Python shell for testing code snippets before adding them to programs"
            ]
          },
          {
            "key": "python_syntax_basics",
            "name": "Python Syntax Basics",
            "short_description": "Understanding Python syntax rules including indentation, comments, and case sensitivity.",
            "example_tasks": [
              "Write Python programs demonstrating proper indentation and explain why indentation is critical in Python (unlike some other languages)",
              "Add single-line comments using # and multi-line comments using triple quotes to explain what code does",
              "Debug programs with syntax errors caused by incorrect indentation, missing colons, or typos and fix them"
            ]
          }
        ]
      },
      {
        "key": "python_variables_types",
        "name": "Python Variables and Data Types",
        "short_description": "Working with variables, understanding Python data types, and performing type conversions.",
        "sub_topics": [
          {
            "key": "variable_assignment",
            "name": "Variable Assignment and Naming",
            "short_description": "Creating variables, following naming conventions, and understanding variable assignment.",
            "example_tasks": [
              "Create variables to store different types of information like name = 'Alex', age = 13, height = 5.2 following Python naming conventions",
              "Evaluate variable names for validity (must start with letter or underscore, no spaces, no reserved words) and correct invalid names",
              "Practice assigning new values to variables and understand that variables can change throughout program execution"
            ]
          },
          {
            "key": "python_data_types",
            "name": "Python Data Types",
            "short_description": "Working with integers, floats, strings, and booleans in Python.",
            "example_tasks": [
              "Use the type() function to determine the data type of different values and variables",
              "Create variables of each type: int (42), float (3.14), str ('hello'), bool (True) and demonstrate their different uses",
              "Explain when to use each data type based on what kind of information needs to be stored"
            ]
          },
          {
            "key": "type_conversion_python",
            "name": "Type Conversion and Casting",
            "short_description": "Converting between data types using int(), float(), str(), and bool() functions.",
            "example_tasks": [
              "Convert user input strings to integers or floats using int() and float() to perform mathematical calculations",
              "Convert numbers to strings using str() to concatenate them with text in output messages",
              "Debug common type errors like trying to add strings and numbers, and fix them with appropriate type conversion"
            ]
          },
          {
            "key": "string_operations_python",
            "name": "String Operations in Python",
            "short_description": "Manipulating strings using concatenation, indexing, slicing, and string methods.",
            "example_tasks": [
              "Concatenate strings using the + operator and repeat strings using * to build messages and patterns",
              "Access individual characters in strings using indexing (string[0]) and extract substrings using slicing (string[1:4])",
              "Use string methods like .upper(), .lower(), .strip(), .replace(), and .split() to manipulate text"
            ]
          }
        ]
      },
      {
        "key": "python_input_output",
        "name": "Input and Output in Python",
        "short_description": "Getting user input, displaying output, and formatting text for readable programs.",
        "sub_topics": [
          {
            "key": "print_function",
            "name": "Print Function and Output",
            "short_description": "Using print() to display text, variables, and formatted output.",
            "example_tasks": [
              "Use print() to display text, variables, and combinations of both using commas or concatenation",
              "Print multiple items on the same line using print() parameters like sep and end",
              "Format output using escape sequences like \\n (newline) and \\t (tab) for better readability"
            ]
          },
          {
            "key": "input_function",
            "name": "Input Function and User Input",
            "short_description": "Using input() to get data from users and storing it in variables.",
            "example_tasks": [
              "Create a program that asks for the user's name using input() and stores it in a variable, then greets them by name",
              "Get multiple pieces of information from users with separate input() calls and use them in calculations or output",
              "Convert input() results (which are always strings) to numbers when needed for mathematical operations"
            ]
          },
          {
            "key": "string_formatting",
            "name": "String Formatting",
            "short_description": "Formatting output using f-strings, .format(), and string concatenation.",
            "example_tasks": [
              "Use f-strings to embed variables directly in strings like f'Hello, {name}! You are {age} years old.'",
              "Format numbers in output to show specific decimal places like f'Price: ${price:.2f}'",
              "Create formatted tables or aligned output using string formatting techniques"
            ]
          }
        ]
      },
      {
        "key": "python_operators",
        "name": "Python Operators and Expressions",
        "short_description": "Using arithmetic, comparison, logical, and assignment operators in Python programs.",
        "sub_topics": [
          {
            "key": "arithmetic_operations",
            "name": "Arithmetic Operators",
            "short_description": "Performing calculations using +, -, *, /, //, %, and ** operators.",
            "example_tasks": [
              "Write expressions using basic arithmetic operators and follow order of operations (PEMDAS) with parentheses for grouping",
              "Use integer division (//) to get whole number results and modulus (%) to find remainders",
              "Calculate exponents using the ** operator like 2**3 for 2 cubed"
            ]
          },
          {
            "key": "comparison_operators_python",
            "name": "Comparison Operators",
            "short_description": "Comparing values using ==, !=, <, >, <=, >= operators.",
            "example_tasks": [
              "Write comparison expressions that evaluate to True or False and test them with different values",
              "Use comparison operators to create conditions for decision-making in programs",
              "Understand the difference between = (assignment) and == (comparison) and avoid common mistakes"
            ]
          },
          {
            "key": "logical_operators_python",
            "name": "Logical Operators",
            "short_description": "Combining conditions using and, or, and not operators.",
            "example_tasks": [
              "Create compound conditions using and (both must be true), or (at least one must be true), and not (reverses truth value)",
              "Write programs that check multiple conditions like 'if age >= 13 and age <= 19' to identify teenagers",
              "Use logical operators to simplify complex decision logic and make code more readable"
            ]
          },
          {
            "key": "assignment_operators",
            "name": "Assignment and Compound Operators",
            "short_description": "Using =, +=, -=, *=, /= and other compound assignment operators.",
            "example_tasks": [
              "Use compound assignment operators like score += 10 as shorthand for score = score + 10",
              "Apply +=, -=, *=, /= operators to update variables efficiently in loops and calculations",
              "Understand that assignment operators modify variables in place and return the new value"
            ]
          }
        ]
      },
      {
        "key": "python_control_structures",
        "name": "Control Structures in Python",
        "short_description": "Using if statements, loops, and control flow to create programs that make decisions and repeat actions.",
        "sub_topics": [
          {
            "key": "if_elif_else",
            "name": "If, Elif, and Else Statements",
            "short_description": "Making decisions in programs using conditional statements.",
            "example_tasks": [
              "Write if statements that execute code only when conditions are true, using proper indentation",
              "Create if-elif-else chains to handle multiple mutually exclusive conditions like grade ranges",
              "Build a simple decision-making program like a number guessing game or grade calculator using conditionals"
            ]
          },
          {
            "key": "nested_conditionals_python",
            "name": "Nested Conditionals",
            "short_description": "Placing if statements inside other if statements for complex logic.",
            "example_tasks": [
              "Create nested if statements to check multiple levels of conditions like checking if a number is positive, then if it's even",
              "Build decision trees for classification problems using nested conditionals",
              "Refactor complex nested conditionals using logical operators to make code more readable"
            ]
          },
          {
            "key": "while_loops",
            "name": "While Loops",
            "short_description": "Repeating code while a condition remains true.",
            "example_tasks": [
              "Create while loops that repeat code until a condition becomes false, like counting from 1 to 10",
              "Build input validation loops that keep asking for input until the user provides valid data",
              "Use while loops with counters, updating the counter inside the loop to avoid infinite loops"
            ]
          },
          {
            "key": "for_loops_python",
            "name": "For Loops and Range",
            "short_description": "Repeating code a specific number of times using for loops and range().",
            "example_tasks": [
              "Use for loops with range() to repeat actions a specific number of times like for i in range(10)",
              "Loop through sequences of numbers using range(start, stop, step) for different counting patterns",
              "Create multiplication tables, patterns, or repetitive calculations using for loops"
            ]
          },
          {
            "key": "loop_control",
            "name": "Loop Control (Break and Continue)",
            "short_description": "Controlling loop execution using break and continue statements.",
            "example_tasks": [
              "Use break to exit a loop early when a specific condition is met, like finding a target value",
              "Use continue to skip the rest of the current iteration and move to the next one",
              "Create a number guessing game where break exits the loop when the correct number is guessed"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "javascript_basics",
    "name": "JavaScript Basics",
    "short_description": "Students learn JavaScript syntax, manipulate web page elements, respond to user events, and create interactive web experiences using client-side scripting.",
    "sub_topics": [
      {
        "key": "javascript_intro",
        "name": "Introduction to JavaScript",
        "short_description": "Understanding what JavaScript is, where it runs, and how to include it in web pages.",
        "sub_topics": [
          {
            "key": "javascript_purpose",
            "name": "JavaScript Purpose and Uses",
            "short_description": "Understanding why JavaScript is essential for modern web development and interactive websites.",
            "example_tasks": [
              "Research and list examples of website features that require JavaScript like form validation, interactive maps, and dynamic content",
              "Compare static HTML pages to JavaScript-enhanced pages by examining the difference in interactivity and user experience",
              "Explore websites with JavaScript disabled and observe what functionality is lost"
            ]
          },
          {
            "key": "including_javascript",
            "name": "Including JavaScript in HTML",
            "short_description": "Adding JavaScript to web pages using script tags, inline code, and external files.",
            "example_tasks": [
              "Create an HTML page with inline JavaScript using <script> tags in the head or body sections",
              "Write JavaScript in an external .js file and link it to an HTML page using <script src='script.js'>",
              "Compare inline, internal, and external JavaScript placement and understand best practices for organization"
            ]
          },
          {
            "key": "browser_console",
            "name": "Browser Console and Debugging",
            "short_description": "Using browser developer tools to test JavaScript and view console output.",
            "example_tasks": [
              "Open browser developer tools (F12) and use the console to test JavaScript commands interactively",
              "Use console.log() to display messages, variable values, and debug information in the browser console",
              "View and fix JavaScript errors that appear in the console with line numbers and error descriptions"
            ]
          }
        ]
      },
      {
        "key": "javascript_syntax_variables",
        "name": "JavaScript Syntax and Variables",
        "short_description": "Learning JavaScript syntax rules, variable declaration, and basic data types.",
        "sub_topics": [
          {
            "key": "javascript_syntax",
            "name": "JavaScript Syntax Fundamentals",
            "short_description": "Understanding JavaScript syntax including semicolons, case sensitivity, and comments.",
            "example_tasks": [
              "Write JavaScript code following proper syntax including semicolons at the end of statements and proper spacing",
              "Add single-line (//) and multi-line (/* */) comments to explain JavaScript code",
              "Debug syntax errors caused by missing semicolons, incorrect capitalization, or mismatched brackets"
            ]
          },
          {
            "key": "variable_declaration_js",
            "name": "Variable Declaration (var, let, const)",
            "short_description": "Declaring variables using var, let, and const with appropriate scope and mutability.",
            "example_tasks": [
              "Declare variables using let for values that will change and const for values that remain constant",
              "Understand the difference between var (function scope) and let (block scope) through examples",
              "Practice declaring and initializing variables with descriptive names following camelCase convention"
            ]
          },
          {
            "key": "javascript_data_types",
            "name": "JavaScript Data Types",
            "short_description": "Working with numbers, strings, booleans, null, and undefined in JavaScript.",
            "example_tasks": [
              "Create variables of different types: number (42, 3.14), string ('hello', \"world\"), boolean (true, false)",
              "Use typeof operator to check the data type of variables and values",
              "Understand special values like null (intentional absence) and undefined (variable declared but not assigned)"
            ]
          },
          {
            "key": "type_coercion",
            "name": "Type Coercion and Conversion",
            "short_description": "Understanding automatic type conversion and explicit type casting in JavaScript.",
            "example_tasks": [
              "Observe type coercion when mixing different types in operations like '5' + 3 resulting in '53'",
              "Use explicit conversion functions like Number(), String(), parseInt(), and parseFloat()",
              "Debug unexpected results caused by type coercion and fix with appropriate conversions"
            ]
          }
        ]
      },
      {
        "key": "javascript_operators_expressions",
        "name": "JavaScript Operators and Expressions",
        "short_description": "Using operators to perform calculations, comparisons, and logical operations in JavaScript.",
        "sub_topics": [
          {
            "key": "arithmetic_js",
            "name": "Arithmetic Operators in JavaScript",
            "short_description": "Performing mathematical calculations using JavaScript operators.",
            "example_tasks": [
              "Use arithmetic operators (+, -, *, /, %, **) to perform calculations and understand operator precedence",
              "Apply increment (++) and decrement (--) operators to modify variables",
              "Create calculators or mathematical programs using arithmetic operators and displaying results on web pages"
            ]
          },
          {
            "key": "comparison_logical_js",
            "name": "Comparison and Logical Operators",
            "short_description": "Comparing values and creating complex conditions using JavaScript operators.",
            "example_tasks": [
              "Use comparison operators (==, ===, !=, !==, <, >, <=, >=) understanding the difference between == (loose) and === (strict) equality",
              "Combine conditions using logical operators (&&, ||, !) to create complex boolean expressions",
              "Write validation logic using comparison and logical operators to check user input"
            ]
          },
          {
            "key": "string_manipulation_js",
            "name": "String Manipulation in JavaScript",
            "short_description": "Working with strings using concatenation, template literals, and string methods.",
            "example_tasks": [
              "Concatenate strings using + operator and template literals using backticks `Hello ${name}`",
              "Use string methods like .length, .toUpperCase(), .toLowerCase(), .substring(), .indexOf(), .split()",
              "Create dynamic text content by combining variables and strings for display on web pages"
            ]
          }
        ]
      },
      {
        "key": "dom_manipulation",
        "name": "DOM Manipulation",
        "short_description": "Accessing and modifying HTML elements using JavaScript to create dynamic web pages.",
        "sub_topics": [
          {
            "key": "selecting_elements",
            "name": "Selecting HTML Elements",
            "short_description": "Using JavaScript to find and select elements from the HTML document.",
            "example_tasks": [
              "Use document.getElementById() to select elements by their id attribute",
              "Select elements using document.querySelector() and document.querySelectorAll() with CSS selectors",
              "Store element references in variables to manipulate them throughout the program"
            ]
          },
          {
            "key": "changing_content",
            "name": "Changing Element Content and Attributes",
            "short_description": "Modifying text, HTML, and attributes of elements using JavaScript.",
            "example_tasks": [
              "Change text content of elements using .textContent or .innerHTML properties",
              "Modify element attributes like src, href, alt using .setAttribute() or direct property access",
              "Create an interactive page where clicking buttons changes the text or images displayed"
            ]
          },
          {
            "key": "styling_elements",
            "name": "Styling Elements with JavaScript",
            "short_description": "Changing CSS properties and classes of elements dynamically.",
            "example_tasks": [
              "Modify inline styles using element.style.property like element.style.color = 'blue'",
              "Add, remove, or toggle CSS classes using .classList.add(), .classList.remove(), and .classList.toggle()",
              "Create interactive styling changes like hover effects, theme switchers, or show/hide functionality"
            ]
          },
          {
            "key": "creating_elements",
            "name": "Creating and Removing Elements",
            "short_description": "Dynamically creating new HTML elements and removing existing ones with JavaScript.",
            "example_tasks": [
              "Create new elements using document.createElement() and add them to the page with .appendChild() or .insertBefore()",
              "Remove elements from the page using .removeChild() or .remove()",
              "Build a to-do list where items can be added and removed dynamically using JavaScript"
            ]
          }
        ]
      },
      {
        "key": "javascript_events",
        "name": "JavaScript Events and Interactivity",
        "short_description": "Responding to user actions like clicks, keyboard input, and mouse movements to create interactive experiences.",
        "sub_topics": [
          {
            "key": "event_listeners",
            "name": "Event Listeners",
            "short_description": "Setting up event listeners to respond when specific events occur.",
            "example_tasks": [
              "Add click event listeners to buttons using .addEventListener('click', function) to execute code when clicked",
              "Create event handler functions that run when events fire, accessing the event object for details",
              "Remove event listeners using .removeEventListener() when they're no longer needed"
            ]
          },
          {
            "key": "mouse_events",
            "name": "Mouse Events",
            "short_description": "Responding to mouse clicks, movements, and hover actions.",
            "example_tasks": [
              "Handle different mouse events like click, dblclick, mouseenter, mouseleave, and mousemove",
              "Create interactive elements that change appearance when the mouse hovers over them",
              "Build a simple drawing program that tracks mouse movement and position"
            ]
          },
          {
            "key": "keyboard_events",
            "name": "Keyboard Events",
            "short_description": "Responding to keyboard input and key presses.",
            "example_tasks": [
              "Listen for keydown, keyup, and keypress events and identify which key was pressed using event.key or event.code",
              "Create keyboard-controlled interactions like moving elements with arrow keys",
              "Build form validation that provides real-time feedback as users type"
            ]
          },
          {
            "key": "form_events",
            "name": "Form Events and Validation",
            "short_description": "Handling form submissions and validating user input with JavaScript.",
            "example_tasks": [
              "Prevent form submission using event.preventDefault() to validate input before sending",
              "Validate form fields checking for empty values, correct formats (email, phone), and required fields",
              "Display error messages next to form fields when validation fails and clear them when corrected"
            ]
          }
        ]
      },
      {
        "key": "javascript_control_flow",
        "name": "Control Flow in JavaScript",
        "short_description": "Using conditionals and loops to control program flow in JavaScript.",
        "sub_topics": [
          {
            "key": "conditionals_js",
            "name": "If-Else Statements in JavaScript",
            "short_description": "Making decisions using if, else if, and else statements.",
            "example_tasks": [
              "Write if-else statements to make decisions based on conditions like user input or element states",
              "Create multiple condition checks using else if chains for different scenarios",
              "Use ternary operators (condition ? value1 : value2) for simple conditional assignments"
            ]
          },
          {
            "key": "switch_statements",
            "name": "Switch Statements",
            "short_description": "Handling multiple cases efficiently using switch statements.",
            "example_tasks": [
              "Create switch statements to handle multiple specific values more cleanly than long if-else chains",
              "Use break statements to prevent fall-through between cases",
              "Implement a simple calculator or menu system using switch statements for different operations"
            ]
          },
          {
            "key": "loops_js",
            "name": "Loops in JavaScript",
            "short_description": "Repeating code using for, while, and do-while loops.",
            "example_tasks": [
              "Create for loops to repeat actions a specific number of times using counter variables",
              "Use while loops to repeat code while conditions are true, like processing user input until valid",
              "Loop through arrays using for loops or for...of loops to process each element"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "data_structures_algorithms",
    "name": "Data Structures and Algorithms",
    "short_description": "Students learn to organize data using lists, arrays, dictionaries, and sets, and implement common algorithms for sorting and searching.",
    "sub_topics": [
      {
        "key": "lists_arrays",
        "name": "Lists and Arrays",
        "short_description": "Storing and manipulating collections of data using ordered sequences.",
        "sub_topics": [
          {
            "key": "creating_lists",
            "name": "Creating and Accessing Lists/Arrays",
            "short_description": "Creating lists, accessing elements by index, and understanding zero-based indexing.",
            "example_tasks": [
              "Create lists/arrays containing multiple values like scores = [85, 92, 78, 95] and access individual elements using indices",
              "Use negative indexing to access elements from the end of the list like scores[-1] for the last element",
              "Practice accessing elements at specific positions and understand IndexError when accessing out-of-bounds indices"
            ]
          },
          {
            "key": "modifying_lists",
            "name": "Modifying Lists/Arrays",
            "short_description": "Adding, removing, and changing elements in lists and arrays.",
            "example_tasks": [
              "Add elements to lists using .append() (end), .insert() (specific position), or concatenation with +",
              "Remove elements using .remove() (by value), .pop() (by index), or del statement",
              "Modify existing elements by assigning new values to specific indices like scores[2] = 88"
            ]
          },
          {
            "key": "list_operations",
            "name": "List Operations and Methods",
            "short_description": "Using built-in methods and operations to work with lists efficiently.",
            "example_tasks": [
              "Find list length using len(), check if items exist using 'in' operator, and concatenate lists with +",
              "Use list methods like .sort(), .reverse(), .count(), and .index() to manipulate and query lists",
              "Create a program that manages a collection of items (shopping list, inventory) using list operations"
            ]
          },
          {
            "key": "iterating_lists",
            "name": "Iterating Through Lists",
            "short_description": "Using loops to process each element in a list or array.",
            "example_tasks": [
              "Loop through list elements using for item in list to process each element",
              "Use enumerate() to get both index and value when iterating like for i, value in enumerate(list)",
              "Calculate totals, averages, or find maximum/minimum values by iterating through numeric lists"
            ]
          },
          {
            "key": "list_comprehensions",
            "name": "List Comprehensions",
            "short_description": "Creating new lists from existing ones using concise comprehension syntax.",
            "example_tasks": [
              "Create new lists using comprehensions like squares = [x**2 for x in range(10)]",
              "Filter lists using conditions in comprehensions like evens = [x for x in numbers if x % 2 == 0]",
              "Transform list data using comprehensions instead of traditional loops for more concise code"
            ]
          }
        ]
      },
      {
        "key": "dictionaries_objects",
        "name": "Dictionaries and Objects",
        "short_description": "Storing data as key-value pairs for efficient lookup and organization.",
        "sub_topics": [
          {
            "key": "creating_dictionaries",
            "name": "Creating and Accessing Dictionaries",
            "short_description": "Creating dictionaries with key-value pairs and accessing values by key.",
            "example_tasks": [
              "Create dictionaries using curly braces like student = {'name': 'Alex', 'age': 13, 'grade': 8}",
              "Access dictionary values using keys like student['name'] or .get() method",
              "Understand KeyError when accessing non-existent keys and use .get() with defaults to avoid errors"
            ]
          },
          {
            "key": "modifying_dictionaries",
            "name": "Modifying Dictionaries",
            "short_description": "Adding, updating, and removing key-value pairs in dictionaries.",
            "example_tasks": [
              "Add new key-value pairs by assigning to new keys like student['school'] = 'Lincoln Middle School'",
              "Update existing values by reassigning like student['grade'] = 9",
              "Remove entries using del statement or .pop() method"
            ]
          },
          {
            "key": "dictionary_operations",
            "name": "Dictionary Methods and Operations",
            "short_description": "Using dictionary methods to work with keys, values, and items.",
            "example_tasks": [
              "Use .keys() to get all keys, .values() to get all values, and .items() to get key-value pairs",
              "Check if keys exist using 'in' operator like if 'name' in student",
              "Iterate through dictionaries using for key in dict or for key, value in dict.items()"
            ]
          },
          {
            "key": "nested_structures",
            "name": "Nested Data Structures",
            "short_description": "Working with lists inside dictionaries or dictionaries inside lists.",
            "example_tasks": [
              "Create nested structures like a list of dictionaries to represent multiple students with their information",
              "Access nested data using multiple brackets or keys like students[0]['name']",
              "Build a contact list, gradebook, or inventory system using nested data structures"
            ]
          }
        ]
      },
      {
        "key": "searching_algorithms",
        "name": "Searching Algorithms",
        "short_description": "Implementing algorithms to find specific elements in data collections.",
        "sub_topics": [
          {
            "key": "linear_search",
            "name": "Linear Search",
            "short_description": "Searching through lists sequentially from beginning to end.",
            "example_tasks": [
              "Implement linear search that checks each element in order until finding the target or reaching the end",
              "Count how many comparisons linear search requires for lists of different sizes",
              "Understand when linear search is appropriate (unsorted data, small lists) versus when other approaches are better"
            ]
          },
          {
            "key": "binary_search",
            "name": "Binary Search",
            "short_description": "Efficiently searching sorted lists by repeatedly dividing the search space in half.",
            "example_tasks": [
              "Implement binary search that compares the target to the middle element and narrows the search to half the list",
              "Compare the efficiency of binary search versus linear search for large sorted lists",
              "Understand that binary search requires sorted data and trace through the algorithm with examples"
            ]
          },
          {
            "key": "search_applications",
            "name": "Search Algorithm Applications",
            "short_description": "Applying search algorithms to solve real-world problems.",
            "example_tasks": [
              "Create a program that searches for student records by name or ID using appropriate search algorithms",
              "Implement autocomplete functionality that searches for matching entries as users type",
              "Compare search performance by measuring time or counting operations for different algorithms and data sizes"
            ]
          }
        ]
      },
      {
        "key": "sorting_algorithms",
        "name": "Sorting Algorithms",
        "short_description": "Implementing algorithms to arrange data in order.",
        "sub_topics": [
          {
            "key": "bubble_sort",
            "name": "Bubble Sort",
            "short_description": "Sorting by repeatedly swapping adjacent elements that are out of order.",
            "example_tasks": [
              "Implement bubble sort that compares adjacent elements and swaps them if they're in wrong order, repeating until sorted",
              "Visualize bubble sort by printing the list after each pass to see how elements \"bubble\" to their positions",
              "Count the number of swaps and comparisons bubble sort makes for different list sizes"
            ]
          },
          {
            "key": "selection_sort",
            "name": "Selection Sort",
            "short_description": "Sorting by repeatedly finding the minimum element and placing it in order.",
            "example_tasks": [
              "Implement selection sort that finds the smallest unsorted element and swaps it to the correct position",
              "Trace through selection sort step-by-step showing how the sorted portion grows",
              "Compare selection sort to bubble sort in terms of swaps required and overall efficiency"
            ]
          },
          {
            "key": "insertion_sort",
            "name": "Insertion Sort",
            "short_description": "Sorting by building a sorted list one element at a time by inserting elements in the correct position.",
            "example_tasks": [
              "Implement insertion sort that takes each element and inserts it into its correct position in the sorted portion",
              "Understand how insertion sort works similarly to sorting playing cards in your hand",
              "Analyze when insertion sort performs well (nearly sorted data) versus poorly (reverse-sorted data)"
            ]
          },
          {
            "key": "sorting_comparison",
            "name": "Comparing Sorting Algorithms",
            "short_description": "Analyzing and comparing the efficiency of different sorting algorithms.",
            "example_tasks": [
              "Compare the time different sorting algorithms take to sort the same data",
              "Identify best-case, average-case, and worst-case scenarios for different sorting algorithms",
              "Research and use built-in sorting functions (.sort(), sorted()) and compare to manual implementations"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "debugging_testing",
    "name": "Debugging and Testing",
    "short_description": "Students learn to identify and fix errors in code, use debugging strategies and tools, write test cases, and develop systematic problem-solving approaches.",
    "sub_topics": [
      {
        "key": "types_of_errors",
        "name": "Types of Programming Errors",
        "short_description": "Understanding syntax errors, runtime errors, and logic errors and how to identify each type.",
        "sub_topics": [
          {
            "key": "syntax_errors",
            "name": "Syntax Errors",
            "short_description": "Identifying and fixing errors in code structure and grammar that prevent programs from running.",
            "example_tasks": [
              "Identify common syntax errors like missing colons, unmatched parentheses, incorrect indentation, and misspelled keywords",
              "Read error messages to understand what's wrong and where the error occurs (line numbers)",
              "Practice fixing syntax errors in broken code samples by carefully checking code structure"
            ]
          },
          {
            "key": "runtime_errors",
            "name": "Runtime Errors",
            "short_description": "Understanding errors that occur during program execution like division by zero or type errors.",
            "example_tasks": [
              "Identify runtime errors such as ZeroDivisionError, TypeError, NameError, and IndexError",
              "Add error handling using try-except blocks to catch and handle runtime errors gracefully",
              "Debug programs that crash during execution by examining the error traceback and identifying the problematic line"
            ]
          },
          {
            "key": "logic_errors",
            "name": "Logic Errors",
            "short_description": "Finding errors where code runs without crashing but produces incorrect results.",
            "example_tasks": [
              "Identify logic errors by comparing actual program output to expected output and finding discrepancies",
              "Trace through code step-by-step to find where logic deviates from the intended algorithm",
              "Fix off-by-one errors, incorrect conditionals, and wrong formulas that cause incorrect behavior"
            ]
          }
        ]
      },
      {
        "key": "debugging_strategies",
        "name": "Debugging Strategies and Techniques",
        "short_description": "Applying systematic approaches to find and fix bugs in programs.",
        "sub_topics": [
          {
            "key": "print_debugging",
            "name": "Print Statement Debugging",
            "short_description": "Using print statements to display variable values and track program flow.",
            "example_tasks": [
              "Add print statements at key points in code to display variable values and verify they contain expected data",
              "Trace program execution by printing messages showing which parts of code are executing",
              "Use print statements to narrow down where errors occur by printing before and after suspicious code sections"
            ]
          },
          {
            "key": "debugger_tools",
            "name": "Using Debugger Tools",
            "short_description": "Using IDE debuggers to set breakpoints, step through code, and inspect variables.",
            "example_tasks": [
              "Set breakpoints in code to pause execution at specific lines and examine program state",
              "Step through code line-by-line using step over, step into, and step out controls",
              "Watch variables and expressions to see how values change during program execution"
            ]
          },
          {
            "key": "rubber_duck_debugging",
            "name": "Explaining Code and Rubber Duck Debugging",
            "short_description": "Finding bugs by explaining code aloud or to others.",
            "example_tasks": [
              "Practice rubber duck debugging by explaining code line-by-line to find errors through explanation",
              "Work in pairs doing code reviews where one person explains their code to another",
              "Document what code is supposed to do versus what it actually does to identify logic errors"
            ]
          },
          {
            "key": "systematic_debugging",
            "name": "Systematic Debugging Process",
            "short_description": "Following a methodical approach to isolate and fix bugs.",
            "example_tasks": [
              "Apply the debugging process: reproduce the bug, isolate the problem, identify the cause, fix it, and test the fix",
              "Use binary search debugging by testing sections of code to narrow down where bugs occur",
              "Document bugs including symptoms, reproduction steps, cause identified, and solution applied"
            ]
          }
        ]
      },
      {
        "key": "testing_strategies",
        "name": "Testing and Test Cases",
        "short_description": "Writing and running test cases to verify that programs work correctly.",
        "sub_topics": [
          {
            "key": "test_case_design",
            "name": "Designing Test Cases",
            "short_description": "Creating comprehensive tests that cover different scenarios and edge cases.",
            "example_tasks": [
              "Design test cases for programs including normal inputs, edge cases (empty, maximum, minimum), and invalid inputs",
              "Create a test plan listing inputs to try and expected outputs for each",
              "Test boundary conditions like the first and last elements of lists or maximum/minimum values"
            ]
          },
          {
            "key": "manual_testing",
            "name": "Manual Testing",
            "short_description": "Testing programs manually by running them with different inputs and verifying outputs.",
            "example_tasks": [
              "Manually test programs with a variety of inputs recording actual versus expected results",
              "Create test logs documenting which tests passed, which failed, and what errors occurred",
              "Perform regression testing to ensure that fixing one bug didn't create new bugs elsewhere"
            ]
          },
          {
            "key": "automated_testing",
            "name": "Introduction to Automated Testing",
            "short_description": "Writing simple automated tests that check if functions return expected values.",
            "example_tasks": [
              "Write assertions that check if function outputs match expected values like assert add(2, 3) == 5",
              "Create test functions that call program functions with various inputs and report pass/fail",
              "Understand the benefits of automated tests that can be run repeatedly as code changes"
            ]
          }
        ]
      },
      {
        "key": "code_review_improvement",
        "name": "Code Review and Improvement",
        "short_description": "Reviewing code for errors, readability, and efficiency, and making improvements.",
        "sub_topics": [
          {
            "key": "peer_code_review",
            "name": "Peer Code Review",
            "short_description": "Reviewing others' code and having others review yours to find bugs and improve quality.",
            "example_tasks": [
              "Review a peer's code checking for errors, unclear variable names, missing comments, and logic issues",
              "Provide constructive feedback focusing on specific improvements rather than general criticism",
              "Accept feedback on your own code and make revisions based on peer suggestions"
            ]
          },
          {
            "key": "code_readability",
            "name": "Code Readability and Style",
            "short_description": "Writing code that is easy to read and understand using clear naming and formatting.",
            "example_tasks": [
              "Refactor code to use descriptive variable and function names that explain their purpose",
              "Add comments explaining complex sections but avoid over-commenting obvious code",
              "Follow consistent indentation, spacing, and naming conventions throughout programs"
            ]
          },
          {
            "key": "refactoring",
            "name": "Code Refactoring",
            "short_description": "Improving code structure and efficiency without changing functionality.",
            "example_tasks": [
              "Identify and eliminate repeated code by creating functions for common operations",
              "Simplify complex conditionals using logical operators or reorganizing logic",
              "Optimize code by removing unnecessary operations, using better algorithms, or simplifying logic"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "problem_solving_code",
    "name": "Problem Solving with Code",
    "short_description": "Students apply computational thinking and programming skills to solve real-world problems through decomposition, planning, implementation, and iteration.",
    "sub_topics": [
      {
        "key": "problem_analysis",
        "name": "Problem Analysis and Planning",
        "short_description": "Understanding problems thoroughly and planning solutions before coding.",
        "sub_topics": [
          {
            "key": "understanding_requirements",
            "name": "Understanding Problem Requirements",
            "short_description": "Identifying what a program needs to do including inputs, outputs, and constraints.",
            "example_tasks": [
              "Read problem descriptions carefully and list what inputs the program needs and what outputs it should produce",
              "Identify constraints and requirements like data validation rules, performance needs, or user interface elements",
              "Ask clarifying questions to fully understand ambiguous or incomplete problem specifications"
            ]
          },
          {
            "key": "solution_planning",
            "name": "Planning Solutions",
            "short_description": "Creating plans and designs before writing code.",
            "example_tasks": [
              "Write pseudocode or create flowcharts to plan the algorithm before implementing in a programming language",
              "Break complex problems into smaller sub-problems and plan how to solve each part",
              "Sketch user interfaces or program flows to visualize how the program will work"
            ]
          },
          {
            "key": "algorithm_selection",
            "name": "Selecting Appropriate Algorithms",
            "short_description": "Choosing the right approach or algorithm for specific problems.",
            "example_tasks": [
              "Evaluate different possible algorithms for a problem and choose based on efficiency and simplicity",
              "Recognize common problem patterns like searching, sorting, counting, or accumulating and apply standard approaches",
              "Compare trade-offs between different solutions considering time, memory, and code complexity"
            ]
          }
        ]
      },
      {
        "key": "incremental_development",
        "name": "Incremental Development",
        "short_description": "Building programs piece by piece, testing each part before adding more functionality.",
        "sub_topics": [
          {
            "key": "starting_simple",
            "name": "Starting with Simple Cases",
            "short_description": "Beginning with basic functionality and building up to full features.",
            "example_tasks": [
              "Create a minimal working version of a program that handles the simplest case before adding complexity",
              "Test basic functionality before adding error handling, validation, or advanced features",
              "Build programs iteratively adding one feature at a time rather than trying to write everything at once"
            ]
          },
          {
            "key": "testing_as_you_go",
            "name": "Testing During Development",
            "short_description": "Testing each component as it's built to catch errors early.",
            "example_tasks": [
              "Test each function or section of code immediately after writing it to verify correctness",
              "Run programs frequently during development to catch bugs as soon as they're introduced",
              "Use test inputs at each stage to verify that new code works correctly before proceeding"
            ]
          },
          {
            "key": "iteration_refinement",
            "name": "Iteration and Refinement",
            "short_description": "Improving programs through multiple rounds of development and testing.",
            "example_tasks": [
              "Create an initial working version then iteratively add features, fix bugs, and improve efficiency",
              "Gather feedback from users or testers and incorporate improvements in subsequent versions",
              "Refactor code as programs grow to keep them maintainable and understandable"
            ]
          }
        ]
      },
      {
        "key": "project_examples",
        "name": "Programming Project Applications",
        "short_description": "Applying problem-solving skills to complete projects that integrate multiple concepts.",
        "sub_topics": [
          {
            "key": "games_simulations",
            "name": "Games and Simulations",
            "short_description": "Creating interactive games and simulations using programming concepts.",
            "example_tasks": [
              "Build a number guessing game with hints, score tracking, and limited attempts using loops and conditionals",
              "Create a text-based adventure game with multiple rooms, items, and choices using data structures and functions",
              "Develop a simulation like population growth, ecosystem dynamics, or economic models using algorithms and data analysis"
            ]
          },
          {
            "key": "data_processing",
            "name": "Data Processing and Analysis",
            "short_description": "Processing and analyzing data from files or user input to extract insights.",
            "example_tasks": [
              "Read data from files, process it (calculate averages, find patterns, filter results), and output summaries",
              "Create programs that analyze text to count words, find most common terms, or check reading level",
              "Process student grade data to calculate averages, identify high/low performers, and generate reports"
            ]
          },
          {
            "key": "utilities_tools",
            "name": "Utilities and Tools",
            "short_description": "Creating practical programs that perform useful tasks or automate work.",
            "example_tasks": [
              "Build a password strength checker that analyzes passwords and provides feedback on security",
              "Create a unit converter that converts between different measurement systems with user-friendly interface",
              "Develop a calculator with advanced features like memory, history, and multiple operations"
            ]
          },
          {
            "key": "creative_applications",
            "name": "Creative Applications",
            "short_description": "Using programming for artistic and creative expression.",
            "example_tasks": [
              "Generate ASCII art or text-based images using loops and character patterns",
              "Create programs that generate random stories, poems, or creative text using templates and word lists",
              "Build music or rhythm programs that play sequences, respond to input, or generate compositions"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "html_fundamentals",
    "name": "HTML Fundamentals",
    "short_description": "Students learn to create web page structure using HTML elements, tags, attributes, and semantic markup to build well-organized, accessible websites.",
    "sub_topics": [
      {
        "key": "html_basics",
        "name": "HTML Basics and Document Structure",
        "short_description": "Understanding HTML purpose, document structure, and basic syntax for creating web pages.",
        "sub_topics": [
          {
            "key": "what_is_html",
            "name": "Introduction to HTML",
            "short_description": "Understanding what HTML is, its role in web development, and how browsers interpret it.",
            "example_tasks": [
              "Explain what HTML stands for (HyperText Markup Language) and its purpose in creating web page structure",
              "View the HTML source code of websites using browser developer tools to see how pages are constructed",
              "Compare HTML (structure), CSS (style), and JavaScript (behavior) to understand the role of each in web development"
            ]
          },
          {
            "key": "html_document_structure",
            "name": "HTML Document Structure",
            "short_description": "Creating valid HTML documents with proper structure including DOCTYPE, html, head, and body tags.",
            "example_tasks": [
              "Create a basic HTML document with required elements: <!DOCTYPE html>, <html>, <head>, <title>, and <body>",
              "Understand the purpose of each structural element: DOCTYPE declares version, head contains metadata, body contains visible content",
              "Validate HTML documents using W3C validator to ensure proper structure and fix any errors"
            ]
          },
          {
            "key": "html_syntax",
            "name": "HTML Syntax and Tags",
            "short_description": "Understanding tag structure, opening/closing tags, self-closing tags, and nesting.",
            "example_tasks": [
              "Write HTML elements with proper syntax including opening tags <p>, closing tags </p>, and self-closing tags <br/>",
              "Practice proper nesting of elements ensuring tags are closed in reverse order of opening",
              "Identify and fix common HTML syntax errors like unclosed tags, improper nesting, or missing required attributes"
            ]
          },
          {
            "key": "html_comments",
            "name": "HTML Comments",
            "short_description": "Adding comments to HTML documents to explain code without affecting display.",
            "example_tasks": [
              "Add HTML comments using <!-- comment text --> to document code sections or leave notes",
              "Use comments to temporarily disable sections of HTML during development or testing",
              "Practice adding meaningful comments that explain complex structures or leave reminders for future edits"
            ]
          }
        ]
      },
      {
        "key": "text_content",
        "name": "Text Content and Formatting",
        "short_description": "Using HTML elements to structure and format text including headings, paragraphs, lists, and emphasis.",
        "sub_topics": [
          {
            "key": "headings_paragraphs",
            "name": "Headings and Paragraphs",
            "short_description": "Creating document hierarchy with heading levels and organizing text into paragraphs.",
            "example_tasks": [
              "Use heading tags <h1> through <h6> to create document hierarchy with h1 as the main title and h2-h6 as subheadings",
              "Organize text content using <p> paragraph tags, understanding that paragraphs create vertical spacing automatically",
              "Create a properly structured article with a main heading, subheadings, and multiple paragraphs of content"
            ]
          },
          {
            "key": "text_formatting",
            "name": "Text Formatting Elements",
            "short_description": "Applying emphasis, importance, and other formatting to text within content.",
            "example_tasks": [
              "Use <strong> for important text (bold) and <em> for emphasized text (italic) with semantic meaning",
              "Apply additional formatting tags like <mark> for highlighting, <small> for fine print, <sub> and <sup> for subscript/superscript",
              "Understand the difference between semantic tags (strong, em) and presentational tags (b, i) and prefer semantic markup"
            ]
          },
          {
            "key": "lists",
            "name": "Ordered and Unordered Lists",
            "short_description": "Creating lists using ul, ol, and li elements for organizing related items.",
            "example_tasks": [
              "Create unordered lists using <ul> and <li> tags for bullet-point lists of items without specific order",
              "Create ordered lists using <ol> and <li> tags for numbered lists showing sequential steps or ranked items",
              "Create nested lists by placing ul or ol elements inside li elements for sub-lists and hierarchical information"
            ]
          },
          {
            "key": "special_text",
            "name": "Special Text Elements",
            "short_description": "Using elements for quotations, code, and other special text types.",
            "example_tasks": [
              "Display inline code using <code> tags and code blocks using <pre> and <code> together to preserve formatting",
              "Add quotations using <blockquote> for long quotes and <q> for short inline quotes with proper attribution",
              "Use <abbr> with title attribute for abbreviations and <time> for dates and times with semantic meaning"
            ]
          }
        ]
      },
      {
        "key": "links_navigation",
        "name": "Links and Navigation",
        "short_description": "Creating hyperlinks to connect pages and resources, building navigation systems.",
        "sub_topics": [
          {
            "key": "creating_links",
            "name": "Creating Hyperlinks",
            "short_description": "Using anchor tags to create links to other pages, websites, and resources.",
            "example_tasks": [
              "Create links using <a href='url'>link text</a> to connect to other web pages or external websites",
              "Understand absolute URLs (https://example.com) versus relative URLs (about.html or ../page.html)",
              "Add title attributes to links for additional information shown on hover"
            ]
          },
          {
            "key": "link_targets",
            "name": "Link Targets and Types",
            "short_description": "Controlling how links open and creating different types of links.",
            "example_tasks": [
              "Use target='_blank' to open links in new tabs or windows, and understand accessibility considerations",
              "Create email links using mailto: protocol like <a href='mailto:email@example.com'>",
              "Create anchor links that jump to specific sections within the same page using id attributes"
            ]
          },
          {
            "key": "navigation_menus",
            "name": "Navigation Menus",
            "short_description": "Building navigation systems using lists and links within nav elements.",
            "example_tasks": [
              "Create a navigation menu using <nav> element containing a <ul> list of links to site pages",
              "Build a multi-level navigation menu with sub-menus using nested lists",
              "Indicate the current page in navigation by adding classes or aria-current attributes for accessibility"
            ]
          }
        ]
      },
      {
        "key": "images_media",
        "name": "Images and Media",
        "short_description": "Embedding images, audio, video, and other media content in web pages.",
        "sub_topics": [
          {
            "key": "images",
            "name": "Adding Images",
            "short_description": "Embedding images using img tags with proper attributes for accessibility.",
            "example_tasks": [
              "Add images using <img src='path' alt='description'> with descriptive alt text for accessibility",
              "Control image display using width and height attributes to prevent layout shifts while images load",
              "Understand image file formats (JPEG for photos, PNG for graphics with transparency, GIF for animations) and choose appropriately"
            ]
          },
          {
            "key": "figures_captions",
            "name": "Figures and Captions",
            "short_description": "Grouping images with captions using semantic HTML elements.",
            "example_tasks": [
              "Use <figure> and <figcaption> elements to associate images with their captions semantically",
              "Create photo galleries using multiple figure elements with descriptive captions",
              "Understand when to use figure elements versus plain img tags based on whether captions are needed"
            ]
          },
          {
            "key": "audio_video",
            "name": "Audio and Video Elements",
            "short_description": "Embedding audio and video content using HTML5 media elements.",
            "example_tasks": [
              "Add video using <video src='file.mp4' controls> with controls for play, pause, and volume",
              "Embed audio using <audio src='file.mp3' controls> for music or sound files",
              "Add multiple source elements with different formats for browser compatibility and include text fallback"
            ]
          },
          {
            "key": "iframes",
            "name": "Embedding External Content",
            "short_description": "Using iframes to embed external content like videos, maps, and other websites.",
            "example_tasks": [
              "Embed YouTube videos by copying the iframe embed code from YouTube and pasting into HTML",
              "Embed Google Maps using iframe embed code to show locations on web pages",
              "Understand security implications of iframes and when they are appropriate to use"
            ]
          }
        ]
      },
      {
        "key": "tables",
        "name": "HTML Tables",
        "short_description": "Creating tables to display tabular data with proper structure and accessibility.",
        "sub_topics": [
          {
            "key": "basic_tables",
            "name": "Basic Table Structure",
            "short_description": "Creating tables using table, tr, th, and td elements.",
            "example_tasks": [
              "Create basic tables using <table>, <tr> for rows, <th> for headers, and <td> for data cells",
              "Build a schedule, grade sheet, or comparison table organizing information in rows and columns",
              "Add borders and spacing to tables to make data more readable"
            ]
          },
          {
            "key": "table_structure",
            "name": "Table Sections and Structure",
            "short_description": "Organizing tables using thead, tbody, and tfoot for better structure.",
            "example_tasks": [
              "Divide tables into sections using <thead> for headers, <tbody> for main content, and <tfoot> for totals or summaries",
              "Create complex tables with column spans using colspan and row spans using rowspan attributes",
              "Add captions to tables using <caption> element to describe table purpose"
            ]
          },
          {
            "key": "table_accessibility",
            "name": "Table Accessibility",
            "short_description": "Making tables accessible using scope attributes and proper headers.",
            "example_tasks": [
              "Add scope='col' to column headers and scope='row' to row headers for screen reader accessibility",
              "Create tables that work well on mobile devices by considering responsive design",
              "Understand when tables are appropriate (tabular data) versus when CSS layout is better (page structure)"
            ]
          }
        ]
      },
      {
        "key": "forms_input",
        "name": "Forms and User Input",
        "short_description": "Creating forms to collect user input with various input types and proper structure.",
        "sub_topics": [
          {
            "key": "basic_forms",
            "name": "Basic Form Structure",
            "short_description": "Creating forms with form elements, labels, and basic input fields.",
            "example_tasks": [
              "Create forms using <form> element with action (where to send data) and method (GET or POST) attributes",
              "Add text inputs using <input type='text'> and associate them with <label> elements for accessibility",
              "Include submit buttons using <input type='submit'> or <button> to allow users to send form data"
            ]
          },
          {
            "key": "input_types",
            "name": "Input Types and Controls",
            "short_description": "Using different input types for various data including text, email, numbers, dates, and more.",
            "example_tasks": [
              "Use specialized input types: email, password, number, date, tel, url to get appropriate keyboards on mobile devices",
              "Add radio buttons for single-choice selections and checkboxes for multiple-choice selections",
              "Create dropdown menus using <select> and <option> elements for choosing from predefined options"
            ]
          },
          {
            "key": "text_areas",
            "name": "Text Areas and Large Input",
            "short_description": "Using textarea elements for multi-line text input.",
            "example_tasks": [
              "Add <textarea> elements for comments, messages, or other multi-line text input",
              "Control textarea size using rows and cols attributes or CSS",
              "Make textareas user-friendly by allowing resizing and providing character count if needed"
            ]
          },
          {
            "key": "form_validation",
            "name": "HTML Form Validation",
            "short_description": "Using HTML5 validation attributes to ensure proper data entry.",
            "example_tasks": [
              "Add required attribute to make fields mandatory before form submission",
              "Use pattern attribute with regular expressions to validate input formats like phone numbers or postal codes",
              "Set min, max, and maxlength attributes to control numeric ranges and text length"
            ]
          }
        ]
      },
      {
        "key": "semantic_html",
        "name": "Semantic HTML and Page Structure",
        "short_description": "Using semantic elements to create meaningful, accessible, and SEO-friendly page structures.",
        "sub_topics": [
          {
            "key": "semantic_elements",
            "name": "Semantic Structure Elements",
            "short_description": "Using header, nav, main, article, section, aside, and footer for page organization.",
            "example_tasks": [
              "Structure pages using semantic elements: <header> for site header, <nav> for navigation, <main> for main content",
              "Use <article> for self-contained content and <section> for thematic grouping within articles or pages",
              "Add <aside> for sidebars or supplementary content and <footer> for page footer information"
            ]
          },
          {
            "key": "document_outline",
            "name": "Creating Document Outlines",
            "short_description": "Building logical document hierarchies using semantic elements and headings.",
            "example_tasks": [
              "Create a complete page structure with header, navigation, main content area, sidebar, and footer using semantic HTML",
              "Build a blog post or article using article, section, and appropriate heading levels for clear hierarchy",
              "Validate document outlines to ensure logical structure that helps screen readers and search engines"
            ]
          },
          {
            "key": "accessibility_attributes",
            "name": "Accessibility Attributes",
            "short_description": "Adding ARIA attributes and other accessibility features to improve usability.",
            "example_tasks": [
              "Add alt text to all images with meaningful descriptions, leaving alt='' for decorative images",
              "Use aria-label and aria-describedby attributes to provide additional context for screen readers",
              "Ensure proper heading hierarchy, landmark regions, and keyboard navigation for accessibility"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "css_styling_layout",
    "name": "CSS Styling and Layout",
    "short_description": "Students learn to style web pages using CSS selectors, properties, colors, fonts, spacing, and layout techniques including flexbox and responsive design.",
    "sub_topics": [
      {
        "key": "css_basics",
        "name": "CSS Basics and Syntax",
        "short_description": "Understanding CSS purpose, syntax, and methods for applying styles to HTML elements.",
        "sub_topics": [
          {
            "key": "what_is_css",
            "name": "Introduction to CSS",
            "short_description": "Understanding CSS purpose and how it separates presentation from content.",
            "example_tasks": [
              "Explain what CSS stands for (Cascading Style Sheets) and its role in controlling web page appearance",
              "View websites with CSS disabled to understand the separation between HTML structure and CSS presentation",
              "Understand the cascade concept where later styles override earlier ones and specificity determines which rules apply"
            ]
          },
          {
            "key": "css_syntax",
            "name": "CSS Syntax and Rules",
            "short_description": "Writing CSS rules with selectors, properties, and values.",
            "example_tasks": [
              "Write CSS rules following the syntax: selector { property: value; } with proper punctuation",
              "Create multiple declarations within a single rule using semicolons to separate property-value pairs",
              "Use browser developer tools to inspect elements and see which CSS rules are applied"
            ]
          },
          {
            "key": "applying_css",
            "name": "Methods of Applying CSS",
            "short_description": "Adding CSS to HTML using inline, internal, and external stylesheets.",
            "example_tasks": [
              "Apply inline styles using style attributes directly on HTML elements (not recommended for production)",
              "Create internal stylesheets using <style> tags in the HTML head section",
              "Link external CSS files using <link rel='stylesheet' href='styles.css'> in the HTML head (best practice)"
            ]
          }
        ]
      },
      {
        "key": "css_selectors",
        "name": "CSS Selectors",
        "short_description": "Targeting HTML elements using various selector types including element, class, ID, and advanced selectors.",
        "sub_topics": [
          {
            "key": "basic_selectors",
            "name": "Basic Selectors",
            "short_description": "Using element, class, and ID selectors to target HTML elements.",
            "example_tasks": [
              "Use element selectors to style all elements of a type like p { color: blue; } for all paragraphs",
              "Create class selectors with .classname to style groups of elements with shared styling",
              "Use ID selectors with #idname to style unique elements, understanding that IDs should be unique per page"
            ]
          },
          {
            "key": "combinators",
            "name": "Combinators and Relationships",
            "short_description": "Selecting elements based on their relationships to other elements.",
            "example_tasks": [
              "Use descendant selectors (div p) to select elements inside other elements regardless of depth",
              "Apply child selectors (div > p) to select direct children only",
              "Use adjacent sibling (+) and general sibling (~) selectors to target elements based on their position"
            ]
          },
          {
            "key": "pseudo_classes",
            "name": "Pseudo-classes",
            "short_description": "Styling elements based on their state or position using pseudo-classes.",
            "example_tasks": [
              "Style link states using :hover, :active, :visited, and :focus pseudo-classes",
              "Use structural pseudo-classes like :first-child, :last-child, :nth-child() to target specific elements",
              "Apply :not() pseudo-class to exclude elements from selection"
            ]
          },
          {
            "key": "attribute_selectors",
            "name": "Attribute Selectors",
            "short_description": "Selecting elements based on their attributes and attribute values.",
            "example_tasks": [
              "Select elements with specific attributes like [type='text'] to style all text inputs",
              "Use attribute selectors with partial matching like [href^='https'] for external links",
              "Combine attribute selectors with other selectors for precise targeting"
            ]
          }
        ]
      },
      {
        "key": "colors_backgrounds",
        "name": "Colors and Backgrounds",
        "short_description": "Applying colors to text and backgrounds using various color formats and background properties.",
        "sub_topics": [
          {
            "key": "color_formats",
            "name": "Color Formats and Values",
            "short_description": "Using different color formats including named colors, hex, RGB, and RGBA.",
            "example_tasks": [
              "Apply colors using color names (red, blue), hex codes (#FF0000), and RGB values rgb(255, 0, 0)",
              "Use RGBA and HSLA for colors with transparency by adding alpha channel values",
              "Create color schemes using online tools and apply consistent colors throughout websites"
            ]
          },
          {
            "key": "text_color",
            "name": "Text Color and Styling",
            "short_description": "Changing text colors and ensuring readable contrast.",
            "example_tasks": [
              "Set text color using the color property and ensure sufficient contrast with background for readability",
              "Apply different colors to links in various states (normal, hover, visited) for clear user feedback",
              "Test color contrast using accessibility tools to meet WCAG standards for text visibility"
            ]
          },
          {
            "key": "backgrounds",
            "name": "Background Colors and Images",
            "short_description": "Setting background colors and images with control over positioning and repetition.",
            "example_tasks": [
              "Set background colors using background-color property for elements and page backgrounds",
              "Add background images using background-image: url() and control repetition with background-repeat",
              "Control background image positioning using background-position and sizing with background-size (cover, contain)"
            ]
          }
        ]
      },
      {
        "key": "typography",
        "name": "Typography and Text Styling",
        "short_description": "Styling text using fonts, sizes, spacing, alignment, and text effects.",
        "sub_topics": [
          {
            "key": "fonts",
            "name": "Font Families and Web Fonts",
            "short_description": "Choosing and applying fonts including web-safe fonts and custom web fonts.",
            "example_tasks": [
              "Apply font families using font-family property with fallback fonts like 'Arial, Helvetica, sans-serif'",
              "Import Google Fonts or other web fonts using @import or <link> tags and apply them to text",
              "Understand web-safe fonts versus custom fonts and when to use each"
            ]
          },
          {
            "key": "text_properties",
            "name": "Text Size, Weight, and Style",
            "short_description": "Controlling text size, weight, style, and transformation.",
            "example_tasks": [
              "Set text size using font-size with units like px, em, rem, or percentages",
              "Control font weight using font-weight (normal, bold, 100-900) and style using font-style (italic, oblique)",
              "Transform text using text-transform (uppercase, lowercase, capitalize) for consistent styling"
            ]
          },
          {
            "key": "text_spacing",
            "name": "Text Spacing and Alignment",
            "short_description": "Adjusting line height, letter spacing, word spacing, and text alignment.",
            "example_tasks": [
              "Improve readability using line-height to adjust spacing between lines of text",
              "Set text alignment using text-align (left, right, center, justify) for different layouts",
              "Fine-tune typography using letter-spacing and word-spacing for professional appearance"
            ]
          },
          {
            "key": "text_decoration",
            "name": "Text Decoration and Effects",
            "short_description": "Adding underlines, shadows, and other text effects.",
            "example_tasks": [
              "Add or remove underlines using text-decoration property (underline, none, line-through)",
              "Create text shadows using text-shadow for depth and visual interest",
              "Style text with effects while maintaining readability and accessibility"
            ]
          }
        ]
      },
      {
        "key": "box_model",
        "name": "CSS Box Model",
        "short_description": "Understanding how elements are sized using content, padding, border, and margin.",
        "sub_topics": [
          {
            "key": "box_model_concept",
            "name": "Understanding the Box Model",
            "short_description": "Learning how content, padding, border, and margin combine to size elements.",
            "example_tasks": [
              "Visualize the box model using browser developer tools to see content, padding, border, and margin layers",
              "Calculate total element size by adding width + padding + border + margin",
              "Understand box-sizing property and difference between content-box (default) and border-box"
            ]
          },
          {
            "key": "width_height",
            "name": "Width and Height",
            "short_description": "Setting element dimensions using width and height properties.",
            "example_tasks": [
              "Set element dimensions using width and height properties with various units (px, %, em, vw, vh)",
              "Use min-width, max-width, min-height, max-height for responsive sizing constraints",
              "Control how content behaves when it exceeds element size using overflow property"
            ]
          },
          {
            "key": "padding",
            "name": "Padding",
            "short_description": "Adding space between content and border using padding properties.",
            "example_tasks": [
              "Add padding inside elements using padding property (all sides) or padding-top, padding-right, padding-bottom, padding-left",
              "Use shorthand padding: 10px 20px (vertical horizontal) or padding: 10px 20px 30px 40px (top right bottom left)",
              "Create comfortable spacing around text and content using appropriate padding values"
            ]
          },
          {
            "key": "borders",
            "name": "Borders",
            "short_description": "Adding borders around elements with control over width, style, and color.",
            "example_tasks": [
              "Add borders using border property combining width, style (solid, dashed, dotted), and color",
              "Style individual borders using border-top, border-right, border-bottom, border-left",
              "Create rounded corners using border-radius for modern, polished designs"
            ]
          },
          {
            "key": "margins",
            "name": "Margins",
            "short_description": "Adding space between elements using margin properties.",
            "example_tasks": [
              "Add space between elements using margin property for all sides or individual sides (margin-top, etc.)",
              "Center block elements horizontally using margin: 0 auto with specified width",
              "Understand margin collapse where vertical margins between elements combine rather than add"
            ]
          }
        ]
      },
      {
        "key": "layout_positioning",
        "name": "Layout and Positioning",
        "short_description": "Controlling element placement using display types, position properties, and layout techniques.",
        "sub_topics": [
          {
            "key": "display_property",
            "name": "Display Property",
            "short_description": "Controlling how elements are displayed using block, inline, inline-block, and none.",
            "example_tasks": [
              "Understand difference between block elements (take full width, stack vertically) and inline elements (flow with text)",
              "Use display: inline-block to create inline elements that accept width and height",
              "Hide elements using display: none (removes from layout) versus visibility: hidden (keeps space)"
            ]
          },
          {
            "key": "position_property",
            "name": "Position Property",
            "short_description": "Positioning elements using static, relative, absolute, fixed, and sticky.",
            "example_tasks": [
              "Use position: relative to offset elements from their normal position using top, right, bottom, left",
              "Create absolutely positioned elements (position: absolute) positioned relative to nearest positioned ancestor",
              "Make headers or navigation stick to viewport using position: fixed or position: sticky"
            ]
          },
          {
            "key": "float_clear",
            "name": "Float and Clear",
            "short_description": "Floating elements and clearing floats for text wrapping and basic layouts.",
            "example_tasks": [
              "Float images left or right to wrap text around them using float: left or float: right",
              "Clear floats using clear: both to prevent elements from wrapping around floated elements",
              "Understand clearfix techniques to contain floated elements within parent containers"
            ]
          }
        ]
      },
      {
        "key": "flexbox",
        "name": "Flexbox Layout",
        "short_description": "Creating flexible, responsive layouts using CSS Flexbox for distributing space and aligning items.",
        "sub_topics": [
          {
            "key": "flex_containers",
            "name": "Flex Containers and Direction",
            "short_description": "Creating flex containers and controlling layout direction.",
            "example_tasks": [
              "Create flex containers using display: flex to enable flexbox layout for child elements",
              "Control layout direction using flex-direction: row (horizontal) or column (vertical)",
              "Understand how flex containers affect only direct children, not all descendants"
            ]
          },
          {
            "key": "flex_alignment",
            "name": "Flexbox Alignment",
            "short_description": "Aligning and distributing flex items using justify-content and align-items.",
            "example_tasks": [
              "Distribute space along main axis using justify-content: flex-start, center, flex-end, space-between, space-around",
              "Align items along cross axis using align-items: flex-start, center, flex-end, stretch",
              "Create centered layouts both horizontally and vertically using flexbox alignment properties"
            ]
          },
          {
            "key": "flex_items",
            "name": "Flex Items and Growth",
            "short_description": "Controlling individual flex item sizing using flex-grow, flex-shrink, and flex-basis.",
            "example_tasks": [
              "Use flex-grow to make items grow and fill available space proportionally",
              "Control item shrinking using flex-shrink when container is too small",
              "Set initial sizes using flex-basis before growing or shrinking occurs"
            ]
          },
          {
            "key": "flex_layouts",
            "name": "Creating Flex Layouts",
            "short_description": "Building common layouts using flexbox including navigation, cards, and page structures.",
            "example_tasks": [
              "Create horizontal navigation menus using flexbox with evenly spaced links",
              "Build card layouts with equal-height cards using flexbox alignment and flex properties",
              "Design responsive page layouts with header, main content, sidebar, and footer using flexbox"
            ]
          }
        ]
      },
      {
        "key": "responsive_design",
        "name": "Responsive Design",
        "short_description": "Creating websites that adapt to different screen sizes using media queries and flexible layouts.",
        "sub_topics": [
          {
            "key": "viewport_units",
            "name": "Viewport and Relative Units",
            "short_description": "Using responsive units like percentages, em, rem, and viewport units.",
            "example_tasks": [
              "Use relative units like percentages, em, and rem instead of fixed pixels for flexible sizing",
              "Apply viewport units (vw, vh) to size elements relative to browser window size",
              "Add viewport meta tag <meta name='viewport' content='width=device-width, initial-scale=1'> for proper mobile display"
            ]
          },
          {
            "key": "media_queries",
            "name": "Media Queries",
            "short_description": "Applying different styles based on screen size, orientation, or device features.",
            "example_tasks": [
              "Create media queries using @media (max-width: 768px) to apply styles for screens below specified width",
              "Design mobile-first by starting with mobile styles and using min-width media queries for larger screens",
              "Add breakpoints for common device sizes (mobile, tablet, desktop) to optimize layouts"
            ]
          },
          {
            "key": "flexible_images",
            "name": "Responsive Images and Media",
            "short_description": "Making images and media adapt to container sizes.",
            "example_tasks": [
              "Make images responsive using max-width: 100% and height: auto to scale within containers",
              "Use CSS to control video and iframe sizing to prevent overflow on small screens",
              "Implement responsive images that load different sizes based on device using srcset attribute"
            ]
          },
          {
            "key": "responsive_layouts",
            "name": "Responsive Layout Patterns",
            "short_description": "Creating layouts that reorganize for different screen sizes.",
            "example_tasks": [
              "Create layouts that stack vertically on mobile and display side-by-side on desktop using flexbox and media queries",
              "Build navigation that changes from horizontal desktop menu to hamburger menu on mobile",
              "Design card grids that adjust column count based on available space"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "web_development_projects",
    "name": "Web Development Projects",
    "short_description": "Students integrate HTML, CSS, and JavaScript skills to build complete, functional websites including personal portfolios, interactive pages, and multi-page sites.",
    "sub_topics": [
      {
        "key": "project_planning",
        "name": "Web Project Planning",
        "short_description": "Planning website structure, content, and design before development.",
        "sub_topics": [
          {
            "key": "site_planning",
            "name": "Site Structure and Navigation",
            "short_description": "Planning page hierarchy, navigation structure, and information architecture.",
            "example_tasks": [
              "Create a site map showing all pages and how they connect through navigation",
              "Plan content organization deciding what information goes on which pages",
              "Design navigation structure ensuring users can easily find any page within 3 clicks"
            ]
          },
          {
            "key": "wireframing",
            "name": "Wireframing and Mockups",
            "short_description": "Sketching layouts and designs before coding.",
            "example_tasks": [
              "Create wireframes sketching page layouts showing placement of header, navigation, content, sidebar, and footer",
              "Design mockups with more detail including colors, fonts, and spacing decisions",
              "Plan responsive layouts showing how designs adapt to mobile, tablet, and desktop screens"
            ]
          },
          {
            "key": "content_strategy",
            "name": "Content Planning",
            "short_description": "Planning and gathering content including text, images, and media.",
            "example_tasks": [
              "Write content for website pages ensuring clear, concise, and appropriate language for audience",
              "Gather or create images, ensuring proper licensing and optimization for web use",
              "Plan multimedia content like videos or audio and how they integrate into pages"
            ]
          }
        ]
      },
      {
        "key": "personal_portfolio",
        "name": "Personal Portfolio Websites",
        "short_description": "Building portfolio websites showcasing skills, projects, and information.",
        "sub_topics": [
          {
            "key": "portfolio_structure",
            "name": "Portfolio Structure and Content",
            "short_description": "Organizing portfolio pages including about, projects, and contact sections.",
            "example_tasks": [
              "Create an about page with bio, skills, interests, and photo",
              "Build a projects page showcasing coding projects, designs, or other work with descriptions and screenshots",
              "Add a contact page with contact form or contact information and social media links"
            ]
          },
          {
            "key": "portfolio_design",
            "name": "Portfolio Design and Branding",
            "short_description": "Designing visually appealing portfolios with consistent branding.",
            "example_tasks": [
              "Choose color scheme and typography that reflects personal brand or style",
              "Design a header with name/logo and consistent navigation across all pages",
              "Create a cohesive visual identity using consistent spacing, colors, and design elements throughout site"
            ]
          },
          {
            "key": "project_showcase",
            "name": "Showcasing Projects Effectively",
            "short_description": "Presenting projects with descriptions, images, and links.",
            "example_tasks": [
              "Create project cards or sections with titles, descriptions, screenshots, and links to live sites or code",
              "Add hover effects or interactions to make project showcase engaging",
              "Organize projects by category, date, or featured status for easy browsing"
            ]
          }
        ]
      },
      {
        "key": "interactive_pages",
        "name": "Interactive Web Pages",
        "short_description": "Building pages with JavaScript interactivity including forms, animations, and dynamic content.",
        "sub_topics": [
          {
            "key": "interactive_forms",
            "name": "Interactive Forms and Validation",
            "short_description": "Creating forms with JavaScript validation and user feedback.",
            "example_tasks": [
              "Build contact forms with JavaScript validation checking for required fields, email format, and message length",
              "Display error messages or success messages based on form validation results",
              "Create survey or quiz forms that calculate results and display feedback using JavaScript"
            ]
          },
          {
            "key": "dynamic_content",
            "name": "Dynamic Content Loading",
            "short_description": "Changing page content based on user interactions without page reload.",
            "example_tasks": [
              "Create tabbed interfaces where clicking tabs displays different content sections",
              "Build accordion sections that expand and collapse when clicked",
              "Design image galleries with lightbox effects showing full-size images on click"
            ]
          },
          {
            "key": "animations_effects",
            "name": "Animations and Visual Effects",
            "short_description": "Adding CSS and JavaScript animations to enhance user experience.",
            "example_tasks": [
              "Create smooth scroll effects when clicking anchor links to sections on the page",
              "Add fade-in animations to elements as they enter the viewport during scrolling",
              "Build interactive hover effects, button animations, and loading indicators"
            ]
          }
        ]
      },
      {
        "key": "multi_page_sites",
        "name": "Multi-Page Websites",
        "short_description": "Creating websites with multiple linked pages and consistent design.",
        "sub_topics": [
          {
            "key": "consistent_design",
            "name": "Maintaining Design Consistency",
            "short_description": "Using consistent styles, navigation, and structure across pages.",
            "example_tasks": [
              "Create a shared stylesheet used by all pages to ensure consistent fonts, colors, and spacing",
              "Use identical header and navigation on all pages so users always know how to move around the site",
              "Maintain consistent layout patterns and content organization across pages"
            ]
          },
          {
            "key": "file_organization",
            "name": "File and Folder Organization",
            "short_description": "Organizing website files in logical folder structures.",
            "example_tasks": [
              "Organize site files into folders like /css, /images, /js, and /pages for clean structure",
              "Use relative links correctly to connect pages, stylesheets, scripts, and images",
              "Follow naming conventions using lowercase, hyphens, and descriptive names for all files"
            ]
          },
          {
            "key": "site_navigation",
            "name": "Multi-Level Navigation",
            "short_description": "Creating navigation systems for sites with multiple sections and sub-pages.",
            "example_tasks": [
              "Build drop-down menus using HTML, CSS, and JavaScript for multi-level navigation",
              "Add breadcrumb navigation showing users their current location in site hierarchy",
              "Create footer navigation with additional links to secondary pages like privacy policy or site map"
            ]
          }
        ]
      },
      {
        "key": "publishing_deployment",
        "name": "Publishing and Deployment",
        "short_description": "Preparing websites for publication and deploying them to web servers.",
        "sub_topics": [
          {
            "key": "testing_optimization",
            "name": "Testing and Optimization",
            "short_description": "Testing websites across browsers and devices before launch.",
            "example_tasks": [
              "Test websites in different browsers (Chrome, Firefox, Safari, Edge) to ensure consistent appearance and functionality",
              "Check responsive design on various device sizes using browser developer tools",
              "Validate HTML and CSS code using W3C validators to catch errors before deployment"
            ]
          },
          {
            "key": "web_hosting",
            "name": "Web Hosting and Domains",
            "short_description": "Understanding how websites are hosted and accessed via domain names.",
            "example_tasks": [
              "Research different web hosting options including free hosting services like GitHub Pages, Netlify, or Replit",
              "Understand how domain names work and how they point to servers hosting websites",
              "Learn about file transfer protocols (FTP) for uploading website files to servers"
            ]
          },
          {
            "key": "deployment_github",
            "name": "Deploying with GitHub Pages",
            "short_description": "Publishing websites using GitHub Pages hosting service.",
            "example_tasks": [
              "Create a GitHub repository for website code and enable GitHub Pages in repository settings",
              "Upload website files to GitHub and access the live site at username.github.io/repository-name",
              "Update websites by pushing changes to GitHub and seeing updates reflected automatically"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "backend_intro",
    "name": "Introduction to Backend Development",
    "short_description": "Students gain foundational understanding of server-side programming, client-server architecture, APIs, and how frontend and backend work together.",
    "sub_topics": [
      {
        "key": "client_server_architecture",
        "name": "Client-Server Architecture",
        "short_description": "Understanding how clients request data and servers respond in web applications.",
        "sub_topics": [
          {
            "key": "frontend_backend_roles",
            "name": "Frontend vs Backend Roles",
            "short_description": "Understanding the distinction between client-side and server-side code.",
            "example_tasks": [
              "Identify which tasks happen on the frontend (user interface, user interactions) versus backend (data storage, business logic)",
              "Trace the flow of data in a web application from user action through frontend to backend and back",
              "Understand why sensitive operations like password verification must happen on the backend for security"
            ]
          },
          {
            "key": "http_requests_responses",
            "name": "HTTP Requests and Responses",
            "short_description": "Understanding how browsers communicate with servers using HTTP protocol.",
            "example_tasks": [
              "Identify different HTTP methods (GET for retrieving data, POST for sending data, PUT for updating, DELETE for removing)",
              "Examine HTTP requests and responses using browser developer tools Network tab",
              "Understand request headers, response headers, status codes (200 OK, 404 Not Found, 500 Server Error)"
            ]
          },
          {
            "key": "stateless_sessions",
            "name": "Stateless Protocol and Sessions",
            "short_description": "Understanding HTTP's stateless nature and how servers maintain user sessions.",
            "example_tasks": [
              "Explain why HTTP is stateless (each request is independent) and challenges this creates",
              "Understand how cookies store session identifiers to maintain user state across requests",
              "Learn how servers use sessions to remember user login status and shopping cart contents"
            ]
          }
        ]
      },
      {
        "key": "intro_apis",
        "name": "Introduction to APIs",
        "short_description": "Understanding Application Programming Interfaces and how applications communicate.",
        "sub_topics": [
          {
            "key": "what_are_apis",
            "name": "What are APIs",
            "short_description": "Understanding API concepts and why they're important for modern web development.",
            "example_tasks": [
              "Explain what API stands for (Application Programming Interface) and its role in allowing programs to communicate",
              "Identify examples of popular APIs like Google Maps API, Weather API, Social Media APIs and what they provide",
              "Understand the concept of API endpoints as specific URLs that provide different data or functions"
            ]
          },
          {
            "key": "rest_apis",
            "name": "REST APIs and JSON",
            "short_description": "Understanding RESTful API architecture and JSON data format.",
            "example_tasks": [
              "Learn REST principles including using HTTP methods appropriately and organizing endpoints logically",
              "Work with JSON (JavaScript Object Notation) to understand how data is structured and transmitted",
              "Parse JSON data received from APIs and extract needed information for display"
            ]
          },
          {
            "key": "using_apis",
            "name": "Consuming APIs in Frontend",
            "short_description": "Making API requests from JavaScript to retrieve and display data.",
            "example_tasks": [
              "Use fetch() or similar methods to make GET requests to public APIs and retrieve data",
              "Display API data on web pages by parsing JSON responses and creating HTML elements dynamically",
              "Handle API errors gracefully and display appropriate messages to users when requests fail"
            ]
          },
          {
            "key": "api_authentication",
            "name": "API Authentication Basics",
            "short_description": "Understanding how APIs verify identity using API keys and tokens.",
            "example_tasks": [
              "Register for API keys from public APIs and understand how to include them in requests",
              "Understand why API keys should be kept secure and not committed to public code repositories",
              "Learn basic authentication methods like API keys in headers or query parameters"
            ]
          }
        ]
      },
      {
        "key": "server_concepts",
        "name": "Server-Side Concepts",
        "short_description": "Understanding basic server-side programming concepts including routing, templates, and data handling.",
        "sub_topics": [
          {
            "key": "routing_basics",
            "name": "Routing and URL Handling",
            "short_description": "Understanding how servers map URLs to different pages or functions.",
            "example_tasks": [
              "Understand how different URLs (routes) on a website trigger different server responses",
              "Map out routing structure for a simple website showing which URLs display which content",
              "Learn about URL parameters and query strings for passing data in URLs"
            ]
          },
          {
            "key": "templates",
            "name": "Server-Side Templates",
            "short_description": "Understanding how servers generate HTML dynamically using templates.",
            "example_tasks": [
              "Understand the concept of templates that combine static HTML with dynamic data",
              "Learn how template engines insert variable data into HTML to create personalized pages",
              "Compare static HTML files versus dynamically generated pages from templates"
            ]
          },
          {
            "key": "form_processing",
            "name": "Processing Form Data",
            "short_description": "Understanding how servers receive and process data submitted through forms.",
            "example_tasks": [
              "Trace the flow of form data from HTML form submission to server-side processing",
              "Understand the difference between GET and POST methods for sending form data",
              "Learn about server-side validation and why it's necessary in addition to frontend validation"
            ]
          }
        ]
      },
      {
        "key": "intro_databases",
        "name": "Introduction to Databases",
        "short_description": "Understanding how servers store and retrieve data from databases.",
        "sub_topics": [
          {
            "key": "why_databases",
            "name": "Why Databases are Needed",
            "short_description": "Understanding the need for persistent data storage in applications.",
            "example_tasks": [
              "Explain why websites need databases to store user accounts, posts, products, and other data",
              "Compare storing data in files versus databases, understanding benefits of databases",
              "Identify what data in common websites would be stored in databases (user profiles, comments, orders)"
            ]
          },
          {
            "key": "database_types",
            "name": "Types of Databases",
            "short_description": "Understanding relational databases versus NoSQL databases.",
            "example_tasks": [
              "Learn about relational databases (SQL) that organize data in tables with relationships",
              "Understand NoSQL databases that store data in flexible formats like documents or key-value pairs",
              "Compare database types and when each is appropriate based on data structure needs"
            ]
          },
          {
            "key": "crud_operations",
            "name": "CRUD Operations Concept",
            "short_description": "Understanding Create, Read, Update, Delete operations on data.",
            "example_tasks": [
              "Identify CRUD operations in common web applications (creating posts, reading user profiles, updating settings, deleting comments)",
              "Map user actions in applications to corresponding CRUD operations on backend",
              "Understand that most applications are built around CRUD operations on different types of data"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "digital_media_content",
    "name": "Digital Media and Content Creation",
    "short_description": "Students create and edit digital media including graphics, audio, video, and integrate multimedia content into web projects with attention to quality and optimization.",
    "sub_topics": [
      {
        "key": "image_creation_editing",
        "name": "Image Creation and Editing",
        "short_description": "Creating and editing digital images for web and other digital projects.",
        "sub_topics": [
          {
            "key": "image_formats",
            "name": "Image File Formats",
            "short_description": "Understanding different image formats and when to use each.",
            "example_tasks": [
              "Compare JPEG (photos, no transparency), PNG (graphics with transparency), GIF (animations), and SVG (scalable vector graphics)",
              "Choose appropriate image formats based on content type, transparency needs, and file size constraints",
              "Convert between image formats using online tools or image editors and observe quality and file size differences"
            ]
          },
          {
            "key": "image_editing_tools",
            "name": "Image Editing Software",
            "short_description": "Using image editing tools to modify and enhance images.",
            "example_tasks": [
              "Use image editing software (GIMP, Photopea, Canva, or similar) to crop, resize, and rotate images",
              "Adjust brightness, contrast, and color balance to improve image appearance",
              "Remove backgrounds, add text overlays, and apply filters for various effects"
            ]
          },
          {
            "key": "graphic_design",
            "name": "Basic Graphic Design",
            "short_description": "Creating graphics, logos, and visual elements for digital projects.",
            "example_tasks": [
              "Design logos or headers for websites using basic shapes, text, and colors",
              "Create graphics for social media posts, presentations, or website banners",
              "Apply design principles like contrast, alignment, and visual hierarchy to create effective graphics"
            ]
          },
          {
            "key": "image_optimization",
            "name": "Image Optimization for Web",
            "short_description": "Optimizing images for fast loading without sacrificing quality.",
            "example_tasks": [
              "Resize images to appropriate dimensions for web display before uploading",
              "Compress images using tools to reduce file size while maintaining acceptable quality",
              "Use appropriate formats and quality settings to balance image quality with load time"
            ]
          }
        ]
      },
      {
        "key": "audio_creation",
        "name": "Audio Creation and Editing",
        "short_description": "Recording, editing, and incorporating audio content in digital projects.",
        "sub_topics": [
          {
            "key": "audio_formats",
            "name": "Audio File Formats",
            "short_description": "Understanding audio formats like MP3, WAV, and AAC.",
            "example_tasks": [
              "Compare audio formats: MP3 (compressed, smaller files), WAV (uncompressed, high quality), AAC (modern compression)",
              "Choose appropriate audio formats based on quality needs and file size constraints",
              "Convert between audio formats using online converters or audio software"
            ]
          },
          {
            "key": "recording_audio",
            "name": "Recording and Capturing Audio",
            "short_description": "Recording voice, music, or other audio using microphones and recording software.",
            "example_tasks": [
              "Record narration or voiceovers using computer microphone and recording software (Audacity or similar)",
              "Understand basic recording principles like microphone placement, room acoustics, and noise reduction",
              "Capture audio at appropriate quality settings considering intended use and file size"
            ]
          },
          {
            "key": "audio_editing",
            "name": "Audio Editing Basics",
            "short_description": "Editing audio clips including trimming, combining, and applying effects.",
            "example_tasks": [
              "Use audio editing software to cut, trim, and combine audio clips",
              "Adjust volume levels and normalize audio for consistent loudness",
              "Apply basic effects like fade in/out, noise removal, and equalization"
            ]
          },
          {
            "key": "audio_web",
            "name": "Adding Audio to Web Projects",
            "short_description": "Integrating audio content into websites and applications.",
            "example_tasks": [
              "Embed audio players in web pages using HTML5 audio element with controls",
              "Provide audio alternatives for accessibility including transcripts for audio content",
              "Optimize audio files for web delivery balancing quality and file size"
            ]
          }
        ]
      },
      {
        "key": "video_creation",
        "name": "Video Creation and Editing",
        "short_description": "Creating, editing, and publishing video content for digital platforms.",
        "sub_topics": [
          {
            "key": "video_formats",
            "name": "Video File Formats and Codecs",
            "short_description": "Understanding video formats like MP4, WebM, and MOV.",
            "example_tasks": [
              "Compare common video formats: MP4 (most compatible), WebM (web-optimized), MOV (Apple)",
              "Understand video codecs (H.264, H.265, VP9) and how they compress video data",
              "Choose appropriate video formats for different platforms (web, mobile, desktop)"
            ]
          },
          {
            "key": "video_capture",
            "name": "Video Recording and Screen Capture",
            "short_description": "Recording video using cameras or screen recording software.",
            "example_tasks": [
              "Record video using webcams or smartphones with attention to lighting, framing, and audio quality",
              "Create screen capture videos demonstrating software or explaining concepts using screen recording tools",
              "Understand basic videography principles like rule of thirds, lighting, and audio quality"
            ]
          },
          {
            "key": "video_editing",
            "name": "Video Editing Basics",
            "short_description": "Editing videos including cutting, transitions, and adding elements.",
            "example_tasks": [
              "Use video editing software to trim clips, remove unwanted sections, and arrange clips in sequence",
              "Add transitions between clips, text overlays, and titles to videos",
              "Combine video clips with audio tracks, adjusting audio levels for background music and dialogue"
            ]
          },
          {
            "key": "video_web",
            "name": "Publishing Video Online",
            "short_description": "Optimizing and embedding videos in websites and uploading to platforms.",
            "example_tasks": [
              "Embed videos in web pages using HTML5 video element or iframe embeds from YouTube/Vimeo",
              "Optimize videos for web by choosing appropriate resolutions, bitrates, and compression settings",
              "Upload videos to platforms like YouTube with appropriate titles, descriptions, and tags"
            ]
          }
        ]
      },
      {
        "key": "multimedia_integration",
        "name": "Multimedia Integration",
        "short_description": "Combining multiple media types in cohesive digital projects.",
        "sub_topics": [
          {
            "key": "multimedia_planning",
            "name": "Planning Multimedia Projects",
            "short_description": "Planning projects that effectively combine images, audio, video, and text.",
            "example_tasks": [
              "Storyboard multimedia projects planning what media appears when and how elements connect",
              "Create asset lists identifying all media needed and sources for each element",
              "Plan user experience considering how users will interact with and navigate multimedia content"
            ]
          },
          {
            "key": "presentations",
            "name": "Multimedia Presentations",
            "short_description": "Creating presentations with integrated media using presentation software.",
            "example_tasks": [
              "Build presentations combining text, images, audio, and video effectively without overwhelming slides",
              "Design consistent visual themes using appropriate colors, fonts, and layouts",
              "Present information clearly with good use of visuals to support rather than duplicate spoken content"
            ]
          },
          {
            "key": "interactive_media",
            "name": "Interactive Multimedia",
            "short_description": "Creating interactive experiences combining media with user interaction.",
            "example_tasks": [
              "Build interactive web pages with images, videos, and animations that respond to user actions",
              "Create clickable image maps or hotspots that reveal information or navigate to content",
              "Design multimedia experiences with clear navigation and intuitive user interfaces"
            ]
          },
          {
            "key": "copyright_attribution",
            "name": "Copyright and Attribution",
            "short_description": "Using media legally and providing proper attribution.",
            "example_tasks": [
              "Find Creative Commons licensed media for use in projects and provide proper attribution",
              "Create original media content to avoid copyright issues when possible",
              "Document sources for all media used in projects including images, audio, video, and fonts"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "database_concepts_sql",
    "name": "Database Concepts and SQL",
    "short_description": "Students learn database design principles, create and manage relational databases, write SQL queries to retrieve and manipulate data, and understand relationships between tables.",
    "sub_topics": [
      {
        "key": "relational_database_basics",
        "name": "Relational Database Fundamentals",
        "short_description": "Understanding how relational databases organize data in tables with rows and columns.",
        "sub_topics": [
          {
            "key": "database_structure",
            "name": "Database Structure and Terminology",
            "short_description": "Understanding tables, rows, columns, and primary keys in database organization.",
            "example_tasks": [
              "Identify the components of a database table: table name, column names (fields), rows (records), and data types",
              "Understand that each row represents one record (like one student or one product) and columns represent attributes",
              "Define primary keys as unique identifiers for each row in a table and explain why they're necessary"
            ]
          },
          {
            "key": "data_types_databases",
            "name": "Database Data Types",
            "short_description": "Understanding different data types used in databases for storing various kinds of information.",
            "example_tasks": [
              "Identify common database data types: INTEGER for whole numbers, REAL/FLOAT for decimals, TEXT/VARCHAR for strings, DATE for dates",
              "Choose appropriate data types for different kinds of information like ages (INTEGER), names (TEXT), prices (REAL), birthdates (DATE)",
              "Understand constraints on data types and why choosing correct types helps maintain data quality"
            ]
          },
          {
            "key": "database_design_principles",
            "name": "Database Design Principles",
            "short_description": "Understanding how to design effective database structures that minimize redundancy.",
            "example_tasks": [
              "Design a simple database schema for a scenario like a school (students table, classes table, enrollments table)",
              "Identify redundant data in poorly designed databases and restructure to eliminate duplication",
              "Apply normalization principles to organize data efficiently by separating information into appropriate tables"
            ]
          }
        ]
      },
      {
        "key": "sql_basics",
        "name": "SQL Query Basics",
        "short_description": "Writing SQL queries to retrieve data from databases using SELECT statements.",
        "sub_topics": [
          {
            "key": "select_statements",
            "name": "SELECT Statements",
            "short_description": "Retrieving data from database tables using SELECT queries.",
            "example_tasks": [
              "Write SELECT queries to retrieve all columns using SELECT * FROM table_name",
              "Select specific columns using SELECT column1, column2 FROM table_name to retrieve only needed data",
              "Use DISTINCT keyword to eliminate duplicate values in query results"
            ]
          },
          {
            "key": "filtering_where",
            "name": "Filtering with WHERE Clause",
            "short_description": "Using WHERE clauses to filter query results based on conditions.",
            "example_tasks": [
              "Add WHERE clauses to filter results using conditions like WHERE age > 12 or WHERE name = 'Alex'",
              "Combine multiple conditions using AND, OR, and NOT operators in WHERE clauses",
              "Use comparison operators (=, !=, <, >, <=, >=) and pattern matching with LIKE operator"
            ]
          },
          {
            "key": "sorting_limiting",
            "name": "Sorting and Limiting Results",
            "short_description": "Organizing query results using ORDER BY and LIMIT clauses.",
            "example_tasks": [
              "Sort query results using ORDER BY column_name ASC (ascending) or DESC (descending)",
              "Limit number of results returned using LIMIT clause like LIMIT 10 for top 10 results",
              "Combine ORDER BY and LIMIT to get top or bottom results like highest scores or most recent dates"
            ]
          },
          {
            "key": "aggregate_functions",
            "name": "Aggregate Functions",
            "short_description": "Using functions to calculate summaries like COUNT, SUM, AVG, MAX, MIN.",
            "example_tasks": [
              "Use COUNT(*) to count number of rows or COUNT(column) to count non-null values",
              "Calculate totals using SUM(), averages using AVG(), maximum using MAX(), and minimum using MIN()",
              "Use GROUP BY to calculate aggregates for different categories like average score per class"
            ]
          }
        ]
      },
      {
        "key": "table_relationships",
        "name": "Table Relationships and Joins",
        "short_description": "Understanding and implementing relationships between tables using foreign keys and joins.",
        "sub_topics": [
          {
            "key": "foreign_keys",
            "name": "Foreign Keys and Relationships",
            "short_description": "Linking tables together using foreign keys to establish relationships.",
            "example_tasks": [
              "Understand foreign keys as columns in one table that reference the primary key in another table",
              "Identify one-to-many relationships like one teacher teaching many classes or one customer placing many orders",
              "Design database schemas showing relationships between tables using foreign keys"
            ]
          },
          {
            "key": "inner_joins",
            "name": "Inner Joins",
            "short_description": "Combining data from multiple tables using INNER JOIN.",
            "example_tasks": [
              "Write INNER JOIN queries to combine related data from two tables based on matching foreign keys",
              "Retrieve data spanning multiple tables like student names with their enrolled classes",
              "Understand that INNER JOIN only returns rows where matching records exist in both tables"
            ]
          },
          {
            "key": "other_joins",
            "name": "Other Join Types",
            "short_description": "Understanding LEFT JOIN, RIGHT JOIN, and other join types.",
            "example_tasks": [
              "Use LEFT JOIN to retrieve all rows from the left table even when no match exists in the right table",
              "Compare INNER JOIN (only matching rows) versus LEFT JOIN (all left rows plus matches)",
              "Write queries that retrieve data even when some relationships don't exist, like all students including those not enrolled in classes"
            ]
          }
        ]
      },
      {
        "key": "data_manipulation",
        "name": "Data Manipulation with SQL",
        "short_description": "Inserting, updating, and deleting data using SQL statements.",
        "sub_topics": [
          {
            "key": "insert_data",
            "name": "Inserting Data",
            "short_description": "Adding new records to database tables using INSERT statements.",
            "example_tasks": [
              "Write INSERT statements to add new rows to tables like INSERT INTO students (name, age, grade) VALUES ('Alex', 13, 8)",
              "Insert multiple rows in a single INSERT statement for efficiency",
              "Understand data type requirements and constraints when inserting data"
            ]
          },
          {
            "key": "update_data",
            "name": "Updating Data",
            "short_description": "Modifying existing records using UPDATE statements.",
            "example_tasks": [
              "Write UPDATE statements to change existing data like UPDATE students SET grade = 9 WHERE name = 'Alex'",
              "Update multiple columns in a single UPDATE statement",
              "Use WHERE clauses carefully in updates to avoid accidentally changing wrong records"
            ]
          },
          {
            "key": "delete_data",
            "name": "Deleting Data",
            "short_description": "Removing records from tables using DELETE statements.",
            "example_tasks": [
              "Write DELETE statements to remove rows like DELETE FROM students WHERE graduated = true",
              "Understand the importance of WHERE clauses in DELETE to avoid deleting all data accidentally",
              "Consider alternatives to deletion like marking records as inactive rather than permanently removing them"
            ]
          }
        ]
      },
      {
        "key": "database_applications",
        "name": "Database Applications",
        "short_description": "Designing and implementing databases for real-world scenarios.",
        "sub_topics": [
          {
            "key": "schema_design",
            "name": "Designing Database Schemas",
            "short_description": "Planning complete database structures for applications.",
            "example_tasks": [
              "Design a database schema for a library system with books, members, and checkouts tables",
              "Create an e-commerce database with products, customers, orders, and order_items tables",
              "Diagram table relationships showing primary keys, foreign keys, and relationship types"
            ]
          },
          {
            "key": "database_projects",
            "name": "Building Database Projects",
            "short_description": "Creating and populating databases with sample data for applications.",
            "example_tasks": [
              "Create database tables using SQL CREATE TABLE statements with appropriate data types and constraints",
              "Populate tables with sample data that represents realistic application scenarios",
              "Write queries to answer questions about the data like 'Which students have perfect attendance?' or 'What are the top-selling products?'"
            ]
          },
          {
            "key": "connecting_databases",
            "name": "Connecting Databases to Applications",
            "short_description": "Understanding how applications interact with databases through queries.",
            "example_tasks": [
              "Trace how web applications use databases: user action triggers query, results displayed on page",
              "Understand the role of backend code in constructing SQL queries based on user input",
              "Design simple applications that would read from and write to databases like grade books or inventory systems"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "data_analysis_visualization",
    "name": "Data Analysis and Visualization",
    "short_description": "Students collect, organize, analyze, and visualize data to identify patterns, draw conclusions, and communicate findings effectively using spreadsheets and visualization tools.",
    "sub_topics": [
      {
        "key": "data_collection_organization",
        "name": "Data Collection and Organization",
        "short_description": "Gathering data from various sources and organizing it for analysis.",
        "sub_topics": [
          {
            "key": "data_sources",
            "name": "Data Sources and Collection Methods",
            "short_description": "Understanding where data comes from and methods for collecting it.",
            "example_tasks": [
              "Identify different data sources: surveys, sensors, web scraping, public datasets, APIs, direct observation",
              "Design a survey to collect data about a topic of interest with clear questions and response formats",
              "Understand ethical considerations in data collection including consent, privacy, and bias"
            ]
          },
          {
            "key": "data_formats",
            "name": "Data Formats and File Types",
            "short_description": "Working with data in different formats including CSV, JSON, and spreadsheets.",
            "example_tasks": [
              "Open and examine CSV files understanding comma-separated values format",
              "Import data from CSV files into spreadsheet applications for analysis",
              "Convert between data formats to make data compatible with different analysis tools"
            ]
          },
          {
            "key": "data_organization",
            "name": "Organizing Data in Spreadsheets",
            "short_description": "Structuring data in rows and columns with appropriate headers and formatting.",
            "example_tasks": [
              "Organize data with descriptive column headers and consistent data entry in each row",
              "Clean data by removing duplicates, fixing inconsistencies, and handling missing values",
              "Use appropriate data types in spreadsheet columns (numbers, dates, text) for correct calculations"
            ]
          }
        ]
      },
      {
        "key": "spreadsheet_analysis",
        "name": "Spreadsheet Analysis",
        "short_description": "Using spreadsheet formulas and functions to calculate statistics and analyze data.",
        "sub_topics": [
          {
            "key": "basic_formulas",
            "name": "Basic Spreadsheet Formulas",
            "short_description": "Creating formulas for calculations using cell references and operators.",
            "example_tasks": [
              "Write formulas using cell references like =A1+B1 instead of hardcoding numbers",
              "Use arithmetic operators (+, -, *, /) in formulas to perform calculations",
              "Copy formulas down columns or across rows and understand relative versus absolute cell references"
            ]
          },
          {
            "key": "statistical_functions",
            "name": "Statistical Functions",
            "short_description": "Calculating statistics using built-in spreadsheet functions.",
            "example_tasks": [
              "Use SUM(), AVERAGE(), COUNT(), MAX(), and MIN() functions to calculate basic statistics",
              "Calculate median using MEDIAN() and mode using MODE() for different measures of center",
              "Use COUNTIF() and SUMIF() to calculate statistics for data meeting specific criteria"
            ]
          },
          {
            "key": "sorting_filtering",
            "name": "Sorting and Filtering Data",
            "short_description": "Organizing and filtering data to focus on specific subsets.",
            "example_tasks": [
              "Sort data by one or more columns to identify patterns or extremes",
              "Apply filters to show only rows meeting certain criteria like scores above 90 or dates in a range",
              "Use filtering to analyze subsets of data separately like comparing different groups"
            ]
          },
          {
            "key": "pivot_tables",
            "name": "Introduction to Pivot Tables",
            "short_description": "Creating pivot tables to summarize and reorganize data.",
            "example_tasks": [
              "Create simple pivot tables to summarize data by categories like total sales by product or average scores by class",
              "Use pivot tables to count occurrences of different values or calculate category totals",
              "Understand how pivot tables reorganize data to show different perspectives"
            ]
          }
        ]
      },
      {
        "key": "data_visualization",
        "name": "Data Visualization",
        "short_description": "Creating charts and graphs to visually represent data and communicate findings.",
        "sub_topics": [
          {
            "key": "chart_types",
            "name": "Choosing Appropriate Chart Types",
            "short_description": "Selecting the right visualization for different types of data and questions.",
            "example_tasks": [
              "Use bar charts to compare values across categories like sales by product or scores by student",
              "Create line charts to show trends over time like temperature changes or website traffic",
              "Use pie charts to show parts of a whole when there are limited categories with clear proportions"
            ]
          },
          {
            "key": "creating_charts",
            "name": "Creating Charts in Spreadsheets",
            "short_description": "Building charts from spreadsheet data with appropriate settings.",
            "example_tasks": [
              "Select data ranges and create charts using spreadsheet chart tools",
              "Customize chart titles, axis labels, and legends to make visualizations clear and informative",
              "Format charts with appropriate colors, scales, and layouts for readability"
            ]
          },
          {
            "key": "effective_visualization",
            "name": "Principles of Effective Visualization",
            "short_description": "Designing visualizations that communicate clearly and avoid misleading representations.",
            "example_tasks": [
              "Design charts with clear labels, appropriate scales, and descriptive titles",
              "Avoid misleading visualizations like truncated axes or inappropriate 3D effects",
              "Choose colors carefully considering colorblind accessibility and visual clarity"
            ]
          },
          {
            "key": "advanced_charts",
            "name": "Advanced Chart Types",
            "short_description": "Creating scatter plots, histograms, and other specialized visualizations.",
            "example_tasks": [
              "Create scatter plots to show relationships between two numeric variables",
              "Build histograms to show distribution of values across ranges",
              "Use combination charts when comparing different types of data on the same visualization"
            ]
          }
        ]
      },
      {
        "key": "interpreting_data",
        "name": "Interpreting and Communicating Data",
        "short_description": "Drawing conclusions from data analysis and presenting findings effectively.",
        "sub_topics": [
          {
            "key": "identifying_patterns",
            "name": "Identifying Patterns and Trends",
            "short_description": "Recognizing patterns, trends, outliers, and relationships in data.",
            "example_tasks": [
              "Identify trends in data such as increasing, decreasing, or cyclical patterns",
              "Spot outliers that differ significantly from other data points and investigate potential causes",
              "Recognize correlations between variables though understanding correlation doesn't prove causation"
            ]
          },
          {
            "key": "drawing_conclusions",
            "name": "Drawing Valid Conclusions",
            "short_description": "Making appropriate inferences from data while acknowledging limitations.",
            "example_tasks": [
              "State conclusions supported by data evidence while avoiding overgeneralizations",
              "Identify limitations of data like sample size, collection methods, or missing information",
              "Distinguish between correlation and causation, avoiding claims of causation without evidence"
            ]
          },
          {
            "key": "presenting_findings",
            "name": "Presenting Data Findings",
            "short_description": "Creating clear presentations that communicate data insights effectively.",
            "example_tasks": [
              "Create data presentations combining visualizations with written explanations of key findings",
              "Tell a story with data by organizing findings in logical order that builds understanding",
              "Design presentations that highlight important insights without overwhelming audience with too much detail"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "intro_data_science",
    "name": "Introduction to Data Science",
    "short_description": "Students explore data science concepts including statistical thinking, data cleaning, exploratory analysis, making predictions from data, and understanding machine learning basics.",
    "sub_topics": [
      {
        "key": "statistics_basics",
        "name": "Statistical Concepts",
        "short_description": "Understanding basic statistical concepts used in data analysis.",
        "sub_topics": [
          {
            "key": "measures_center",
            "name": "Measures of Center",
            "short_description": "Calculating and interpreting mean, median, and mode.",
            "example_tasks": [
              "Calculate mean (average), median (middle value), and mode (most frequent) for datasets",
              "Understand when each measure is most appropriate, like using median when outliers affect mean",
              "Compare how mean and median differ for skewed versus symmetric distributions"
            ]
          },
          {
            "key": "measures_spread",
            "name": "Measures of Spread",
            "short_description": "Understanding range, quartiles, and standard deviation to describe data variation.",
            "example_tasks": [
              "Calculate range (max - min) to understand the spread of data",
              "Find quartiles and create box plots to visualize data distribution and identify outliers",
              "Understand standard deviation as a measure of how spread out values are from the mean"
            ]
          },
          {
            "key": "distributions",
            "name": "Understanding Distributions",
            "short_description": "Recognizing different distribution shapes and what they reveal about data.",
            "example_tasks": [
              "Identify distribution shapes: symmetric, skewed left, skewed right, bimodal, uniform",
              "Create histograms to visualize data distributions and identify patterns",
              "Understand what distribution shape reveals about the data and appropriate statistics to use"
            ]
          }
        ]
      },
      {
        "key": "data_cleaning",
        "name": "Data Cleaning and Preparation",
        "short_description": "Preparing messy real-world data for analysis by handling errors, missing values, and inconsistencies.",
        "sub_topics": [
          {
            "key": "identifying_issues",
            "name": "Identifying Data Quality Issues",
            "short_description": "Recognizing problems in datasets that need to be addressed.",
            "example_tasks": [
              "Identify common data quality issues: missing values, duplicates, inconsistent formatting, outliers, incorrect data types",
              "Examine datasets for errors like typos, impossible values, or inconsistent units",
              "Document data quality issues found and plan cleaning strategies"
            ]
          },
          {
            "key": "handling_missing_data",
            "name": "Handling Missing Values",
            "short_description": "Dealing with incomplete data through various strategies.",
            "example_tasks": [
              "Identify missing values in datasets and determine why data might be missing",
              "Apply strategies for missing data: removing rows with missing values, filling with mean/median, or using placeholders",
              "Understand trade-offs between different approaches to handling missing data"
            ]
          },
          {
            "key": "data_transformation",
            "name": "Data Transformation",
            "short_description": "Converting and standardizing data for consistent analysis.",
            "example_tasks": [
              "Standardize text data like making all entries lowercase or fixing inconsistent capitalization",
              "Convert data types such as strings to numbers or dates to standard formats",
              "Create derived variables like calculating age from birthdate or categorizing continuous data into ranges"
            ]
          }
        ]
      },
      {
        "key": "exploratory_analysis",
        "name": "Exploratory Data Analysis",
        "short_description": "Investigating datasets to discover patterns, relationships, and insights.",
        "sub_topics": [
          {
            "key": "asking_questions",
            "name": "Asking Questions of Data",
            "short_description": "Formulating questions that can be answered through data analysis.",
            "example_tasks": [
              "Generate questions about datasets that can be investigated through analysis",
              "Transform general questions into specific, measurable questions answerable with available data",
              "Prioritize questions based on importance and feasibility of answering with the data"
            ]
          },
          {
            "key": "univariate_analysis",
            "name": "Single Variable Analysis",
            "short_description": "Analyzing individual variables to understand their distributions and characteristics.",
            "example_tasks": [
              "Create frequency tables and histograms to understand how individual variables are distributed",
              "Calculate summary statistics for single variables to describe their characteristics",
              "Identify unusual values or patterns in individual variables"
            ]
          },
          {
            "key": "bivariate_analysis",
            "name": "Analyzing Relationships",
            "short_description": "Investigating relationships between two variables.",
            "example_tasks": [
              "Create scatter plots to visualize relationships between two numeric variables",
              "Calculate correlation coefficients to quantify strength and direction of relationships",
              "Use grouped bar charts or side-by-side box plots to compare groups"
            ]
          }
        ]
      },
      {
        "key": "predictions_ml_intro",
        "name": "Predictions and Machine Learning Basics",
        "short_description": "Understanding how data can be used to make predictions and basic machine learning concepts.",
        "sub_topics": [
          {
            "key": "patterns_predictions",
            "name": "Using Patterns to Predict",
            "short_description": "Understanding how patterns in historical data can inform predictions.",
            "example_tasks": [
              "Identify patterns in data that could be used to make predictions about future values",
              "Understand the concept of training on historical data to predict new cases",
              "Recognize limitations of predictions including that past patterns may not continue"
            ]
          },
          {
            "key": "classification_basics",
            "name": "Introduction to Classification",
            "short_description": "Understanding how data can be used to classify items into categories.",
            "example_tasks": [
              "Understand classification as predicting which category something belongs to based on its features",
              "Explore simple classification rules based on data patterns like decision trees",
              "Test classification accuracy by comparing predictions to actual categories"
            ]
          },
          {
            "key": "machine_learning_concepts",
            "name": "Basic Machine Learning Concepts",
            "short_description": "Understanding fundamental ideas behind machine learning without complex math.",
            "example_tasks": [
              "Understand that machine learning involves computers finding patterns in data automatically",
              "Explore supervised learning where algorithms learn from labeled examples",
              "Discuss real-world applications of machine learning like recommendation systems, image recognition, or spam filters"
            ]
          },
          {
            "key": "ml_ethics",
            "name": "Machine Learning Ethics and Bias",
            "short_description": "Understanding ethical considerations and potential biases in machine learning.",
            "example_tasks": [
              "Identify how bias in training data can lead to biased predictions",
              "Discuss ethical implications of machine learning in areas like facial recognition or criminal justice",
              "Understand importance of diverse, representative training data for fair machine learning systems"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "cybersecurity_principles",
    "name": "Cybersecurity Principles",
    "short_description": "Students learn about cybersecurity threats, defensive strategies, encryption basics, secure coding practices, and protecting systems and data from attacks.",
    "sub_topics": [
      {
        "key": "threat_landscape",
        "name": "Cybersecurity Threat Landscape",
        "short_description": "Understanding different types of cyber threats and attack vectors.",
        "sub_topics": [
          {
            "key": "threat_types",
            "name": "Types of Cyber Threats",
            "short_description": "Identifying various categories of cybersecurity threats.",
            "example_tasks": [
              "Research different threat categories: malware, social engineering, network attacks, insider threats, physical threats",
              "Create a visual map of cyber threats showing how they target different parts of systems",
              "Analyze recent news stories about cyber attacks and categorize the types of threats involved"
            ]
          },
          {
            "key": "attack_vectors",
            "name": "Common Attack Vectors",
            "short_description": "Understanding how attackers gain access to systems and data.",
            "example_tasks": [
              "Identify common entry points for attacks: email phishing, vulnerable software, weak passwords, unpatched systems",
              "Map out attack scenarios showing step-by-step how an attacker might compromise a system",
              "Understand the concept of the attack surface and how to minimize it"
            ]
          },
          {
            "key": "threat_actors",
            "name": "Threat Actors and Motivations",
            "short_description": "Understanding who launches cyber attacks and why.",
            "example_tasks": [
              "Identify different threat actors: hacktivists, cybercriminals, nation-states, insider threats, script kiddies",
              "Understand different motivations: financial gain, espionage, disruption, activism, curiosity",
              "Discuss how understanding attacker motivations helps in planning defenses"
            ]
          }
        ]
      },
      {
        "key": "defensive_strategies",
        "name": "Defensive Cybersecurity Strategies",
        "short_description": "Learning security principles and practices to protect systems and data.",
        "sub_topics": [
          {
            "key": "security_principles",
            "name": "Core Security Principles",
            "short_description": "Understanding fundamental concepts like defense in depth, least privilege, and fail-safe defaults.",
            "example_tasks": [
              "Explain defense in depth using multiple layers of security like locks on doors, alarms, and security guards",
              "Apply principle of least privilege by giving users only the permissions they need for their tasks",
              "Understand fail-safe defaults where systems default to secure settings rather than convenient but insecure ones"
            ]
          },
          {
            "key": "access_control",
            "name": "Access Control and Authentication",
            "short_description": "Controlling who can access systems and data through authentication and authorization.",
            "example_tasks": [
              "Understand the difference between authentication (proving identity) and authorization (granting permissions)",
              "Implement strong authentication using passwords plus additional factors like codes or biometrics",
              "Design access control systems that follow principle of least privilege for different user roles"
            ]
          },
          {
            "key": "network_security",
            "name": "Network Security Basics",
            "short_description": "Understanding how networks are secured through firewalls, encryption, and monitoring.",
            "example_tasks": [
              "Understand how firewalls filter network traffic based on rules to block malicious connections",
              "Learn about VPNs (Virtual Private Networks) that encrypt internet connections for security and privacy",
              "Identify importance of network monitoring and intrusion detection systems"
            ]
          },
          {
            "key": "security_updates",
            "name": "Software Updates and Patch Management",
            "short_description": "Understanding the critical importance of keeping software updated.",
            "example_tasks": [
              "Explain why software updates are critical for security, patching vulnerabilities that attackers exploit",
              "Create a patch management plan for personal devices including checking for updates regularly",
              "Research examples of major security breaches that exploited unpatched vulnerabilities"
            ]
          }
        ]
      },
      {
        "key": "encryption_basics",
        "name": "Encryption and Cryptography",
        "short_description": "Understanding how encryption protects data and communications.",
        "sub_topics": [
          {
            "key": "encryption_concepts",
            "name": "Encryption Fundamentals",
            "short_description": "Understanding basic concepts of encryption, keys, and ciphers.",
            "example_tasks": [
              "Understand encryption as transforming data so only authorized parties with keys can read it",
              "Explore simple ciphers like Caesar cipher to understand basic encryption concepts",
              "Distinguish between encryption (reversible with key) and hashing (one-way transformation)"
            ]
          },
          {
            "key": "symmetric_asymmetric",
            "name": "Symmetric vs Asymmetric Encryption",
            "short_description": "Understanding different encryption approaches and their uses.",
            "example_tasks": [
              "Understand symmetric encryption where same key encrypts and decrypts (fast but requires shared secret key)",
              "Learn about asymmetric encryption using public and private key pairs (solves key distribution problem)",
              "Identify use cases for each type like HTTPS using both for secure web communication"
            ]
          },
          {
            "key": "encryption_applications",
            "name": "Real-World Encryption Applications",
            "short_description": "Understanding where encryption is used to protect data.",
            "example_tasks": [
              "Identify encryption in daily use: HTTPS for websites, encrypted messaging apps, full-disk encryption on devices",
              "Understand end-to-end encryption where only sender and recipient can read messages, not service providers",
              "Discuss the balance between encryption for privacy and concerns about encrypted communications hiding illegal activity"
            ]
          },
          {
            "key": "hashing",
            "name": "Hashing and Data Integrity",
            "short_description": "Understanding how hashing verifies data hasn't been tampered with.",
            "example_tasks": [
              "Understand hashing as one-way transformation that creates unique fingerprints of data",
              "Learn how hashes verify file integrity by comparing hash values before and after transfer",
              "Understand password hashing where passwords are stored as hashes rather than plain text"
            ]
          }
        ]
      },
      {
        "key": "secure_coding",
        "name": "Secure Coding Practices",
        "short_description": "Writing code that is resistant to common vulnerabilities and attacks.",
        "sub_topics": [
          {
            "key": "input_validation",
            "name": "Input Validation",
            "short_description": "Validating and sanitizing user input to prevent injection attacks.",
            "example_tasks": [
              "Understand why trusting user input is dangerous and can lead to security vulnerabilities",
              "Implement input validation checking that data is the expected type, length, and format",
              "Learn about injection attacks where malicious input is interpreted as code, and how to prevent them"
            ]
          },
          {
            "key": "common_vulnerabilities",
            "name": "Common Security Vulnerabilities",
            "short_description": "Understanding frequent coding mistakes that create security holes.",
            "example_tasks": [
              "Learn about SQL injection where malicious input manipulates database queries",
              "Understand cross-site scripting (XSS) where attackers inject malicious scripts into web pages",
              "Identify buffer overflows, authentication bypasses, and other common vulnerabilities"
            ]
          },
          {
            "key": "secure_design",
            "name": "Security in Software Design",
            "short_description": "Building security considerations into software from the beginning.",
            "example_tasks": [
              "Apply security by design principles planning security features from the start rather than adding them later",
              "Identify sensitive data in applications and plan how to protect it through encryption and access controls",
              "Create threat models for applications identifying potential attacks and planning defenses"
            ]
          }
        ]
      },
      {
        "key": "incident_response",
        "name": "Security Incidents and Response",
        "short_description": "Understanding how to recognize, respond to, and recover from security incidents.",
        "sub_topics": [
          {
            "key": "recognizing_incidents",
            "name": "Recognizing Security Incidents",
            "short_description": "Identifying signs that a security breach or attack has occurred.",
            "example_tasks": [
              "Identify indicators of compromise like unusual network activity, unexpected system behavior, or unauthorized access",
              "Understand warning signs of malware infection like slow performance, unexpected popups, or disabled security software",
              "Practice spotting phishing attempts and social engineering attacks before they succeed"
            ]
          },
          {
            "key": "incident_response_steps",
            "name": "Incident Response Process",
            "short_description": "Understanding the steps to take when a security incident occurs.",
            "example_tasks": [
              "Learn the incident response cycle: preparation, detection, containment, eradication, recovery, lessons learned",
              "Practice incident response scenarios deciding what actions to take when discovering various types of attacks",
              "Understand the importance of documenting incidents for investigation and preventing future occurrences"
            ]
          },
          {
            "key": "reporting",
            "name": "Reporting Security Issues",
            "short_description": "Understanding when and how to report security vulnerabilities and incidents.",
            "example_tasks": [
              "Understand responsible disclosure when finding security vulnerabilities in software or websites",
              "Know who to contact when discovering security issues (IT department, security teams, vendors)",
              "Learn about bug bounty programs where security researchers are rewarded for finding and reporting vulnerabilities"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "privacy_digital_ethics",
    "name": "Privacy and Digital Ethics",
    "short_description": "Students explore privacy rights, data protection regulations, ethical computing practices, algorithmic bias, and the societal impacts of technology.",
    "sub_topics": [
      {
        "key": "privacy_rights",
        "name": "Privacy Rights and Regulations",
        "short_description": "Understanding legal protections for personal information and privacy rights.",
        "sub_topics": [
          {
            "key": "privacy_laws",
            "name": "Privacy Laws and Regulations",
            "short_description": "Learning about laws that protect personal data like GDPR and COPPA.",
            "example_tasks": [
              "Research privacy laws like COPPA (Children's Online Privacy Protection Act) that protects children's data online",
              "Understand GDPR principles like right to access, right to deletion, and data minimization",
              "Investigate privacy regulations in your state or country and what rights they provide"
            ]
          },
          {
            "key": "consent_control",
            "name": "Consent and Data Control",
            "short_description": "Understanding informed consent and individual control over personal data.",
            "example_tasks": [
              "Analyze privacy policies and terms of service to understand what data companies collect and why",
              "Evaluate whether websites and apps obtain meaningful informed consent before collecting data",
              "Exercise data control rights by requesting copies of personal data or requesting account deletion"
            ]
          },
          {
            "key": "surveillance",
            "name": "Surveillance and Monitoring",
            "short_description": "Understanding different types of surveillance and their privacy implications.",
            "example_tasks": [
              "Identify different forms of surveillance: corporate tracking, government monitoring, social media monitoring, workplace surveillance",
              "Discuss the balance between security needs and privacy rights in surveillance",
              "Research cases where surveillance capabilities were used appropriately versus misused"
            ]
          }
        ]
      },
      {
        "key": "data_ethics",
        "name": "Ethical Data Collection and Use",
        "short_description": "Understanding ethical considerations in collecting, storing, and using data.",
        "sub_topics": [
          {
            "key": "ethical_collection",
            "name": "Ethical Data Collection",
            "short_description": "Understanding principles for collecting data ethically and responsibly.",
            "example_tasks": [
              "Apply principles of ethical data collection: informed consent, data minimization, purpose limitation, transparency",
              "Design surveys or data collection with privacy protections like anonymization and voluntary participation",
              "Identify problematic data collection practices that violate ethical principles or privacy"
            ]
          },
          {
            "key": "data_security_responsibility",
            "name": "Data Security Responsibilities",
            "short_description": "Understanding obligations to protect data that is collected.",
            "example_tasks": [
              "Understand that collecting data creates responsibility to protect it from breaches and misuse",
              "Learn about data breach notification requirements when personal data is compromised",
              "Discuss appropriate data retention policies and secure deletion when data is no longer needed"
            ]
          },
          {
            "key": "data_sharing",
            "name": "Data Sharing and Third Parties",
            "short_description": "Understanding ethical considerations when sharing data with other organizations.",
            "example_tasks": [
              "Identify when apps and websites share user data with third parties for advertising or other purposes",
              "Evaluate whether data sharing practices are transparent and users have control over them",
              "Understand risks of data aggregation where multiple data sources are combined to reveal sensitive information"
            ]
          }
        ]
      },
      {
        "key": "algorithmic_ethics",
        "name": "Algorithmic Ethics and Bias",
        "short_description": "Understanding how algorithms can perpetuate bias and ethical issues with automated decision-making.",
        "sub_topics": [
          {
            "key": "algorithmic_bias",
            "name": "Recognizing Algorithmic Bias",
            "short_description": "Understanding how bias in data and algorithms can lead to unfair outcomes.",
            "example_tasks": [
              "Identify sources of algorithmic bias: biased training data, biased algorithm design, biased interpretation of results",
              "Analyze examples of algorithmic bias in facial recognition, hiring algorithms, or predictive policing",
              "Understand how historical bias in data perpetuates discrimination when used to train algorithms"
            ]
          },
          {
            "key": "fairness_accountability",
            "name": "Fairness and Accountability",
            "short_description": "Understanding principles for creating fair algorithms and holding systems accountable.",
            "example_tasks": [
              "Discuss what fairness means in algorithmic decision-making and challenges in defining it",
              "Understand the importance of transparency and explainability in automated decisions that affect people",
              "Identify who should be accountable when algorithmic systems cause harm: developers, companies, or users"
            ]
          },
          {
            "key": "automation_impact",
            "name": "Impact of Automation on Society",
            "short_description": "Understanding broader societal implications of automated systems and AI.",
            "example_tasks": [
              "Discuss impacts of automation on employment and what responsibilities society has to displaced workers",
              "Analyze the digital divide where unequal access to technology creates or widens inequality",
              "Consider ethical questions about AI in areas like autonomous vehicles, healthcare, and criminal justice"
            ]
          }
        ]
      },
      {
        "key": "digital_citizenship_ethics",
        "name": "Ethical Digital Citizenship",
        "short_description": "Practicing ethical behavior online and understanding technology's societal impact.",
        "sub_topics": [
          {
            "key": "online_behavior",
            "name": "Ethical Online Behavior",
            "short_description": "Understanding ethical responsibilities in online interactions and content sharing.",
            "example_tasks": [
              "Practice ethical online communication including respecting others, fact-checking before sharing, and constructive dialogue",
              "Understand responsibilities when creating and sharing content including avoiding misinformation and respecting copyrights",
              "Identify ethical dilemmas in online contexts and apply ethical reasoning to resolve them"
            ]
          },
          {
            "key": "technology_society",
            "name": "Technology's Impact on Society",
            "short_description": "Understanding how technology affects communities, culture, and society.",
            "example_tasks": [
              "Analyze how social media affects mental health, relationships, and civic engagement both positively and negatively",
              "Discuss the attention economy and ethical concerns about technology designed to be addictive",
              "Consider environmental impacts of technology including energy consumption and electronic waste"
            ]
          },
          {
            "key": "responsible_innovation",
            "name": "Responsible Innovation",
            "short_description": "Understanding principles for developing technology ethically and responsibly.",
            "example_tasks": [
              "Apply ethical frameworks to evaluate whether new technologies should be developed or deployed",
              "Consider unintended consequences of technology and importance of diverse perspectives in development",
              "Discuss the role of technologists in considering societal impact of their work"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "software_development_lifecycle",
    "name": "Software Development Lifecycle",
    "short_description": "Students learn the phases of software development from planning and design through implementation, testing, deployment, and maintenance, understanding professional development processes.",
    "sub_topics": [
      {
        "key": "sdlc_phases",
        "name": "SDLC Phases and Models",
        "short_description": "Understanding the stages of software development and different development methodologies.",
        "sub_topics": [
          {
            "key": "development_phases",
            "name": "Software Development Phases",
            "short_description": "Understanding the key phases: requirements, design, implementation, testing, deployment, maintenance.",
            "example_tasks": [
              "Identify the phases of software development and explain what happens in each phase",
              "Map activities to SDLC phases like gathering user requirements (requirements), creating wireframes (design), writing code (implementation)",
              "Understand that SDLC phases may overlap and projects often cycle back to earlier phases when issues are discovered"
            ]
          },
          {
            "key": "waterfall_model",
            "name": "Waterfall Development Model",
            "short_description": "Understanding sequential development where each phase completes before the next begins.",
            "example_tasks": [
              "Diagram the waterfall model showing sequential phases from requirements through maintenance",
              "Identify advantages of waterfall (clear structure, well-documented) and disadvantages (inflexible, late testing)",
              "Understand when waterfall is appropriate such as projects with well-defined requirements that won't change"
            ]
          },
          {
            "key": "agile_development",
            "name": "Agile Development",
            "short_description": "Understanding iterative development with frequent releases and continuous feedback.",
            "example_tasks": [
              "Learn agile principles like working software over documentation, responding to change, and customer collaboration",
              "Understand iterative development through short sprints producing working software incrementally",
              "Compare agile versus waterfall approaches and discuss when each is more appropriate"
            ]
          },
          {
            "key": "development_methodologies",
            "name": "Other Development Methodologies",
            "short_description": "Learning about Scrum, Kanban, and other development frameworks.",
            "example_tasks": [
              "Research Scrum methodology including roles (product owner, scrum master, team), ceremonies (daily standups, sprints), and artifacts (backlog)",
              "Understand Kanban boards for visualizing work flow and limiting work in progress",
              "Apply a simple agile methodology to a student project using sprints and retrospectives"
            ]
          }
        ]
      },
      {
        "key": "requirements_design",
        "name": "Requirements and Design",
        "short_description": "Gathering user needs, defining requirements, and designing software solutions.",
        "sub_topics": [
          {
            "key": "gathering_requirements",
            "name": "Gathering Requirements",
            "short_description": "Collecting and documenting what software needs to do through user research.",
            "example_tasks": [
              "Interview potential users to understand their needs, problems, and desired features",
              "Create user stories in the format 'As a [user type], I want [feature] so that [benefit]'",
              "Distinguish between functional requirements (what the software does) and non-functional requirements (performance, security, usability)"
            ]
          },
          {
            "key": "use_cases",
            "name": "Use Cases and Scenarios",
            "short_description": "Describing how users will interact with the software through scenarios.",
            "example_tasks": [
              "Write use cases describing step-by-step interactions between users and the system",
              "Create user personas representing different types of users and their needs",
              "Develop user scenarios showing how the software will be used in real-world contexts"
            ]
          },
          {
            "key": "software_design",
            "name": "Software Design and Architecture",
            "short_description": "Planning the structure and organization of software before coding.",
            "example_tasks": [
              "Create system architecture diagrams showing major components and how they interact",
              "Design user interfaces through wireframes and mockups before implementation",
              "Plan data structures and algorithms needed to implement required functionality"
            ]
          },
          {
            "key": "design_patterns",
            "name": "Introduction to Design Patterns",
            "short_description": "Understanding common solutions to recurring software design problems.",
            "example_tasks": [
              "Learn about simple design patterns like Model-View-Controller (MVC) for separating concerns",
              "Understand the DRY principle (Don't Repeat Yourself) and how to avoid code duplication",
              "Identify patterns in existing software and understand why they improve design"
            ]
          }
        ]
      },
      {
        "key": "implementation_practices",
        "name": "Implementation Best Practices",
        "short_description": "Writing clean, maintainable code following professional standards.",
        "sub_topics": [
          {
            "key": "code_organization",
            "name": "Code Organization",
            "short_description": "Structuring code into functions, classes, and modules for maintainability.",
            "example_tasks": [
              "Organize code into functions that each perform a single, well-defined task",
              "Group related functions into modules or classes for better code organization",
              "Use meaningful file and folder structures to organize project code logically"
            ]
          },
          {
            "key": "naming_conventions",
            "name": "Naming Conventions and Style",
            "short_description": "Using consistent, descriptive names and following language style guides.",
            "example_tasks": [
              "Follow naming conventions for your programming language (camelCase, snake_case, PascalCase as appropriate)",
              "Write self-documenting code using descriptive variable and function names that explain their purpose",
              "Follow style guides for consistent formatting, indentation, and code structure"
            ]
          },
          {
            "key": "documentation",
            "name": "Code Documentation",
            "short_description": "Writing comments and documentation to explain code purpose and usage.",
            "example_tasks": [
              "Write function docstrings explaining what functions do, parameters they take, and values they return",
              "Add inline comments explaining complex or non-obvious code sections",
              "Create README files documenting what projects do, how to install them, and how to use them"
            ]
          },
          {
            "key": "error_handling",
            "name": "Error Handling",
            "short_description": "Handling errors gracefully to prevent crashes and provide helpful messages.",
            "example_tasks": [
              "Use try-except blocks to catch errors and handle them without crashing the program",
              "Provide helpful error messages that tell users what went wrong and what they can do about it",
              "Validate inputs before processing to catch errors early and provide clear feedback"
            ]
          }
        ]
      },
      {
        "key": "testing_qa",
        "name": "Testing and Quality Assurance",
        "short_description": "Implementing comprehensive testing strategies to ensure software quality.",
        "sub_topics": [
          {
            "key": "testing_types",
            "name": "Types of Testing",
            "short_description": "Understanding unit testing, integration testing, and system testing.",
            "example_tasks": [
              "Distinguish between testing levels: unit tests (individual functions), integration tests (components together), system tests (complete application)",
              "Understand the testing pyramid with many unit tests, fewer integration tests, and minimal end-to-end tests",
              "Plan testing strategies that cover different aspects of software at appropriate levels"
            ]
          },
          {
            "key": "writing_tests",
            "name": "Writing Test Cases",
            "short_description": "Creating comprehensive test cases covering normal and edge cases.",
            "example_tasks": [
              "Write unit tests for individual functions testing normal inputs, edge cases, and error conditions",
              "Create test suites that can be run automatically to verify code works correctly",
              "Use assertions to verify that functions produce expected outputs for given inputs"
            ]
          },
          {
            "key": "test_driven_development",
            "name": "Test-Driven Development",
            "short_description": "Writing tests before code to drive development and ensure testability.",
            "example_tasks": [
              "Practice TDD cycle: write a failing test, write code to pass the test, refactor for quality",
              "Understand how writing tests first clarifies requirements and improves design",
              "Experience benefits of TDD including confidence in code correctness and easier refactoring"
            ]
          },
          {
            "key": "quality_assurance",
            "name": "Quality Assurance Practices",
            "short_description": "Implementing processes to maintain high software quality.",
            "example_tasks": [
              "Create quality checklists covering functionality, usability, performance, and security",
              "Perform regression testing to ensure new changes don't break existing functionality",
              "Document bugs with clear descriptions, steps to reproduce, and expected versus actual behavior"
            ]
          }
        ]
      },
      {
        "key": "deployment_maintenance",
        "name": "Deployment and Maintenance",
        "short_description": "Releasing software to users and maintaining it over time.",
        "sub_topics": [
          {
            "key": "deployment_process",
            "name": "Software Deployment",
            "short_description": "Understanding how software is released to production environments.",
            "example_tasks": [
              "Understand deployment steps: prepare release, test in staging, deploy to production, monitor for issues",
              "Learn about different deployment environments: development, testing, staging, production",
              "Understand rollback procedures for reverting to previous versions if problems occur"
            ]
          },
          {
            "key": "version_management",
            "name": "Version Management",
            "short_description": "Managing software versions and release cycles.",
            "example_tasks": [
              "Understand semantic versioning (MAJOR.MINOR.PATCH) and when to increment each number",
              "Create release notes documenting new features, bug fixes, and breaking changes",
              "Plan release schedules balancing new features with stability and quality"
            ]
          },
          {
            "key": "maintenance",
            "name": "Software Maintenance",
            "short_description": "Updating and improving software after initial release.",
            "example_tasks": [
              "Understand types of maintenance: corrective (bug fixes), adaptive (environment changes), perfective (improvements), preventive (future problems)",
              "Monitor software in production for bugs, performance issues, and user feedback",
              "Prioritize maintenance tasks balancing urgency, impact, and available resources"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "version_control_collaboration",
    "name": "Version Control and Collaboration",
    "short_description": "Students learn to use version control systems like Git to track changes, collaborate on code, manage branches, and work effectively in team development environments.",
    "sub_topics": [
      {
        "key": "version_control_basics",
        "name": "Version Control Fundamentals",
        "short_description": "Understanding why version control is essential and basic concepts.",
        "sub_topics": [
          {
            "key": "why_version_control",
            "name": "Why Version Control Matters",
            "short_description": "Understanding problems version control solves in software development.",
            "example_tasks": [
              "Identify problems without version control: lost work, inability to undo changes, difficulty collaborating, no change history",
              "Understand how version control provides a complete history of changes with ability to revert to any previous state",
              "Learn how version control enables multiple people to work on the same codebase simultaneously"
            ]
          },
          {
            "key": "version_control_concepts",
            "name": "Version Control Concepts",
            "short_description": "Understanding repositories, commits, and version history.",
            "example_tasks": [
              "Understand repositories as storage for project files and their complete history",
              "Learn about commits as snapshots of code at specific points in time with descriptive messages",
              "Understand version history as a timeline of commits showing how code evolved"
            ]
          },
          {
            "key": "local_vs_remote",
            "name": "Local vs Remote Repositories",
            "short_description": "Understanding the difference between local and remote repositories.",
            "example_tasks": [
              "Understand local repositories stored on your computer versus remote repositories on servers like GitHub",
              "Learn why remote repositories enable collaboration and provide backups",
              "Understand synchronization between local and remote repositories through push and pull operations"
            ]
          }
        ]
      },
      {
        "key": "git_basics",
        "name": "Git Basics",
        "short_description": "Learning fundamental Git commands and workflows.",
        "sub_topics": [
          {
            "key": "git_setup",
            "name": "Git Installation and Setup",
            "short_description": "Installing Git and configuring user information.",
            "example_tasks": [
              "Install Git on your computer and verify installation with git --version command",
              "Configure Git with your name and email using git config commands",
              "Understand Git configuration levels: system, global, and local (repository-specific)"
            ]
          },
          {
            "key": "creating_repositories",
            "name": "Creating and Cloning Repositories",
            "short_description": "Starting new repositories or copying existing ones.",
            "example_tasks": [
              "Create a new Git repository using git init to start tracking an existing project",
              "Clone existing repositories from GitHub using git clone to get a local copy",
              "Understand the .git directory that stores all repository information and history"
            ]
          },
          {
            "key": "basic_workflow",
            "name": "Basic Git Workflow",
            "short_description": "Adding, committing, and tracking changes to files.",
            "example_tasks": [
              "Use git status to see which files have changed and which changes are staged for commit",
              "Stage changes using git add to prepare files for committing",
              "Commit changes using git commit with descriptive messages explaining what changed and why"
            ]
          },
          {
            "key": "viewing_history",
            "name": "Viewing History and Changes",
            "short_description": "Examining commit history and comparing versions.",
            "example_tasks": [
              "View commit history using git log to see past commits, authors, dates, and messages",
              "Use git diff to see what changes were made between versions or before committing",
              "Examine specific commits to understand what changed at different points in project history"
            ]
          }
        ]
      },
      {
        "key": "branching_merging",
        "name": "Branching and Merging",
        "short_description": "Using branches to work on features independently and merging changes back.",
        "sub_topics": [
          {
            "key": "branch_concepts",
            "name": "Understanding Branches",
            "short_description": "Learning what branches are and why they're useful.",
            "example_tasks": [
              "Understand branches as separate lines of development allowing work on features without affecting main code",
              "Learn common branch naming conventions like feature/new-feature or bugfix/issue-123",
              "Understand the main or master branch as the primary stable branch"
            ]
          },
          {
            "key": "creating_branches",
            "name": "Creating and Switching Branches",
            "short_description": "Creating new branches and moving between them.",
            "example_tasks": [
              "Create new branches using git branch branch-name or git checkout -b branch-name",
              "Switch between branches using git checkout or git switch to work on different features",
              "View all branches with git branch to see local branches and git branch -a for all including remote"
            ]
          },
          {
            "key": "merging_branches",
            "name": "Merging Branches",
            "short_description": "Combining changes from one branch into another.",
            "example_tasks": [
              "Merge feature branches back into main branch using git merge after features are complete",
              "Understand fast-forward merges when branches have linear history versus merge commits for diverged branches",
              "Delete branches after merging using git branch -d branch-name to keep repository clean"
            ]
          },
          {
            "key": "merge_conflicts",
            "name": "Resolving Merge Conflicts",
            "short_description": "Handling situations where changes conflict between branches.",
            "example_tasks": [
              "Understand why merge conflicts occur when same lines are changed differently in different branches",
              "Resolve conflicts by editing files to combine changes appropriately and removing conflict markers",
              "Use git status during conflict resolution to see which files need attention and mark resolution with git add"
            ]
          }
        ]
      },
      {
        "key": "remote_collaboration",
        "name": "Remote Repositories and Collaboration",
        "short_description": "Working with remote repositories and collaborating with others.",
        "sub_topics": [
          {
            "key": "github_basics",
            "name": "Using GitHub",
            "short_description": "Understanding GitHub as a platform for hosting and collaborating on code.",
            "example_tasks": [
              "Create a GitHub account and understand GitHub as a hosting service for Git repositories",
              "Create remote repositories on GitHub and understand visibility options (public vs private)",
              "Navigate GitHub's interface to view code, commits, branches, and other repository information"
            ]
          },
          {
            "key": "push_pull",
            "name": "Pushing and Pulling Changes",
            "short_description": "Synchronizing local and remote repositories.",
            "example_tasks": [
              "Push local commits to remote repository using git push to share your changes",
              "Pull changes from remote repository using git pull to get others' updates",
              "Understand pull as combination of fetch (download changes) and merge (integrate them)"
            ]
          },
          {
            "key": "collaboration_workflow",
            "name": "Collaboration Workflows",
            "short_description": "Following practices for effective team collaboration.",
            "example_tasks": [
              "Follow workflow: pull latest changes, create feature branch, make changes, push branch, create pull request",
              "Understand pull requests as requests to merge your changes with review and discussion",
              "Practice reviewing others' code providing constructive feedback on pull requests"
            ]
          },
          {
            "key": "forking_contributing",
            "name": "Forking and Contributing",
            "short_description": "Contributing to projects you don't have direct access to.",
            "example_tasks": [
              "Fork repositories to create your own copy of projects you want to contribute to",
              "Make changes in your fork and submit pull requests to the original repository",
              "Understand open source contribution workflow and etiquette"
            ]
          }
        ]
      },
      {
        "key": "git_best_practices",
        "name": "Git Best Practices",
        "short_description": "Following conventions and practices for effective version control.",
        "sub_topics": [
          {
            "key": "commit_messages",
            "name": "Writing Good Commit Messages",
            "short_description": "Creating clear, informative commit messages.",
            "example_tasks": [
              "Write commit messages with clear, concise summaries of what changed and why",
              "Follow commit message conventions: imperative mood ('Add feature' not 'Added feature'), 50-character summary",
              "Include additional details in commit body when necessary to explain complex changes"
            ]
          },
          {
            "key": "committing_strategy",
            "name": "Committing Frequently and Logically",
            "short_description": "Making commits at appropriate points with logical groupings.",
            "example_tasks": [
              "Commit frequently creating checkpoints as you work rather than one large commit at the end",
              "Group related changes together in commits (one feature or fix per commit when possible)",
              "Avoid committing broken code or mixing unrelated changes in single commits"
            ]
          },
          {
            "key": "gitignore",
            "name": "Using .gitignore",
            "short_description": "Excluding files that shouldn't be tracked in version control.",
            "example_tasks": [
              "Create .gitignore files to exclude temporary files, build artifacts, and sensitive information",
              "Understand what should be ignored: compiled code, dependencies, API keys, personal IDE settings",
              "Use .gitignore templates for common project types (Python, JavaScript, etc.)"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "mobile_app_development",
    "name": "Mobile and App Development",
    "short_description": "Students explore mobile app development concepts, design mobile-friendly interfaces, understand platform differences, and create simple mobile applications or responsive web apps.",
    "sub_topics": [
      {
        "key": "mobile_platforms",
        "name": "Mobile Platforms and Ecosystem",
        "short_description": "Understanding mobile operating systems and app distribution.",
        "sub_topics": [
          {
            "key": "mobile_os",
            "name": "Mobile Operating Systems",
            "short_description": "Understanding iOS, Android, and their characteristics.",
            "example_tasks": [
              "Compare iOS and Android in terms of market share, development requirements, and user base",
              "Understand platform-specific features and design guidelines for each operating system",
              "Research how apps are developed differently for iOS (Swift/Objective-C) versus Android (Java/Kotlin)"
            ]
          },
          {
            "key": "app_stores",
            "name": "App Stores and Distribution",
            "short_description": "Understanding how mobile apps are distributed and discovered.",
            "example_tasks": [
              "Learn about app stores: Apple App Store, Google Play Store, and their submission requirements",
              "Understand app review processes and guidelines apps must follow for approval",
              "Research app monetization strategies: paid apps, in-app purchases, subscriptions, advertising"
            ]
          },
          {
            "key": "native_vs_web",
            "name": "Native vs Web Apps",
            "short_description": "Understanding different approaches to mobile app development.",
            "example_tasks": [
              "Compare native apps (platform-specific) versus web apps (browser-based) versus hybrid apps",
              "Understand trade-offs: native apps have better performance and access to device features, web apps are easier to develop cross-platform",
              "Identify Progressive Web Apps (PWAs) that combine benefits of both approaches"
            ]
          }
        ]
      },
      {
        "key": "mobile_design_principles",
        "name": "Mobile Design Principles",
        "short_description": "Designing user interfaces optimized for mobile devices.",
        "sub_topics": [
          {
            "key": "mobile_ui_patterns",
            "name": "Mobile UI Patterns",
            "short_description": "Understanding common mobile interface patterns and conventions.",
            "example_tasks": [
              "Identify common mobile UI patterns: navigation bars, tab bars, cards, lists, hamburger menus",
              "Understand mobile navigation patterns and when to use each type",
              "Design mobile interfaces following platform conventions for familiar, intuitive user experiences"
            ]
          },
          {
            "key": "touch_interfaces",
            "name": "Designing for Touch",
            "short_description": "Creating interfaces optimized for touch interaction.",
            "example_tasks": [
              "Design touch targets large enough for fingers (minimum 44x44 pixels) with appropriate spacing",
              "Implement common touch gestures: tap, swipe, pinch-to-zoom, long-press",
              "Provide visual feedback for touch interactions so users know their actions registered"
            ]
          },
          {
            "key": "mobile_layout",
            "name": "Mobile Layout and Screen Sizes",
            "short_description": "Designing layouts that work across different mobile screen sizes.",
            "example_tasks": [
              "Design layouts that adapt to different screen sizes from small phones to large tablets",
              "Use vertical scrolling as primary navigation method for mobile content",
              "Prioritize important content and actions for limited mobile screen space"
            ]
          },
          {
            "key": "mobile_performance",
            "name": "Mobile Performance Considerations",
            "short_description": "Optimizing apps for mobile constraints like bandwidth and battery.",
            "example_tasks": [
              "Optimize images and assets for mobile devices to reduce bandwidth usage and load times",
              "Understand battery consumption considerations and how to minimize power usage",
              "Design apps to work with limited or intermittent connectivity"
            ]
          }
        ]
      },
      {
        "key": "responsive_web_apps",
        "name": "Responsive Web Applications",
        "short_description": "Building web apps that work well on mobile devices.",
        "sub_topics": [
          {
            "key": "mobile_first_design",
            "name": "Mobile-First Design",
            "short_description": "Starting design with mobile experience and progressively enhancing for larger screens.",
            "example_tasks": [
              "Design mobile layouts first focusing on essential features and content",
              "Add features and expand layouts for tablet and desktop sizes using media queries",
              "Understand progressive enhancement: basic experience works everywhere, enhanced features for capable devices"
            ]
          },
          {
            "key": "responsive_frameworks",
            "name": "Responsive Frameworks",
            "short_description": "Using frameworks like Bootstrap to build responsive interfaces quickly.",
            "example_tasks": [
              "Use responsive CSS frameworks to build mobile-friendly layouts with grid systems",
              "Implement responsive navigation that adapts from mobile hamburger menus to desktop navigation bars",
              "Utilize framework components designed to work across screen sizes"
            ]
          },
          {
            "key": "mobile_testing",
            "name": "Testing on Mobile Devices",
            "short_description": "Testing web apps on actual mobile devices and emulators.",
            "example_tasks": [
              "Test web apps on actual mobile devices to verify touch interactions and performance",
              "Use browser developer tools device emulation to test different screen sizes during development",
              "Test across different mobile browsers and operating systems to ensure compatibility"
            ]
          }
        ]
      },
      {
        "key": "intro_app_development",
        "name": "Introduction to App Development",
        "short_description": "Creating simple mobile apps or mobile-friendly web applications.",
        "sub_topics": [
          {
            "key": "app_planning",
            "name": "Planning Mobile Apps",
            "short_description": "Defining app purpose, features, and user flows.",
            "example_tasks": [
              "Define app purpose and target audience identifying what problem the app solves",
              "List core features focusing on essential functionality for mobile context",
              "Map user flows showing step-by-step how users will accomplish tasks in the app"
            ]
          },
          {
            "key": "simple_apps",
            "name": "Building Simple Apps",
            "short_description": "Creating basic mobile applications with simple functionality.",
            "example_tasks": [
              "Build a simple calculator app demonstrating basic mobile UI and functionality",
              "Create a to-do list app with local storage to persist data",
              "Develop a quiz app using mobile-friendly interface with touch interactions"
            ]
          },
          {
            "key": "device_features",
            "name": "Using Device Features",
            "short_description": "Accessing mobile device capabilities like camera, GPS, and sensors.",
            "example_tasks": [
              "Access device location using geolocation APIs to provide location-based features",
              "Use camera APIs to capture photos or scan QR codes within apps",
              "Implement device sensors like accelerometer for interactive experiences"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "cloud_computing_web_services",
    "name": "Cloud Computing and Web Services",
    "short_description": "Students learn about cloud computing concepts, different service models (IaaS, PaaS, SaaS), APIs and web services, and how modern applications leverage cloud infrastructure.",
    "sub_topics": [
      {
        "key": "cloud_computing_basics",
        "name": "Cloud Computing Fundamentals",
        "short_description": "Understanding what cloud computing is and its benefits.",
        "sub_topics": [
          {
            "key": "what_is_cloud",
            "name": "What is Cloud Computing",
            "short_description": "Understanding cloud computing as on-demand access to computing resources over the internet.",
            "example_tasks": [
              "Define cloud computing as delivery of computing services (servers, storage, databases, networking, software) over the internet",
              "Understand benefits of cloud computing: scalability, cost-effectiveness, accessibility from anywhere, reduced IT management",
              "Compare cloud computing to traditional on-premises computing and understand the shift in how IT resources are consumed"
            ]
          },
          {
            "key": "cloud_characteristics",
            "name": "Key Characteristics of Cloud",
            "short_description": "Understanding features that define cloud services.",
            "example_tasks": [
              "Identify essential cloud characteristics: on-demand self-service, broad network access, resource pooling, rapid elasticity, measured service",
              "Understand scalability: ability to increase or decrease resources based on demand automatically",
              "Learn about pay-as-you-go pricing where you only pay for resources actually used"
            ]
          },
          {
            "key": "cloud_deployment",
            "name": "Cloud Deployment Models",
            "short_description": "Understanding public, private, and hybrid clouds.",
            "example_tasks": [
              "Compare public clouds (shared infrastructure like AWS, Azure, Google Cloud) versus private clouds (dedicated to one organization)",
              "Understand hybrid clouds combining public and private cloud resources",
              "Identify when different deployment models are appropriate based on security, cost, and control requirements"
            ]
          }
        ]
      },
      {
        "key": "cloud_service_models",
        "name": "Cloud Service Models",
        "short_description": "Understanding IaaS, PaaS, and SaaS service levels.",
        "sub_topics": [
          {
            "key": "iaas",
            "name": "Infrastructure as a Service (IaaS)",
            "short_description": "Understanding cloud-provided infrastructure like virtual machines and storage.",
            "example_tasks": [
              "Understand IaaS as providing virtualized computing resources: servers, storage, networking",
              "Identify IaaS examples like Amazon EC2 (virtual servers), S3 (storage), or Google Compute Engine",
              "Understand that with IaaS, providers manage physical infrastructure while customers manage operating systems and applications"
            ]
          },
          {
            "key": "paas",
            "name": "Platform as a Service (PaaS)",
            "short_description": "Understanding cloud platforms for developing and deploying applications.",
            "example_tasks": [
              "Understand PaaS as providing development and deployment platforms without managing underlying infrastructure",
              "Identify PaaS examples like Heroku, Google App Engine, or Azure App Service",
              "Learn how PaaS handles server management, scaling, and updates so developers can focus on code"
            ]
          },
          {
            "key": "saas",
            "name": "Software as a Service (SaaS)",
            "short_description": "Understanding cloud-delivered software applications.",
            "example_tasks": [
              "Understand SaaS as complete applications delivered over the internet on subscription basis",
              "Identify SaaS examples: Google Workspace, Microsoft 365, Salesforce, Dropbox, Zoom",
              "Compare SaaS to traditional installed software understanding benefits of automatic updates and accessibility"
            ]
          },
          {
            "key": "service_model_comparison",
            "name": "Comparing Service Models",
            "short_description": "Understanding differences between IaaS, PaaS, and SaaS.",
            "example_tasks": [
              "Compare what customers manage versus what providers manage in each service model",
              "Understand the spectrum from maximum control (IaaS) to maximum convenience (SaaS)",
              "Select appropriate service models for different scenarios based on control, flexibility, and management needs"
            ]
          }
        ]
      },
      {
        "key": "web_services_apis",
        "name": "Web Services and APIs",
        "short_description": "Understanding how applications communicate through web services and APIs.",
        "sub_topics": [
          {
            "key": "web_services_overview",
            "name": "Web Services Overview",
            "short_description": "Understanding web services as software systems designed for machine-to-machine communication.",
            "example_tasks": [
              "Understand web services as ways for applications to communicate over the internet regardless of platforms",
              "Learn how web services enable integration between different systems and applications",
              "Identify examples of web services: payment processing, map services, social media integration, weather data"
            ]
          },
          {
            "key": "rest_apis_detail",
            "name": "RESTful APIs",
            "short_description": "Understanding REST principles and working with RESTful web services.",
            "example_tasks": [
              "Understand REST principles: stateless communication, standard HTTP methods (GET, POST, PUT, DELETE), resource-based URLs",
              "Make API requests using tools like Postman or curl to interact with RESTful services",
              "Parse JSON responses from APIs and extract needed data for applications"
            ]
          },
          {
            "key": "api_integration",
            "name": "Integrating APIs",
            "short_description": "Connecting applications to external services through APIs.",
            "example_tasks": [
              "Integrate a weather API to display current weather in a web application",
              "Use a mapping API like Google Maps to add location features to projects",
              "Implement API authentication using API keys or OAuth for secure access"
            ]
          }
        ]
      },
      {
        "key": "cloud_storage_databases",
        "name": "Cloud Storage and Databases",
        "short_description": "Understanding cloud-based data storage solutions.",
        "sub_topics": [
          {
            "key": "cloud_storage_types",
            "name": "Types of Cloud Storage",
            "short_description": "Understanding object storage, file storage, and block storage.",
            "example_tasks": [
              "Understand object storage (like Amazon S3) for storing files and media accessed over internet",
              "Learn about file storage for shared file systems and block storage for virtual machine drives",
              "Compare cloud storage to traditional storage understanding scalability and accessibility benefits"
            ]
          },
          {
            "key": "cloud_databases",
            "name": "Cloud Database Services",
            "short_description": "Using managed database services in the cloud.",
            "example_tasks": [
              "Understand cloud database services that handle backups, updates, and scaling automatically",
              "Compare SQL databases (MySQL, PostgreSQL) versus NoSQL databases (MongoDB, DynamoDB) in cloud",
              "Identify benefits of managed databases: reduced administration, automatic backups, easy scaling"
            ]
          },
          {
            "key": "data_in_cloud",
            "name": "Managing Data in the Cloud",
            "short_description": "Understanding data security, backup, and compliance in cloud environments.",
            "example_tasks": [
              "Understand data security in cloud including encryption at rest and in transit",
              "Learn about backup and disaster recovery options in cloud services",
              "Discuss data compliance and regulatory considerations when storing data in the cloud"
            ]
          }
        ]
      },
      {
        "key": "cloud_applications",
        "name": "Building Cloud Applications",
        "short_description": "Understanding how modern applications leverage cloud infrastructure.",
        "sub_topics": [
          {
            "key": "cloud_native",
            "name": "Cloud-Native Applications",
            "short_description": "Understanding applications designed specifically for cloud environments.",
            "example_tasks": [
              "Understand cloud-native principles: microservices, containers, dynamic scaling, continuous deployment",
              "Learn how cloud-native apps differ from traditional applications in architecture and deployment",
              "Identify benefits of cloud-native design like scalability, resilience, and faster updates"
            ]
          },
          {
            "key": "serverless",
            "name": "Introduction to Serverless Computing",
            "short_description": "Understanding serverless functions that run without managing servers.",
            "example_tasks": [
              "Understand serverless computing where code runs in response to events without provisioning servers",
              "Learn about Functions as a Service (FaaS) like AWS Lambda or Google Cloud Functions",
              "Identify use cases for serverless: APIs, data processing, scheduled tasks, event-driven workflows"
            ]
          },
          {
            "key": "deploying_to_cloud",
            "name": "Deploying Applications to Cloud",
            "short_description": "Publishing web applications using cloud platforms.",
            "example_tasks": [
              "Deploy a simple web application to a cloud platform like Heroku, Netlify, or Vercel",
              "Configure custom domains for cloud-hosted applications",
              "Understand continuous deployment where code changes automatically deploy to production"
            ]
          }
        ]
      }
    ]
  },
  {
    "key": "emerging_technologies_innovation",
    "name": "Emerging Technologies and Innovation",
    "short_description": "Students explore cutting-edge technologies including artificial intelligence, machine learning, Internet of Things, robotics, and consider future technology trends and career pathways.",
    "sub_topics": [
      {
        "key": "artificial_intelligence",
        "name": "Artificial Intelligence Basics",
        "short_description": "Understanding AI concepts, applications, and how machines can learn and make decisions.",
        "sub_topics": [
          {
            "key": "what_is_ai",
            "name": "What is Artificial Intelligence",
            "short_description": "Understanding AI as computer systems that can perform tasks requiring human intelligence.",
            "example_tasks": [
              "Define AI as machines performing tasks that typically require human intelligence: learning, problem-solving, pattern recognition, decision-making",
              "Distinguish between narrow AI (designed for specific tasks) and general AI (human-level intelligence across domains)",
              "Identify AI in everyday life: virtual assistants, recommendation systems, image recognition, autonomous vehicles"
            ]
          },
          {
            "key": "machine_learning_intro",
            "name": "Introduction to Machine Learning",
            "short_description": "Understanding how computers can learn from data without explicit programming.",
            "example_tasks": [
              "Understand machine learning as AI approach where systems learn from data rather than following programmed rules",
              "Explore supervised learning (learning from labeled examples), unsupervised learning (finding patterns), and reinforcement learning (learning through trial and error)",
              "Identify machine learning applications: spam filters, voice recognition, image classification, predictive text"
            ]
          },
          {
            "key": "neural_networks",
            "name": "Neural Networks and Deep Learning",
            "short_description": "Understanding basic concepts of neural networks inspired by human brains.",
            "example_tasks": [
              "Understand neural networks as computing systems inspired by biological brains with interconnected nodes",
              "Learn about deep learning using multiple layers of neural networks for complex pattern recognition",
              "Explore applications of deep learning: computer vision, natural language processing, game playing"
            ]
          },
          {
            "key": "ai_ethics_impact",
            "name": "AI Ethics and Societal Impact",
            "short_description": "Understanding ethical considerations and societal implications of AI.",
            "example_tasks": [
              "Discuss ethical concerns with AI: bias in algorithms, privacy, accountability for AI decisions, job displacement",
              "Understand how AI can perpetuate or amplify existing biases in training data",
              "Consider positive and negative impacts of AI on society, employment, and daily life"
            ]
          }
        ]
      },
      {
        "key": "internet_of_things",
        "name": "Internet of Things (IoT)",
        "short_description": "Understanding networks of connected devices that collect and share data.",
        "sub_topics": [
          {
            "key": "iot_concepts",
            "name": "IoT Concepts and Components",
            "short_description": "Understanding what IoT is and how connected devices work.",
            "example_tasks": [
              "Define IoT as network of physical devices with sensors, software, and connectivity to exchange data",
              "Identify IoT components: sensors (collect data), actuators (perform actions), connectivity (transmit data), processing (analyze data)",
              "Explore IoT examples: smart home devices, wearable fitness trackers, connected cars, industrial sensors"
            ]
          },
          {
            "key": "iot_applications",
            "name": "IoT Applications",
            "short_description": "Understanding how IoT is used in different domains.",
            "example_tasks": [
              "Investigate smart home IoT: thermostats, security cameras, lighting, appliances controlled remotely",
              "Explore wearable IoT devices that track health metrics, activity, and location",
              "Research industrial IoT applications: monitoring equipment, optimizing manufacturing, tracking inventory"
            ]
          },
          {
            "key": "iot_security_privacy",
            "name": "IoT Security and Privacy",
            "short_description": "Understanding security challenges with connected devices.",
            "example_tasks": [
              "Identify security risks with IoT: weak passwords, unencrypted data, vulnerable firmware, botnet attacks",
              "Understand privacy concerns with IoT devices constantly collecting data about behavior and environment",
              "Learn about securing IoT devices: changing default passwords, updating firmware, securing network"
            ]
          }
        ]
      },
      {
        "key": "robotics_automation",
        "name": "Robotics and Automation",
        "short_description": "Understanding robots, automation systems, and their applications.",
        "sub_topics": [
          {
            "key": "robotics_basics",
            "name": "Robotics Fundamentals",
            "short_description": "Understanding what robots are and how they work.",
            "example_tasks": [
              "Define robots as programmable machines that can sense environment, process information, and perform actions",
              "Identify robot components: sensors (perception), processors (decision-making), actuators (movement)",
              "Explore different types of robots: industrial robots, service robots, autonomous vehicles, drones"
            ]
          },
          {
            "key": "programming_robots",
            "name": "Introduction to Robot Programming",
            "short_description": "Understanding how robots are programmed to perform tasks.",
            "example_tasks": [
              "Learn basic concepts of robot programming: commands for movement, sensor reading, decision-making",
              "Experiment with educational robots or simulators to program simple behaviors",
              "Understand how robots use feedback from sensors to adjust actions and complete tasks"
            ]
          },
          {
            "key": "automation_impact",
            "name": "Automation and Society",
            "short_description": "Understanding impacts of automation on work and society.",
            "example_tasks": [
              "Discuss how automation affects employment by replacing repetitive tasks but creating new technical jobs",
              "Identify tasks well-suited for automation versus those requiring human judgment and creativity",
              "Consider ethical questions about autonomous systems making decisions that affect people"
            ]
          }
        ]
      },
      {
        "key": "emerging_tech_trends",
        "name": "Emerging Technology Trends",
        "short_description": "Exploring cutting-edge technologies and future trends.",
        "sub_topics": [
          {
            "key": "vr_ar",
            "name": "Virtual and Augmented Reality",
            "short_description": "Understanding immersive technologies that blend digital and physical worlds.",
            "example_tasks": [
              "Distinguish between VR (fully immersive digital environments) and AR (digital overlays on real world)",
              "Explore VR/AR applications: gaming, training simulations, virtual meetings, education, industrial design",
              "Understand VR/AR hardware like headsets and controllers and how they create immersive experiences"
            ]
          },
          {
            "key": "blockchain",
            "name": "Blockchain and Cryptocurrency",
            "short_description": "Understanding distributed ledger technology and digital currencies.",
            "example_tasks": [
              "Understand blockchain as distributed database where transactions are recorded across many computers",
              "Learn how blockchain ensures security and transparency through cryptography and consensus mechanisms",
              "Explore blockchain applications beyond cryptocurrency: supply chain tracking, digital identity, smart contracts"
            ]
          },
          {
            "key": "quantum_computing",
            "name": "Introduction to Quantum Computing",
            "short_description": "Understanding basics of quantum computers and their potential.",
            "example_tasks": [
              "Understand quantum computing as using quantum mechanical phenomena for computation",
              "Learn how quantum computers differ from classical computers and problems they might solve faster",
              "Discuss potential applications: drug discovery, cryptography, optimization, climate modeling"
            ]
          },
          {
            "key": "future_trends",
            "name": "Future Technology Trends",
            "short_description": "Exploring emerging technologies and predicting future developments.",
            "example_tasks": [
              "Research emerging technologies like brain-computer interfaces, synthetic biology, or advanced materials",
              "Predict how technology might evolve in next 5-10 years based on current trends",
              "Discuss how emerging technologies might address global challenges like climate change, healthcare, or education"
            ]
          }
        ]
      },
      {
        "key": "tech_careers",
        "name": "Technology Careers and Pathways",
        "short_description": "Exploring career options in technology and skills needed for success.",
        "sub_topics": [
          {
            "key": "tech_career_paths",
            "name": "Technology Career Paths",
            "short_description": "Understanding diverse career options in technology fields.",
            "example_tasks": [
              "Research technology careers: software developer, data scientist, cybersecurity analyst, UX designer, network engineer, AI researcher",
              "Interview professionals in technology fields about their work, education, and career paths",
              "Explore career pathways including education requirements, skills needed, and growth opportunities"
            ]
          },
          {
            "key": "skills_for_tech",
            "name": "Skills for Technology Careers",
            "short_description": "Understanding technical and soft skills valuable in technology.",
            "example_tasks": [
              "Identify technical skills for different careers: programming languages, tools, platforms, methodologies",
              "Understand importance of soft skills: problem-solving, communication, collaboration, continuous learning",
              "Create personal learning plans to develop skills for careers of interest"
            ]
          },
          {
            "key": "building_portfolio",
            "name": "Building a Technology Portfolio",
            "short_description": "Creating portfolios showcasing skills and projects.",
            "example_tasks": [
              "Build a portfolio website showcasing projects, skills, and accomplishments",
              "Document projects with descriptions, screenshots, code samples, and reflection on learning",
              "Contribute to open source projects or create public repositories to demonstrate skills"
            ]
          },
          {
            "key": "staying_current",
            "name": "Continuous Learning in Technology",
            "short_description": "Understanding the need for ongoing learning as technology evolves.",
            "example_tasks": [
              "Identify resources for continuous learning: online courses, documentation, tutorials, tech blogs, conferences",
              "Practice learning new technologies independently by following tutorials and building small projects",
              "Understand that technology careers require commitment to lifelong learning as field constantly evolves"
            ]
          }
        ]
      }
    ]
  }
]
